TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Oct  7 22:14:25 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../bissc.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\hakan\workspace_v10\IDDK_PM_Servo_F2837x-v2\F2837x_RAM")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("PM_bissc_generateCRCTable")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PM_bissc_generateCRCTable")

    1023                      .dwpsn  file "../bissc.c",line 78,column 2,is_stmt,isa 0
    1024              $C$DW$66        .dwtag  DW_TAG_TI_branch
    1025                      .dwattr $C$DW$66, DW_AT_low_pc(0x00)
    1026                      .dwattr $C$DW$66, DW_AT_name("_F28x_usDelay")
    1027                      .dwattr $C$DW$66, DW_AT_TI_call
    1028              
    1029 00000110 7640!         LCR       #_F28x_usDelay        ; [CPU_ALU] |78| 
         00000111 0000 
    1030                      ; call occurs [#_F28x_usDelay] ; [] |78| 
    1031                      .dwpsn  file "../bissc.c",line 84,column 2,is_stmt,isa 0
    1032 00000112 0219          MOVB      ACC,#25               ; [CPU_ALU] |84| 
    1033              $C$DW$67        .dwtag  DW_TAG_TI_branch
    1034                      .dwattr $C$DW$67, DW_AT_low_pc(0x00)
    1035                      .dwattr $C$DW$67, DW_AT_name("_PM_bissc_setFreq")
    1036                      .dwattr $C$DW$67, DW_AT_TI_call
    1037              
    1038 00000113 7640!         LCR       #_PM_bissc_setFreq    ; [CPU_ALU] |84| 
         00000114 0000 
    1039                      ; call occurs [#_PM_bissc_setFreq] ; [] |84| 
    1040                      .dwpsn  file "../bissc.c",line 86,column 2,is_stmt,isa 0
    1041 00000115 8F01          MOVL      XAR4,#79998           ; [CPU_ARAU] |86| 
         00000116 387E 
    1042 00000117 A8A9          MOVL      ACC,XAR4              ; [CPU_ALU] |86| 
    1043              $C$DW$68        .dwtag  DW_TAG_TI_branch
    1044                      .dwattr $C$DW$68, DW_AT_low_pc(0x00)
    1045                      .dwattr $C$DW$68, DW_AT_name("_F28x_usDelay")
    1046                      .dwattr $C$DW$68, DW_AT_TI_call
    1047              
    1048 00000118 7640!         LCR       #_F28x_usDelay        ; [CPU_ALU] |86| 
         00000119 0000 
    1049                      ; call occurs [#_F28x_usDelay] ; [] |86| 
    1050 0000011a 761F-         MOVW      DP,#_bissc_data_struct+23 ; [CPU_ARAU] 
         0000011b 0000 
    1051                      .dwpsn  file "../bissc.c",line 88,column 2,is_stmt,isa 0
    1052 0000011c 2B17!         MOV       @$BLOCKED(_bissc_data_struct)+23,#0 ; [CPU_ALU] |88| 
    1053                      .dwpsn  file "../bissc.c",line 89,column 2,is_stmt,isa 0
    1054 0000011d 56BF!         MOVB      @$BLOCKED(_bissc_data_struct),#3,UNC ; [CPU_ALU] |89| 
         0000011e 0300 
    1055                      .dwpsn  file "../bissc.c",line 90,column 2,is_stmt,isa 0
    1056 0000011f 2B0C!         MOV       @$BLOCKED(_bissc_data_struct)+12,#0 ; [CPU_ALU] |90| 
    1057                      .dwpsn  file "../bissc.c",line 91,column 2,is_stmt,isa 0
    1058 00000120 280A!         MOV       @$BLOCKED(_bissc_data_struct)+10,#65535 ; [CPU_ALU] |91| 
         00000121 FFFF 
    1059                      .dwpsn  file "../bissc.c",line 92,column 2,is_stmt,isa 0
    1060 00000122 280B!         MOV       @$BLOCKED(_bissc_data_struct)+11,#65535 ; [CPU_ALU] |92| 
         00000123 FFFF 
    1061                      .dwpsn  file "../bissc.c",line 93,column 2,is_stmt,isa 0
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   22

    1062 00000124 2B16!         MOV       @$BLOCKED(_bissc_data_struct)+22,#0 ; [CPU_ALU] |93| 
    1063              $C$DW$69        .dwtag  DW_TAG_TI_branch
    1064                      .dwattr $C$DW$69, DW_AT_low_pc(0x00)
    1065                      .dwattr $C$DW$69, DW_AT_TI_return
    1066              
    1067 00000125 0006          LRETR     ; [CPU_ALU] 
    1068                      ; return occurs ; [] 
    1069                      .dwattr $C$DW$60, DW_AT_TI_end_file("../bissc.c")
    1070                      .dwattr $C$DW$60, DW_AT_TI_end_line(0x5e)
    1071                      .dwattr $C$DW$60, DW_AT_TI_end_column(0x01)
    1072                      .dwendentry
    1073                      .dwendtag $C$DW$60
    1074              
    1075              ;**************************************************************
    1076              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1077              ;**************************************************************
    1078                      .global _PM_bissc_generateCRCTable
    1079                      .global _PM_bissc_setupPeriph
    1080                      .global _F28x_usDelay
    1081                      .global _PM_bissc_setFreq
    1082                      .global _PM_bissc_setupNewSCDTransfer
    1083                      .global _PM_bissc_startOperation
    1084                      .global _PM_bissc_getCRC
    1085                      .global _PM_bissc_getBits
    1086                      .global _SpibRegs
    1087                      .global _PieCtrlRegs
    1088                      .global _InputXbarRegs
    1089                      .global _GpioDataRegs
    1090                      .global _CpuSysRegs
    1091                      .global _EPwm4Regs
    1092                      .global _GpioCtrlRegs
    1093                      .global _PieVectTable
    1094              
    1095              ;***************************************************************
    1096              ;* TYPE INFORMATION                                            *
    1097              ;***************************************************************
    1098              
    1099              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1100                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x5c)
    1101              $C$DW$70        .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$20)
    1103                      .dwattr $C$DW$70, DW_AT_name("cd_status")
    1104                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_cd_status")
    1105                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1107              
    1108              $C$DW$71        .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$22)
    1110                      .dwattr $C$DW$71, DW_AT_name("remaining_cd_bits")
    1111                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_remaining_cd_bits")
    1112                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1113                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1114              
    1115              $C$DW$72        .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   23

    1117                      .dwattr $C$DW$72, DW_AT_name("cd_bits_to_send")
    1118                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_cd_bits_to_send")
    1119                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1120                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1121              
    1122              $C$DW$73        .dwtag  DW_TAG_member
    1123                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$24)
    1124                      .dwattr $C$DW$73, DW_AT_name("cdm")
    1125                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_cdm")
    1126                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1127                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1128              
    1129              $C$DW$74        .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$24)
    1131                      .dwattr $C$DW$74, DW_AT_name("cds_stream")
    1132                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_cds_stream")
    1133                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1134                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1135              
    1136              $C$DW$75        .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
    1138                      .dwattr $C$DW$75, DW_AT_name("cds_raw")
    1139                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_cds_raw")
    1140                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1141                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1142              
    1143              $C$DW$76        .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    1145                      .dwattr $C$DW$76, DW_AT_name("cd_register_xfer_address")
    1146                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_cd_register_xfer_address")
    1147                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1148                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1149              
    1150              $C$DW$77        .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
    1152                      .dwattr $C$DW$77, DW_AT_name("cd_register_xfer_rxdata")
    1153                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_cd_register_xfer_rxdata")
    1154                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1155                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1156              
    1157              $C$DW$78        .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    1159                      .dwattr $C$DW$78, DW_AT_name("cd_register_xfer_txdata")
    1160                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_cd_register_xfer_txdata")
    1161                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1162                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1163              
    1164              $C$DW$79        .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
    1166                      .dwattr $C$DW$79, DW_AT_name("cd_register_xfer_is_write")
    1167                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_cd_register_xfer_is_write")
    1168                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1169                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1170              
    1171              $C$DW$80        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   24

    1172                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$24)
    1173                      .dwattr $C$DW$80, DW_AT_name("scd_raw")
    1174                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_scd_raw")
    1175                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1176                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1177              
    1178              $C$DW$81        .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$20)
    1180                      .dwattr $C$DW$81, DW_AT_name("scd_crc")
    1181                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_scd_crc")
    1182                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1183                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1184              
    1185              $C$DW$82        .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$24)
    1187                      .dwattr $C$DW$82, DW_AT_name("position")
    1188                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_position")
    1189                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1190                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1191              
    1192              $C$DW$83        .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    1194                      .dwattr $C$DW$83, DW_AT_name("scd_error")
    1195                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_scd_error")
    1196                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1197                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1198              
    1199              $C$DW$84        .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
    1201                      .dwattr $C$DW$84, DW_AT_name("scd_warning")
    1202                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_scd_warning")
    1203                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1204                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1205              
    1206              $C$DW$85        .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    1208                      .dwattr $C$DW$85, DW_AT_name("crc_incorrect_count")
    1209                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_crc_incorrect_count")
    1210                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1211                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1212              
    1213              $C$DW$86        .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
    1215                      .dwattr $C$DW$86, DW_AT_name("dataReady")
    1216                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_dataReady")
    1217                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1218                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1219              
    1220              $C$DW$87        .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$25)
    1222                      .dwattr $C$DW$87, DW_AT_name("sdata")
    1223                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_sdata")
    1224                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1225                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1226              
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   25

    1227              $C$DW$88        .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$25)
    1229                      .dwattr $C$DW$88, DW_AT_name("rdata")
    1230                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rdata")
    1231                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1232                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1233              
    1234              $C$DW$89        .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    1236                      .dwattr $C$DW$89, DW_AT_name("fifo_level")
    1237                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_fifo_level")
    1238                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1239                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1240              
    1241              $C$DW$90        .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
    1243                      .dwattr $C$DW$90, DW_AT_name("xfer_address_withCTS")
    1244                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_xfer_address_withCTS")
    1245                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
    1246                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1247              
    1248              $C$DW$91        .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$27)
    1250                      .dwattr $C$DW$91, DW_AT_name("spi")
    1251                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_spi")
    1252                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1253                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1254              
    1255                      .dwendtag $C$DW$T$28
    1256              
    1257              $C$DW$T$541     .dwtag  DW_TAG_typedef
    1258                      .dwattr $C$DW$T$541, DW_AT_name("BISSC_DATA_STRUCT")
    1259                      .dwattr $C$DW$T$541, DW_AT_type(*$C$DW$T$28)
    1260                      .dwattr $C$DW$T$541, DW_AT_language(DW_LANG_C)
    1261              
    1262              
    1263              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1264                      .dwattr $C$DW$T$30, DW_AT_name("AQCSFRC_BITS")
    1265                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1266              $C$DW$92        .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$29)
    1268                      .dwattr $C$DW$92, DW_AT_name("CSFA")
    1269                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_CSFA")
    1270                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0e)
    1271                      .dwattr $C$DW$92, DW_AT_bit_size(0x02)
    1272                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1274              
    1275              $C$DW$93        .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$29)
    1277                      .dwattr $C$DW$93, DW_AT_name("CSFB")
    1278                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_CSFB")
    1279                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0c)
    1280                      .dwattr $C$DW$93, DW_AT_bit_size(0x02)
    1281                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   26

    1282                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1283              
    1284              $C$DW$94        .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$29)
    1286                      .dwattr $C$DW$94, DW_AT_name("rsvd1")
    1287                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd1")
    1288                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00)
    1289                      .dwattr $C$DW$94, DW_AT_bit_size(0x0c)
    1290                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1291                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1292              
    1293                      .dwendtag $C$DW$T$30
    1294              
    1295              
    1296              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1297                      .dwattr $C$DW$T$31, DW_AT_name("AQCSFRC_REG")
    1298                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1299              $C$DW$95        .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$29)
    1301                      .dwattr $C$DW$95, DW_AT_name("all")
    1302                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
    1303                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1305              
    1306              $C$DW$96        .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$30)
    1308                      .dwattr $C$DW$96, DW_AT_name("bit")
    1309                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
    1310                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1312              
    1313                      .dwendtag $C$DW$T$31
    1314              
    1315              
    1316              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1317                      .dwattr $C$DW$T$32, DW_AT_name("AQCTLA2_BITS")
    1318                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1319              $C$DW$97        .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$29)
    1321                      .dwattr $C$DW$97, DW_AT_name("T1U")
    1322                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_T1U")
    1323                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0e)
    1324                      .dwattr $C$DW$97, DW_AT_bit_size(0x02)
    1325                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1326                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1327              
    1328              $C$DW$98        .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$29)
    1330                      .dwattr $C$DW$98, DW_AT_name("T1D")
    1331                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_T1D")
    1332                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c)
    1333                      .dwattr $C$DW$98, DW_AT_bit_size(0x02)
    1334                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1336              
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   27

    1337              $C$DW$99        .dwtag  DW_TAG_member
    1338                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$29)
    1339                      .dwattr $C$DW$99, DW_AT_name("T2U")
    1340                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_T2U")
    1341                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0a)
    1342                      .dwattr $C$DW$99, DW_AT_bit_size(0x02)
    1343                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1344                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1345              
    1346              $C$DW$100       .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$29)
    1348                      .dwattr $C$DW$100, DW_AT_name("T2D")
    1349                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_T2D")
    1350                      .dwattr $C$DW$100, DW_AT_bit_offset(0x08)
    1351                      .dwattr $C$DW$100, DW_AT_bit_size(0x02)
    1352                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1354              
    1355              $C$DW$101       .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$29)
    1357                      .dwattr $C$DW$101, DW_AT_name("rsvd1")
    1358                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd1")
    1359                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1360                      .dwattr $C$DW$101, DW_AT_bit_size(0x08)
    1361                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1362                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1363              
    1364                      .dwendtag $C$DW$T$32
    1365              
    1366              
    1367              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1368                      .dwattr $C$DW$T$33, DW_AT_name("AQCTLA2_REG")
    1369                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1370              $C$DW$102       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$29)
    1372                      .dwattr $C$DW$102, DW_AT_name("all")
    1373                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    1374                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1376              
    1377              $C$DW$103       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$32)
    1379                      .dwattr $C$DW$103, DW_AT_name("bit")
    1380                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    1381                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1383              
    1384                      .dwendtag $C$DW$T$33
    1385              
    1386              
    1387              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1388                      .dwattr $C$DW$T$34, DW_AT_name("AQCTLA_BITS")
    1389                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1390              $C$DW$104       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   28

    1392                      .dwattr $C$DW$104, DW_AT_name("ZRO")
    1393                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_ZRO")
    1394                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e)
    1395                      .dwattr $C$DW$104, DW_AT_bit_size(0x02)
    1396                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1397                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1398              
    1399              $C$DW$105       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$29)
    1401                      .dwattr $C$DW$105, DW_AT_name("PRD")
    1402                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_PRD")
    1403                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0c)
    1404                      .dwattr $C$DW$105, DW_AT_bit_size(0x02)
    1405                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1407              
    1408              $C$DW$106       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$29)
    1410                      .dwattr $C$DW$106, DW_AT_name("CAU")
    1411                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_CAU")
    1412                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0a)
    1413                      .dwattr $C$DW$106, DW_AT_bit_size(0x02)
    1414                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1415                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1416              
    1417              $C$DW$107       .dwtag  DW_TAG_member
    1418                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$29)
    1419                      .dwattr $C$DW$107, DW_AT_name("CAD")
    1420                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_CAD")
    1421                      .dwattr $C$DW$107, DW_AT_bit_offset(0x08)
    1422                      .dwattr $C$DW$107, DW_AT_bit_size(0x02)
    1423                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1424                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1425              
    1426              $C$DW$108       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$29)
    1428                      .dwattr $C$DW$108, DW_AT_name("CBU")
    1429                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_CBU")
    1430                      .dwattr $C$DW$108, DW_AT_bit_offset(0x06)
    1431                      .dwattr $C$DW$108, DW_AT_bit_size(0x02)
    1432                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1434              
    1435              $C$DW$109       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$29)
    1437                      .dwattr $C$DW$109, DW_AT_name("CBD")
    1438                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_CBD")
    1439                      .dwattr $C$DW$109, DW_AT_bit_offset(0x04)
    1440                      .dwattr $C$DW$109, DW_AT_bit_size(0x02)
    1441                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1442                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1443              
    1444              $C$DW$110       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$29)
    1446                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   29

    1447                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    1448                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1449                      .dwattr $C$DW$110, DW_AT_bit_size(0x04)
    1450                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1452              
    1453                      .dwendtag $C$DW$T$34
    1454              
    1455              
    1456              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1457                      .dwattr $C$DW$T$35, DW_AT_name("AQCTLA_REG")
    1458                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1459              $C$DW$111       .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$29)
    1461                      .dwattr $C$DW$111, DW_AT_name("all")
    1462                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1463                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1464                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1465              
    1466              $C$DW$112       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$34)
    1468                      .dwattr $C$DW$112, DW_AT_name("bit")
    1469                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    1470                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1471                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1472              
    1473                      .dwendtag $C$DW$T$35
    1474              
    1475              
    1476              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1477                      .dwattr $C$DW$T$36, DW_AT_name("AQCTLB2_BITS")
    1478                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1479              $C$DW$113       .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$29)
    1481                      .dwattr $C$DW$113, DW_AT_name("T1U")
    1482                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_T1U")
    1483                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0e)
    1484                      .dwattr $C$DW$113, DW_AT_bit_size(0x02)
    1485                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1486                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1487              
    1488              $C$DW$114       .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$29)
    1490                      .dwattr $C$DW$114, DW_AT_name("T1D")
    1491                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_T1D")
    1492                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0c)
    1493                      .dwattr $C$DW$114, DW_AT_bit_size(0x02)
    1494                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1496              
    1497              $C$DW$115       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$29)
    1499                      .dwattr $C$DW$115, DW_AT_name("T2U")
    1500                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_T2U")
    1501                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   30

    1502                      .dwattr $C$DW$115, DW_AT_bit_size(0x02)
    1503                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1504                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1505              
    1506              $C$DW$116       .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$29)
    1508                      .dwattr $C$DW$116, DW_AT_name("T2D")
    1509                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_T2D")
    1510                      .dwattr $C$DW$116, DW_AT_bit_offset(0x08)
    1511                      .dwattr $C$DW$116, DW_AT_bit_size(0x02)
    1512                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1513                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1514              
    1515              $C$DW$117       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$29)
    1517                      .dwattr $C$DW$117, DW_AT_name("rsvd1")
    1518                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd1")
    1519                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    1520                      .dwattr $C$DW$117, DW_AT_bit_size(0x08)
    1521                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524                      .dwendtag $C$DW$T$36
    1525              
    1526              
    1527              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1528                      .dwattr $C$DW$T$37, DW_AT_name("AQCTLB2_REG")
    1529                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1530              $C$DW$118       .dwtag  DW_TAG_member
    1531                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$29)
    1532                      .dwattr $C$DW$118, DW_AT_name("all")
    1533                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_all")
    1534                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1535                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1536              
    1537              $C$DW$119       .dwtag  DW_TAG_member
    1538                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$36)
    1539                      .dwattr $C$DW$119, DW_AT_name("bit")
    1540                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_bit")
    1541                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1542                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1543              
    1544                      .dwendtag $C$DW$T$37
    1545              
    1546              
    1547              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1548                      .dwattr $C$DW$T$38, DW_AT_name("AQCTLB_BITS")
    1549                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1550              $C$DW$120       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$29)
    1552                      .dwattr $C$DW$120, DW_AT_name("ZRO")
    1553                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_ZRO")
    1554                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0e)
    1555                      .dwattr $C$DW$120, DW_AT_bit_size(0x02)
    1556                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   31

    1557                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1558              
    1559              $C$DW$121       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$29)
    1561                      .dwattr $C$DW$121, DW_AT_name("PRD")
    1562                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PRD")
    1563                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0c)
    1564                      .dwattr $C$DW$121, DW_AT_bit_size(0x02)
    1565                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1566                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1567              
    1568              $C$DW$122       .dwtag  DW_TAG_member
    1569                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$29)
    1570                      .dwattr $C$DW$122, DW_AT_name("CAU")
    1571                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_CAU")
    1572                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0a)
    1573                      .dwattr $C$DW$122, DW_AT_bit_size(0x02)
    1574                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1575                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1576              
    1577              $C$DW$123       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$29)
    1579                      .dwattr $C$DW$123, DW_AT_name("CAD")
    1580                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_CAD")
    1581                      .dwattr $C$DW$123, DW_AT_bit_offset(0x08)
    1582                      .dwattr $C$DW$123, DW_AT_bit_size(0x02)
    1583                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1584                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1585              
    1586              $C$DW$124       .dwtag  DW_TAG_member
    1587                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$29)
    1588                      .dwattr $C$DW$124, DW_AT_name("CBU")
    1589                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_CBU")
    1590                      .dwattr $C$DW$124, DW_AT_bit_offset(0x06)
    1591                      .dwattr $C$DW$124, DW_AT_bit_size(0x02)
    1592                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1594              
    1595              $C$DW$125       .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$29)
    1597                      .dwattr $C$DW$125, DW_AT_name("CBD")
    1598                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_CBD")
    1599                      .dwattr $C$DW$125, DW_AT_bit_offset(0x04)
    1600                      .dwattr $C$DW$125, DW_AT_bit_size(0x02)
    1601                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1603              
    1604              $C$DW$126       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$29)
    1606                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
    1607                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
    1608                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00)
    1609                      .dwattr $C$DW$126, DW_AT_bit_size(0x04)
    1610                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1611                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   32

    1612              
    1613                      .dwendtag $C$DW$T$38
    1614              
    1615              
    1616              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1617                      .dwattr $C$DW$T$39, DW_AT_name("AQCTLB_REG")
    1618                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1619              $C$DW$127       .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$29)
    1621                      .dwattr $C$DW$127, DW_AT_name("all")
    1622                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_all")
    1623                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1624                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1625              
    1626              $C$DW$128       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$38)
    1628                      .dwattr $C$DW$128, DW_AT_name("bit")
    1629                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bit")
    1630                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1631                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1632              
    1633                      .dwendtag $C$DW$T$39
    1634              
    1635              
    1636              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1637                      .dwattr $C$DW$T$40, DW_AT_name("AQCTL_BITS")
    1638                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1639              $C$DW$129       .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$29)
    1641                      .dwattr $C$DW$129, DW_AT_name("LDAQAMODE")
    1642                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_LDAQAMODE")
    1643                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0e)
    1644                      .dwattr $C$DW$129, DW_AT_bit_size(0x02)
    1645                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1646                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1647              
    1648              $C$DW$130       .dwtag  DW_TAG_member
    1649                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$29)
    1650                      .dwattr $C$DW$130, DW_AT_name("LDAQBMODE")
    1651                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_LDAQBMODE")
    1652                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0c)
    1653                      .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    1654                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1655                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1656              
    1657              $C$DW$131       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$29)
    1659                      .dwattr $C$DW$131, DW_AT_name("SHDWAQAMODE")
    1660                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_SHDWAQAMODE")
    1661                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0b)
    1662                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1663                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1664                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1665              
    1666              $C$DW$132       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   33

    1667                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$29)
    1668                      .dwattr $C$DW$132, DW_AT_name("rsvd1")
    1669                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd1")
    1670                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0a)
    1671                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1672                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1673                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1674              
    1675              $C$DW$133       .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$29)
    1677                      .dwattr $C$DW$133, DW_AT_name("SHDWAQBMODE")
    1678                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_SHDWAQBMODE")
    1679                      .dwattr $C$DW$133, DW_AT_bit_offset(0x09)
    1680                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1681                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1682                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1683              
    1684              $C$DW$134       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$29)
    1686                      .dwattr $C$DW$134, DW_AT_name("rsvd2")
    1687                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd2")
    1688                      .dwattr $C$DW$134, DW_AT_bit_offset(0x08)
    1689                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1690                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1691                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1692              
    1693              $C$DW$135       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$29)
    1695                      .dwattr $C$DW$135, DW_AT_name("LDAQASYNC")
    1696                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_LDAQASYNC")
    1697                      .dwattr $C$DW$135, DW_AT_bit_offset(0x06)
    1698                      .dwattr $C$DW$135, DW_AT_bit_size(0x02)
    1699                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1700                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1701              
    1702              $C$DW$136       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$29)
    1704                      .dwattr $C$DW$136, DW_AT_name("LDAQBSYNC")
    1705                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_LDAQBSYNC")
    1706                      .dwattr $C$DW$136, DW_AT_bit_offset(0x04)
    1707                      .dwattr $C$DW$136, DW_AT_bit_size(0x02)
    1708                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1709                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1710              
    1711              $C$DW$137       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$29)
    1713                      .dwattr $C$DW$137, DW_AT_name("rsvd3")
    1714                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd3")
    1715                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    1716                      .dwattr $C$DW$137, DW_AT_bit_size(0x04)
    1717                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1718                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1719              
    1720                      .dwendtag $C$DW$T$40
    1721              
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   34

    1722              
    1723              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1724                      .dwattr $C$DW$T$41, DW_AT_name("AQCTL_REG")
    1725                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1726              $C$DW$138       .dwtag  DW_TAG_member
    1727                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$29)
    1728                      .dwattr $C$DW$138, DW_AT_name("all")
    1729                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    1730                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1731                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1732              
    1733              $C$DW$139       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$40)
    1735                      .dwattr $C$DW$139, DW_AT_name("bit")
    1736                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    1737                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1738                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1739              
    1740                      .dwendtag $C$DW$T$41
    1741              
    1742              
    1743              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1744                      .dwattr $C$DW$T$42, DW_AT_name("AQSFRC_BITS")
    1745                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1746              $C$DW$140       .dwtag  DW_TAG_member
    1747                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$29)
    1748                      .dwattr $C$DW$140, DW_AT_name("ACTSFA")
    1749                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ACTSFA")
    1750                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0e)
    1751                      .dwattr $C$DW$140, DW_AT_bit_size(0x02)
    1752                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1753                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1754              
    1755              $C$DW$141       .dwtag  DW_TAG_member
    1756                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$29)
    1757                      .dwattr $C$DW$141, DW_AT_name("OTSFA")
    1758                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_OTSFA")
    1759                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0d)
    1760                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1761                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1762                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1763              
    1764              $C$DW$142       .dwtag  DW_TAG_member
    1765                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$29)
    1766                      .dwattr $C$DW$142, DW_AT_name("ACTSFB")
    1767                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ACTSFB")
    1768                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0b)
    1769                      .dwattr $C$DW$142, DW_AT_bit_size(0x02)
    1770                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1771                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1772              
    1773              $C$DW$143       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$29)
    1775                      .dwattr $C$DW$143, DW_AT_name("OTSFB")
    1776                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_OTSFB")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   35

    1777                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0a)
    1778                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1779                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1780                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1781              
    1782              $C$DW$144       .dwtag  DW_TAG_member
    1783                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$29)
    1784                      .dwattr $C$DW$144, DW_AT_name("RLDCSF")
    1785                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_RLDCSF")
    1786                      .dwattr $C$DW$144, DW_AT_bit_offset(0x08)
    1787                      .dwattr $C$DW$144, DW_AT_bit_size(0x02)
    1788                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1789                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1790              
    1791              $C$DW$145       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$29)
    1793                      .dwattr $C$DW$145, DW_AT_name("rsvd1")
    1794                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd1")
    1795                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    1796                      .dwattr $C$DW$145, DW_AT_bit_size(0x08)
    1797                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1798                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1799              
    1800                      .dwendtag $C$DW$T$42
    1801              
    1802              
    1803              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1804                      .dwattr $C$DW$T$43, DW_AT_name("AQSFRC_REG")
    1805                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1806              $C$DW$146       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$29)
    1808                      .dwattr $C$DW$146, DW_AT_name("all")
    1809                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_all")
    1810                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1811                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1812              
    1813              $C$DW$147       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$42)
    1815                      .dwattr $C$DW$147, DW_AT_name("bit")
    1816                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_bit")
    1817                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1818                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1819              
    1820                      .dwendtag $C$DW$T$43
    1821              
    1822              
    1823              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1824                      .dwattr $C$DW$T$44, DW_AT_name("AQTSRCSEL_BITS")
    1825                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1826              $C$DW$148       .dwtag  DW_TAG_member
    1827                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$29)
    1828                      .dwattr $C$DW$148, DW_AT_name("T1SEL")
    1829                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_T1SEL")
    1830                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0c)
    1831                      .dwattr $C$DW$148, DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   36

    1832                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1833                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1834              
    1835              $C$DW$149       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$29)
    1837                      .dwattr $C$DW$149, DW_AT_name("T2SEL")
    1838                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_T2SEL")
    1839                      .dwattr $C$DW$149, DW_AT_bit_offset(0x08)
    1840                      .dwattr $C$DW$149, DW_AT_bit_size(0x04)
    1841                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1842                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1843              
    1844              $C$DW$150       .dwtag  DW_TAG_member
    1845                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$29)
    1846                      .dwattr $C$DW$150, DW_AT_name("rsvd1")
    1847                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd1")
    1848                      .dwattr $C$DW$150, DW_AT_bit_offset(0x00)
    1849                      .dwattr $C$DW$150, DW_AT_bit_size(0x08)
    1850                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1851                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1852              
    1853                      .dwendtag $C$DW$T$44
    1854              
    1855              
    1856              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1857                      .dwattr $C$DW$T$45, DW_AT_name("AQTSRCSEL_REG")
    1858                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1859              $C$DW$151       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$29)
    1861                      .dwattr $C$DW$151, DW_AT_name("all")
    1862                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_all")
    1863                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1864                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1865              
    1866              $C$DW$152       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$44)
    1868                      .dwattr $C$DW$152, DW_AT_name("bit")
    1869                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_bit")
    1870                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1871                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1872              
    1873                      .dwendtag $C$DW$T$45
    1874              
    1875              
    1876              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1877                      .dwattr $C$DW$T$46, DW_AT_name("CMPA_BITS")
    1878                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    1879              $C$DW$153       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$29)
    1881                      .dwattr $C$DW$153, DW_AT_name("CMPAHR")
    1882                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_CMPAHR")
    1883                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00)
    1884                      .dwattr $C$DW$153, DW_AT_bit_size(0x10)
    1885                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1886                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   37

    1887              
    1888              $C$DW$154       .dwtag  DW_TAG_member
    1889                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$29)
    1890                      .dwattr $C$DW$154, DW_AT_name("CMPA")
    1891                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_CMPA")
    1892                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    1893                      .dwattr $C$DW$154, DW_AT_bit_size(0x10)
    1894                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1895                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1896              
    1897                      .dwendtag $C$DW$T$46
    1898              
    1899              
    1900              $C$DW$T$48      .dwtag  DW_TAG_union_type
    1901                      .dwattr $C$DW$T$48, DW_AT_name("CMPA_REG")
    1902                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    1903              $C$DW$155       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$47)
    1905                      .dwattr $C$DW$155, DW_AT_name("all")
    1906                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_all")
    1907                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1908                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1909              
    1910              $C$DW$156       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$46)
    1912                      .dwattr $C$DW$156, DW_AT_name("bit")
    1913                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_bit")
    1914                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1915                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1916              
    1917                      .dwendtag $C$DW$T$48
    1918              
    1919              
    1920              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1921                      .dwattr $C$DW$T$49, DW_AT_name("CMPB_BITS")
    1922                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    1923              $C$DW$157       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$29)
    1925                      .dwattr $C$DW$157, DW_AT_name("CMPBHR")
    1926                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_CMPBHR")
    1927                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00)
    1928                      .dwattr $C$DW$157, DW_AT_bit_size(0x10)
    1929                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1930                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1931              
    1932              $C$DW$158       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$29)
    1934                      .dwattr $C$DW$158, DW_AT_name("CMPB")
    1935                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_CMPB")
    1936                      .dwattr $C$DW$158, DW_AT_bit_offset(0x00)
    1937                      .dwattr $C$DW$158, DW_AT_bit_size(0x10)
    1938                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1939                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1940              
    1941                      .dwendtag $C$DW$T$49
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   38

    1942              
    1943              
    1944              $C$DW$T$50      .dwtag  DW_TAG_union_type
    1945                      .dwattr $C$DW$T$50, DW_AT_name("CMPB_REG")
    1946                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    1947              $C$DW$159       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$47)
    1949                      .dwattr $C$DW$159, DW_AT_name("all")
    1950                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_all")
    1951                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1953              
    1954              $C$DW$160       .dwtag  DW_TAG_member
    1955                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$49)
    1956                      .dwattr $C$DW$160, DW_AT_name("bit")
    1957                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_bit")
    1958                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1959                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1960              
    1961                      .dwendtag $C$DW$T$50
    1962              
    1963              
    1964              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1965                      .dwattr $C$DW$T$51, DW_AT_name("CMPCTL2_BITS")
    1966                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    1967              $C$DW$161       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$29)
    1969                      .dwattr $C$DW$161, DW_AT_name("LOADCMODE")
    1970                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_LOADCMODE")
    1971                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0e)
    1972                      .dwattr $C$DW$161, DW_AT_bit_size(0x02)
    1973                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1974                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1975              
    1976              $C$DW$162       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$29)
    1978                      .dwattr $C$DW$162, DW_AT_name("LOADDMODE")
    1979                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_LOADDMODE")
    1980                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0c)
    1981                      .dwattr $C$DW$162, DW_AT_bit_size(0x02)
    1982                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1983                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1984              
    1985              $C$DW$163       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$29)
    1987                      .dwattr $C$DW$163, DW_AT_name("SHDWCMODE")
    1988                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_SHDWCMODE")
    1989                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0b)
    1990                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1991                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1992                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1993              
    1994              $C$DW$164       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$29)
    1996                      .dwattr $C$DW$164, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   39

    1997                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd1")
    1998                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0a)
    1999                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2000                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2002              
    2003              $C$DW$165       .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$29)
    2005                      .dwattr $C$DW$165, DW_AT_name("SHDWDMODE")
    2006                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_SHDWDMODE")
    2007                      .dwattr $C$DW$165, DW_AT_bit_offset(0x09)
    2008                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2009                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2011              
    2012              $C$DW$166       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$29)
    2014                      .dwattr $C$DW$166, DW_AT_name("rsvd2")
    2015                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd2")
    2016                      .dwattr $C$DW$166, DW_AT_bit_offset(0x06)
    2017                      .dwattr $C$DW$166, DW_AT_bit_size(0x03)
    2018                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2020              
    2021              $C$DW$167       .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$29)
    2023                      .dwattr $C$DW$167, DW_AT_name("LOADCSYNC")
    2024                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_LOADCSYNC")
    2025                      .dwattr $C$DW$167, DW_AT_bit_offset(0x04)
    2026                      .dwattr $C$DW$167, DW_AT_bit_size(0x02)
    2027                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2028                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2029              
    2030              $C$DW$168       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$29)
    2032                      .dwattr $C$DW$168, DW_AT_name("LOADDSYNC")
    2033                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_LOADDSYNC")
    2034                      .dwattr $C$DW$168, DW_AT_bit_offset(0x02)
    2035                      .dwattr $C$DW$168, DW_AT_bit_size(0x02)
    2036                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2037                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2038              
    2039              $C$DW$169       .dwtag  DW_TAG_member
    2040                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$29)
    2041                      .dwattr $C$DW$169, DW_AT_name("rsvd3")
    2042                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd3")
    2043                      .dwattr $C$DW$169, DW_AT_bit_offset(0x00)
    2044                      .dwattr $C$DW$169, DW_AT_bit_size(0x02)
    2045                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2046                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2047              
    2048                      .dwendtag $C$DW$T$51
    2049              
    2050              
    2051              $C$DW$T$52      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   40

    2052                      .dwattr $C$DW$T$52, DW_AT_name("CMPCTL2_REG")
    2053                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    2054              $C$DW$170       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$29)
    2056                      .dwattr $C$DW$170, DW_AT_name("all")
    2057                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_all")
    2058                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2059                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2060              
    2061              $C$DW$171       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$51)
    2063                      .dwattr $C$DW$171, DW_AT_name("bit")
    2064                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_bit")
    2065                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2066                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2067              
    2068                      .dwendtag $C$DW$T$52
    2069              
    2070              
    2071              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2072                      .dwattr $C$DW$T$53, DW_AT_name("CMPCTL_BITS")
    2073                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    2074              $C$DW$172       .dwtag  DW_TAG_member
    2075                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$29)
    2076                      .dwattr $C$DW$172, DW_AT_name("LOADAMODE")
    2077                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_LOADAMODE")
    2078                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0e)
    2079                      .dwattr $C$DW$172, DW_AT_bit_size(0x02)
    2080                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2081                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2082              
    2083              $C$DW$173       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$29)
    2085                      .dwattr $C$DW$173, DW_AT_name("LOADBMODE")
    2086                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_LOADBMODE")
    2087                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0c)
    2088                      .dwattr $C$DW$173, DW_AT_bit_size(0x02)
    2089                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2090                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2091              
    2092              $C$DW$174       .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$29)
    2094                      .dwattr $C$DW$174, DW_AT_name("SHDWAMODE")
    2095                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_SHDWAMODE")
    2096                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0b)
    2097                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2098                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2100              
    2101              $C$DW$175       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$29)
    2103                      .dwattr $C$DW$175, DW_AT_name("rsvd1")
    2104                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd1")
    2105                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0a)
    2106                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   41

    2107                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2108                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2109              
    2110              $C$DW$176       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$29)
    2112                      .dwattr $C$DW$176, DW_AT_name("SHDWBMODE")
    2113                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_SHDWBMODE")
    2114                      .dwattr $C$DW$176, DW_AT_bit_offset(0x09)
    2115                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2116                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2117                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2118              
    2119              $C$DW$177       .dwtag  DW_TAG_member
    2120                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$29)
    2121                      .dwattr $C$DW$177, DW_AT_name("rsvd2")
    2122                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd2")
    2123                      .dwattr $C$DW$177, DW_AT_bit_offset(0x08)
    2124                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2125                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2126                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2127              
    2128              $C$DW$178       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$29)
    2130                      .dwattr $C$DW$178, DW_AT_name("SHDWAFULL")
    2131                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_SHDWAFULL")
    2132                      .dwattr $C$DW$178, DW_AT_bit_offset(0x07)
    2133                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2134                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2135                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2136              
    2137              $C$DW$179       .dwtag  DW_TAG_member
    2138                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$29)
    2139                      .dwattr $C$DW$179, DW_AT_name("SHDWBFULL")
    2140                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_SHDWBFULL")
    2141                      .dwattr $C$DW$179, DW_AT_bit_offset(0x06)
    2142                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2143                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2144                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2145              
    2146              $C$DW$180       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$29)
    2148                      .dwattr $C$DW$180, DW_AT_name("LOADASYNC")
    2149                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_LOADASYNC")
    2150                      .dwattr $C$DW$180, DW_AT_bit_offset(0x04)
    2151                      .dwattr $C$DW$180, DW_AT_bit_size(0x02)
    2152                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2154              
    2155              $C$DW$181       .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$29)
    2157                      .dwattr $C$DW$181, DW_AT_name("LOADBSYNC")
    2158                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_LOADBSYNC")
    2159                      .dwattr $C$DW$181, DW_AT_bit_offset(0x02)
    2160                      .dwattr $C$DW$181, DW_AT_bit_size(0x02)
    2161                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   42

    2162                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2163              
    2164              $C$DW$182       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$29)
    2166                      .dwattr $C$DW$182, DW_AT_name("rsvd3")
    2167                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd3")
    2168                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    2169                      .dwattr $C$DW$182, DW_AT_bit_size(0x02)
    2170                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2171                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2172              
    2173                      .dwendtag $C$DW$T$53
    2174              
    2175              
    2176              $C$DW$T$54      .dwtag  DW_TAG_union_type
    2177                      .dwattr $C$DW$T$54, DW_AT_name("CMPCTL_REG")
    2178                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    2179              $C$DW$183       .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$29)
    2181                      .dwattr $C$DW$183, DW_AT_name("all")
    2182                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    2183                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2184                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2185              
    2186              $C$DW$184       .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$53)
    2188                      .dwattr $C$DW$184, DW_AT_name("bit")
    2189                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    2190                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2191                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2192              
    2193                      .dwendtag $C$DW$T$54
    2194              
    2195              
    2196              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2197                      .dwattr $C$DW$T$55, DW_AT_name("CPUSYSLOCK1_BITS")
    2198                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x02)
    2199              $C$DW$185       .dwtag  DW_TAG_member
    2200                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$29)
    2201                      .dwattr $C$DW$185, DW_AT_name("HIBBOOTMODE")
    2202                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    2203                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0f)
    2204                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2205                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2206                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2207              
    2208              $C$DW$186       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$29)
    2210                      .dwattr $C$DW$186, DW_AT_name("IORESTOREADDR")
    2211                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_IORESTOREADDR")
    2212                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0e)
    2213                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2214                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2215                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2216              
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   43

    2217              $C$DW$187       .dwtag  DW_TAG_member
    2218                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$29)
    2219                      .dwattr $C$DW$187, DW_AT_name("PIEVERRADDR")
    2220                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PIEVERRADDR")
    2221                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0d)
    2222                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2223                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2224                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2225              
    2226              $C$DW$188       .dwtag  DW_TAG_member
    2227                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$29)
    2228                      .dwattr $C$DW$188, DW_AT_name("PCLKCR0")
    2229                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_PCLKCR0")
    2230                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0c)
    2231                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2232                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2233                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2234              
    2235              $C$DW$189       .dwtag  DW_TAG_member
    2236                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$29)
    2237                      .dwattr $C$DW$189, DW_AT_name("PCLKCR1")
    2238                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_PCLKCR1")
    2239                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0b)
    2240                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2241                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2242                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2243              
    2244              $C$DW$190       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$29)
    2246                      .dwattr $C$DW$190, DW_AT_name("PCLKCR2")
    2247                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PCLKCR2")
    2248                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0a)
    2249                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2250                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2251                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2252              
    2253              $C$DW$191       .dwtag  DW_TAG_member
    2254                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$29)
    2255                      .dwattr $C$DW$191, DW_AT_name("PCLKCR3")
    2256                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PCLKCR3")
    2257                      .dwattr $C$DW$191, DW_AT_bit_offset(0x09)
    2258                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2259                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2260                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2261              
    2262              $C$DW$192       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$29)
    2264                      .dwattr $C$DW$192, DW_AT_name("PCLKCR4")
    2265                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PCLKCR4")
    2266                      .dwattr $C$DW$192, DW_AT_bit_offset(0x08)
    2267                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2268                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2269                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2270              
    2271              $C$DW$193       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   44

    2272                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$29)
    2273                      .dwattr $C$DW$193, DW_AT_name("PCLKCR5")
    2274                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_PCLKCR5")
    2275                      .dwattr $C$DW$193, DW_AT_bit_offset(0x07)
    2276                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2277                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2279              
    2280              $C$DW$194       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$29)
    2282                      .dwattr $C$DW$194, DW_AT_name("PCLKCR6")
    2283                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_PCLKCR6")
    2284                      .dwattr $C$DW$194, DW_AT_bit_offset(0x06)
    2285                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2286                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2288              
    2289              $C$DW$195       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$29)
    2291                      .dwattr $C$DW$195, DW_AT_name("PCLKCR7")
    2292                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_PCLKCR7")
    2293                      .dwattr $C$DW$195, DW_AT_bit_offset(0x05)
    2294                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2295                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2297              
    2298              $C$DW$196       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$29)
    2300                      .dwattr $C$DW$196, DW_AT_name("PCLKCR8")
    2301                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_PCLKCR8")
    2302                      .dwattr $C$DW$196, DW_AT_bit_offset(0x04)
    2303                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2304                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2305                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2306              
    2307              $C$DW$197       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$29)
    2309                      .dwattr $C$DW$197, DW_AT_name("PCLKCR9")
    2310                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_PCLKCR9")
    2311                      .dwattr $C$DW$197, DW_AT_bit_offset(0x03)
    2312                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2313                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2315              
    2316              $C$DW$198       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$29)
    2318                      .dwattr $C$DW$198, DW_AT_name("PCLKCR10")
    2319                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_PCLKCR10")
    2320                      .dwattr $C$DW$198, DW_AT_bit_offset(0x02)
    2321                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2322                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2323                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2324              
    2325              $C$DW$199       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   45

    2327                      .dwattr $C$DW$199, DW_AT_name("PCLKCR11")
    2328                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_PCLKCR11")
    2329                      .dwattr $C$DW$199, DW_AT_bit_offset(0x01)
    2330                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2331                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2332                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2333              
    2334              $C$DW$200       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$29)
    2336                      .dwattr $C$DW$200, DW_AT_name("PCLKCR12")
    2337                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_PCLKCR12")
    2338                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00)
    2339                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2340                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2341                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2342              
    2343              $C$DW$201       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$29)
    2345                      .dwattr $C$DW$201, DW_AT_name("PCLKCR13")
    2346                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_PCLKCR13")
    2347                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0f)
    2348                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2349                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2350                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2351              
    2352              $C$DW$202       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$29)
    2354                      .dwattr $C$DW$202, DW_AT_name("PCLKCR14")
    2355                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_PCLKCR14")
    2356                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0e)
    2357                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2358                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2359                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2360              
    2361              $C$DW$203       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$29)
    2363                      .dwattr $C$DW$203, DW_AT_name("PCLKCR15")
    2364                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_PCLKCR15")
    2365                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0d)
    2366                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2367                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2368                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2369              
    2370              $C$DW$204       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$29)
    2372                      .dwattr $C$DW$204, DW_AT_name("PCLKCR16")
    2373                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_PCLKCR16")
    2374                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0c)
    2375                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2376                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2377                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2378              
    2379              $C$DW$205       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$29)
    2381                      .dwattr $C$DW$205, DW_AT_name("SECMSEL")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:25 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bissc.asm                                                            PAGE   46

    2382                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_SECMSEL")
    2383                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0b)
    2384                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2385                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2386                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2387              
    2388              $C$DW$206       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$29)
    2390                      .dwattr $C$DW$206, DW_AT_name("LPMCR")
