TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Mon Dec  7 23:59:27 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\hakan\OneDrive\Belgeler\GitHub\fault_tolerant_drives\Softw
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("PIE_RESERVED_ISR")

    1518                      .global _EQEP1_ISR
    1519                      .global _EQEP2_ISR
    1520                      .global _EQEP3_ISR
    1521                      .global _SPIA_RX_ISR
    1522                      .global _SPIA_TX_ISR
    1523                      .global _SPIB_RX_ISR
    1524                      .global _SPIB_TX_ISR
    1525                      .global _MCBSPA_RX_ISR
    1526                      .global _MCBSPA_TX_ISR
    1527                      .global _MCBSPB_RX_ISR
    1528                      .global _MCBSPB_TX_ISR
    1529                      .global _DMA_CH1_ISR
    1530                      .global _DMA_CH2_ISR
    1531                      .global _DMA_CH3_ISR
    1532                      .global _DMA_CH4_ISR
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   33

    1533                      .global _DMA_CH5_ISR
    1534                      .global _DMA_CH6_ISR
    1535                      .global _I2CA_ISR
    1536                      .global _I2CA_FIFO_ISR
    1537                      .global _I2CB_ISR
    1538                      .global _I2CB_FIFO_ISR
    1539                      .global _SCIC_RX_ISR
    1540                      .global _SCIC_TX_ISR
    1541                      .global _SCID_RX_ISR
    1542                      .global _SCID_TX_ISR
    1543                      .global _SCIA_RX_ISR
    1544                      .global _SCIA_TX_ISR
    1545                      .global _SCIB_RX_ISR
    1546                      .global _SCIB_TX_ISR
    1547                      .global _CANA0_ISR
    1548                      .global _CANA1_ISR
    1549                      .global _CANB0_ISR
    1550                      .global _CANB1_ISR
    1551                      .global _ADCA_EVT_ISR
    1552                      .global _ADCA2_ISR
    1553                      .global _ADCA3_ISR
    1554                      .global _ADCA4_ISR
    1555                      .global _ADCB_EVT_ISR
    1556                      .global _ADCB2_ISR
    1557                      .global _ADCB3_ISR
    1558                      .global _ADCB4_ISR
    1559                      .global _CLA1_1_ISR
    1560                      .global _CLA1_2_ISR
    1561                      .global _CLA1_3_ISR
    1562                      .global _CLA1_4_ISR
    1563                      .global _CLA1_5_ISR
    1564                      .global _CLA1_6_ISR
    1565                      .global _CLA1_7_ISR
    1566                      .global _CLA1_8_ISR
    1567                      .global _XINT3_ISR
    1568                      .global _XINT4_ISR
    1569                      .global _XINT5_ISR
    1570                      .global _VCU_ISR
    1571                      .global _FPU_OVERFLOW_ISR
    1572                      .global _FPU_UNDERFLOW_ISR
    1573                      .global _IPC0_ISR
    1574                      .global _IPC1_ISR
    1575                      .global _IPC2_ISR
    1576                      .global _IPC3_ISR
    1577                      .global _EPWM9_TZ_ISR
    1578                      .global _EPWM10_TZ_ISR
    1579                      .global _EPWM11_TZ_ISR
    1580                      .global _EPWM12_TZ_ISR
    1581                      .global _EPWM9_ISR
    1582                      .global _EPWM10_ISR
    1583                      .global _EPWM11_ISR
    1584                      .global _EPWM12_ISR
    1585                      .global _SD1_ISR
    1586                      .global _SD2_ISR
    1587                      .global _SPIC_RX_ISR
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   34

    1588                      .global _SPIC_TX_ISR
    1589                      .global _UPPA_ISR
    1590                      .global _USBA_ISR
    1591                      .global _ADCC_EVT_ISR
    1592                      .global _ADCC2_ISR
    1593                      .global _ADCC3_ISR
    1594                      .global _ADCC4_ISR
    1595                      .global _ADCD_EVT_ISR
    1596                      .global _ADCD2_ISR
    1597                      .global _ADCD3_ISR
    1598                      .global _ADCD4_ISR
    1599                      .global _EMIF_ERROR_ISR
    1600                      .global _RAM_CORRECTABLE_ERROR_ISR
    1601                      .global _FLASH_CORRECTABLE_ERROR_ISR
    1602                      .global _RAM_ACCESS_VIOLATION_ISR
    1603                      .global _SYS_PLL_SLIP_ISR
    1604                      .global _AUX_PLL_SLIP_ISR
    1605                      .global _CLA_OVERFLOW_ISR
    1606                      .global _CLA_UNDERFLOW_ISR
    1607                      .global _PieCtrlRegs
    1608                      .global _PieVectTable
    1609              
    1610              ;***************************************************************
    1611              ;* TYPE INFORMATION                                            *
    1612              ;***************************************************************
    1613              
    1614              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1615                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
    1616                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1617              $C$DW$148       .dwtag  DW_TAG_member
    1618                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1619                      .dwattr $C$DW$148, DW_AT_name("ACK1")
    1620                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ACK1")
    1621                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0f)
    1622                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1623                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1624                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1625              
    1626              $C$DW$149       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1628                      .dwattr $C$DW$149, DW_AT_name("ACK2")
    1629                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ACK2")
    1630                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0e)
    1631                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1632                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1633                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1634              
    1635              $C$DW$150       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1637                      .dwattr $C$DW$150, DW_AT_name("ACK3")
    1638                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ACK3")
    1639                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0d)
    1640                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1641                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   35

    1643              
    1644              $C$DW$151       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1646                      .dwattr $C$DW$151, DW_AT_name("ACK4")
    1647                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ACK4")
    1648                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0c)
    1649                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1650                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1651                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1652              
    1653              $C$DW$152       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1655                      .dwattr $C$DW$152, DW_AT_name("ACK5")
    1656                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ACK5")
    1657                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0b)
    1658                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1659                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1661              
    1662              $C$DW$153       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1664                      .dwattr $C$DW$153, DW_AT_name("ACK6")
    1665                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ACK6")
    1666                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0a)
    1667                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1668                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1670              
    1671              $C$DW$154       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1673                      .dwattr $C$DW$154, DW_AT_name("ACK7")
    1674                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ACK7")
    1675                      .dwattr $C$DW$154, DW_AT_bit_offset(0x09)
    1676                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1677                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1678                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1679              
    1680              $C$DW$155       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1682                      .dwattr $C$DW$155, DW_AT_name("ACK8")
    1683                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ACK8")
    1684                      .dwattr $C$DW$155, DW_AT_bit_offset(0x08)
    1685                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1686                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1687                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1688              
    1689              $C$DW$156       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1691                      .dwattr $C$DW$156, DW_AT_name("ACK9")
    1692                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ACK9")
    1693                      .dwattr $C$DW$156, DW_AT_bit_offset(0x07)
    1694                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1695                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1697              
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   36

    1698              $C$DW$157       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1700                      .dwattr $C$DW$157, DW_AT_name("ACK10")
    1701                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ACK10")
    1702                      .dwattr $C$DW$157, DW_AT_bit_offset(0x06)
    1703                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1704                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1705                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1706              
    1707              $C$DW$158       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1709                      .dwattr $C$DW$158, DW_AT_name("ACK11")
    1710                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ACK11")
    1711                      .dwattr $C$DW$158, DW_AT_bit_offset(0x05)
    1712                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    1713                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1715              
    1716              $C$DW$159       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1718                      .dwattr $C$DW$159, DW_AT_name("ACK12")
    1719                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ACK12")
    1720                      .dwattr $C$DW$159, DW_AT_bit_offset(0x04)
    1721                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    1722                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1723                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1724              
    1725              $C$DW$160       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1727                      .dwattr $C$DW$160, DW_AT_name("rsvd1")
    1728                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd1")
    1729                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    1730                      .dwattr $C$DW$160, DW_AT_bit_size(0x04)
    1731                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1733              
    1734                      .dwendtag $C$DW$T$20
    1735              
    1736              
    1737              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1738                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
    1739                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1740              $C$DW$161       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1742                      .dwattr $C$DW$161, DW_AT_name("all")
    1743                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_all")
    1744                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1745                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1746              
    1747              $C$DW$162       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    1749                      .dwattr $C$DW$162, DW_AT_name("bit")
    1750                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_bit")
    1751                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1752                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   37

    1753              
    1754                      .dwendtag $C$DW$T$21
    1755              
    1756              
    1757              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1758                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
    1759                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1760              $C$DW$163       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1762                      .dwattr $C$DW$163, DW_AT_name("ENPIE")
    1763                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_ENPIE")
    1764                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0f)
    1765                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1766                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1767                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1768              
    1769              $C$DW$164       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1771                      .dwattr $C$DW$164, DW_AT_name("PIEVECT")
    1772                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PIEVECT")
    1773                      .dwattr $C$DW$164, DW_AT_bit_offset(0x00)
    1774                      .dwattr $C$DW$164, DW_AT_bit_size(0x0f)
    1775                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1777              
    1778                      .dwendtag $C$DW$T$22
    1779              
    1780              
    1781              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1782                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
    1783                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1784              $C$DW$165       .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1786                      .dwattr $C$DW$165, DW_AT_name("all")
    1787                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_all")
    1788                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1789                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1790              
    1791              $C$DW$166       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    1793                      .dwattr $C$DW$166, DW_AT_name("bit")
    1794                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_bit")
    1795                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1796                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1797              
    1798                      .dwendtag $C$DW$T$23
    1799              
    1800              
    1801              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1802                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER10_BITS")
    1803                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1804              $C$DW$167       .dwtag  DW_TAG_member
    1805                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1806                      .dwattr $C$DW$167, DW_AT_name("INTx1")
    1807                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_INTx1")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   38

    1808                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0f)
    1809                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    1810                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1811                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1812              
    1813              $C$DW$168       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1815                      .dwattr $C$DW$168, DW_AT_name("INTx2")
    1816                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_INTx2")
    1817                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0e)
    1818                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    1819                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1820                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1821              
    1822              $C$DW$169       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1824                      .dwattr $C$DW$169, DW_AT_name("INTx3")
    1825                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_INTx3")
    1826                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0d)
    1827                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    1828                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1829                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1830              
    1831              $C$DW$170       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1833                      .dwattr $C$DW$170, DW_AT_name("INTx4")
    1834                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_INTx4")
    1835                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0c)
    1836                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    1837                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1838                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1839              
    1840              $C$DW$171       .dwtag  DW_TAG_member
    1841                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1842                      .dwattr $C$DW$171, DW_AT_name("INTx5")
    1843                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_INTx5")
    1844                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0b)
    1845                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    1846                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1847                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1848              
    1849              $C$DW$172       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1851                      .dwattr $C$DW$172, DW_AT_name("INTx6")
    1852                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_INTx6")
    1853                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0a)
    1854                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    1855                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1856                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1857              
    1858              $C$DW$173       .dwtag  DW_TAG_member
    1859                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1860                      .dwattr $C$DW$173, DW_AT_name("INTx7")
    1861                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_INTx7")
    1862                      .dwattr $C$DW$173, DW_AT_bit_offset(0x09)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   39

    1863                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    1864                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1865                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1866              
    1867              $C$DW$174       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1869                      .dwattr $C$DW$174, DW_AT_name("INTx8")
    1870                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_INTx8")
    1871                      .dwattr $C$DW$174, DW_AT_bit_offset(0x08)
    1872                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    1873                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1874                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1875              
    1876              $C$DW$175       .dwtag  DW_TAG_member
    1877                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1878                      .dwattr $C$DW$175, DW_AT_name("INTx9")
    1879                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_INTx9")
    1880                      .dwattr $C$DW$175, DW_AT_bit_offset(0x07)
    1881                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    1882                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1883                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1884              
    1885              $C$DW$176       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1887                      .dwattr $C$DW$176, DW_AT_name("INTx10")
    1888                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_INTx10")
    1889                      .dwattr $C$DW$176, DW_AT_bit_offset(0x06)
    1890                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    1891                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1892                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1893              
    1894              $C$DW$177       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1896                      .dwattr $C$DW$177, DW_AT_name("INTx11")
    1897                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_INTx11")
    1898                      .dwattr $C$DW$177, DW_AT_bit_offset(0x05)
    1899                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    1900                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1901                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1902              
    1903              $C$DW$178       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1905                      .dwattr $C$DW$178, DW_AT_name("INTx12")
    1906                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_INTx12")
    1907                      .dwattr $C$DW$178, DW_AT_bit_offset(0x04)
    1908                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    1909                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1910                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1911              
    1912              $C$DW$179       .dwtag  DW_TAG_member
    1913                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1914                      .dwattr $C$DW$179, DW_AT_name("INTx13")
    1915                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_INTx13")
    1916                      .dwattr $C$DW$179, DW_AT_bit_offset(0x03)
    1917                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   40

    1918                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1919                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1920              
    1921              $C$DW$180       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1923                      .dwattr $C$DW$180, DW_AT_name("INTx14")
    1924                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_INTx14")
    1925                      .dwattr $C$DW$180, DW_AT_bit_offset(0x02)
    1926                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    1927                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1928                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1929              
    1930              $C$DW$181       .dwtag  DW_TAG_member
    1931                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1932                      .dwattr $C$DW$181, DW_AT_name("INTx15")
    1933                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_INTx15")
    1934                      .dwattr $C$DW$181, DW_AT_bit_offset(0x01)
    1935                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    1936                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1937                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1938              
    1939              $C$DW$182       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1941                      .dwattr $C$DW$182, DW_AT_name("INTx16")
    1942                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_INTx16")
    1943                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    1944                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    1945                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1946                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1947              
    1948                      .dwendtag $C$DW$T$24
    1949              
    1950              
    1951              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1952                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER10_REG")
    1953                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1954              $C$DW$183       .dwtag  DW_TAG_member
    1955                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1956                      .dwattr $C$DW$183, DW_AT_name("all")
    1957                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    1958                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1959                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1960              
    1961              $C$DW$184       .dwtag  DW_TAG_member
    1962                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$24)
    1963                      .dwattr $C$DW$184, DW_AT_name("bit")
    1964                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    1965                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1966                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1967              
    1968                      .dwendtag $C$DW$T$25
    1969              
    1970              
    1971              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1972                      .dwattr $C$DW$T$26, DW_AT_name("PIEIER11_BITS")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   41

    1973                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1974              $C$DW$185       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1976                      .dwattr $C$DW$185, DW_AT_name("INTx1")
    1977                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_INTx1")
    1978                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0f)
    1979                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    1980                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1981                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1982              
    1983              $C$DW$186       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1985                      .dwattr $C$DW$186, DW_AT_name("INTx2")
    1986                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_INTx2")
    1987                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0e)
    1988                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    1989                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1990                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1991              
    1992              $C$DW$187       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1994                      .dwattr $C$DW$187, DW_AT_name("INTx3")
    1995                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_INTx3")
    1996                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0d)
    1997                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    1998                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1999                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2000              
    2001              $C$DW$188       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2003                      .dwattr $C$DW$188, DW_AT_name("INTx4")
    2004                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_INTx4")
    2005                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0c)
    2006                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2007                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2008                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2009              
    2010              $C$DW$189       .dwtag  DW_TAG_member
    2011                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2012                      .dwattr $C$DW$189, DW_AT_name("INTx5")
    2013                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_INTx5")
    2014                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0b)
    2015                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2016                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2017                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2018              
    2019              $C$DW$190       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2021                      .dwattr $C$DW$190, DW_AT_name("INTx6")
    2022                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_INTx6")
    2023                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0a)
    2024                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2025                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2026                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2027              
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   42

    2028              $C$DW$191       .dwtag  DW_TAG_member
    2029                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2030                      .dwattr $C$DW$191, DW_AT_name("INTx7")
    2031                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_INTx7")
    2032                      .dwattr $C$DW$191, DW_AT_bit_offset(0x09)
    2033                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2034                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2035                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2036              
    2037              $C$DW$192       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2039                      .dwattr $C$DW$192, DW_AT_name("INTx8")
    2040                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_INTx8")
    2041                      .dwattr $C$DW$192, DW_AT_bit_offset(0x08)
    2042                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2043                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2044                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2045              
    2046              $C$DW$193       .dwtag  DW_TAG_member
    2047                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2048                      .dwattr $C$DW$193, DW_AT_name("INTx9")
    2049                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_INTx9")
    2050                      .dwattr $C$DW$193, DW_AT_bit_offset(0x07)
    2051                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2052                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2053                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2054              
    2055              $C$DW$194       .dwtag  DW_TAG_member
    2056                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2057                      .dwattr $C$DW$194, DW_AT_name("INTx10")
    2058                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_INTx10")
    2059                      .dwattr $C$DW$194, DW_AT_bit_offset(0x06)
    2060                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2061                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2062                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2063              
    2064              $C$DW$195       .dwtag  DW_TAG_member
    2065                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2066                      .dwattr $C$DW$195, DW_AT_name("INTx11")
    2067                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_INTx11")
    2068                      .dwattr $C$DW$195, DW_AT_bit_offset(0x05)
    2069                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2070                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2071                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2072              
    2073              $C$DW$196       .dwtag  DW_TAG_member
    2074                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2075                      .dwattr $C$DW$196, DW_AT_name("INTx12")
    2076                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_INTx12")
    2077                      .dwattr $C$DW$196, DW_AT_bit_offset(0x04)
    2078                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2079                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2080                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2081              
    2082              $C$DW$197       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   43

    2083                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2084                      .dwattr $C$DW$197, DW_AT_name("INTx13")
    2085                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_INTx13")
    2086                      .dwattr $C$DW$197, DW_AT_bit_offset(0x03)
    2087                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2088                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2089                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2090              
    2091              $C$DW$198       .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2093                      .dwattr $C$DW$198, DW_AT_name("INTx14")
    2094                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_INTx14")
    2095                      .dwattr $C$DW$198, DW_AT_bit_offset(0x02)
    2096                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2097                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2098                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2099              
    2100              $C$DW$199       .dwtag  DW_TAG_member
    2101                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2102                      .dwattr $C$DW$199, DW_AT_name("INTx15")
    2103                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_INTx15")
    2104                      .dwattr $C$DW$199, DW_AT_bit_offset(0x01)
    2105                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2106                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2107                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2108              
    2109              $C$DW$200       .dwtag  DW_TAG_member
    2110                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2111                      .dwattr $C$DW$200, DW_AT_name("INTx16")
    2112                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_INTx16")
    2113                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00)
    2114                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2115                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2116                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2117              
    2118                      .dwendtag $C$DW$T$26
    2119              
    2120              
    2121              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2122                      .dwattr $C$DW$T$27, DW_AT_name("PIEIER11_REG")
    2123                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2124              $C$DW$201       .dwtag  DW_TAG_member
    2125                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2126                      .dwattr $C$DW$201, DW_AT_name("all")
    2127                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_all")
    2128                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2129                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2130              
    2131              $C$DW$202       .dwtag  DW_TAG_member
    2132                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$26)
    2133                      .dwattr $C$DW$202, DW_AT_name("bit")
    2134                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_bit")
    2135                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2136                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2137              
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   44

    2138                      .dwendtag $C$DW$T$27
    2139              
    2140              
    2141              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2142                      .dwattr $C$DW$T$28, DW_AT_name("PIEIER12_BITS")
    2143                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2144              $C$DW$203       .dwtag  DW_TAG_member
    2145                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2146                      .dwattr $C$DW$203, DW_AT_name("INTx1")
    2147                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_INTx1")
    2148                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0f)
    2149                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2150                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2151                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2152              
    2153              $C$DW$204       .dwtag  DW_TAG_member
    2154                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2155                      .dwattr $C$DW$204, DW_AT_name("INTx2")
    2156                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_INTx2")
    2157                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0e)
    2158                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2159                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2160                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2161              
    2162              $C$DW$205       .dwtag  DW_TAG_member
    2163                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2164                      .dwattr $C$DW$205, DW_AT_name("INTx3")
    2165                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_INTx3")
    2166                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0d)
    2167                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2168                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2169                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2170              
    2171              $C$DW$206       .dwtag  DW_TAG_member
    2172                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2173                      .dwattr $C$DW$206, DW_AT_name("INTx4")
    2174                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_INTx4")
    2175                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0c)
    2176                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2177                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2178                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2179              
    2180              $C$DW$207       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2182                      .dwattr $C$DW$207, DW_AT_name("INTx5")
    2183                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_INTx5")
    2184                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0b)
    2185                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2186                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2187                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2188              
    2189              $C$DW$208       .dwtag  DW_TAG_member
    2190                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2191                      .dwattr $C$DW$208, DW_AT_name("INTx6")
    2192                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_INTx6")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   45

    2193                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0a)
    2194                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2195                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2196                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2197              
    2198              $C$DW$209       .dwtag  DW_TAG_member
    2199                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2200                      .dwattr $C$DW$209, DW_AT_name("INTx7")
    2201                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_INTx7")
    2202                      .dwattr $C$DW$209, DW_AT_bit_offset(0x09)
    2203                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2204                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2205                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2206              
    2207              $C$DW$210       .dwtag  DW_TAG_member
    2208                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2209                      .dwattr $C$DW$210, DW_AT_name("INTx8")
    2210                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_INTx8")
    2211                      .dwattr $C$DW$210, DW_AT_bit_offset(0x08)
    2212                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2213                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2214                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2215              
    2216              $C$DW$211       .dwtag  DW_TAG_member
    2217                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2218                      .dwattr $C$DW$211, DW_AT_name("INTx9")
    2219                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_INTx9")
    2220                      .dwattr $C$DW$211, DW_AT_bit_offset(0x07)
    2221                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2222                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2223                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2224              
    2225              $C$DW$212       .dwtag  DW_TAG_member
    2226                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2227                      .dwattr $C$DW$212, DW_AT_name("INTx10")
    2228                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_INTx10")
    2229                      .dwattr $C$DW$212, DW_AT_bit_offset(0x06)
    2230                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    2231                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2232                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2233              
    2234              $C$DW$213       .dwtag  DW_TAG_member
    2235                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2236                      .dwattr $C$DW$213, DW_AT_name("INTx11")
    2237                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_INTx11")
    2238                      .dwattr $C$DW$213, DW_AT_bit_offset(0x05)
    2239                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2240                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2241                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2242              
    2243              $C$DW$214       .dwtag  DW_TAG_member
    2244                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2245                      .dwattr $C$DW$214, DW_AT_name("INTx12")
    2246                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_INTx12")
    2247                      .dwattr $C$DW$214, DW_AT_bit_offset(0x04)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   46

    2248                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    2249                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2250                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2251              
    2252              $C$DW$215       .dwtag  DW_TAG_member
    2253                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2254                      .dwattr $C$DW$215, DW_AT_name("INTx13")
    2255                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_INTx13")
    2256                      .dwattr $C$DW$215, DW_AT_bit_offset(0x03)
    2257                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    2258                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2259                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2260              
    2261              $C$DW$216       .dwtag  DW_TAG_member
    2262                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2263                      .dwattr $C$DW$216, DW_AT_name("INTx14")
    2264                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_INTx14")
    2265                      .dwattr $C$DW$216, DW_AT_bit_offset(0x02)
    2266                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    2267                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2268                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2269              
    2270              $C$DW$217       .dwtag  DW_TAG_member
    2271                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2272                      .dwattr $C$DW$217, DW_AT_name("INTx15")
    2273                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_INTx15")
    2274                      .dwattr $C$DW$217, DW_AT_bit_offset(0x01)
    2275                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    2276                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2277                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2278              
    2279              $C$DW$218       .dwtag  DW_TAG_member
    2280                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2281                      .dwattr $C$DW$218, DW_AT_name("INTx16")
    2282                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_INTx16")
    2283                      .dwattr $C$DW$218, DW_AT_bit_offset(0x00)
    2284                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    2285                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2286                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2287              
    2288                      .dwendtag $C$DW$T$28
    2289              
    2290              
    2291              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2292                      .dwattr $C$DW$T$29, DW_AT_name("PIEIER12_REG")
    2293                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2294              $C$DW$219       .dwtag  DW_TAG_member
    2295                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2296                      .dwattr $C$DW$219, DW_AT_name("all")
    2297                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_all")
    2298                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2299                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2300              
    2301              $C$DW$220       .dwtag  DW_TAG_member
    2302                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   47

    2303                      .dwattr $C$DW$220, DW_AT_name("bit")
    2304                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_bit")
    2305                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2306                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2307              
    2308                      .dwendtag $C$DW$T$29
    2309              
    2310              
    2311              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2312                      .dwattr $C$DW$T$30, DW_AT_name("PIEIER1_BITS")
    2313                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2314              $C$DW$221       .dwtag  DW_TAG_member
    2315                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2316                      .dwattr $C$DW$221, DW_AT_name("INTx1")
    2317                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_INTx1")
    2318                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0f)
    2319                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    2320                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2321                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2322              
    2323              $C$DW$222       .dwtag  DW_TAG_member
    2324                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2325                      .dwattr $C$DW$222, DW_AT_name("INTx2")
    2326                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_INTx2")
    2327                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0e)
    2328                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    2329                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2330                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2331              
    2332              $C$DW$223       .dwtag  DW_TAG_member
    2333                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2334                      .dwattr $C$DW$223, DW_AT_name("INTx3")
    2335                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_INTx3")
    2336                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0d)
    2337                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    2338                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2339                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2340              
    2341              $C$DW$224       .dwtag  DW_TAG_member
    2342                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2343                      .dwattr $C$DW$224, DW_AT_name("INTx4")
    2344                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_INTx4")
    2345                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0c)
    2346                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    2347                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2348                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2349              
    2350              $C$DW$225       .dwtag  DW_TAG_member
    2351                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2352                      .dwattr $C$DW$225, DW_AT_name("INTx5")
    2353                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_INTx5")
    2354                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0b)
    2355                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    2356                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2357                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   48

    2358              
    2359              $C$DW$226       .dwtag  DW_TAG_member
    2360                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2361                      .dwattr $C$DW$226, DW_AT_name("INTx6")
    2362                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_INTx6")
    2363                      .dwattr $C$DW$226, DW_AT_bit_offset(0x0a)
    2364                      .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    2365                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2366                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2367              
    2368              $C$DW$227       .dwtag  DW_TAG_member
    2369                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    2370                      .dwattr $C$DW$227, DW_AT_name("INTx7")
    2371                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_INTx7")
    2372                      .dwattr $C$DW$227, DW_AT_bit_offset(0x09)
    2373                      .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    2374                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2375                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2376              
    2377              $C$DW$228       .dwtag  DW_TAG_member
    2378                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2379                      .dwattr $C$DW$228, DW_AT_name("INTx8")
    2380                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_INTx8")
    2381                      .dwattr $C$DW$228, DW_AT_bit_offset(0x08)
    2382                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    2383                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2384                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2385              
    2386              $C$DW$229       .dwtag  DW_TAG_member
    2387                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2388                      .dwattr $C$DW$229, DW_AT_name("INTx9")
    2389                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_INTx9")
    2390                      .dwattr $C$DW$229, DW_AT_bit_offset(0x07)
    2391                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    2392                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2393                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2394              
    2395              $C$DW$230       .dwtag  DW_TAG_member
    2396                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    2397                      .dwattr $C$DW$230, DW_AT_name("INTx10")
    2398                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_INTx10")
    2399                      .dwattr $C$DW$230, DW_AT_bit_offset(0x06)
    2400                      .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    2401                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2402                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2403              
    2404              $C$DW$231       .dwtag  DW_TAG_member
    2405                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2406                      .dwattr $C$DW$231, DW_AT_name("INTx11")
    2407                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_INTx11")
    2408                      .dwattr $C$DW$231, DW_AT_bit_offset(0x05)
    2409                      .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    2410                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2411                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2412              
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   49

    2413              $C$DW$232       .dwtag  DW_TAG_member
    2414                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    2415                      .dwattr $C$DW$232, DW_AT_name("INTx12")
    2416                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_INTx12")
    2417                      .dwattr $C$DW$232, DW_AT_bit_offset(0x04)
    2418                      .dwattr $C$DW$232, DW_AT_bit_size(0x01)
    2419                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2420                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2421              
    2422              $C$DW$233       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    2424                      .dwattr $C$DW$233, DW_AT_name("INTx13")
    2425                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_INTx13")
    2426                      .dwattr $C$DW$233, DW_AT_bit_offset(0x03)
    2427                      .dwattr $C$DW$233, DW_AT_bit_size(0x01)
    2428                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2429                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2430              
    2431              $C$DW$234       .dwtag  DW_TAG_member
    2432                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    2433                      .dwattr $C$DW$234, DW_AT_name("INTx14")
    2434                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_INTx14")
    2435                      .dwattr $C$DW$234, DW_AT_bit_offset(0x02)
    2436                      .dwattr $C$DW$234, DW_AT_bit_size(0x01)
    2437                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2438                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2439              
    2440              $C$DW$235       .dwtag  DW_TAG_member
    2441                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    2442                      .dwattr $C$DW$235, DW_AT_name("INTx15")
    2443                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_INTx15")
    2444                      .dwattr $C$DW$235, DW_AT_bit_offset(0x01)
    2445                      .dwattr $C$DW$235, DW_AT_bit_size(0x01)
    2446                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2447                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2448              
    2449              $C$DW$236       .dwtag  DW_TAG_member
    2450                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    2451                      .dwattr $C$DW$236, DW_AT_name("INTx16")
    2452                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_INTx16")
    2453                      .dwattr $C$DW$236, DW_AT_bit_offset(0x00)
    2454                      .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    2455                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2456                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2457              
    2458                      .dwendtag $C$DW$T$30
    2459              
    2460              
    2461              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2462                      .dwattr $C$DW$T$31, DW_AT_name("PIEIER1_REG")
    2463                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2464              $C$DW$237       .dwtag  DW_TAG_member
    2465                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    2466                      .dwattr $C$DW$237, DW_AT_name("all")
    2467                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   50

    2468                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2469                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2470              
    2471              $C$DW$238       .dwtag  DW_TAG_member
    2472                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$30)
    2473                      .dwattr $C$DW$238, DW_AT_name("bit")
    2474                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_bit")
    2475                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2476                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2477              
    2478                      .dwendtag $C$DW$T$31
    2479              
    2480              
    2481              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2482                      .dwattr $C$DW$T$32, DW_AT_name("PIEIER2_BITS")
    2483                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2484              $C$DW$239       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    2486                      .dwattr $C$DW$239, DW_AT_name("INTx1")
    2487                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_INTx1")
    2488                      .dwattr $C$DW$239, DW_AT_bit_offset(0x0f)
    2489                      .dwattr $C$DW$239, DW_AT_bit_size(0x01)
    2490                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2491                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2492              
    2493              $C$DW$240       .dwtag  DW_TAG_member
    2494                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    2495                      .dwattr $C$DW$240, DW_AT_name("INTx2")
    2496                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_INTx2")
    2497                      .dwattr $C$DW$240, DW_AT_bit_offset(0x0e)
    2498                      .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    2499                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2500                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2501              
    2502              $C$DW$241       .dwtag  DW_TAG_member
    2503                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    2504                      .dwattr $C$DW$241, DW_AT_name("INTx3")
    2505                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_INTx3")
    2506                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0d)
    2507                      .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    2508                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2509                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2510              
    2511              $C$DW$242       .dwtag  DW_TAG_member
    2512                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    2513                      .dwattr $C$DW$242, DW_AT_name("INTx4")
    2514                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_INTx4")
    2515                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0c)
    2516                      .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    2517                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2518                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2519              
    2520              $C$DW$243       .dwtag  DW_TAG_member
    2521                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2522                      .dwattr $C$DW$243, DW_AT_name("INTx5")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   51

    2523                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_INTx5")
    2524                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0b)
    2525                      .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    2526                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2527                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2528              
    2529              $C$DW$244       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2531                      .dwattr $C$DW$244, DW_AT_name("INTx6")
    2532                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_INTx6")
    2533                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0a)
    2534                      .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    2535                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2536                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2537              
    2538              $C$DW$245       .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2540                      .dwattr $C$DW$245, DW_AT_name("INTx7")
    2541                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_INTx7")
    2542                      .dwattr $C$DW$245, DW_AT_bit_offset(0x09)
    2543                      .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    2544                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2545                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2546              
    2547              $C$DW$246       .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    2549                      .dwattr $C$DW$246, DW_AT_name("INTx8")
    2550                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_INTx8")
    2551                      .dwattr $C$DW$246, DW_AT_bit_offset(0x08)
    2552                      .dwattr $C$DW$246, DW_AT_bit_size(0x01)
    2553                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2554                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2555              
    2556              $C$DW$247       .dwtag  DW_TAG_member
    2557                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    2558                      .dwattr $C$DW$247, DW_AT_name("INTx9")
    2559                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_INTx9")
    2560                      .dwattr $C$DW$247, DW_AT_bit_offset(0x07)
    2561                      .dwattr $C$DW$247, DW_AT_bit_size(0x01)
    2562                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2563                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2564              
    2565              $C$DW$248       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    2567                      .dwattr $C$DW$248, DW_AT_name("INTx10")
    2568                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_INTx10")
    2569                      .dwattr $C$DW$248, DW_AT_bit_offset(0x06)
    2570                      .dwattr $C$DW$248, DW_AT_bit_size(0x01)
    2571                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2572                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2573              
    2574              $C$DW$249       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    2576                      .dwattr $C$DW$249, DW_AT_name("INTx11")
    2577                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_INTx11")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   52

    2578                      .dwattr $C$DW$249, DW_AT_bit_offset(0x05)
    2579                      .dwattr $C$DW$249, DW_AT_bit_size(0x01)
    2580                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2581                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2582              
    2583              $C$DW$250       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    2585                      .dwattr $C$DW$250, DW_AT_name("INTx12")
    2586                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_INTx12")
    2587                      .dwattr $C$DW$250, DW_AT_bit_offset(0x04)
    2588                      .dwattr $C$DW$250, DW_AT_bit_size(0x01)
    2589                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2590                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2591              
    2592              $C$DW$251       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    2594                      .dwattr $C$DW$251, DW_AT_name("INTx13")
    2595                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_INTx13")
    2596                      .dwattr $C$DW$251, DW_AT_bit_offset(0x03)
    2597                      .dwattr $C$DW$251, DW_AT_bit_size(0x01)
    2598                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2599                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2600              
    2601              $C$DW$252       .dwtag  DW_TAG_member
    2602                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    2603                      .dwattr $C$DW$252, DW_AT_name("INTx14")
    2604                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_INTx14")
    2605                      .dwattr $C$DW$252, DW_AT_bit_offset(0x02)
    2606                      .dwattr $C$DW$252, DW_AT_bit_size(0x01)
    2607                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2608                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2609              
    2610              $C$DW$253       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    2612                      .dwattr $C$DW$253, DW_AT_name("INTx15")
    2613                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_INTx15")
    2614                      .dwattr $C$DW$253, DW_AT_bit_offset(0x01)
    2615                      .dwattr $C$DW$253, DW_AT_bit_size(0x01)
    2616                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2617                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2618              
    2619              $C$DW$254       .dwtag  DW_TAG_member
    2620                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    2621                      .dwattr $C$DW$254, DW_AT_name("INTx16")
    2622                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_INTx16")
    2623                      .dwattr $C$DW$254, DW_AT_bit_offset(0x00)
    2624                      .dwattr $C$DW$254, DW_AT_bit_size(0x01)
    2625                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2626                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2627              
    2628                      .dwendtag $C$DW$T$32
    2629              
    2630              
    2631              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2632                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER2_REG")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   53

    2633                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2634              $C$DW$255       .dwtag  DW_TAG_member
    2635                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    2636                      .dwattr $C$DW$255, DW_AT_name("all")
    2637                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_all")
    2638                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2639                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2640              
    2641              $C$DW$256       .dwtag  DW_TAG_member
    2642                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$32)
    2643                      .dwattr $C$DW$256, DW_AT_name("bit")
    2644                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_bit")
    2645                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2646                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2647              
    2648                      .dwendtag $C$DW$T$33
    2649              
    2650              
    2651              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2652                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER3_BITS")
    2653                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2654              $C$DW$257       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    2656                      .dwattr $C$DW$257, DW_AT_name("INTx1")
    2657                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_INTx1")
    2658                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0f)
    2659                      .dwattr $C$DW$257, DW_AT_bit_size(0x01)
    2660                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2661                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2662              
    2663              $C$DW$258       .dwtag  DW_TAG_member
    2664                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    2665                      .dwattr $C$DW$258, DW_AT_name("INTx2")
    2666                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_INTx2")
    2667                      .dwattr $C$DW$258, DW_AT_bit_offset(0x0e)
    2668                      .dwattr $C$DW$258, DW_AT_bit_size(0x01)
    2669                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2670                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2671              
    2672              $C$DW$259       .dwtag  DW_TAG_member
    2673                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    2674                      .dwattr $C$DW$259, DW_AT_name("INTx3")
    2675                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_INTx3")
    2676                      .dwattr $C$DW$259, DW_AT_bit_offset(0x0d)
    2677                      .dwattr $C$DW$259, DW_AT_bit_size(0x01)
    2678                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2679                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2680              
    2681              $C$DW$260       .dwtag  DW_TAG_member
    2682                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    2683                      .dwattr $C$DW$260, DW_AT_name("INTx4")
    2684                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_INTx4")
    2685                      .dwattr $C$DW$260, DW_AT_bit_offset(0x0c)
    2686                      .dwattr $C$DW$260, DW_AT_bit_size(0x01)
    2687                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   54

    2688                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2689              
    2690              $C$DW$261       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    2692                      .dwattr $C$DW$261, DW_AT_name("INTx5")
    2693                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_INTx5")
    2694                      .dwattr $C$DW$261, DW_AT_bit_offset(0x0b)
    2695                      .dwattr $C$DW$261, DW_AT_bit_size(0x01)
    2696                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2697                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2698              
    2699              $C$DW$262       .dwtag  DW_TAG_member
    2700                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    2701                      .dwattr $C$DW$262, DW_AT_name("INTx6")
    2702                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_INTx6")
    2703                      .dwattr $C$DW$262, DW_AT_bit_offset(0x0a)
    2704                      .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    2705                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2706                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2707              
    2708              $C$DW$263       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    2710                      .dwattr $C$DW$263, DW_AT_name("INTx7")
    2711                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_INTx7")
    2712                      .dwattr $C$DW$263, DW_AT_bit_offset(0x09)
    2713                      .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    2714                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2715                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2716              
    2717              $C$DW$264       .dwtag  DW_TAG_member
    2718                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    2719                      .dwattr $C$DW$264, DW_AT_name("INTx8")
    2720                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_INTx8")
    2721                      .dwattr $C$DW$264, DW_AT_bit_offset(0x08)
    2722                      .dwattr $C$DW$264, DW_AT_bit_size(0x01)
    2723                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2724                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2725              
    2726              $C$DW$265       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    2728                      .dwattr $C$DW$265, DW_AT_name("INTx9")
    2729                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_INTx9")
    2730                      .dwattr $C$DW$265, DW_AT_bit_offset(0x07)
    2731                      .dwattr $C$DW$265, DW_AT_bit_size(0x01)
    2732                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2733                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2734              
    2735              $C$DW$266       .dwtag  DW_TAG_member
    2736                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    2737                      .dwattr $C$DW$266, DW_AT_name("INTx10")
    2738                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_INTx10")
    2739                      .dwattr $C$DW$266, DW_AT_bit_offset(0x06)
    2740                      .dwattr $C$DW$266, DW_AT_bit_size(0x01)
    2741                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2742                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   55

    2743              
    2744              $C$DW$267       .dwtag  DW_TAG_member
    2745                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    2746                      .dwattr $C$DW$267, DW_AT_name("INTx11")
    2747                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_INTx11")
    2748                      .dwattr $C$DW$267, DW_AT_bit_offset(0x05)
    2749                      .dwattr $C$DW$267, DW_AT_bit_size(0x01)
    2750                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2751                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2752              
    2753              $C$DW$268       .dwtag  DW_TAG_member
    2754                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    2755                      .dwattr $C$DW$268, DW_AT_name("INTx12")
    2756                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_INTx12")
    2757                      .dwattr $C$DW$268, DW_AT_bit_offset(0x04)
    2758                      .dwattr $C$DW$268, DW_AT_bit_size(0x01)
    2759                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2760                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2761              
    2762              $C$DW$269       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    2764                      .dwattr $C$DW$269, DW_AT_name("INTx13")
    2765                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_INTx13")
    2766                      .dwattr $C$DW$269, DW_AT_bit_offset(0x03)
    2767                      .dwattr $C$DW$269, DW_AT_bit_size(0x01)
    2768                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2769                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2770              
    2771              $C$DW$270       .dwtag  DW_TAG_member
    2772                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    2773                      .dwattr $C$DW$270, DW_AT_name("INTx14")
    2774                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_INTx14")
    2775                      .dwattr $C$DW$270, DW_AT_bit_offset(0x02)
    2776                      .dwattr $C$DW$270, DW_AT_bit_size(0x01)
    2777                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2778                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2779              
    2780              $C$DW$271       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    2782                      .dwattr $C$DW$271, DW_AT_name("INTx15")
    2783                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_INTx15")
    2784                      .dwattr $C$DW$271, DW_AT_bit_offset(0x01)
    2785                      .dwattr $C$DW$271, DW_AT_bit_size(0x01)
    2786                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2787                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2788              
    2789              $C$DW$272       .dwtag  DW_TAG_member
    2790                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    2791                      .dwattr $C$DW$272, DW_AT_name("INTx16")
    2792                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_INTx16")
    2793                      .dwattr $C$DW$272, DW_AT_bit_offset(0x00)
    2794                      .dwattr $C$DW$272, DW_AT_bit_size(0x01)
    2795                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2796                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2797              
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   56

    2798                      .dwendtag $C$DW$T$34
    2799              
    2800              
    2801              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2802                      .dwattr $C$DW$T$35, DW_AT_name("PIEIER3_REG")
    2803                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2804              $C$DW$273       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    2806                      .dwattr $C$DW$273, DW_AT_name("all")
    2807                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_all")
    2808                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2809                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2810              
    2811              $C$DW$274       .dwtag  DW_TAG_member
    2812                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$34)
    2813                      .dwattr $C$DW$274, DW_AT_name("bit")
    2814                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_bit")
    2815                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2816                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2817              
    2818                      .dwendtag $C$DW$T$35
    2819              
    2820              
    2821              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2822                      .dwattr $C$DW$T$36, DW_AT_name("PIEIER4_BITS")
    2823                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2824              $C$DW$275       .dwtag  DW_TAG_member
    2825                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    2826                      .dwattr $C$DW$275, DW_AT_name("INTx1")
    2827                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_INTx1")
    2828                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0f)
    2829                      .dwattr $C$DW$275, DW_AT_bit_size(0x01)
    2830                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2831                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2832              
    2833              $C$DW$276       .dwtag  DW_TAG_member
    2834                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    2835                      .dwattr $C$DW$276, DW_AT_name("INTx2")
    2836                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_INTx2")
    2837                      .dwattr $C$DW$276, DW_AT_bit_offset(0x0e)
    2838                      .dwattr $C$DW$276, DW_AT_bit_size(0x01)
    2839                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2840                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2841              
    2842              $C$DW$277       .dwtag  DW_TAG_member
    2843                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    2844                      .dwattr $C$DW$277, DW_AT_name("INTx3")
    2845                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_INTx3")
    2846                      .dwattr $C$DW$277, DW_AT_bit_offset(0x0d)
    2847                      .dwattr $C$DW$277, DW_AT_bit_size(0x01)
    2848                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2849                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2850              
    2851              $C$DW$278       .dwtag  DW_TAG_member
    2852                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:27 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   57

    2853                      .dwattr $C$DW$278, DW_AT_name("INTx4")
    2854                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_INTx4")
    2855                      .dwattr $C$DW$278, DW_AT_bit_offset(0x0c)
    2856                      .dwattr $C$DW$278, DW_AT_bit_size(0x01)
    2857                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2858                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2859              
    2860              $C$DW$279       .dwtag  DW_TAG_member
    2861                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    2862                      .dwattr $C$DW$279, DW_AT_name("INTx5")
    2863                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_INTx5")
    2864                      .dwattr $C$DW$279, DW_AT_bit_offset(0x0b)
    2865                      .dwattr $C$DW$279, DW_AT_bit_size(0x01)
    2866                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2867                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2868              
    2869              $C$DW$280       .dwtag  DW_TAG_member
    2870                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    2871                      .dwattr $C$DW$280, DW_AT_name("INTx6")
    2872                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_INTx6")
    2873                      .dwattr $C$DW$280, DW_AT_bit_offset(0x0a)
    2874                      .dwattr $C$DW$280, DW_AT_bit_size(0x01)
    2875                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2876                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2877              
    2878              $C$DW$281       .dwtag  DW_TAG_member
    2879                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    2880                      .dwattr $C$DW$281, DW_AT_name("INTx7")
    2881                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_INTx7")
    2882                      .dwattr $C$DW$281, DW_AT_bit_offset(0x09)
    2883                      .dwattr $C$DW$281, DW_AT_bit_size(0x01)
    2884                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2885                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2886              
    2887              $C$DW$282       .dwtag  DW_TAG_member
    2888                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    2889                      .dwattr $C$DW$282, DW_AT_name("INTx8")
    2890                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_INTx8")
    2891                      .dwattr $C$DW$282, DW_AT_bit_offset(0x08)
    2892                      .dwattr $C$DW$282, DW_AT_bit_size(0x01)
    2893                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2894                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2895              
    2896              $C$DW$283       .dwtag  DW_TAG_member
    2897                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    2898                      .dwattr $C$DW$283, DW_AT_name("INTx9")
    2899                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_INTx9")
