TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Oct  7 22:14:17 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\hakan\workspace_v10\IDDK_PM_Servo_F2837x-v2\F2837x_RAM")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("GpioCtrlRegs")

     863                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_EPwm.c",li
     864              $C$DW$33        .dwtag  DW_TAG_TI_branch
     865                      .dwattr $C$DW$33, DW_AT_low_pc(0x00)
     866                      .dwattr $C$DW$33, DW_AT_name("_InitEPwm7Gpio")
     867                      .dwattr $C$DW$33, DW_AT_TI_call
     868              
     869 00000132 7640'         LCR       #_InitEPwm7Gpio       ; [CPU_ALU] |25| 
         00000133 0088 
     870                      ; call occurs [#_InitEPwm7Gpio] ; [] |25| 
     871                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_EPwm.c",li
     872              $C$DW$34        .dwtag  DW_TAG_TI_branch
     873                      .dwattr $C$DW$34, DW_AT_low_pc(0x00)
     874                      .dwattr $C$DW$34, DW_AT_name("_InitEPwm8Gpio")
     875                      .dwattr $C$DW$34, DW_AT_TI_call
     876              
     877 00000134 7640'         LCR       #_InitEPwm8Gpio       ; [CPU_ALU] |26| 
         00000135 00A0 
     878                      ; call occurs [#_InitEPwm8Gpio] ; [] |26| 
     879                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_EPwm.c",li
     880              $C$DW$35        .dwtag  DW_TAG_TI_branch
     881                      .dwattr $C$DW$35, DW_AT_low_pc(0x00)
     882                      .dwattr $C$DW$35, DW_AT_name("_InitEPwm9Gpio")
     883                      .dwattr $C$DW$35, DW_AT_TI_call
     884              
     885 00000136 7640'         LCR       #_InitEPwm9Gpio       ; [CPU_ALU] |27| 
         00000137 00B8 
     886                      ; call occurs [#_InitEPwm9Gpio] ; [] |27| 
     887                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_EPwm.c",li
     888              $C$DW$36        .dwtag  DW_TAG_TI_branch
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   19

     889                      .dwattr $C$DW$36, DW_AT_low_pc(0x00)
     890                      .dwattr $C$DW$36, DW_AT_name("_InitEPwm10Gpio")
     891                      .dwattr $C$DW$36, DW_AT_TI_call
     892              
     893 00000138 7640'         LCR       #_InitEPwm10Gpio      ; [CPU_ALU] |28| 
         00000139 00D2 
     894                      ; call occurs [#_InitEPwm10Gpio] ; [] |28| 
     895                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_EPwm.c",li
     896              $C$DW$37        .dwtag  DW_TAG_TI_branch
     897                      .dwattr $C$DW$37, DW_AT_low_pc(0x00)
     898                      .dwattr $C$DW$37, DW_AT_name("_InitEPwm11Gpio")
     899                      .dwattr $C$DW$37, DW_AT_TI_call
     900              
     901 0000013a 7640'         LCR       #_InitEPwm11Gpio      ; [CPU_ALU] |29| 
         0000013b 00ED 
     902                      ; call occurs [#_InitEPwm11Gpio] ; [] |29| 
     903                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_EPwm.c",li
     904              $C$DW$38        .dwtag  DW_TAG_TI_branch
     905                      .dwattr $C$DW$38, DW_AT_low_pc(0x00)
     906                      .dwattr $C$DW$38, DW_AT_name("_InitEPwm12Gpio")
     907                      .dwattr $C$DW$38, DW_AT_TI_call
     908              
     909 0000013c 7640'         LCR       #_InitEPwm12Gpio      ; [CPU_ALU] |30| 
         0000013d 0109 
     910                      ; call occurs [#_InitEPwm12Gpio] ; [] |30| 
     911              $C$DW$39        .dwtag  DW_TAG_TI_branch
     912                      .dwattr $C$DW$39, DW_AT_low_pc(0x00)
     913                      .dwattr $C$DW$39, DW_AT_TI_return
     914              
     915 0000013e 0006          LRETR     ; [CPU_ALU] 
     916                      ; return occurs ; [] 
     917                      .dwattr $C$DW$26, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/so
     918                      .dwattr $C$DW$26, DW_AT_TI_end_line(0x20)
     919                      .dwattr $C$DW$26, DW_AT_TI_end_column(0x01)
     920                      .dwendentry
     921                      .dwendtag $C$DW$26
     922              
     923              ;**************************************************************
     924              ;* UNDEFINED EXTERNAL REFERENCES                              *
     925              ;**************************************************************
     926                      .global _GpioCtrlRegs
     927              
     928              ;***************************************************************
     929              ;* TYPE INFORMATION                                            *
     930              ;***************************************************************
     931              
     932              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     933                      .dwattr $C$DW$T$20, DW_AT_name("GPACR_BITS")
     934                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     935              $C$DW$40        .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     937                      .dwattr $C$DW$40, DW_AT_name("GPIO0")
     938                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_GPIO0")
     939                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0f)
     940                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   20

     941                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     943              
     944              $C$DW$41        .dwtag  DW_TAG_member
     945                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     946                      .dwattr $C$DW$41, DW_AT_name("GPIO1")
     947                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_GPIO1")
     948                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0e)
     949                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     950                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     951                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     952              
     953              $C$DW$42        .dwtag  DW_TAG_member
     954                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     955                      .dwattr $C$DW$42, DW_AT_name("GPIO2")
     956                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_GPIO2")
     957                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0d)
     958                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     959                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     960                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     961              
     962              $C$DW$43        .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     964                      .dwattr $C$DW$43, DW_AT_name("GPIO3")
     965                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_GPIO3")
     966                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0c)
     967                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     968                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     969                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     970              
     971              $C$DW$44        .dwtag  DW_TAG_member
     972                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     973                      .dwattr $C$DW$44, DW_AT_name("GPIO4")
     974                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIO4")
     975                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0b)
     976                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     977                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     978                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     979              
     980              $C$DW$45        .dwtag  DW_TAG_member
     981                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     982                      .dwattr $C$DW$45, DW_AT_name("GPIO5")
     983                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIO5")
     984                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0a)
     985                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     986                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     987                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     988              
     989              $C$DW$46        .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     991                      .dwattr $C$DW$46, DW_AT_name("GPIO6")
     992                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIO6")
     993                      .dwattr $C$DW$46, DW_AT_bit_offset(0x09)
     994                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     995                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   21

     996                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     997              
     998              $C$DW$47        .dwtag  DW_TAG_member
     999                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
    1000                      .dwattr $C$DW$47, DW_AT_name("GPIO7")
    1001                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO7")
    1002                      .dwattr $C$DW$47, DW_AT_bit_offset(0x08)
    1003                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
    1004                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1005                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1006              
    1007              $C$DW$48        .dwtag  DW_TAG_member
    1008                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
    1009                      .dwattr $C$DW$48, DW_AT_name("GPIO8")
    1010                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO8")
    1011                      .dwattr $C$DW$48, DW_AT_bit_offset(0x07)
    1012                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
    1013                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1015              
    1016              $C$DW$49        .dwtag  DW_TAG_member
    1017                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
    1018                      .dwattr $C$DW$49, DW_AT_name("GPIO9")
    1019                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO9")
    1020                      .dwattr $C$DW$49, DW_AT_bit_offset(0x06)
    1021                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
    1022                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1023                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1024              
    1025              $C$DW$50        .dwtag  DW_TAG_member
    1026                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
    1027                      .dwattr $C$DW$50, DW_AT_name("GPIO10")
    1028                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO10")
    1029                      .dwattr $C$DW$50, DW_AT_bit_offset(0x05)
    1030                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
    1031                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1032                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1033              
    1034              $C$DW$51        .dwtag  DW_TAG_member
    1035                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
    1036                      .dwattr $C$DW$51, DW_AT_name("GPIO11")
    1037                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO11")
    1038                      .dwattr $C$DW$51, DW_AT_bit_offset(0x04)
    1039                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
    1040                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1041                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1042              
    1043              $C$DW$52        .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1045                      .dwattr $C$DW$52, DW_AT_name("GPIO12")
    1046                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO12")
    1047                      .dwattr $C$DW$52, DW_AT_bit_offset(0x03)
    1048                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
    1049                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1050                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   22

    1051              
    1052              $C$DW$53        .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
    1054                      .dwattr $C$DW$53, DW_AT_name("GPIO13")
    1055                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO13")
    1056                      .dwattr $C$DW$53, DW_AT_bit_offset(0x02)
    1057                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
    1058                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1059                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1060              
    1061              $C$DW$54        .dwtag  DW_TAG_member
    1062                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
    1063                      .dwattr $C$DW$54, DW_AT_name("GPIO14")
    1064                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO14")
    1065                      .dwattr $C$DW$54, DW_AT_bit_offset(0x01)
    1066                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
    1067                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1068                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1069              
    1070              $C$DW$55        .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1072                      .dwattr $C$DW$55, DW_AT_name("GPIO15")
    1073                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO15")
    1074                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00)
    1075                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
    1076                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1077                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1078              
    1079              $C$DW$56        .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1081                      .dwattr $C$DW$56, DW_AT_name("GPIO16")
    1082                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO16")
    1083                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0f)
    1084                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
    1085                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1086                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1087              
    1088              $C$DW$57        .dwtag  DW_TAG_member
    1089                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1090                      .dwattr $C$DW$57, DW_AT_name("GPIO17")
    1091                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO17")
    1092                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0e)
    1093                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
    1094                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1095                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1096              
    1097              $C$DW$58        .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1099                      .dwattr $C$DW$58, DW_AT_name("GPIO18")
    1100                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO18")
    1101                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0d)
    1102                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
    1103                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1104                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1105              
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   23

    1106              $C$DW$59        .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1108                      .dwattr $C$DW$59, DW_AT_name("GPIO19")
    1109                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO19")
    1110                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0c)
    1111                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
    1112                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1113                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1114              
    1115              $C$DW$60        .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1117                      .dwattr $C$DW$60, DW_AT_name("GPIO20")
    1118                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO20")
    1119                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0b)
    1120                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
    1121                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1122                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1123              
    1124              $C$DW$61        .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1126                      .dwattr $C$DW$61, DW_AT_name("GPIO21")
    1127                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO21")
    1128                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0a)
    1129                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
    1130                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1131                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1132              
    1133              $C$DW$62        .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1135                      .dwattr $C$DW$62, DW_AT_name("GPIO22")
    1136                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO22")
    1137                      .dwattr $C$DW$62, DW_AT_bit_offset(0x09)
    1138                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
    1139                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1140                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1141              
    1142              $C$DW$63        .dwtag  DW_TAG_member
    1143                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1144                      .dwattr $C$DW$63, DW_AT_name("GPIO23")
    1145                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO23")
    1146                      .dwattr $C$DW$63, DW_AT_bit_offset(0x08)
    1147                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
    1148                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1149                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1150              
    1151              $C$DW$64        .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1153                      .dwattr $C$DW$64, DW_AT_name("GPIO24")
    1154                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO24")
    1155                      .dwattr $C$DW$64, DW_AT_bit_offset(0x07)
    1156                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
    1157                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1158                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1159              
    1160              $C$DW$65        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   24

    1161                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1162                      .dwattr $C$DW$65, DW_AT_name("GPIO25")
    1163                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO25")
    1164                      .dwattr $C$DW$65, DW_AT_bit_offset(0x06)
    1165                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
    1166                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1167                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1168              
    1169              $C$DW$66        .dwtag  DW_TAG_member
    1170                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1171                      .dwattr $C$DW$66, DW_AT_name("GPIO26")
    1172                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO26")
    1173                      .dwattr $C$DW$66, DW_AT_bit_offset(0x05)
    1174                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1175                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1176                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1177              
    1178              $C$DW$67        .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1180                      .dwattr $C$DW$67, DW_AT_name("GPIO27")
    1181                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO27")
    1182                      .dwattr $C$DW$67, DW_AT_bit_offset(0x04)
    1183                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1184                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1185                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1186              
    1187              $C$DW$68        .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1189                      .dwattr $C$DW$68, DW_AT_name("GPIO28")
    1190                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO28")
    1191                      .dwattr $C$DW$68, DW_AT_bit_offset(0x03)
    1192                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
    1193                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1194                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1195              
    1196              $C$DW$69        .dwtag  DW_TAG_member
    1197                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1198                      .dwattr $C$DW$69, DW_AT_name("GPIO29")
    1199                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO29")
    1200                      .dwattr $C$DW$69, DW_AT_bit_offset(0x02)
    1201                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1202                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1203                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1204              
    1205              $C$DW$70        .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1207                      .dwattr $C$DW$70, DW_AT_name("GPIO30")
    1208                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO30")
    1209                      .dwattr $C$DW$70, DW_AT_bit_offset(0x01)
    1210                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1211                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1212                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1213              
    1214              $C$DW$71        .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   25

    1216                      .dwattr $C$DW$71, DW_AT_name("GPIO31")
    1217                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO31")
    1218                      .dwattr $C$DW$71, DW_AT_bit_offset(0x00)
    1219                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    1220                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1221                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1222              
    1223                      .dwendtag $C$DW$T$20
    1224              
    1225              
    1226              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1227                      .dwattr $C$DW$T$22, DW_AT_name("GPACR_REG")
    1228                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1229              $C$DW$72        .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
    1231                      .dwattr $C$DW$72, DW_AT_name("all")
    1232                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_all")
    1233                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1235              
    1236              $C$DW$73        .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
    1238                      .dwattr $C$DW$73, DW_AT_name("bit")
    1239                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_bit")
    1240                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1242              
    1243                      .dwendtag $C$DW$T$22
    1244              
    1245              
    1246              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1247                      .dwattr $C$DW$T$23, DW_AT_name("GPACSEL1_BITS")
    1248                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1249              $C$DW$74        .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1251                      .dwattr $C$DW$74, DW_AT_name("GPIO0")
    1252                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO0")
    1253                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0c)
    1254                      .dwattr $C$DW$74, DW_AT_bit_size(0x04)
    1255                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1256                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1257              
    1258              $C$DW$75        .dwtag  DW_TAG_member
    1259                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1260                      .dwattr $C$DW$75, DW_AT_name("GPIO1")
    1261                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO1")
    1262                      .dwattr $C$DW$75, DW_AT_bit_offset(0x08)
    1263                      .dwattr $C$DW$75, DW_AT_bit_size(0x04)
    1264                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1265                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1266              
    1267              $C$DW$76        .dwtag  DW_TAG_member
    1268                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1269                      .dwattr $C$DW$76, DW_AT_name("GPIO2")
    1270                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO2")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   26

    1271                      .dwattr $C$DW$76, DW_AT_bit_offset(0x04)
    1272                      .dwattr $C$DW$76, DW_AT_bit_size(0x04)
    1273                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1274                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1275              
    1276              $C$DW$77        .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1278                      .dwattr $C$DW$77, DW_AT_name("GPIO3")
    1279                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO3")
    1280                      .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
    1281                      .dwattr $C$DW$77, DW_AT_bit_size(0x04)
    1282                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1284              
    1285              $C$DW$78        .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$78, DW_AT_name("GPIO4")
    1288                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO4")
    1289                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0c)
    1290                      .dwattr $C$DW$78, DW_AT_bit_size(0x04)
    1291                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1292                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1293              
    1294              $C$DW$79        .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1296                      .dwattr $C$DW$79, DW_AT_name("GPIO5")
    1297                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO5")
    1298                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08)
    1299                      .dwattr $C$DW$79, DW_AT_bit_size(0x04)
    1300                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1301                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1302              
    1303              $C$DW$80        .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1305                      .dwattr $C$DW$80, DW_AT_name("GPIO6")
    1306                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO6")
    1307                      .dwattr $C$DW$80, DW_AT_bit_offset(0x04)
    1308                      .dwattr $C$DW$80, DW_AT_bit_size(0x04)
    1309                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1310                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1311              
    1312              $C$DW$81        .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1314                      .dwattr $C$DW$81, DW_AT_name("GPIO7")
    1315                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO7")
    1316                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00)
    1317                      .dwattr $C$DW$81, DW_AT_bit_size(0x04)
    1318                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1319                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1320              
    1321                      .dwendtag $C$DW$T$23
    1322              
    1323              
    1324              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1325                      .dwattr $C$DW$T$24, DW_AT_name("GPACSEL1_REG")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   27

    1326                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1327              $C$DW$82        .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
    1329                      .dwattr $C$DW$82, DW_AT_name("all")
    1330                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_all")
    1331                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1333              
    1334              $C$DW$83        .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$23)
    1336                      .dwattr $C$DW$83, DW_AT_name("bit")
    1337                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_bit")
    1338                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1340              
    1341                      .dwendtag $C$DW$T$24
    1342              
    1343              
    1344              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1345                      .dwattr $C$DW$T$25, DW_AT_name("GPACSEL2_BITS")
    1346                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1347              $C$DW$84        .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1349                      .dwattr $C$DW$84, DW_AT_name("GPIO8")
    1350                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO8")
    1351                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0c)
    1352                      .dwattr $C$DW$84, DW_AT_bit_size(0x04)
    1353                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1354                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1355              
    1356              $C$DW$85        .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1358                      .dwattr $C$DW$85, DW_AT_name("GPIO9")
    1359                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO9")
    1360                      .dwattr $C$DW$85, DW_AT_bit_offset(0x08)
    1361                      .dwattr $C$DW$85, DW_AT_bit_size(0x04)
    1362                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1363                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1364              
    1365              $C$DW$86        .dwtag  DW_TAG_member
    1366                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1367                      .dwattr $C$DW$86, DW_AT_name("GPIO10")
    1368                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO10")
    1369                      .dwattr $C$DW$86, DW_AT_bit_offset(0x04)
    1370                      .dwattr $C$DW$86, DW_AT_bit_size(0x04)
    1371                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1372                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1373              
    1374              $C$DW$87        .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1376                      .dwattr $C$DW$87, DW_AT_name("GPIO11")
    1377                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO11")
    1378                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
    1379                      .dwattr $C$DW$87, DW_AT_bit_size(0x04)
    1380                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   28

    1381                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1382              
    1383              $C$DW$88        .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1385                      .dwattr $C$DW$88, DW_AT_name("GPIO12")
    1386                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO12")
    1387                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0c)
    1388                      .dwattr $C$DW$88, DW_AT_bit_size(0x04)
    1389                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1390                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1391              
    1392              $C$DW$89        .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$89, DW_AT_name("GPIO13")
    1395                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO13")
    1396                      .dwattr $C$DW$89, DW_AT_bit_offset(0x08)
    1397                      .dwattr $C$DW$89, DW_AT_bit_size(0x04)
    1398                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1399                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1400              
    1401              $C$DW$90        .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1403                      .dwattr $C$DW$90, DW_AT_name("GPIO14")
    1404                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO14")
    1405                      .dwattr $C$DW$90, DW_AT_bit_offset(0x04)
    1406                      .dwattr $C$DW$90, DW_AT_bit_size(0x04)
    1407                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1408                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1409              
    1410              $C$DW$91        .dwtag  DW_TAG_member
    1411                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1412                      .dwattr $C$DW$91, DW_AT_name("GPIO15")
    1413                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO15")
    1414                      .dwattr $C$DW$91, DW_AT_bit_offset(0x00)
    1415                      .dwattr $C$DW$91, DW_AT_bit_size(0x04)
    1416                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1417                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1418              
    1419                      .dwendtag $C$DW$T$25
    1420              
    1421              
    1422              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1423                      .dwattr $C$DW$T$26, DW_AT_name("GPACSEL2_REG")
    1424                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1425              $C$DW$92        .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
    1427                      .dwattr $C$DW$92, DW_AT_name("all")
    1428                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_all")
    1429                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1430                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1431              
    1432              $C$DW$93        .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$25)
    1434                      .dwattr $C$DW$93, DW_AT_name("bit")
    1435                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   29

    1436                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1437                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1438              
    1439                      .dwendtag $C$DW$T$26
    1440              
    1441              
    1442              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1443                      .dwattr $C$DW$T$27, DW_AT_name("GPACSEL3_BITS")
    1444                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1445              $C$DW$94        .dwtag  DW_TAG_member
    1446                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1447                      .dwattr $C$DW$94, DW_AT_name("GPIO16")
    1448                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO16")
    1449                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0c)
    1450                      .dwattr $C$DW$94, DW_AT_bit_size(0x04)
    1451                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1453              
    1454              $C$DW$95        .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1456                      .dwattr $C$DW$95, DW_AT_name("GPIO17")
    1457                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO17")
    1458                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08)
    1459                      .dwattr $C$DW$95, DW_AT_bit_size(0x04)
    1460                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1461                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1462              
    1463              $C$DW$96        .dwtag  DW_TAG_member
    1464                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1465                      .dwattr $C$DW$96, DW_AT_name("GPIO18")
    1466                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO18")
    1467                      .dwattr $C$DW$96, DW_AT_bit_offset(0x04)
    1468                      .dwattr $C$DW$96, DW_AT_bit_size(0x04)
    1469                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1470                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1471              
    1472              $C$DW$97        .dwtag  DW_TAG_member
    1473                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1474                      .dwattr $C$DW$97, DW_AT_name("GPIO19")
    1475                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO19")
    1476                      .dwattr $C$DW$97, DW_AT_bit_offset(0x00)
    1477                      .dwattr $C$DW$97, DW_AT_bit_size(0x04)
    1478                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1479                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1480              
    1481              $C$DW$98        .dwtag  DW_TAG_member
    1482                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1483                      .dwattr $C$DW$98, DW_AT_name("GPIO20")
    1484                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO20")
    1485                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c)
    1486                      .dwattr $C$DW$98, DW_AT_bit_size(0x04)
    1487                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1488                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1489              
    1490              $C$DW$99        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   30

    1491                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1492                      .dwattr $C$DW$99, DW_AT_name("GPIO21")
    1493                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO21")
    1494                      .dwattr $C$DW$99, DW_AT_bit_offset(0x08)
    1495                      .dwattr $C$DW$99, DW_AT_bit_size(0x04)
    1496                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1497                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1498              
    1499              $C$DW$100       .dwtag  DW_TAG_member
    1500                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1501                      .dwattr $C$DW$100, DW_AT_name("GPIO22")
    1502                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO22")
    1503                      .dwattr $C$DW$100, DW_AT_bit_offset(0x04)
    1504                      .dwattr $C$DW$100, DW_AT_bit_size(0x04)
    1505                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1506                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1507              
    1508              $C$DW$101       .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1510                      .dwattr $C$DW$101, DW_AT_name("GPIO23")
    1511                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO23")
    1512                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1513                      .dwattr $C$DW$101, DW_AT_bit_size(0x04)
    1514                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1515                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1516              
    1517                      .dwendtag $C$DW$T$27
    1518              
    1519              
    1520              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1521                      .dwattr $C$DW$T$28, DW_AT_name("GPACSEL3_REG")
    1522                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1523              $C$DW$102       .dwtag  DW_TAG_member
    1524                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$21)
    1525                      .dwattr $C$DW$102, DW_AT_name("all")
    1526                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    1527                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1528                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1529              
    1530              $C$DW$103       .dwtag  DW_TAG_member
    1531                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$27)
    1532                      .dwattr $C$DW$103, DW_AT_name("bit")
    1533                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    1534                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1535                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1536              
    1537                      .dwendtag $C$DW$T$28
    1538              
    1539              
    1540              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1541                      .dwattr $C$DW$T$29, DW_AT_name("GPACSEL4_BITS")
    1542                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1543              $C$DW$104       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1545                      .dwattr $C$DW$104, DW_AT_name("GPIO24")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   31

    1546                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO24")
    1547                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0c)
    1548                      .dwattr $C$DW$104, DW_AT_bit_size(0x04)
    1549                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1550                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1551              
    1552              $C$DW$105       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1554                      .dwattr $C$DW$105, DW_AT_name("GPIO25")
    1555                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO25")
    1556                      .dwattr $C$DW$105, DW_AT_bit_offset(0x08)
    1557                      .dwattr $C$DW$105, DW_AT_bit_size(0x04)
    1558                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1559                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1560              
    1561              $C$DW$106       .dwtag  DW_TAG_member
    1562                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1563                      .dwattr $C$DW$106, DW_AT_name("GPIO26")
    1564                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO26")
    1565                      .dwattr $C$DW$106, DW_AT_bit_offset(0x04)
    1566                      .dwattr $C$DW$106, DW_AT_bit_size(0x04)
    1567                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1568                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1569              
    1570              $C$DW$107       .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1572                      .dwattr $C$DW$107, DW_AT_name("GPIO27")
    1573                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO27")
    1574                      .dwattr $C$DW$107, DW_AT_bit_offset(0x00)
    1575                      .dwattr $C$DW$107, DW_AT_bit_size(0x04)
    1576                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1578              
    1579              $C$DW$108       .dwtag  DW_TAG_member
    1580                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1581                      .dwattr $C$DW$108, DW_AT_name("GPIO28")
    1582                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO28")
    1583                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0c)
    1584                      .dwattr $C$DW$108, DW_AT_bit_size(0x04)
    1585                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1586                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1587              
    1588              $C$DW$109       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1590                      .dwattr $C$DW$109, DW_AT_name("GPIO29")
    1591                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO29")
    1592                      .dwattr $C$DW$109, DW_AT_bit_offset(0x08)
    1593                      .dwattr $C$DW$109, DW_AT_bit_size(0x04)
    1594                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1595                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1596              
    1597              $C$DW$110       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1599                      .dwattr $C$DW$110, DW_AT_name("GPIO30")
    1600                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO30")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   32

    1601                      .dwattr $C$DW$110, DW_AT_bit_offset(0x04)
    1602                      .dwattr $C$DW$110, DW_AT_bit_size(0x04)
    1603                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1604                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1605              
    1606              $C$DW$111       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1608                      .dwattr $C$DW$111, DW_AT_name("GPIO31")
    1609                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO31")
    1610                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1611                      .dwattr $C$DW$111, DW_AT_bit_size(0x04)
    1612                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1613                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1614              
    1615                      .dwendtag $C$DW$T$29
    1616              
    1617              
    1618              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1619                      .dwattr $C$DW$T$30, DW_AT_name("GPACSEL4_REG")
    1620                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1621              $C$DW$112       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    1623                      .dwattr $C$DW$112, DW_AT_name("all")
    1624                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_all")
    1625                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1626                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1627              
    1628              $C$DW$113       .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$29)
    1630                      .dwattr $C$DW$113, DW_AT_name("bit")
    1631                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_bit")
    1632                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1633                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1634              
    1635                      .dwendtag $C$DW$T$30
    1636              
    1637              
    1638              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1639                      .dwattr $C$DW$T$31, DW_AT_name("GPACTRL_BITS")
    1640                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1641              $C$DW$114       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1643                      .dwattr $C$DW$114, DW_AT_name("QUALPRD0")
    1644                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_QUALPRD0")
    1645                      .dwattr $C$DW$114, DW_AT_bit_offset(0x08)
    1646                      .dwattr $C$DW$114, DW_AT_bit_size(0x08)
    1647                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1649              
    1650              $C$DW$115       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1652                      .dwattr $C$DW$115, DW_AT_name("QUALPRD1")
    1653                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_QUALPRD1")
    1654                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
    1655                      .dwattr $C$DW$115, DW_AT_bit_size(0x08)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   33

    1656                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1657                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1658              
    1659              $C$DW$116       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1661                      .dwattr $C$DW$116, DW_AT_name("QUALPRD2")
    1662                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_QUALPRD2")
    1663                      .dwattr $C$DW$116, DW_AT_bit_offset(0x08)
    1664                      .dwattr $C$DW$116, DW_AT_bit_size(0x08)
    1665                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1666                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1667              
    1668              $C$DW$117       .dwtag  DW_TAG_member
    1669                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1670                      .dwattr $C$DW$117, DW_AT_name("QUALPRD3")
    1671                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_QUALPRD3")
    1672                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    1673                      .dwattr $C$DW$117, DW_AT_bit_size(0x08)
    1674                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1675                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1676              
    1677                      .dwendtag $C$DW$T$31
    1678              
    1679              
    1680              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1681                      .dwattr $C$DW$T$32, DW_AT_name("GPACTRL_REG")
    1682                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1683              $C$DW$118       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
    1685                      .dwattr $C$DW$118, DW_AT_name("all")
    1686                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_all")
    1687                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1689              
    1690              $C$DW$119       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$31)
    1692                      .dwattr $C$DW$119, DW_AT_name("bit")
    1693                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_bit")
    1694                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1695                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1696              
    1697                      .dwendtag $C$DW$T$32
    1698              
    1699              
    1700              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1701                      .dwattr $C$DW$T$33, DW_AT_name("GPADIR_BITS")
    1702                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1703              $C$DW$120       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1705                      .dwattr $C$DW$120, DW_AT_name("GPIO0")
    1706                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO0")
    1707                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0f)
    1708                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1709                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1710                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   34

    1711              
    1712              $C$DW$121       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1714                      .dwattr $C$DW$121, DW_AT_name("GPIO1")
    1715                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO1")
    1716                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0e)
    1717                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1718                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1719                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1720              
    1721              $C$DW$122       .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1723                      .dwattr $C$DW$122, DW_AT_name("GPIO2")
    1724                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO2")
    1725                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0d)
    1726                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1727                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1729              
    1730              $C$DW$123       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1732                      .dwattr $C$DW$123, DW_AT_name("GPIO3")
    1733                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO3")
    1734                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0c)
    1735                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1736                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1738              
    1739              $C$DW$124       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1741                      .dwattr $C$DW$124, DW_AT_name("GPIO4")
    1742                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO4")
    1743                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0b)
    1744                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1745                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1746                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1747              
    1748              $C$DW$125       .dwtag  DW_TAG_member
    1749                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1750                      .dwattr $C$DW$125, DW_AT_name("GPIO5")
    1751                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO5")
    1752                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0a)
    1753                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1754                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1755                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1756              
    1757              $C$DW$126       .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1759                      .dwattr $C$DW$126, DW_AT_name("GPIO6")
    1760                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO6")
    1761                      .dwattr $C$DW$126, DW_AT_bit_offset(0x09)
    1762                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1763                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1764                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1765              
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   35

    1766              $C$DW$127       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1768                      .dwattr $C$DW$127, DW_AT_name("GPIO7")
    1769                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO7")
    1770                      .dwattr $C$DW$127, DW_AT_bit_offset(0x08)
    1771                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1772                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1773                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1774              
    1775              $C$DW$128       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1777                      .dwattr $C$DW$128, DW_AT_name("GPIO8")
    1778                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO8")
    1779                      .dwattr $C$DW$128, DW_AT_bit_offset(0x07)
    1780                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1781                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1782                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1783              
    1784              $C$DW$129       .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1786                      .dwattr $C$DW$129, DW_AT_name("GPIO9")
    1787                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO9")
    1788                      .dwattr $C$DW$129, DW_AT_bit_offset(0x06)
    1789                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1790                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1791                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1792              
    1793              $C$DW$130       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1795                      .dwattr $C$DW$130, DW_AT_name("GPIO10")
    1796                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO10")
    1797                      .dwattr $C$DW$130, DW_AT_bit_offset(0x05)
    1798                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1799                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1801              
    1802              $C$DW$131       .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1804                      .dwattr $C$DW$131, DW_AT_name("GPIO11")
    1805                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO11")
    1806                      .dwattr $C$DW$131, DW_AT_bit_offset(0x04)
    1807                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1808                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1809                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1810              
    1811              $C$DW$132       .dwtag  DW_TAG_member
    1812                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1813                      .dwattr $C$DW$132, DW_AT_name("GPIO12")
    1814                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO12")
    1815                      .dwattr $C$DW$132, DW_AT_bit_offset(0x03)
    1816                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1817                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1818                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1819              
    1820              $C$DW$133       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   36

    1821                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1822                      .dwattr $C$DW$133, DW_AT_name("GPIO13")
    1823                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO13")
    1824                      .dwattr $C$DW$133, DW_AT_bit_offset(0x02)
    1825                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1826                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1827                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1828              
    1829              $C$DW$134       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1831                      .dwattr $C$DW$134, DW_AT_name("GPIO14")
    1832                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO14")
    1833                      .dwattr $C$DW$134, DW_AT_bit_offset(0x01)
    1834                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1835                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1836                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1837              
    1838              $C$DW$135       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1840                      .dwattr $C$DW$135, DW_AT_name("GPIO15")
    1841                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO15")
    1842                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    1843                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1844                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1845                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1846              
    1847              $C$DW$136       .dwtag  DW_TAG_member
    1848                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1849                      .dwattr $C$DW$136, DW_AT_name("GPIO16")
    1850                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO16")
    1851                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0f)
    1852                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1853                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1854                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1855              
    1856              $C$DW$137       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1858                      .dwattr $C$DW$137, DW_AT_name("GPIO17")
    1859                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO17")
    1860                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0e)
    1861                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1862                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1863                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1864              
    1865              $C$DW$138       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1867                      .dwattr $C$DW$138, DW_AT_name("GPIO18")
    1868                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO18")
    1869                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0d)
    1870                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1871                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1872                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1873              
    1874              $C$DW$139       .dwtag  DW_TAG_member
    1875                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   37

    1876                      .dwattr $C$DW$139, DW_AT_name("GPIO19")
    1877                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO19")
    1878                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0c)
    1879                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1880                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1881                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1882              
    1883              $C$DW$140       .dwtag  DW_TAG_member
    1884                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1885                      .dwattr $C$DW$140, DW_AT_name("GPIO20")
    1886                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO20")
    1887                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0b)
    1888                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1889                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1890                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1891              
    1892              $C$DW$141       .dwtag  DW_TAG_member
    1893                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1894                      .dwattr $C$DW$141, DW_AT_name("GPIO21")
    1895                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO21")
    1896                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0a)
    1897                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1898                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1899                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1900              
    1901              $C$DW$142       .dwtag  DW_TAG_member
    1902                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1903                      .dwattr $C$DW$142, DW_AT_name("GPIO22")
    1904                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO22")
    1905                      .dwattr $C$DW$142, DW_AT_bit_offset(0x09)
    1906                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1907                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1908                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1909              
    1910              $C$DW$143       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1912                      .dwattr $C$DW$143, DW_AT_name("GPIO23")
    1913                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO23")
    1914                      .dwattr $C$DW$143, DW_AT_bit_offset(0x08)
    1915                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1916                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1917                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1918              
    1919              $C$DW$144       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1921                      .dwattr $C$DW$144, DW_AT_name("GPIO24")
    1922                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO24")
    1923                      .dwattr $C$DW$144, DW_AT_bit_offset(0x07)
    1924                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1925                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1926                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1927              
    1928              $C$DW$145       .dwtag  DW_TAG_member
    1929                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1930                      .dwattr $C$DW$145, DW_AT_name("GPIO25")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   38

    1931                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO25")
    1932                      .dwattr $C$DW$145, DW_AT_bit_offset(0x06)
    1933                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1934                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1935                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1936              
    1937              $C$DW$146       .dwtag  DW_TAG_member
    1938                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1939                      .dwattr $C$DW$146, DW_AT_name("GPIO26")
    1940                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO26")
    1941                      .dwattr $C$DW$146, DW_AT_bit_offset(0x05)
    1942                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1943                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1944                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1945              
    1946              $C$DW$147       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1948                      .dwattr $C$DW$147, DW_AT_name("GPIO27")
    1949                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO27")
    1950                      .dwattr $C$DW$147, DW_AT_bit_offset(0x04)
    1951                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1952                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1953                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1954              
    1955              $C$DW$148       .dwtag  DW_TAG_member
    1956                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1957                      .dwattr $C$DW$148, DW_AT_name("GPIO28")
    1958                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO28")
    1959                      .dwattr $C$DW$148, DW_AT_bit_offset(0x03)
    1960                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1961                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1962                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1963              
    1964              $C$DW$149       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1966                      .dwattr $C$DW$149, DW_AT_name("GPIO29")
    1967                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO29")
    1968                      .dwattr $C$DW$149, DW_AT_bit_offset(0x02)
    1969                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1970                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1971                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1972              
    1973              $C$DW$150       .dwtag  DW_TAG_member
    1974                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1975                      .dwattr $C$DW$150, DW_AT_name("GPIO30")
    1976                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO30")
    1977                      .dwattr $C$DW$150, DW_AT_bit_offset(0x01)
    1978                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1979                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1980                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1981              
    1982              $C$DW$151       .dwtag  DW_TAG_member
    1983                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1984                      .dwattr $C$DW$151, DW_AT_name("GPIO31")
    1985                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO31")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   39

    1986                      .dwattr $C$DW$151, DW_AT_bit_offset(0x00)
    1987                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1988                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1989                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1990              
    1991                      .dwendtag $C$DW$T$33
    1992              
    1993              
    1994              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1995                      .dwattr $C$DW$T$34, DW_AT_name("GPADIR_REG")
    1996                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1997              $C$DW$152       .dwtag  DW_TAG_member
    1998                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$21)
    1999                      .dwattr $C$DW$152, DW_AT_name("all")
    2000                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_all")
    2001                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2002                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2003              
    2004              $C$DW$153       .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$33)
    2006                      .dwattr $C$DW$153, DW_AT_name("bit")
    2007                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_bit")
    2008                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2009                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2010              
    2011                      .dwendtag $C$DW$T$34
    2012              
    2013              
    2014              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2015                      .dwattr $C$DW$T$35, DW_AT_name("GPAGMUX1_BITS")
    2016                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2017              $C$DW$154       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2019                      .dwattr $C$DW$154, DW_AT_name("GPIO0")
    2020                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO0")
    2021                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0e)
    2022                      .dwattr $C$DW$154, DW_AT_bit_size(0x02)
    2023                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2024                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2025              
    2026              $C$DW$155       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2028                      .dwattr $C$DW$155, DW_AT_name("GPIO1")
    2029                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO1")
    2030                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0c)
    2031                      .dwattr $C$DW$155, DW_AT_bit_size(0x02)
    2032                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2033                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2034              
    2035              $C$DW$156       .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2037                      .dwattr $C$DW$156, DW_AT_name("GPIO2")
    2038                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO2")
    2039                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0a)
    2040                      .dwattr $C$DW$156, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   40

    2041                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2042                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2043              
    2044              $C$DW$157       .dwtag  DW_TAG_member
    2045                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2046                      .dwattr $C$DW$157, DW_AT_name("GPIO3")
    2047                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO3")
    2048                      .dwattr $C$DW$157, DW_AT_bit_offset(0x08)
    2049                      .dwattr $C$DW$157, DW_AT_bit_size(0x02)
    2050                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2051                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2052              
    2053              $C$DW$158       .dwtag  DW_TAG_member
    2054                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2055                      .dwattr $C$DW$158, DW_AT_name("GPIO4")
    2056                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO4")
    2057                      .dwattr $C$DW$158, DW_AT_bit_offset(0x06)
    2058                      .dwattr $C$DW$158, DW_AT_bit_size(0x02)
    2059                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2060                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2061              
    2062              $C$DW$159       .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2064                      .dwattr $C$DW$159, DW_AT_name("GPIO5")
    2065                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO5")
    2066                      .dwattr $C$DW$159, DW_AT_bit_offset(0x04)
    2067                      .dwattr $C$DW$159, DW_AT_bit_size(0x02)
    2068                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2069                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2070              
    2071              $C$DW$160       .dwtag  DW_TAG_member
    2072                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2073                      .dwattr $C$DW$160, DW_AT_name("GPIO6")
    2074                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO6")
    2075                      .dwattr $C$DW$160, DW_AT_bit_offset(0x02)
    2076                      .dwattr $C$DW$160, DW_AT_bit_size(0x02)
    2077                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2078                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2079              
    2080              $C$DW$161       .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2082                      .dwattr $C$DW$161, DW_AT_name("GPIO7")
    2083                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO7")
    2084                      .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    2085                      .dwattr $C$DW$161, DW_AT_bit_size(0x02)
    2086                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2087                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2088              
    2089              $C$DW$162       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2091                      .dwattr $C$DW$162, DW_AT_name("GPIO8")
    2092                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO8")
    2093                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0e)
    2094                      .dwattr $C$DW$162, DW_AT_bit_size(0x02)
    2095                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   41

    2096                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2097              
    2098              $C$DW$163       .dwtag  DW_TAG_member
    2099                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2100                      .dwattr $C$DW$163, DW_AT_name("GPIO9")
    2101                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO9")
    2102                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0c)
    2103                      .dwattr $C$DW$163, DW_AT_bit_size(0x02)
    2104                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2105                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2106              
    2107              $C$DW$164       .dwtag  DW_TAG_member
    2108                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2109                      .dwattr $C$DW$164, DW_AT_name("GPIO10")
    2110                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO10")
    2111                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0a)
    2112                      .dwattr $C$DW$164, DW_AT_bit_size(0x02)
    2113                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2114                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2115              
    2116              $C$DW$165       .dwtag  DW_TAG_member
    2117                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2118                      .dwattr $C$DW$165, DW_AT_name("GPIO11")
    2119                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO11")
    2120                      .dwattr $C$DW$165, DW_AT_bit_offset(0x08)
    2121                      .dwattr $C$DW$165, DW_AT_bit_size(0x02)
    2122                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2123                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2124              
    2125              $C$DW$166       .dwtag  DW_TAG_member
    2126                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2127                      .dwattr $C$DW$166, DW_AT_name("GPIO12")
    2128                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO12")
    2129                      .dwattr $C$DW$166, DW_AT_bit_offset(0x06)
    2130                      .dwattr $C$DW$166, DW_AT_bit_size(0x02)
    2131                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2132                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2133              
    2134              $C$DW$167       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2136                      .dwattr $C$DW$167, DW_AT_name("GPIO13")
    2137                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO13")
    2138                      .dwattr $C$DW$167, DW_AT_bit_offset(0x04)
    2139                      .dwattr $C$DW$167, DW_AT_bit_size(0x02)
    2140                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2141                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2142              
    2143              $C$DW$168       .dwtag  DW_TAG_member
    2144                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2145                      .dwattr $C$DW$168, DW_AT_name("GPIO14")
    2146                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO14")
    2147                      .dwattr $C$DW$168, DW_AT_bit_offset(0x02)
    2148                      .dwattr $C$DW$168, DW_AT_bit_size(0x02)
    2149                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2150                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   42

    2151              
    2152              $C$DW$169       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2154                      .dwattr $C$DW$169, DW_AT_name("GPIO15")
    2155                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO15")
    2156                      .dwattr $C$DW$169, DW_AT_bit_offset(0x00)
    2157                      .dwattr $C$DW$169, DW_AT_bit_size(0x02)
    2158                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2159                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2160              
    2161                      .dwendtag $C$DW$T$35
    2162              
    2163              
    2164              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2165                      .dwattr $C$DW$T$36, DW_AT_name("GPAGMUX1_REG")
    2166                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2167              $C$DW$170       .dwtag  DW_TAG_member
    2168                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
    2169                      .dwattr $C$DW$170, DW_AT_name("all")
    2170                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_all")
    2171                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2172                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2173              
    2174              $C$DW$171       .dwtag  DW_TAG_member
    2175                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$35)
    2176                      .dwattr $C$DW$171, DW_AT_name("bit")
    2177                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_bit")
    2178                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2179                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2180              
    2181                      .dwendtag $C$DW$T$36
    2182              
    2183              
    2184              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2185                      .dwattr $C$DW$T$37, DW_AT_name("GPAGMUX2_BITS")
    2186                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2187              $C$DW$172       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2189                      .dwattr $C$DW$172, DW_AT_name("GPIO16")
    2190                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIO16")
    2191                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0e)
    2192                      .dwattr $C$DW$172, DW_AT_bit_size(0x02)
    2193                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2194                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2195              
    2196              $C$DW$173       .dwtag  DW_TAG_member
    2197                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2198                      .dwattr $C$DW$173, DW_AT_name("GPIO17")
    2199                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GPIO17")
    2200                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0c)
    2201                      .dwattr $C$DW$173, DW_AT_bit_size(0x02)
    2202                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2203                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2204              
    2205              $C$DW$174       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:18 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   43

    2206                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2207                      .dwattr $C$DW$174, DW_AT_name("GPIO18")
    2208                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GPIO18")
    2209                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0a)
    2210                      .dwattr $C$DW$174, DW_AT_bit_size(0x02)
    2211                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2212                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2213              
    2214              $C$DW$175       .dwtag  DW_TAG_member
    2215                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2216                      .dwattr $C$DW$175, DW_AT_name("GPIO19")
    2217                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIO19")
    2218                      .dwattr $C$DW$175, DW_AT_bit_offset(0x08)
    2219                      .dwattr $C$DW$175, DW_AT_bit_size(0x02)
    2220                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2221                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2222              
