TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Oct  7 22:14:21 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\hakan\workspace_v10\IDDK_PM_Servo_F2837x-v2\F2837x_RAM")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_EnableUnbondedIOPullups")

    1949 000002cb 1E10!         MOVL      @$BLOCKED(_DcsmZ1Regs)+16,ACC ; [CPU_ALU] |519| 
    1950                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    1951 000002cc 0200          MOVB      ACC,#0                ; [CPU_ALU] |520| 
    1952 000002cd 1901          SUBB      ACC,#1                ; [CPU_ALU] |520| 
    1953 000002ce 1E12!         MOVL      @$BLOCKED(_DcsmZ1Regs)+18,ACC ; [CPU_ALU] |520| 
    1954                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    1955 000002cf 0200          MOVB      ACC,#0                ; [CPU_ALU] |521| 
    1956 000002d0 1901          SUBB      ACC,#1                ; [CPU_ALU] |521| 
    1957 000002d1 1E14!         MOVL      @$BLOCKED(_DcsmZ1Regs)+20,ACC ; [CPU_ALU] |521| 
    1958                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   40

    1959 000002d2 0200          MOVB      ACC,#0                ; [CPU_ALU] |522| 
    1960 000002d3 1901          SUBB      ACC,#1                ; [CPU_ALU] |522| 
    1961 000002d4 1E16!         MOVL      @$BLOCKED(_DcsmZ1Regs)+22,ACC ; [CPU_ALU] |522| 
    1962                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    1963 000002d5 0200          MOVB      ACC,#0                ; [CPU_ALU] |524| 
    1964 000002d6 761F!         MOVW      DP,#_DcsmZ2Regs+16    ; [CPU_ARAU] 
         000002d7 0000 
    1965 000002d8 1901          SUBB      ACC,#1                ; [CPU_ALU] |524| 
    1966 000002d9 1E10!         MOVL      @$BLOCKED(_DcsmZ2Regs)+16,ACC ; [CPU_ALU] |524| 
    1967                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    1968 000002da 0200          MOVB      ACC,#0                ; [CPU_ALU] |525| 
    1969 000002db 1901          SUBB      ACC,#1                ; [CPU_ALU] |525| 
    1970 000002dc 1E12!         MOVL      @$BLOCKED(_DcsmZ2Regs)+18,ACC ; [CPU_ALU] |525| 
    1971                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    1972 000002dd 0200          MOVB      ACC,#0                ; [CPU_ALU] |526| 
    1973 000002de 1901          SUBB      ACC,#1                ; [CPU_ALU] |526| 
    1974 000002df 1E14!         MOVL      @$BLOCKED(_DcsmZ2Regs)+20,ACC ; [CPU_ALU] |526| 
    1975                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    1976 000002e0 0200          MOVB      ACC,#0                ; [CPU_ALU] |527| 
    1977 000002e1 1901          SUBB      ACC,#1                ; [CPU_ALU] |527| 
    1978 000002e2 1E16!         MOVL      @$BLOCKED(_DcsmZ2Regs)+22,ACC ; [CPU_ALU] |527| 
    1979 000002e3 761A   EDIS
    1980 000002e4 FF69          SPM       #0                    ; [CPU_ALU] 
    1981                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    1982 000002e5 9A00          MOVB      AL,#0                 ; [CPU_ALU] |547| 
    1983              $C$DW$79        .dwtag  DW_TAG_TI_branch
    1984                      .dwattr $C$DW$79, DW_AT_low_pc(0x00)
    1985                      .dwattr $C$DW$79, DW_AT_TI_return
    1986              
    1987 000002e6 0006          LRETR     ; [CPU_ALU] 
    1988                      ; return occurs ; [] 
    1989                      .dwattr $C$DW$78, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/so
    1990                      .dwattr $C$DW$78, DW_AT_TI_end_line(0x225)
    1991                      .dwattr $C$DW$78, DW_AT_TI_end_column(0x01)
    1992                      .dwendentry
    1993                      .dwendtag $C$DW$78
    1994              
    1995              ;**************************************************************
    1996              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1997              ;**************************************************************
    1998                      .global _GPIO_EnableUnbondedIOPullups
    1999                      .global _F28x_usDelay
    2000                      .global _DcsmZ1Regs
    2001                      .global _DcsmZ2Regs
    2002                      .global _Flash0EccRegs
    2003                      .global _WdRegs
    2004                      .global _ClkCfgRegs
    2005                      .global _AnalogSubsysRegs
    2006                      .global _CpuSysRegs
    2007                      .global _DevCfgRegs
    2008                      .global _Flash0CtrlRegs
    2009              
    2010              ;***************************************************************
    2011              ;* TYPE INFORMATION                                            *
    2012              ;***************************************************************
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   41

    2013              
    2014              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2015                      .dwattr $C$DW$T$25, DW_AT_name("ANALOG_SUBSYS_REGS")
    2016                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
    2017              $C$DW$80        .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    2019                      .dwattr $C$DW$80, DW_AT_name("rsvd1")
    2020                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_rsvd1")
    2021                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    2023              
    2024              $C$DW$81        .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$192)
    2026                      .dwattr $C$DW$81, DW_AT_name("INTOSC1TRIM")
    2027                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    2028                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2029                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    2030              
    2031              $C$DW$82        .dwtag  DW_TAG_member
    2032                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$194)
    2033                      .dwattr $C$DW$82, DW_AT_name("INTOSC2TRIM")
    2034                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    2035                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2036                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    2037              
    2038              $C$DW$83        .dwtag  DW_TAG_member
    2039                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    2040                      .dwattr $C$DW$83, DW_AT_name("rsvd2")
    2041                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd2")
    2042                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2043                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    2044              
    2045              $C$DW$84        .dwtag  DW_TAG_member
    2046                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$292)
    2047                      .dwattr $C$DW$84, DW_AT_name("TSNSCTL")
    2048                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_TSNSCTL")
    2049                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2050                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    2051              
    2052              $C$DW$85        .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$22)
    2054                      .dwattr $C$DW$85, DW_AT_name("rsvd3")
    2055                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd3")
    2056                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2057                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    2058              
    2059              $C$DW$86        .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$198)
    2061                      .dwattr $C$DW$86, DW_AT_name("LOCK")
    2062                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_LOCK")
    2063                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2064                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    2065              
    2066              $C$DW$87        .dwtag  DW_TAG_member
    2067                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   42

    2068                      .dwattr $C$DW$87, DW_AT_name("rsvd4")
    2069                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd4")
    2070                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2071                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    2072              
    2073              $C$DW$88        .dwtag  DW_TAG_member
    2074                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$28)
    2075                      .dwattr $C$DW$88, DW_AT_name("ANAREFTRIMA")
    2076                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ANAREFTRIMA")
    2077                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2078                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2079              
    2080              $C$DW$89        .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$30)
    2082                      .dwattr $C$DW$89, DW_AT_name("ANAREFTRIMB")
    2083                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ANAREFTRIMB")
    2084                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2085                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2086              
    2087              $C$DW$90        .dwtag  DW_TAG_member
    2088                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$32)
    2089                      .dwattr $C$DW$90, DW_AT_name("ANAREFTRIMC")
    2090                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_ANAREFTRIMC")
    2091                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2092                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2093              
    2094              $C$DW$91        .dwtag  DW_TAG_member
    2095                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$34)
    2096                      .dwattr $C$DW$91, DW_AT_name("ANAREFTRIMD")
    2097                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ANAREFTRIMD")
    2098                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2099                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2100              
    2101              $C$DW$92        .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$24)
    2103                      .dwattr $C$DW$92, DW_AT_name("rsvd5")
    2104                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd5")
    2105                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2106                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2107              
    2108                      .dwendtag $C$DW$T$25
    2109              
    2110              $C$DW$93        .dwtag  DW_TAG_TI_far_type
    2111                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$25)
    2112              
    2113              $C$DW$T$340     .dwtag  DW_TAG_volatile_type
    2114                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$93)
    2115              
    2116              
    2117              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2118                      .dwattr $C$DW$T$26, DW_AT_name("ANAREFTRIMA_BITS")
    2119                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2120              $C$DW$94        .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    2122                      .dwattr $C$DW$94, DW_AT_name("BGVALTRIM")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   43

    2123                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_BGVALTRIM")
    2124                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0a)
    2125                      .dwattr $C$DW$94, DW_AT_bit_size(0x06)
    2126                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2127                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2128              
    2129              $C$DW$95        .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    2131                      .dwattr $C$DW$95, DW_AT_name("BGSLOPETRIM")
    2132                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2133                      .dwattr $C$DW$95, DW_AT_bit_offset(0x05)
    2134                      .dwattr $C$DW$95, DW_AT_bit_size(0x05)
    2135                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2136                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2137              
    2138              $C$DW$96        .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    2140                      .dwattr $C$DW$96, DW_AT_name("IREFTRIM")
    2141                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_IREFTRIM")
    2142                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
    2143                      .dwattr $C$DW$96, DW_AT_bit_size(0x05)
    2144                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2145                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2146              
    2147              $C$DW$97        .dwtag  DW_TAG_member
    2148                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    2149                      .dwattr $C$DW$97, DW_AT_name("rsvd1")
    2150                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd1")
    2151                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08)
    2152                      .dwattr $C$DW$97, DW_AT_bit_size(0x08)
    2153                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2154                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2155              
    2156              $C$DW$98        .dwtag  DW_TAG_member
    2157                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    2158                      .dwattr $C$DW$98, DW_AT_name("rsvd2")
    2159                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd2")
    2160                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00)
    2161                      .dwattr $C$DW$98, DW_AT_bit_size(0x08)
    2162                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2163                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2164              
    2165                      .dwendtag $C$DW$T$26
    2166              
    2167              
    2168              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2169                      .dwattr $C$DW$T$28, DW_AT_name("ANAREFTRIMA_REG")
    2170                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2171              $C$DW$99        .dwtag  DW_TAG_member
    2172                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$27)
    2173                      .dwattr $C$DW$99, DW_AT_name("all")
    2174                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_all")
    2175                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2176                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2177              
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   44

    2178              $C$DW$100       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$26)
    2180                      .dwattr $C$DW$100, DW_AT_name("bit")
    2181                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_bit")
    2182                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2183                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2184              
    2185                      .dwendtag $C$DW$T$28
    2186              
    2187              
    2188              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2189                      .dwattr $C$DW$T$29, DW_AT_name("ANAREFTRIMB_BITS")
    2190                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2191              $C$DW$101       .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2193                      .dwattr $C$DW$101, DW_AT_name("BGVALTRIM")
    2194                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_BGVALTRIM")
    2195                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0a)
    2196                      .dwattr $C$DW$101, DW_AT_bit_size(0x06)
    2197                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2199              
    2200              $C$DW$102       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    2202                      .dwattr $C$DW$102, DW_AT_name("BGSLOPETRIM")
    2203                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2204                      .dwattr $C$DW$102, DW_AT_bit_offset(0x05)
    2205                      .dwattr $C$DW$102, DW_AT_bit_size(0x05)
    2206                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2208              
    2209              $C$DW$103       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    2211                      .dwattr $C$DW$103, DW_AT_name("IREFTRIM")
    2212                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_IREFTRIM")
    2213                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    2214                      .dwattr $C$DW$103, DW_AT_bit_size(0x05)
    2215                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2216                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2217              
    2218              $C$DW$104       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2220                      .dwattr $C$DW$104, DW_AT_name("rsvd1")
    2221                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd1")
    2222                      .dwattr $C$DW$104, DW_AT_bit_offset(0x08)
    2223                      .dwattr $C$DW$104, DW_AT_bit_size(0x08)
    2224                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2225                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2226              
    2227              $C$DW$105       .dwtag  DW_TAG_member
    2228                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2229                      .dwattr $C$DW$105, DW_AT_name("rsvd2")
    2230                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd2")
    2231                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    2232                      .dwattr $C$DW$105, DW_AT_bit_size(0x08)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   45

    2233                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2234                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2235              
    2236                      .dwendtag $C$DW$T$29
    2237              
    2238              
    2239              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2240                      .dwattr $C$DW$T$30, DW_AT_name("ANAREFTRIMB_REG")
    2241                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2242              $C$DW$106       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$27)
    2244                      .dwattr $C$DW$106, DW_AT_name("all")
    2245                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    2246                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2247                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2248              
    2249              $C$DW$107       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$29)
    2251                      .dwattr $C$DW$107, DW_AT_name("bit")
    2252                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    2253                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2254                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2255              
    2256                      .dwendtag $C$DW$T$30
    2257              
    2258              
    2259              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2260                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFTRIMC_BITS")
    2261                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2262              $C$DW$108       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2264                      .dwattr $C$DW$108, DW_AT_name("BGVALTRIM")
    2265                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_BGVALTRIM")
    2266                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0a)
    2267                      .dwattr $C$DW$108, DW_AT_bit_size(0x06)
    2268                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2269                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2270              
    2271              $C$DW$109       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2273                      .dwattr $C$DW$109, DW_AT_name("BGSLOPETRIM")
    2274                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2275                      .dwattr $C$DW$109, DW_AT_bit_offset(0x05)
    2276                      .dwattr $C$DW$109, DW_AT_bit_size(0x05)
    2277                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2279              
    2280              $C$DW$110       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2282                      .dwattr $C$DW$110, DW_AT_name("IREFTRIM")
    2283                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_IREFTRIM")
    2284                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    2285                      .dwattr $C$DW$110, DW_AT_bit_size(0x05)
    2286                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   46

    2288              
    2289              $C$DW$111       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2291                      .dwattr $C$DW$111, DW_AT_name("rsvd1")
    2292                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd1")
    2293                      .dwattr $C$DW$111, DW_AT_bit_offset(0x08)
    2294                      .dwattr $C$DW$111, DW_AT_bit_size(0x08)
    2295                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2296                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2297              
    2298              $C$DW$112       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2300                      .dwattr $C$DW$112, DW_AT_name("rsvd2")
    2301                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd2")
    2302                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    2303                      .dwattr $C$DW$112, DW_AT_bit_size(0x08)
    2304                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2305                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2306              
    2307                      .dwendtag $C$DW$T$31
    2308              
    2309              
    2310              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2311                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFTRIMC_REG")
    2312                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2313              $C$DW$113       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$27)
    2315                      .dwattr $C$DW$113, DW_AT_name("all")
    2316                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
    2317                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2318                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2319              
    2320              $C$DW$114       .dwtag  DW_TAG_member
    2321                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$31)
    2322                      .dwattr $C$DW$114, DW_AT_name("bit")
    2323                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
    2324                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2325                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2326              
    2327                      .dwendtag $C$DW$T$32
    2328              
    2329              
    2330              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2331                      .dwattr $C$DW$T$33, DW_AT_name("ANAREFTRIMD_BITS")
    2332                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2333              $C$DW$115       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2335                      .dwattr $C$DW$115, DW_AT_name("BGVALTRIM")
    2336                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_BGVALTRIM")
    2337                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0a)
    2338                      .dwattr $C$DW$115, DW_AT_bit_size(0x06)
    2339                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2340                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2341              
    2342              $C$DW$116       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   47

    2343                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2344                      .dwattr $C$DW$116, DW_AT_name("BGSLOPETRIM")
    2345                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2346                      .dwattr $C$DW$116, DW_AT_bit_offset(0x05)
    2347                      .dwattr $C$DW$116, DW_AT_bit_size(0x05)
    2348                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2349                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2350              
    2351              $C$DW$117       .dwtag  DW_TAG_member
    2352                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2353                      .dwattr $C$DW$117, DW_AT_name("IREFTRIM")
    2354                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_IREFTRIM")
    2355                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    2356                      .dwattr $C$DW$117, DW_AT_bit_size(0x05)
    2357                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2358                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2359              
    2360              $C$DW$118       .dwtag  DW_TAG_member
    2361                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2362                      .dwattr $C$DW$118, DW_AT_name("rsvd1")
    2363                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd1")
    2364                      .dwattr $C$DW$118, DW_AT_bit_offset(0x08)
    2365                      .dwattr $C$DW$118, DW_AT_bit_size(0x08)
    2366                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2367                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2368              
    2369              $C$DW$119       .dwtag  DW_TAG_member
    2370                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2371                      .dwattr $C$DW$119, DW_AT_name("rsvd2")
    2372                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd2")
    2373                      .dwattr $C$DW$119, DW_AT_bit_offset(0x00)
    2374                      .dwattr $C$DW$119, DW_AT_bit_size(0x08)
    2375                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2376                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2377              
    2378                      .dwendtag $C$DW$T$33
    2379              
    2380              
    2381              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2382                      .dwattr $C$DW$T$34, DW_AT_name("ANAREFTRIMD_REG")
    2383                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2384              $C$DW$120       .dwtag  DW_TAG_member
    2385                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$27)
    2386                      .dwattr $C$DW$120, DW_AT_name("all")
    2387                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_all")
    2388                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2389                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2390              
    2391              $C$DW$121       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$33)
    2393                      .dwattr $C$DW$121, DW_AT_name("bit")
    2394                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_bit")
    2395                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2396                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2397              
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   48

    2398                      .dwendtag $C$DW$T$34
    2399              
    2400              
    2401              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2402                      .dwattr $C$DW$T$35, DW_AT_name("AUXCLKDIVSEL_BITS")
    2403                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2404              $C$DW$122       .dwtag  DW_TAG_member
    2405                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2406                      .dwattr $C$DW$122, DW_AT_name("AUXPLLDIV")
    2407                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_AUXPLLDIV")
    2408                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e)
    2409                      .dwattr $C$DW$122, DW_AT_bit_size(0x02)
    2410                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2411                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2412              
    2413              $C$DW$123       .dwtag  DW_TAG_member
    2414                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2415                      .dwattr $C$DW$123, DW_AT_name("rsvd1")
    2416                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd1")
    2417                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    2418                      .dwattr $C$DW$123, DW_AT_bit_size(0x0e)
    2419                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2420                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2421              
    2422              $C$DW$124       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2424                      .dwattr $C$DW$124, DW_AT_name("rsvd2")
    2425                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd2")
    2426                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    2427                      .dwattr $C$DW$124, DW_AT_bit_size(0x10)
    2428                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2429                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2430              
    2431                      .dwendtag $C$DW$T$35
    2432              
    2433              
    2434              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2435                      .dwattr $C$DW$T$36, DW_AT_name("AUXCLKDIVSEL_REG")
    2436                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2437              $C$DW$125       .dwtag  DW_TAG_member
    2438                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$27)
    2439                      .dwattr $C$DW$125, DW_AT_name("all")
    2440                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    2441                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2442                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2443              
    2444              $C$DW$126       .dwtag  DW_TAG_member
    2445                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$35)
    2446                      .dwattr $C$DW$126, DW_AT_name("bit")
    2447                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    2448                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2449                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2450              
    2451                      .dwendtag $C$DW$T$36
    2452              
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   49

    2453              
    2454              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2455                      .dwattr $C$DW$T$37, DW_AT_name("AUXPLLCTL1_BITS")
    2456                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2457              $C$DW$127       .dwtag  DW_TAG_member
    2458                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2459                      .dwattr $C$DW$127, DW_AT_name("PLLEN")
    2460                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_PLLEN")
    2461                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0f)
    2462                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    2463                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2464                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2465              
    2466              $C$DW$128       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2468                      .dwattr $C$DW$128, DW_AT_name("PLLCLKEN")
    2469                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_PLLCLKEN")
    2470                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0e)
    2471                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2472                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2473                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2474              
    2475              $C$DW$129       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2477                      .dwattr $C$DW$129, DW_AT_name("rsvd1")
    2478                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd1")
    2479                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    2480                      .dwattr $C$DW$129, DW_AT_bit_size(0x0e)
    2481                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2482                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2483              
    2484              $C$DW$130       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2486                      .dwattr $C$DW$130, DW_AT_name("rsvd2")
    2487                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd2")
    2488                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    2489                      .dwattr $C$DW$130, DW_AT_bit_size(0x10)
    2490                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2491                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2492              
    2493                      .dwendtag $C$DW$T$37
    2494              
    2495              
    2496              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2497                      .dwattr $C$DW$T$38, DW_AT_name("AUXPLLCTL1_REG")
    2498                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2499              $C$DW$131       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$27)
    2501                      .dwattr $C$DW$131, DW_AT_name("all")
    2502                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    2503                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2504                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2505              
    2506              $C$DW$132       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   50

    2508                      .dwattr $C$DW$132, DW_AT_name("bit")
    2509                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    2510                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2511                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2512              
    2513                      .dwendtag $C$DW$T$38
    2514              
    2515              
    2516              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2517                      .dwattr $C$DW$T$39, DW_AT_name("AUXPLLMULT_BITS")
    2518                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2519              $C$DW$133       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2521                      .dwattr $C$DW$133, DW_AT_name("IMULT")
    2522                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_IMULT")
    2523                      .dwattr $C$DW$133, DW_AT_bit_offset(0x09)
    2524                      .dwattr $C$DW$133, DW_AT_bit_size(0x07)
    2525                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2526                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2527              
    2528              $C$DW$134       .dwtag  DW_TAG_member
    2529                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2530                      .dwattr $C$DW$134, DW_AT_name("rsvd1")
    2531                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd1")
    2532                      .dwattr $C$DW$134, DW_AT_bit_offset(0x08)
    2533                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    2534                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2535                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2536              
    2537              $C$DW$135       .dwtag  DW_TAG_member
    2538                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2539                      .dwattr $C$DW$135, DW_AT_name("FMULT")
    2540                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_FMULT")
    2541                      .dwattr $C$DW$135, DW_AT_bit_offset(0x06)
    2542                      .dwattr $C$DW$135, DW_AT_bit_size(0x02)
    2543                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2544                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2545              
    2546              $C$DW$136       .dwtag  DW_TAG_member
    2547                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2548                      .dwattr $C$DW$136, DW_AT_name("rsvd2")
    2549                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd2")
    2550                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    2551                      .dwattr $C$DW$136, DW_AT_bit_size(0x06)
    2552                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2553                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2554              
    2555              $C$DW$137       .dwtag  DW_TAG_member
    2556                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2557                      .dwattr $C$DW$137, DW_AT_name("rsvd3")
    2558                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd3")
    2559                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    2560                      .dwattr $C$DW$137, DW_AT_bit_size(0x10)
    2561                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2562                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   51

    2563              
    2564                      .dwendtag $C$DW$T$39
    2565              
    2566              
    2567              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2568                      .dwattr $C$DW$T$40, DW_AT_name("AUXPLLMULT_REG")
    2569                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2570              $C$DW$138       .dwtag  DW_TAG_member
    2571                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$27)
    2572                      .dwattr $C$DW$138, DW_AT_name("all")
    2573                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    2574                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2575                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2576              
    2577              $C$DW$139       .dwtag  DW_TAG_member
    2578                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$39)
    2579                      .dwattr $C$DW$139, DW_AT_name("bit")
    2580                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    2581                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2582                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2583              
    2584                      .dwendtag $C$DW$T$40
    2585              
    2586              
    2587              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2588                      .dwattr $C$DW$T$41, DW_AT_name("AUXPLLSTS_BITS")
    2589                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2590              $C$DW$140       .dwtag  DW_TAG_member
    2591                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2592                      .dwattr $C$DW$140, DW_AT_name("LOCKS")
    2593                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_LOCKS")
    2594                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0f)
    2595                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2596                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2597                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2598              
    2599              $C$DW$141       .dwtag  DW_TAG_member
    2600                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2601                      .dwattr $C$DW$141, DW_AT_name("SLIPS")
    2602                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_SLIPS")
    2603                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0e)
    2604                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2605                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2606                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2607              
    2608              $C$DW$142       .dwtag  DW_TAG_member
    2609                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2610                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    2611                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    2612                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    2613                      .dwattr $C$DW$142, DW_AT_bit_size(0x0e)
    2614                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2615                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2616              
    2617              $C$DW$143       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   52

    2618                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2619                      .dwattr $C$DW$143, DW_AT_name("rsvd2")
    2620                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd2")
    2621                      .dwattr $C$DW$143, DW_AT_bit_offset(0x00)
    2622                      .dwattr $C$DW$143, DW_AT_bit_size(0x10)
    2623                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2624                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2625              
    2626                      .dwendtag $C$DW$T$41
    2627              
    2628              
    2629              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2630                      .dwattr $C$DW$T$42, DW_AT_name("AUXPLLSTS_REG")
    2631                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2632              $C$DW$144       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    2634                      .dwattr $C$DW$144, DW_AT_name("all")
    2635                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_all")
    2636                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2637                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2638              
    2639              $C$DW$145       .dwtag  DW_TAG_member
    2640                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$41)
    2641                      .dwattr $C$DW$145, DW_AT_name("bit")
    2642                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_bit")
    2643                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2644                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2645              
    2646                      .dwendtag $C$DW$T$42
    2647              
    2648              
    2649              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2650                      .dwattr $C$DW$T$43, DW_AT_name("CLKCFGLOCK1_BITS")
    2651                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2652              $C$DW$146       .dwtag  DW_TAG_member
    2653                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2654                      .dwattr $C$DW$146, DW_AT_name("CLKSRCCTL1")
    2655                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    2656                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0f)
    2657                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2658                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2659                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2660              
    2661              $C$DW$147       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2663                      .dwattr $C$DW$147, DW_AT_name("CLKSRCCTL2")
    2664                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    2665                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0e)
    2666                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2667                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2668                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2669              
    2670              $C$DW$148       .dwtag  DW_TAG_member
    2671                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2672                      .dwattr $C$DW$148, DW_AT_name("CLKSRCCTL3")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   53

    2673                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    2674                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0d)
    2675                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2676                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2677                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2678              
    2679              $C$DW$149       .dwtag  DW_TAG_member
    2680                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2681                      .dwattr $C$DW$149, DW_AT_name("SYSPLLCTL1")
    2682                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    2683                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0c)
    2684                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2685                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2686                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2687              
    2688              $C$DW$150       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2690                      .dwattr $C$DW$150, DW_AT_name("SYSPLLCTL2")
    2691                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    2692                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0b)
    2693                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2694                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2696              
    2697              $C$DW$151       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2699                      .dwattr $C$DW$151, DW_AT_name("SYSPLLCTL3")
    2700                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    2701                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0a)
    2702                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2703                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2704                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2705              
    2706              $C$DW$152       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2708                      .dwattr $C$DW$152, DW_AT_name("SYSPLLMULT")
    2709                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_SYSPLLMULT")
    2710                      .dwattr $C$DW$152, DW_AT_bit_offset(0x09)
    2711                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2712                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2713                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2714              
    2715              $C$DW$153       .dwtag  DW_TAG_member
    2716                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2717                      .dwattr $C$DW$153, DW_AT_name("AUXPLLCTL1")
    2718                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    2719                      .dwattr $C$DW$153, DW_AT_bit_offset(0x08)
    2720                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2721                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2722                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2723              
    2724              $C$DW$154       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2726                      .dwattr $C$DW$154, DW_AT_name("rsvd1")
    2727                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   54

    2728                      .dwattr $C$DW$154, DW_AT_bit_offset(0x07)
    2729                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2730                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2731                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2732              
    2733              $C$DW$155       .dwtag  DW_TAG_member
    2734                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2735                      .dwattr $C$DW$155, DW_AT_name("rsvd2")
    2736                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd2")
    2737                      .dwattr $C$DW$155, DW_AT_bit_offset(0x06)
    2738                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2739                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2740                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2741              
    2742              $C$DW$156       .dwtag  DW_TAG_member
    2743                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2744                      .dwattr $C$DW$156, DW_AT_name("AUXPLLMULT")
    2745                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_AUXPLLMULT")
    2746                      .dwattr $C$DW$156, DW_AT_bit_offset(0x05)
    2747                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2748                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2749                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2750              
    2751              $C$DW$157       .dwtag  DW_TAG_member
    2752                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2753                      .dwattr $C$DW$157, DW_AT_name("SYSCLKDIVSEL")
    2754                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    2755                      .dwattr $C$DW$157, DW_AT_bit_offset(0x04)
    2756                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2757                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2758                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2759              
    2760              $C$DW$158       .dwtag  DW_TAG_member
    2761                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2762                      .dwattr $C$DW$158, DW_AT_name("AUXCLKDIVSEL")
    2763                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    2764                      .dwattr $C$DW$158, DW_AT_bit_offset(0x03)
    2765                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2766                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2767                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2768              
    2769              $C$DW$159       .dwtag  DW_TAG_member
    2770                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2771                      .dwattr $C$DW$159, DW_AT_name("PERCLKDIVSEL")
    2772                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    2773                      .dwattr $C$DW$159, DW_AT_bit_offset(0x02)
    2774                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2775                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2776                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2777              
    2778              $C$DW$160       .dwtag  DW_TAG_member
    2779                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2780                      .dwattr $C$DW$160, DW_AT_name("rsvd3")
    2781                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd3")
    2782                      .dwattr $C$DW$160, DW_AT_bit_offset(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   55

    2783                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2784                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2785                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2786              
    2787              $C$DW$161       .dwtag  DW_TAG_member
    2788                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2789                      .dwattr $C$DW$161, DW_AT_name("LOSPCP")
    2790                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_LOSPCP")
    2791                      .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    2792                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2793                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2794                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2795              
    2796              $C$DW$162       .dwtag  DW_TAG_member
    2797                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2798                      .dwattr $C$DW$162, DW_AT_name("rsvd4")
    2799                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd4")
    2800                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00)
    2801                      .dwattr $C$DW$162, DW_AT_bit_size(0x10)
    2802                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2803                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2804              
    2805                      .dwendtag $C$DW$T$43
    2806              
    2807              
    2808              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2809                      .dwattr $C$DW$T$44, DW_AT_name("CLKCFGLOCK1_REG")
    2810                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2811              $C$DW$163       .dwtag  DW_TAG_member
    2812                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$27)
    2813                      .dwattr $C$DW$163, DW_AT_name("all")
    2814                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_all")
    2815                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2816                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2817              
    2818              $C$DW$164       .dwtag  DW_TAG_member
    2819                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$43)
    2820                      .dwattr $C$DW$164, DW_AT_name("bit")
    2821                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_bit")
    2822                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2823                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2824              
    2825                      .dwendtag $C$DW$T$44
    2826              
    2827              
    2828              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2829                      .dwattr $C$DW$T$45, DW_AT_name("CLKSEM_BITS")
    2830                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2831              $C$DW$165       .dwtag  DW_TAG_member
    2832                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2833                      .dwattr $C$DW$165, DW_AT_name("SEM")
    2834                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_SEM")
    2835                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0e)
    2836                      .dwattr $C$DW$165, DW_AT_bit_size(0x02)
    2837                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   56

    2838                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2839              
    2840              $C$DW$166       .dwtag  DW_TAG_member
    2841                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2842                      .dwattr $C$DW$166, DW_AT_name("rsvd1")
    2843                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd1")
    2844                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    2845                      .dwattr $C$DW$166, DW_AT_bit_size(0x0e)
    2846                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2847                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2848              
    2849              $C$DW$167       .dwtag  DW_TAG_member
    2850                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2851                      .dwattr $C$DW$167, DW_AT_name("KEY")
    2852                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_KEY")
    2853                      .dwattr $C$DW$167, DW_AT_bit_offset(0x00)
    2854                      .dwattr $C$DW$167, DW_AT_bit_size(0x10)
    2855                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2856                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2857              
    2858                      .dwendtag $C$DW$T$45
    2859              
    2860              
    2861              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2862                      .dwattr $C$DW$T$46, DW_AT_name("CLKSEM_REG")
    2863                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2864              $C$DW$168       .dwtag  DW_TAG_member
    2865                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    2866                      .dwattr $C$DW$168, DW_AT_name("all")
    2867                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_all")
    2868                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2869                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2870              
    2871              $C$DW$169       .dwtag  DW_TAG_member
    2872                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$45)
    2873                      .dwattr $C$DW$169, DW_AT_name("bit")
    2874                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_bit")
    2875                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2876                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2877              
    2878                      .dwendtag $C$DW$T$46
    2879              
    2880              
    2881              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2882                      .dwattr $C$DW$T$47, DW_AT_name("CLKSRCCTL1_BITS")
    2883                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2884              $C$DW$170       .dwtag  DW_TAG_member
    2885                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2886                      .dwattr $C$DW$170, DW_AT_name("OSCCLKSRCSEL")
    2887                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    2888                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0e)
    2889                      .dwattr $C$DW$170, DW_AT_bit_size(0x02)
    2890                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2891                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2892              
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   57

    2893              $C$DW$171       .dwtag  DW_TAG_member
    2894                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2895                      .dwattr $C$DW$171, DW_AT_name("rsvd1")
    2896                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd1")
    2897                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0d)
    2898                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2899                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2900                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2901              
    2902              $C$DW$172       .dwtag  DW_TAG_member
    2903                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2904                      .dwattr $C$DW$172, DW_AT_name("INTOSC2OFF")
    2905                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_INTOSC2OFF")
    2906                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0c)
    2907                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2908                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2909                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2910              
    2911              $C$DW$173       .dwtag  DW_TAG_member
    2912                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2913                      .dwattr $C$DW$173, DW_AT_name("XTALOFF")
    2914                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_XTALOFF")
    2915                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0b)
    2916                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2917                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2918                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2919              
    2920              $C$DW$174       .dwtag  DW_TAG_member
    2921                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2922                      .dwattr $C$DW$174, DW_AT_name("WDHALTI")
    2923                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_WDHALTI")
    2924                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0a)
    2925                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2926                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2927                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2928              
    2929              $C$DW$175       .dwtag  DW_TAG_member
    2930                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2931                      .dwattr $C$DW$175, DW_AT_name("rsvd2")
    2932                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd2")
    2933                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    2934                      .dwattr $C$DW$175, DW_AT_bit_size(0x0a)
    2935                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2936                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2937              
    2938              $C$DW$176       .dwtag  DW_TAG_member
    2939                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2940                      .dwattr $C$DW$176, DW_AT_name("rsvd3")
    2941                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd3")
    2942                      .dwattr $C$DW$176, DW_AT_bit_offset(0x00)
    2943                      .dwattr $C$DW$176, DW_AT_bit_size(0x10)
    2944                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2945                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2946              
    2947                      .dwendtag $C$DW$T$47
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   58

    2948              
    2949              
    2950              $C$DW$T$48      .dwtag  DW_TAG_union_type
    2951                      .dwattr $C$DW$T$48, DW_AT_name("CLKSRCCTL1_REG")
    2952                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2953              $C$DW$177       .dwtag  DW_TAG_member
    2954                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    2955                      .dwattr $C$DW$177, DW_AT_name("all")
    2956                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_all")
    2957                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2958                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2959              
    2960              $C$DW$178       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$47)
    2962                      .dwattr $C$DW$178, DW_AT_name("bit")
    2963                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_bit")
    2964                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2965                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2966              
    2967                      .dwendtag $C$DW$T$48
    2968              
    2969              
    2970              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2971                      .dwattr $C$DW$T$49, DW_AT_name("CLKSRCCTL2_BITS")
    2972                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    2973              $C$DW$179       .dwtag  DW_TAG_member
    2974                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2975                      .dwattr $C$DW$179, DW_AT_name("AUXOSCCLKSRCSEL")
    2976                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    2977                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0e)
    2978                      .dwattr $C$DW$179, DW_AT_bit_size(0x02)
    2979                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2980                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2981              
    2982              $C$DW$180       .dwtag  DW_TAG_member
    2983                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2984                      .dwattr $C$DW$180, DW_AT_name("CANABCLKSEL")
    2985                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_CANABCLKSEL")
    2986                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0c)
    2987                      .dwattr $C$DW$180, DW_AT_bit_size(0x02)
    2988                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2989                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2990              
    2991              $C$DW$181       .dwtag  DW_TAG_member
    2992                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2993                      .dwattr $C$DW$181, DW_AT_name("CANBBCLKSEL")
    2994                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    2995                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0a)
    2996                      .dwattr $C$DW$181, DW_AT_bit_size(0x02)
    2997                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2998                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2999              
    3000              $C$DW$182       .dwtag  DW_TAG_member
    3001                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3002                      .dwattr $C$DW$182, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   59

    3003                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd1")
    3004                      .dwattr $C$DW$182, DW_AT_bit_offset(0x08)
    3005                      .dwattr $C$DW$182, DW_AT_bit_size(0x02)
    3006                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3007                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3008              
    3009              $C$DW$183       .dwtag  DW_TAG_member
    3010                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3011                      .dwattr $C$DW$183, DW_AT_name("rsvd2")
    3012                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd2")
    3013                      .dwattr $C$DW$183, DW_AT_bit_offset(0x06)
    3014                      .dwattr $C$DW$183, DW_AT_bit_size(0x02)
    3015                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3016                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3017              
    3018              $C$DW$184       .dwtag  DW_TAG_member
    3019                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    3020                      .dwattr $C$DW$184, DW_AT_name("rsvd3")
    3021                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rsvd3")
    3022                      .dwattr $C$DW$184, DW_AT_bit_offset(0x00)
    3023                      .dwattr $C$DW$184, DW_AT_bit_size(0x06)
    3024                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3025                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3026              
    3027              $C$DW$185       .dwtag  DW_TAG_member
    3028                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    3029                      .dwattr $C$DW$185, DW_AT_name("rsvd4")
    3030                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd4")
    3031                      .dwattr $C$DW$185, DW_AT_bit_offset(0x00)
    3032                      .dwattr $C$DW$185, DW_AT_bit_size(0x10)
    3033                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3034                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3035              
    3036                      .dwendtag $C$DW$T$49
    3037              
    3038              
    3039              $C$DW$T$50      .dwtag  DW_TAG_union_type
    3040                      .dwattr $C$DW$T$50, DW_AT_name("CLKSRCCTL2_REG")
    3041                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    3042              $C$DW$186       .dwtag  DW_TAG_member
    3043                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    3044                      .dwattr $C$DW$186, DW_AT_name("all")
    3045                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_all")
    3046                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3047                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3048              
    3049              $C$DW$187       .dwtag  DW_TAG_member
    3050                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$49)
    3051                      .dwattr $C$DW$187, DW_AT_name("bit")
    3052                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_bit")
    3053                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3054                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3055              
    3056                      .dwendtag $C$DW$T$50
    3057              
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   60

    3058              
    3059              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3060                      .dwattr $C$DW$T$51, DW_AT_name("CLKSRCCTL3_BITS")
    3061                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    3062              $C$DW$188       .dwtag  DW_TAG_member
    3063                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    3064                      .dwattr $C$DW$188, DW_AT_name("XCLKOUTSEL")
    3065                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    3066                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0d)
    3067                      .dwattr $C$DW$188, DW_AT_bit_size(0x03)
    3068                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3069                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3070              
    3071              $C$DW$189       .dwtag  DW_TAG_member
    3072                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    3073                      .dwattr $C$DW$189, DW_AT_name("rsvd1")
    3074                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd1")
    3075                      .dwattr $C$DW$189, DW_AT_bit_offset(0x00)
    3076                      .dwattr $C$DW$189, DW_AT_bit_size(0x0d)
    3077                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3078                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3079              
    3080              $C$DW$190       .dwtag  DW_TAG_member
    3081                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    3082                      .dwattr $C$DW$190, DW_AT_name("rsvd2")
    3083                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd2")
    3084                      .dwattr $C$DW$190, DW_AT_bit_offset(0x00)
    3085                      .dwattr $C$DW$190, DW_AT_bit_size(0x10)
    3086                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3087                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3088              
    3089                      .dwendtag $C$DW$T$51
    3090              
    3091              
    3092              $C$DW$T$52      .dwtag  DW_TAG_union_type
    3093                      .dwattr $C$DW$T$52, DW_AT_name("CLKSRCCTL3_REG")
    3094                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    3095              $C$DW$191       .dwtag  DW_TAG_member
    3096                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    3097                      .dwattr $C$DW$191, DW_AT_name("all")
    3098                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_all")
    3099                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3100                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3101              
    3102              $C$DW$192       .dwtag  DW_TAG_member
    3103                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$51)
    3104                      .dwattr $C$DW$192, DW_AT_name("bit")
    3105                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_bit")
    3106                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3107                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3108              
    3109                      .dwendtag $C$DW$T$52
    3110              
    3111              
    3112              $C$DW$T$54      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   61

    3113                      .dwattr $C$DW$T$54, DW_AT_name("CLK_CFG_REGS")
    3114                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x32)
    3115              $C$DW$193       .dwtag  DW_TAG_member
    3116                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$46)
    3117                      .dwattr $C$DW$193, DW_AT_name("CLKSEM")
    3118                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_CLKSEM")
    3119                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3120                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3121              
    3122              $C$DW$194       .dwtag  DW_TAG_member
    3123                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$44)
    3124                      .dwattr $C$DW$194, DW_AT_name("CLKCFGLOCK1")
    3125                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    3126                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3127                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3128              
    3129              $C$DW$195       .dwtag  DW_TAG_member
    3130                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$53)
    3131                      .dwattr $C$DW$195, DW_AT_name("rsvd1")
    3132                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd1")
    3133                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3134                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3135              
    3136              $C$DW$196       .dwtag  DW_TAG_member
    3137                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$48)
    3138                      .dwattr $C$DW$196, DW_AT_name("CLKSRCCTL1")
    3139                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3140                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3141                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3142              
    3143              $C$DW$197       .dwtag  DW_TAG_member
    3144                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$50)
    3145                      .dwattr $C$DW$197, DW_AT_name("CLKSRCCTL2")
    3146                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3147                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3148                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3149              
    3150              $C$DW$198       .dwtag  DW_TAG_member
    3151                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$52)
    3152                      .dwattr $C$DW$198, DW_AT_name("CLKSRCCTL3")
    3153                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3154                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3155                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3156              
    3157              $C$DW$199       .dwtag  DW_TAG_member
    3158                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$284)
    3159                      .dwattr $C$DW$199, DW_AT_name("SYSPLLCTL1")
    3160                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3161                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3162                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3163              
    3164              $C$DW$200       .dwtag  DW_TAG_member
    3165                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$53)
    3166                      .dwattr $C$DW$200, DW_AT_name("rsvd2")
    3167                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   62

    3168                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3169                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3170              
    3171              $C$DW$201       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$286)
    3173                      .dwattr $C$DW$201, DW_AT_name("SYSPLLMULT")
    3174                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3175                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3176                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3177              
    3178              $C$DW$202       .dwtag  DW_TAG_member
    3179                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$288)
    3180                      .dwattr $C$DW$202, DW_AT_name("SYSPLLSTS")
    3181                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_SYSPLLSTS")
    3182                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3183                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3184              
    3185              $C$DW$203       .dwtag  DW_TAG_member
    3186                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$38)
    3187                      .dwattr $C$DW$203, DW_AT_name("AUXPLLCTL1")
    3188                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3189                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3190                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3191              
    3192              $C$DW$204       .dwtag  DW_TAG_member
    3193                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$53)
    3194                      .dwattr $C$DW$204, DW_AT_name("rsvd3")
    3195                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd3")
    3196                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3197                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3198              
    3199              $C$DW$205       .dwtag  DW_TAG_member
    3200                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$40)
    3201                      .dwattr $C$DW$205, DW_AT_name("AUXPLLMULT")
    3202                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3203                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3204                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3205              
    3206              $C$DW$206       .dwtag  DW_TAG_member
    3207                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$42)
    3208                      .dwattr $C$DW$206, DW_AT_name("AUXPLLSTS")
    3209                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_AUXPLLSTS")
    3210                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3211                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3212              
    3213              $C$DW$207       .dwtag  DW_TAG_member
    3214                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$282)
    3215                      .dwattr $C$DW$207, DW_AT_name("SYSCLKDIVSEL")
    3216                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3217                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3218                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3219              
    3220              $C$DW$208       .dwtag  DW_TAG_member
    3221                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$36)
    3222                      .dwattr $C$DW$208, DW_AT_name("AUXCLKDIVSEL")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   63

    3223                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3224                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3225                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3226              
    3227              $C$DW$209       .dwtag  DW_TAG_member
    3228                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$242)
    3229                      .dwattr $C$DW$209, DW_AT_name("PERCLKDIVSEL")
    3230                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3231                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3232                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3233              
    3234              $C$DW$210       .dwtag  DW_TAG_member
    3235                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$307)
    3236                      .dwattr $C$DW$210, DW_AT_name("XCLKOUTDIVSEL")
    3237                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    3238                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3239                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3240              
    3241              $C$DW$211       .dwtag  DW_TAG_member
    3242                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$21)
    3243                      .dwattr $C$DW$211, DW_AT_name("rsvd4")
    3244                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd4")
    3245                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3246                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3247              
    3248              $C$DW$212       .dwtag  DW_TAG_member
    3249                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$200)
    3250                      .dwattr $C$DW$212, DW_AT_name("LOSPCP")
    3251                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_LOSPCP")
    3252                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3253                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3254              
    3255              $C$DW$213       .dwtag  DW_TAG_member
    3256                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$206)
    3257                      .dwattr $C$DW$213, DW_AT_name("MCDCR")
    3258                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_MCDCR")
    3259                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3260                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3261              
    3262              $C$DW$214       .dwtag  DW_TAG_member
    3263                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$305)
    3264                      .dwattr $C$DW$214, DW_AT_name("X1CNT")
    3265                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_X1CNT")
    3266                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3267                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3268              
    3269                      .dwendtag $C$DW$T$54
    3270              
    3271              $C$DW$215       .dwtag  DW_TAG_TI_far_type
    3272                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$54)
    3273              
    3274              $C$DW$T$346     .dwtag  DW_TAG_volatile_type
    3275                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$215)
    3276              
    3277              
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   64

    3278              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3279                      .dwattr $C$DW$T$55, DW_AT_name("CPU2RESCTL_BITS")
    3280                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x02)
    3281              $C$DW$216       .dwtag  DW_TAG_member
    3282                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3283                      .dwattr $C$DW$216, DW_AT_name("RESET")
    3284                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_RESET")
    3285                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0f)
    3286                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    3287                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3288                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3289              
    3290              $C$DW$217       .dwtag  DW_TAG_member
    3291                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    3292                      .dwattr $C$DW$217, DW_AT_name("rsvd1")
    3293                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_rsvd1")
    3294                      .dwattr $C$DW$217, DW_AT_bit_offset(0x00)
    3295                      .dwattr $C$DW$217, DW_AT_bit_size(0x0f)
    3296                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3297                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3298              
    3299              $C$DW$218       .dwtag  DW_TAG_member
    3300                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    3301                      .dwattr $C$DW$218, DW_AT_name("KEY")
    3302                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_KEY")
    3303                      .dwattr $C$DW$218, DW_AT_bit_offset(0x00)
    3304                      .dwattr $C$DW$218, DW_AT_bit_size(0x10)
    3305                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3306                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3307              
    3308                      .dwendtag $C$DW$T$55
    3309              
    3310              
    3311              $C$DW$T$56      .dwtag  DW_TAG_union_type
    3312                      .dwattr $C$DW$T$56, DW_AT_name("CPU2RESCTL_REG")
    3313                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x02)
    3314              $C$DW$219       .dwtag  DW_TAG_member
