TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Oct  7 22:14:20 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\hakan\workspace_v10\IDDK_PM_Servo_F2837x-v2\F2837x_RAM")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("InputXbarRegs")

    1457              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1458              ;***************************************************************
    1459              
    1460              _GPIO_EnableUnbondedIOPullups:
    1461              ;* AL    assigned to _pin_count
    1462              $C$DW$77        .dwtag  DW_TAG_variable
    1463                      .dwattr $C$DW$77, DW_AT_name("pin_count")
    1464                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_pin_count")
    1465                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$6)
    1466                      .dwattr $C$DW$77, DW_AT_location[DW_OP_reg0]
    1467              
    1468                      .dwcfi  cfa_offset, -2
    1469                      .dwcfi  save_reg_to_mem, 26, 0
    1470 000001bd 761F!         MOVW      DP,#_DevCfgRegs+8     ; [CPU_ARAU] 
         000001be 0000 
    1471 000001bf 2901          CLRC      SXM                   ; [CPU_ALU] 
    1472                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Gpio.c",li
    1473 000001c0 0608!         MOVL      ACC,@$BLOCKED(_DevCfgRegs)+8 ; [CPU_ALU] |320| 
    1474 000001c1 FF47          SFR       ACC,8                 ; [CPU_ALU] |320| 
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   29

    1475 000001c2 9007          ANDB      AL,#0x07              ; [CPU_ALU] |320| 
    1476 000001c3 5205          CMPB      AL,#5                 ; [CPU_ALU] |320| 
    1477 000001c4 6106          B         $C$L18,EQ             ; [CPU_ALU] |320| 
    1478                      ; branchcc occurs ; [] |320| 
    1479                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Gpio.c",li
    1480 000001c5 5206          CMPB      AL,#6                 ; [CPU_ALU] |331| 
    1481 000001c6 6006          B         $C$L19,NEQ            ; [CPU_ALU] |331| 
    1482                      ; branchcc occurs ; [] |331| 
    1483                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Gpio.c",li
    1484              $C$DW$78        .dwtag  DW_TAG_TI_branch
    1485                      .dwattr $C$DW$78, DW_AT_low_pc(0x00)
    1486                      .dwattr $C$DW$78, DW_AT_name("_GPIO_EnableUnbondedIOPullupsFor176Pin")
    1487                      .dwattr $C$DW$78, DW_AT_TI_call
    1488              
    1489 000001c7 7640'         LCR       #_GPIO_EnableUnbondedIOPullupsFor176Pin ; [CPU_ALU] |333| 
         000001c8 017F 
    1490                      ; call occurs [#_GPIO_EnableUnbondedIOPullupsFor176Pin] ; [] |333| 
    1491 000001c9 6F03          B         $C$L19,UNC            ; [CPU_ALU] 
    1492                      ; branch occurs ; [] 
    1493 000001ca       $C$L18:    
    1494                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Gpio.c",li
    1495              $C$DW$79        .dwtag  DW_TAG_TI_branch
    1496                      .dwattr $C$DW$79, DW_AT_low_pc(0x00)
    1497                      .dwattr $C$DW$79, DW_AT_name("_GPIO_EnableUnbondedIOPullupsFor100Pin")
    1498                      .dwattr $C$DW$79, DW_AT_TI_call
    1499              
    1500 000001ca 7640'         LCR       #_GPIO_EnableUnbondedIOPullupsFor100Pin ; [CPU_ALU] |329| 
         000001cb 0198 
    1501                      ; call occurs [#_GPIO_EnableUnbondedIOPullupsFor100Pin] ; [] |329| 
    1502              $C$L19:    
    1503              $C$DW$80        .dwtag  DW_TAG_TI_branch
    1504                      .dwattr $C$DW$80, DW_AT_low_pc(0x00)
    1505                      .dwattr $C$DW$80, DW_AT_TI_return
    1506              
    1507 000001cc 0006          LRETR     ; [CPU_ALU] 
    1508                      ; return occurs ; [] 
    1509                      .dwattr $C$DW$76, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/so
    1510                      .dwattr $C$DW$76, DW_AT_TI_end_line(0x154)
    1511                      .dwattr $C$DW$76, DW_AT_TI_end_column(0x02)
    1512                      .dwendentry
    1513                      .dwendtag $C$DW$76
    1514              
    1515              ;**************************************************************
    1516              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1517              ;**************************************************************
    1518                      .global _InputXbarRegs
    1519                      .global _GpioDataRegs
    1520                      .global _DevCfgRegs
    1521                      .global _GpioCtrlRegs
    1522              
    1523              ;***************************************************************
    1524              ;* TYPE INFORMATION                                            *
    1525              ;***************************************************************
    1526              
    1527              $C$DW$T$20      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   30

    1528                      .dwattr $C$DW$T$20, DW_AT_name("CPU2RESCTL_BITS")
    1529                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1530              $C$DW$81        .dwtag  DW_TAG_member
    1531                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1532                      .dwattr $C$DW$81, DW_AT_name("RESET")
    1533                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_RESET")
    1534                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0f)
    1535                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1536                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1537                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1538              
    1539              $C$DW$82        .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1541                      .dwattr $C$DW$82, DW_AT_name("rsvd1")
    1542                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd1")
    1543                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1544                      .dwattr $C$DW$82, DW_AT_bit_size(0x0f)
    1545                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1546                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1547              
    1548              $C$DW$83        .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1550                      .dwattr $C$DW$83, DW_AT_name("KEY")
    1551                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_KEY")
    1552                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00)
    1553                      .dwattr $C$DW$83, DW_AT_bit_size(0x10)
    1554                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1555                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1556              
    1557                      .dwendtag $C$DW$T$20
    1558              
    1559              
    1560              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1561                      .dwattr $C$DW$T$22, DW_AT_name("CPU2RESCTL_REG")
    1562                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1563              $C$DW$84        .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1565                      .dwattr $C$DW$84, DW_AT_name("all")
    1566                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_all")
    1567                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1568                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1569              
    1570              $C$DW$85        .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    1572                      .dwattr $C$DW$85, DW_AT_name("bit")
    1573                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_bit")
    1574                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1575                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1576              
    1577                      .dwendtag $C$DW$T$22
    1578              
    1579              
    1580              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1581                      .dwattr $C$DW$T$23, DW_AT_name("CPUSEL0_BITS")
    1582                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   31

    1583              $C$DW$86        .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1585                      .dwattr $C$DW$86, DW_AT_name("EPWM1")
    1586                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_EPWM1")
    1587                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0f)
    1588                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1589                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1590                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1591              
    1592              $C$DW$87        .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1594                      .dwattr $C$DW$87, DW_AT_name("EPWM2")
    1595                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_EPWM2")
    1596                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0e)
    1597                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1598                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1599                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1600              
    1601              $C$DW$88        .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1603                      .dwattr $C$DW$88, DW_AT_name("EPWM3")
    1604                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_EPWM3")
    1605                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0d)
    1606                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1607                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1608                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1609              
    1610              $C$DW$89        .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1612                      .dwattr $C$DW$89, DW_AT_name("EPWM4")
    1613                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_EPWM4")
    1614                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0c)
    1615                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1616                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1618              
    1619              $C$DW$90        .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1621                      .dwattr $C$DW$90, DW_AT_name("EPWM5")
    1622                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_EPWM5")
    1623                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0b)
    1624                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1625                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1626                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1627              
    1628              $C$DW$91        .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1630                      .dwattr $C$DW$91, DW_AT_name("EPWM6")
    1631                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_EPWM6")
    1632                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0a)
    1633                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1634                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1635                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1636              
    1637              $C$DW$92        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   32

    1638                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1639                      .dwattr $C$DW$92, DW_AT_name("EPWM7")
    1640                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_EPWM7")
    1641                      .dwattr $C$DW$92, DW_AT_bit_offset(0x09)
    1642                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1643                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1644                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1645              
    1646              $C$DW$93        .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1648                      .dwattr $C$DW$93, DW_AT_name("EPWM8")
    1649                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_EPWM8")
    1650                      .dwattr $C$DW$93, DW_AT_bit_offset(0x08)
    1651                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1652                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1653                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1654              
    1655              $C$DW$94        .dwtag  DW_TAG_member
    1656                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1657                      .dwattr $C$DW$94, DW_AT_name("EPWM9")
    1658                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_EPWM9")
    1659                      .dwattr $C$DW$94, DW_AT_bit_offset(0x07)
    1660                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1661                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1662                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1663              
    1664              $C$DW$95        .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1666                      .dwattr $C$DW$95, DW_AT_name("EPWM10")
    1667                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_EPWM10")
    1668                      .dwattr $C$DW$95, DW_AT_bit_offset(0x06)
    1669                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1670                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1671                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1672              
    1673              $C$DW$96        .dwtag  DW_TAG_member
    1674                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1675                      .dwattr $C$DW$96, DW_AT_name("EPWM11")
    1676                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_EPWM11")
    1677                      .dwattr $C$DW$96, DW_AT_bit_offset(0x05)
    1678                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1679                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1680                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1681              
    1682              $C$DW$97        .dwtag  DW_TAG_member
    1683                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1684                      .dwattr $C$DW$97, DW_AT_name("EPWM12")
    1685                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_EPWM12")
    1686                      .dwattr $C$DW$97, DW_AT_bit_offset(0x04)
    1687                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1688                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1689                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1690              
    1691              $C$DW$98        .dwtag  DW_TAG_member
    1692                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   33

    1693                      .dwattr $C$DW$98, DW_AT_name("rsvd1")
    1694                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd1")
    1695                      .dwattr $C$DW$98, DW_AT_bit_offset(0x03)
    1696                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1697                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1698                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1699              
    1700              $C$DW$99        .dwtag  DW_TAG_member
    1701                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1702                      .dwattr $C$DW$99, DW_AT_name("rsvd2")
    1703                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd2")
    1704                      .dwattr $C$DW$99, DW_AT_bit_offset(0x02)
    1705                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1706                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1707                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1708              
    1709              $C$DW$100       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1711                      .dwattr $C$DW$100, DW_AT_name("rsvd3")
    1712                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd3")
    1713                      .dwattr $C$DW$100, DW_AT_bit_offset(0x01)
    1714                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1715                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1716                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1717              
    1718              $C$DW$101       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1720                      .dwattr $C$DW$101, DW_AT_name("rsvd4")
    1721                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd4")
    1722                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1723                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1724                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1725                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1726              
    1727              $C$DW$102       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1729                      .dwattr $C$DW$102, DW_AT_name("rsvd5")
    1730                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd5")
    1731                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    1732                      .dwattr $C$DW$102, DW_AT_bit_size(0x10)
    1733                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1734                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1735              
    1736                      .dwendtag $C$DW$T$23
    1737              
    1738              
    1739              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1740                      .dwattr $C$DW$T$24, DW_AT_name("CPUSEL0_REG")
    1741                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1742              $C$DW$103       .dwtag  DW_TAG_member
    1743                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
    1744                      .dwattr $C$DW$103, DW_AT_name("all")
    1745                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_all")
    1746                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1747                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   34

    1748              
    1749              $C$DW$104       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$23)
    1751                      .dwattr $C$DW$104, DW_AT_name("bit")
    1752                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_bit")
    1753                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1754                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1755              
    1756                      .dwendtag $C$DW$T$24
    1757              
    1758              
    1759              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1760                      .dwattr $C$DW$T$25, DW_AT_name("CPUSEL11_BITS")
    1761                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1762              $C$DW$105       .dwtag  DW_TAG_member
    1763                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1764                      .dwattr $C$DW$105, DW_AT_name("ADC_A")
    1765                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ADC_A")
    1766                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0f)
    1767                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1768                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1769                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1770              
    1771              $C$DW$106       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1773                      .dwattr $C$DW$106, DW_AT_name("ADC_B")
    1774                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_ADC_B")
    1775                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0e)
    1776                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1777                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1778                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1779              
    1780              $C$DW$107       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1782                      .dwattr $C$DW$107, DW_AT_name("ADC_C")
    1783                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_ADC_C")
    1784                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0d)
    1785                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1786                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1787                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1788              
    1789              $C$DW$108       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1791                      .dwattr $C$DW$108, DW_AT_name("ADC_D")
    1792                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_ADC_D")
    1793                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0c)
    1794                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1795                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1796                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1797              
    1798              $C$DW$109       .dwtag  DW_TAG_member
    1799                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1800                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
    1801                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
    1802                      .dwattr $C$DW$109, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   35

    1803                      .dwattr $C$DW$109, DW_AT_bit_size(0x0c)
    1804                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1805                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1806              
    1807              $C$DW$110       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1809                      .dwattr $C$DW$110, DW_AT_name("rsvd2")
    1810                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd2")
    1811                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1812                      .dwattr $C$DW$110, DW_AT_bit_size(0x10)
    1813                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1814                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1815              
    1816                      .dwendtag $C$DW$T$25
    1817              
    1818              
    1819              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1820                      .dwattr $C$DW$T$26, DW_AT_name("CPUSEL11_REG")
    1821                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1822              $C$DW$111       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$21)
    1824                      .dwattr $C$DW$111, DW_AT_name("all")
    1825                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1826                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1827                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1828              
    1829              $C$DW$112       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$25)
    1831                      .dwattr $C$DW$112, DW_AT_name("bit")
    1832                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    1833                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1834                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1835              
    1836                      .dwendtag $C$DW$T$26
    1837              
    1838              
    1839              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1840                      .dwattr $C$DW$T$27, DW_AT_name("CPUSEL12_BITS")
    1841                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1842              $C$DW$113       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1844                      .dwattr $C$DW$113, DW_AT_name("CMPSS1")
    1845                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_CMPSS1")
    1846                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0f)
    1847                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1848                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1849                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1850              
    1851              $C$DW$114       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1853                      .dwattr $C$DW$114, DW_AT_name("CMPSS2")
    1854                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_CMPSS2")
    1855                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0e)
    1856                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1857                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   36

    1858                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1859              
    1860              $C$DW$115       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1862                      .dwattr $C$DW$115, DW_AT_name("CMPSS3")
    1863                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_CMPSS3")
    1864                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0d)
    1865                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1866                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1867                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1868              
    1869              $C$DW$116       .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1871                      .dwattr $C$DW$116, DW_AT_name("CMPSS4")
    1872                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_CMPSS4")
    1873                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0c)
    1874                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1875                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1876                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1877              
    1878              $C$DW$117       .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1880                      .dwattr $C$DW$117, DW_AT_name("CMPSS5")
    1881                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_CMPSS5")
    1882                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0b)
    1883                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1884                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1885                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1886              
    1887              $C$DW$118       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1889                      .dwattr $C$DW$118, DW_AT_name("CMPSS6")
    1890                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_CMPSS6")
    1891                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0a)
    1892                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1893                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1894                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1895              
    1896              $C$DW$119       .dwtag  DW_TAG_member
    1897                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1898                      .dwattr $C$DW$119, DW_AT_name("CMPSS7")
    1899                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_CMPSS7")
    1900                      .dwattr $C$DW$119, DW_AT_bit_offset(0x09)
    1901                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1902                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1903                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1904              
    1905              $C$DW$120       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1907                      .dwattr $C$DW$120, DW_AT_name("CMPSS8")
    1908                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_CMPSS8")
    1909                      .dwattr $C$DW$120, DW_AT_bit_offset(0x08)
    1910                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1911                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1912                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   37

    1913              
    1914              $C$DW$121       .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1916                      .dwattr $C$DW$121, DW_AT_name("rsvd1")
    1917                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd1")
    1918                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1919                      .dwattr $C$DW$121, DW_AT_bit_size(0x08)
    1920                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1921                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1922              
    1923              $C$DW$122       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1925                      .dwattr $C$DW$122, DW_AT_name("rsvd2")
    1926                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd2")
    1927                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00)
    1928                      .dwattr $C$DW$122, DW_AT_bit_size(0x10)
    1929                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1930                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1931              
    1932                      .dwendtag $C$DW$T$27
    1933              
    1934              
    1935              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1936                      .dwattr $C$DW$T$28, DW_AT_name("CPUSEL12_REG")
    1937                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1938              $C$DW$123       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$21)
    1940                      .dwattr $C$DW$123, DW_AT_name("all")
    1941                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_all")
    1942                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1943                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1944              
    1945              $C$DW$124       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$27)
    1947                      .dwattr $C$DW$124, DW_AT_name("bit")
    1948                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bit")
    1949                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1950                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1951              
    1952                      .dwendtag $C$DW$T$28
    1953              
    1954              
    1955              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1956                      .dwattr $C$DW$T$29, DW_AT_name("CPUSEL14_BITS")
    1957                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1958              $C$DW$125       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1960                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    1961                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
    1962                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0f)
    1963                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1964                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1965                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1966              
    1967              $C$DW$126       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   38

    1968                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1969                      .dwattr $C$DW$126, DW_AT_name("rsvd2")
    1970                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd2")
    1971                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0e)
    1972                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1973                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1974                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1975              
    1976              $C$DW$127       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1978                      .dwattr $C$DW$127, DW_AT_name("rsvd3")
    1979                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd3")
    1980                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0d)
    1981                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1982                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1983                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1984              
    1985              $C$DW$128       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$128, DW_AT_name("rsvd4")
    1988                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd4")
    1989                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0c)
    1990                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1991                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1992                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1993              
    1994              $C$DW$129       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1996                      .dwattr $C$DW$129, DW_AT_name("rsvd5")
    1997                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd5")
    1998                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    1999                      .dwattr $C$DW$129, DW_AT_bit_size(0x0c)
    2000                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2002              
    2003              $C$DW$130       .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2005                      .dwattr $C$DW$130, DW_AT_name("DAC_A")
    2006                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_DAC_A")
    2007                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0f)
    2008                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2009                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2010                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2011              
    2012              $C$DW$131       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2014                      .dwattr $C$DW$131, DW_AT_name("DAC_B")
    2015                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_DAC_B")
    2016                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0e)
    2017                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2018                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2019                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2020              
    2021              $C$DW$132       .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   39

    2023                      .dwattr $C$DW$132, DW_AT_name("DAC_C")
    2024                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_DAC_C")
    2025                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0d)
    2026                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2027                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2028                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2029              
    2030              $C$DW$133       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2032                      .dwattr $C$DW$133, DW_AT_name("rsvd6")
    2033                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd6")
    2034                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0c)
    2035                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2036                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2037                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2038              
    2039              $C$DW$134       .dwtag  DW_TAG_member
    2040                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2041                      .dwattr $C$DW$134, DW_AT_name("rsvd7")
    2042                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd7")
    2043                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    2044                      .dwattr $C$DW$134, DW_AT_bit_size(0x0c)
    2045                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2046                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2047              
    2048                      .dwendtag $C$DW$T$29
    2049              
    2050              
    2051              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2052                      .dwattr $C$DW$T$30, DW_AT_name("CPUSEL14_REG")
    2053                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2054              $C$DW$135       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$21)
    2056                      .dwattr $C$DW$135, DW_AT_name("all")
    2057                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_all")
    2058                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2059                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2060              
    2061              $C$DW$136       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$29)
    2063                      .dwattr $C$DW$136, DW_AT_name("bit")
    2064                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_bit")
    2065                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2066                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2067              
    2068                      .dwendtag $C$DW$T$30
    2069              
    2070              
    2071              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2072                      .dwattr $C$DW$T$31, DW_AT_name("CPUSEL1_BITS")
    2073                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2074              $C$DW$137       .dwtag  DW_TAG_member
    2075                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2076                      .dwattr $C$DW$137, DW_AT_name("ECAP1")
    2077                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ECAP1")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   40

    2078                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0f)
    2079                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2080                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2081                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2082              
    2083              $C$DW$138       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2085                      .dwattr $C$DW$138, DW_AT_name("ECAP2")
    2086                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ECAP2")
    2087                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0e)
    2088                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2089                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2090                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2091              
    2092              $C$DW$139       .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2094                      .dwattr $C$DW$139, DW_AT_name("ECAP3")
    2095                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ECAP3")
    2096                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0d)
    2097                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2098                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2100              
    2101              $C$DW$140       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2103                      .dwattr $C$DW$140, DW_AT_name("ECAP4")
    2104                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ECAP4")
    2105                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0c)
    2106                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2107                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2108                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2109              
    2110              $C$DW$141       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2112                      .dwattr $C$DW$141, DW_AT_name("ECAP5")
    2113                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ECAP5")
    2114                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0b)
    2115                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2116                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2117                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2118              
    2119              $C$DW$142       .dwtag  DW_TAG_member
    2120                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2121                      .dwattr $C$DW$142, DW_AT_name("ECAP6")
    2122                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ECAP6")
    2123                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0a)
    2124                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2125                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2126                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2127              
    2128              $C$DW$143       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2130                      .dwattr $C$DW$143, DW_AT_name("rsvd1")
    2131                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd1")
    2132                      .dwattr $C$DW$143, DW_AT_bit_offset(0x09)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   41

    2133                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2134                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2135                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2136              
    2137              $C$DW$144       .dwtag  DW_TAG_member
    2138                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2139                      .dwattr $C$DW$144, DW_AT_name("rsvd2")
    2140                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd2")
    2141                      .dwattr $C$DW$144, DW_AT_bit_offset(0x08)
    2142                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2143                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2144                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2145              
    2146              $C$DW$145       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2148                      .dwattr $C$DW$145, DW_AT_name("rsvd3")
    2149                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd3")
    2150                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    2151                      .dwattr $C$DW$145, DW_AT_bit_size(0x08)
    2152                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2154              
    2155              $C$DW$146       .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2157                      .dwattr $C$DW$146, DW_AT_name("rsvd4")
    2158                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd4")
    2159                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    2160                      .dwattr $C$DW$146, DW_AT_bit_size(0x10)
    2161                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2162                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2163              
    2164                      .dwendtag $C$DW$T$31
    2165              
    2166              
    2167              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2168                      .dwattr $C$DW$T$32, DW_AT_name("CPUSEL1_REG")
    2169                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2170              $C$DW$147       .dwtag  DW_TAG_member
    2171                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$21)
    2172                      .dwattr $C$DW$147, DW_AT_name("all")
    2173                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_all")
    2174                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2175                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2176              
    2177              $C$DW$148       .dwtag  DW_TAG_member
    2178                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$31)
    2179                      .dwattr $C$DW$148, DW_AT_name("bit")
    2180                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_bit")
    2181                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2182                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2183              
    2184                      .dwendtag $C$DW$T$32
    2185              
    2186              
    2187              $C$DW$T$33      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   42

    2188                      .dwattr $C$DW$T$33, DW_AT_name("CPUSEL2_BITS")
    2189                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2190              $C$DW$149       .dwtag  DW_TAG_member
    2191                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2192                      .dwattr $C$DW$149, DW_AT_name("EQEP1")
    2193                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_EQEP1")
    2194                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0f)
    2195                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2196                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2197                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2198              
    2199              $C$DW$150       .dwtag  DW_TAG_member
    2200                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2201                      .dwattr $C$DW$150, DW_AT_name("EQEP2")
    2202                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_EQEP2")
    2203                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0e)
    2204                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2205                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2206                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2207              
    2208              $C$DW$151       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2210                      .dwattr $C$DW$151, DW_AT_name("EQEP3")
    2211                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_EQEP3")
    2212                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0d)
    2213                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2214                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2215                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2216              
    2217              $C$DW$152       .dwtag  DW_TAG_member
    2218                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2219                      .dwattr $C$DW$152, DW_AT_name("rsvd1")
    2220                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd1")
    2221                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0c)
    2222                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2223                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2224                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2225              
    2226              $C$DW$153       .dwtag  DW_TAG_member
    2227                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2228                      .dwattr $C$DW$153, DW_AT_name("rsvd2")
    2229                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd2")
    2230                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00)
    2231                      .dwattr $C$DW$153, DW_AT_bit_size(0x0c)
    2232                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2233                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2234              
    2235              $C$DW$154       .dwtag  DW_TAG_member
    2236                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2237                      .dwattr $C$DW$154, DW_AT_name("rsvd3")
    2238                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd3")
    2239                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    2240                      .dwattr $C$DW$154, DW_AT_bit_size(0x10)
    2241                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2242                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   43

    2243              
    2244                      .dwendtag $C$DW$T$33
    2245              
    2246              
    2247              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2248                      .dwattr $C$DW$T$34, DW_AT_name("CPUSEL2_REG")
    2249                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2250              $C$DW$155       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    2252                      .dwattr $C$DW$155, DW_AT_name("all")
    2253                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_all")
    2254                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2255                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2256              
    2257              $C$DW$156       .dwtag  DW_TAG_member
    2258                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$33)
    2259                      .dwattr $C$DW$156, DW_AT_name("bit")
    2260                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_bit")
    2261                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2262                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2263              
    2264                      .dwendtag $C$DW$T$34
    2265              
    2266              
    2267              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2268                      .dwattr $C$DW$T$35, DW_AT_name("CPUSEL3_BITS")
    2269                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2270              $C$DW$157       .dwtag  DW_TAG_member
    2271                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2272                      .dwattr $C$DW$157, DW_AT_name("rsvd1")
    2273                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd1")
    2274                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0f)
    2275                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2276                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2277                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2278              
    2279              $C$DW$158       .dwtag  DW_TAG_member
    2280                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2281                      .dwattr $C$DW$158, DW_AT_name("rsvd2")
    2282                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd2")
    2283                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0e)
    2284                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2285                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2286                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2287              
    2288              $C$DW$159       .dwtag  DW_TAG_member
    2289                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2290                      .dwattr $C$DW$159, DW_AT_name("rsvd3")
    2291                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd3")
    2292                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0d)
    2293                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2294                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2295                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2296              
    2297              $C$DW$160       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   44

    2298                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2299                      .dwattr $C$DW$160, DW_AT_name("rsvd4")
    2300                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd4")
    2301                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0c)
    2302                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2303                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2304                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2305              
    2306              $C$DW$161       .dwtag  DW_TAG_member
    2307                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2308                      .dwattr $C$DW$161, DW_AT_name("rsvd5")
    2309                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rsvd5")
    2310                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0b)
    2311                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2312                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2313                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2314              
    2315              $C$DW$162       .dwtag  DW_TAG_member
    2316                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2317                      .dwattr $C$DW$162, DW_AT_name("rsvd6")
    2318                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd6")
    2319                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0a)
    2320                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2321                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2322                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2323              
    2324              $C$DW$163       .dwtag  DW_TAG_member
    2325                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2326                      .dwattr $C$DW$163, DW_AT_name("rsvd7")
    2327                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd7")
    2328                      .dwattr $C$DW$163, DW_AT_bit_offset(0x09)
    2329                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2330                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2331                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2332              
    2333              $C$DW$164       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2335                      .dwattr $C$DW$164, DW_AT_name("rsvd8")
    2336                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd8")
    2337                      .dwattr $C$DW$164, DW_AT_bit_offset(0x08)
    2338                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2339                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2340                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2341              
    2342              $C$DW$165       .dwtag  DW_TAG_member
    2343                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2344                      .dwattr $C$DW$165, DW_AT_name("rsvd9")
    2345                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd9")
    2346                      .dwattr $C$DW$165, DW_AT_bit_offset(0x00)
    2347                      .dwattr $C$DW$165, DW_AT_bit_size(0x08)
    2348                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2349                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2350              
    2351              $C$DW$166       .dwtag  DW_TAG_member
    2352                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   45

    2353                      .dwattr $C$DW$166, DW_AT_name("rsvd10")
    2354                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd10")
    2355                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    2356                      .dwattr $C$DW$166, DW_AT_bit_size(0x10)
    2357                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2358                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2359              
    2360                      .dwendtag $C$DW$T$35
    2361              
    2362              
    2363              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2364                      .dwattr $C$DW$T$36, DW_AT_name("CPUSEL3_REG")
    2365                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2366              $C$DW$167       .dwtag  DW_TAG_member
    2367                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    2368                      .dwattr $C$DW$167, DW_AT_name("all")
    2369                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_all")
    2370                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2371                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2372              
    2373              $C$DW$168       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$35)
    2375                      .dwattr $C$DW$168, DW_AT_name("bit")
    2376                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_bit")
    2377                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2378                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2379              
    2380                      .dwendtag $C$DW$T$36
    2381              
    2382              
    2383              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2384                      .dwattr $C$DW$T$37, DW_AT_name("CPUSEL4_BITS")
    2385                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2386              $C$DW$169       .dwtag  DW_TAG_member
    2387                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2388                      .dwattr $C$DW$169, DW_AT_name("SD1")
    2389                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_SD1")
    2390                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0f)
    2391                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2392                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2393                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2394              
    2395              $C$DW$170       .dwtag  DW_TAG_member
    2396                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2397                      .dwattr $C$DW$170, DW_AT_name("SD2")
    2398                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_SD2")
    2399                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0e)
    2400                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2401                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2402                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2403              
    2404              $C$DW$171       .dwtag  DW_TAG_member
    2405                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2406                      .dwattr $C$DW$171, DW_AT_name("rsvd1")
    2407                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   46

    2408                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0d)
    2409                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2410                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2411                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2412              
    2413              $C$DW$172       .dwtag  DW_TAG_member
    2414                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2415                      .dwattr $C$DW$172, DW_AT_name("rsvd2")
    2416                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd2")
    2417                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0c)
    2418                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2419                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2420                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2421              
    2422              $C$DW$173       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2424                      .dwattr $C$DW$173, DW_AT_name("rsvd3")
    2425                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd3")
    2426                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0b)
    2427                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2428                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2429                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2430              
    2431              $C$DW$174       .dwtag  DW_TAG_member
    2432                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2433                      .dwattr $C$DW$174, DW_AT_name("rsvd4")
    2434                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd4")
    2435                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0a)
    2436                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2437                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2438                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2439              
    2440              $C$DW$175       .dwtag  DW_TAG_member
    2441                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2442                      .dwattr $C$DW$175, DW_AT_name("rsvd5")
    2443                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd5")
    2444                      .dwattr $C$DW$175, DW_AT_bit_offset(0x09)
    2445                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2446                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2447                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2448              
    2449              $C$DW$176       .dwtag  DW_TAG_member
    2450                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2451                      .dwattr $C$DW$176, DW_AT_name("rsvd6")
    2452                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd6")
    2453                      .dwattr $C$DW$176, DW_AT_bit_offset(0x08)
    2454                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2455                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2456                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2457              
    2458              $C$DW$177       .dwtag  DW_TAG_member
    2459                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2460                      .dwattr $C$DW$177, DW_AT_name("rsvd7")
    2461                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd7")
    2462                      .dwattr $C$DW$177, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   47

    2463                      .dwattr $C$DW$177, DW_AT_bit_size(0x08)
    2464                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2465                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2466              
    2467              $C$DW$178       .dwtag  DW_TAG_member
    2468                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2469                      .dwattr $C$DW$178, DW_AT_name("rsvd8")
    2470                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd8")
    2471                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00)
    2472                      .dwattr $C$DW$178, DW_AT_bit_size(0x10)
    2473                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2474                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2475              
    2476                      .dwendtag $C$DW$T$37
    2477              
    2478              
    2479              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2480                      .dwattr $C$DW$T$38, DW_AT_name("CPUSEL4_REG")
    2481                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2482              $C$DW$179       .dwtag  DW_TAG_member
    2483                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$21)
    2484                      .dwattr $C$DW$179, DW_AT_name("all")
    2485                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_all")
    2486                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2487                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2488              
    2489              $C$DW$180       .dwtag  DW_TAG_member
    2490                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$37)
    2491                      .dwattr $C$DW$180, DW_AT_name("bit")
    2492                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_bit")
    2493                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2494                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2495              
    2496                      .dwendtag $C$DW$T$38
    2497              
    2498              
    2499              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2500                      .dwattr $C$DW$T$39, DW_AT_name("CPUSEL5_BITS")
    2501                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2502              $C$DW$181       .dwtag  DW_TAG_member
    2503                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2504                      .dwattr $C$DW$181, DW_AT_name("SCI_A")
    2505                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_SCI_A")
    2506                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0f)
    2507                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2508                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2509                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2510              
    2511              $C$DW$182       .dwtag  DW_TAG_member
    2512                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2513                      .dwattr $C$DW$182, DW_AT_name("SCI_B")
    2514                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_SCI_B")
    2515                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0e)
    2516                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2517                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   48

    2518                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2519              
    2520              $C$DW$183       .dwtag  DW_TAG_member
    2521                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2522                      .dwattr $C$DW$183, DW_AT_name("SCI_C")
    2523                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_SCI_C")
    2524                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0d)
    2525                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2526                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2527                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2528              
    2529              $C$DW$184       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2531                      .dwattr $C$DW$184, DW_AT_name("SCI_D")
    2532                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_SCI_D")
    2533                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0c)
    2534                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2535                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2536                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2537              
    2538              $C$DW$185       .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2540                      .dwattr $C$DW$185, DW_AT_name("rsvd1")
    2541                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd1")
    2542                      .dwattr $C$DW$185, DW_AT_bit_offset(0x00)
    2543                      .dwattr $C$DW$185, DW_AT_bit_size(0x0c)
    2544                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2545                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2546              
    2547              $C$DW$186       .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2549                      .dwattr $C$DW$186, DW_AT_name("rsvd2")
    2550                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd2")
    2551                      .dwattr $C$DW$186, DW_AT_bit_offset(0x00)
    2552                      .dwattr $C$DW$186, DW_AT_bit_size(0x10)
    2553                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2554                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2555              
    2556                      .dwendtag $C$DW$T$39
    2557              
    2558              
    2559              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2560                      .dwattr $C$DW$T$40, DW_AT_name("CPUSEL5_REG")
    2561                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2562              $C$DW$187       .dwtag  DW_TAG_member
    2563                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$21)
    2564                      .dwattr $C$DW$187, DW_AT_name("all")
    2565                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_all")
    2566                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2567                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2568              
    2569              $C$DW$188       .dwtag  DW_TAG_member
    2570                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$39)
    2571                      .dwattr $C$DW$188, DW_AT_name("bit")
    2572                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   49

    2573                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2574                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2575              
    2576                      .dwendtag $C$DW$T$40
    2577              
    2578              
    2579              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2580                      .dwattr $C$DW$T$41, DW_AT_name("CPUSEL6_BITS")
    2581                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2582              $C$DW$189       .dwtag  DW_TAG_member
    2583                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2584                      .dwattr $C$DW$189, DW_AT_name("SPI_A")
    2585                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_SPI_A")
    2586                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0f)
    2587                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2588                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2589                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2590              
    2591              $C$DW$190       .dwtag  DW_TAG_member
    2592                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2593                      .dwattr $C$DW$190, DW_AT_name("SPI_B")
    2594                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_SPI_B")
    2595                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0e)
    2596                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2597                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2598                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2599              
    2600              $C$DW$191       .dwtag  DW_TAG_member
    2601                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2602                      .dwattr $C$DW$191, DW_AT_name("SPI_C")
    2603                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_SPI_C")
    2604                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0d)
    2605                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2606                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2607                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2608              
    2609              $C$DW$192       .dwtag  DW_TAG_member
    2610                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2611                      .dwattr $C$DW$192, DW_AT_name("rsvd1")
    2612                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd1")
    2613                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0c)
    2614                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2615                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2616                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2617              
    2618              $C$DW$193       .dwtag  DW_TAG_member
    2619                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2620                      .dwattr $C$DW$193, DW_AT_name("rsvd2")
    2621                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd2")
    2622                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00)
    2623                      .dwattr $C$DW$193, DW_AT_bit_size(0x0c)
    2624                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2625                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2626              
    2627              $C$DW$194       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   50

    2628                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2629                      .dwattr $C$DW$194, DW_AT_name("rsvd3")
    2630                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rsvd3")
    2631                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0f)
    2632                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2633                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2634                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2635              
    2636              $C$DW$195       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2638                      .dwattr $C$DW$195, DW_AT_name("rsvd4")
    2639                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd4")
    2640                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0e)
    2641                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2642                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2643                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2644              
    2645              $C$DW$196       .dwtag  DW_TAG_member
    2646                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2647                      .dwattr $C$DW$196, DW_AT_name("rsvd5")
    2648                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd5")
    2649                      .dwattr $C$DW$196, DW_AT_bit_offset(0x00)
    2650                      .dwattr $C$DW$196, DW_AT_bit_size(0x0e)
    2651                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2652                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2653              
    2654                      .dwendtag $C$DW$T$41
    2655              
    2656              
    2657              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2658                      .dwattr $C$DW$T$42, DW_AT_name("CPUSEL6_REG")
    2659                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2660              $C$DW$197       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    2662                      .dwattr $C$DW$197, DW_AT_name("all")
    2663                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_all")
    2664                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2665                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2666              
    2667              $C$DW$198       .dwtag  DW_TAG_member
    2668                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$41)
    2669                      .dwattr $C$DW$198, DW_AT_name("bit")
    2670                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_bit")
    2671                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2672                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2673              
    2674                      .dwendtag $C$DW$T$42
    2675              
    2676              
    2677              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2678                      .dwattr $C$DW$T$43, DW_AT_name("CPUSEL7_BITS")
    2679                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2680              $C$DW$199       .dwtag  DW_TAG_member
    2681                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2682                      .dwattr $C$DW$199, DW_AT_name("I2C_A")
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   51

    2683                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_I2C_A")
    2684                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0f)
    2685                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2686                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2687                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2688              
    2689              $C$DW$200       .dwtag  DW_TAG_member
    2690                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2691                      .dwattr $C$DW$200, DW_AT_name("I2C_B")
    2692                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_I2C_B")
    2693                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0e)
    2694                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2695                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2696                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2697              
    2698              $C$DW$201       .dwtag  DW_TAG_member
    2699                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2700                      .dwattr $C$DW$201, DW_AT_name("rsvd1")
    2701                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd1")
    2702                      .dwattr $C$DW$201, DW_AT_bit_offset(0x00)
    2703                      .dwattr $C$DW$201, DW_AT_bit_size(0x0e)
    2704                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2705                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2706              
    2707              $C$DW$202       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2709                      .dwattr $C$DW$202, DW_AT_name("rsvd2")
    2710                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rsvd2")
    2711                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0f)
    2712                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2713                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2714                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2715              
    2716              $C$DW$203       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2718                      .dwattr $C$DW$203, DW_AT_name("rsvd3")
    2719                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd3")
    2720                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0e)
    2721                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2722                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2723                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2724              
    2725              $C$DW$204       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2727                      .dwattr $C$DW$204, DW_AT_name("rsvd4")
    2728                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd4")
    2729                      .dwattr $C$DW$204, DW_AT_bit_offset(0x00)
    2730                      .dwattr $C$DW$204, DW_AT_bit_size(0x0e)
    2731                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2732                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2733              
    2734                      .dwendtag $C$DW$T$43
    2735              
    2736              
    2737              $C$DW$T$44      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   52

    2738                      .dwattr $C$DW$T$44, DW_AT_name("CPUSEL7_REG")
    2739                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2740              $C$DW$205       .dwtag  DW_TAG_member
    2741                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$21)
    2742                      .dwattr $C$DW$205, DW_AT_name("all")
    2743                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_all")
    2744                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2745                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2746              
    2747              $C$DW$206       .dwtag  DW_TAG_member
    2748                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$43)
    2749                      .dwattr $C$DW$206, DW_AT_name("bit")
    2750                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_bit")
    2751                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2752                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2753              
    2754                      .dwendtag $C$DW$T$44
    2755              
    2756              
    2757              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2758                      .dwattr $C$DW$T$45, DW_AT_name("CPUSEL8_BITS")
    2759                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2760              $C$DW$207       .dwtag  DW_TAG_member
    2761                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2762                      .dwattr $C$DW$207, DW_AT_name("CAN_A")
    2763                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_CAN_A")
    2764                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0f)
    2765                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2766                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2767                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2768              
    2769              $C$DW$208       .dwtag  DW_TAG_member
    2770                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2771                      .dwattr $C$DW$208, DW_AT_name("CAN_B")
    2772                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_CAN_B")
    2773                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0e)
    2774                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2775                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2776                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2777              
    2778              $C$DW$209       .dwtag  DW_TAG_member
    2779                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2780                      .dwattr $C$DW$209, DW_AT_name("rsvd1")
    2781                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_rsvd1")
    2782                      .dwattr $C$DW$209, DW_AT_bit_offset(0x0d)
    2783                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2784                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2785                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2786              
    2787              $C$DW$210       .dwtag  DW_TAG_member
    2788                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2789                      .dwattr $C$DW$210, DW_AT_name("rsvd2")
    2790                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd2")
    2791                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0c)
    2792                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Oct  7 22:14:20 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   53

    2793                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2794                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2795              
    2796              $C$DW$211       .dwtag  DW_TAG_member
    2797                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2798                      .dwattr $C$DW$211, DW_AT_name("rsvd3")
    2799                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd3")
    2800                      .dwattr $C$DW$211, DW_AT_bit_offset(0x00)
    2801                      .dwattr $C$DW$211, DW_AT_bit_size(0x0c)
    2802                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2803                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2804              
    2805              $C$DW$212       .dwtag  DW_TAG_member
    2806                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2807                      .dwattr $C$DW$212, DW_AT_name("rsvd4")
    2808                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd4")
    2809                      .dwattr $C$DW$212, DW_AT_bit_offset(0x00)
    2810                      .dwattr $C$DW$212, DW_AT_bit_size(0x10)
    2811                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2812                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2813              
    2814                      .dwendtag $C$DW$T$45
    2815              
    2816              
    2817              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2818                      .dwattr $C$DW$T$46, DW_AT_name("CPUSEL8_REG")
    2819                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2820              $C$DW$213       .dwtag  DW_TAG_member
    2821                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$21)
    2822                      .dwattr $C$DW$213, DW_AT_name("all")
    2823                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_all")
    2824                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2825                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2826              
    2827              $C$DW$214       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$45)
    2829                      .dwattr $C$DW$214, DW_AT_name("bit")
    2830                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_bit")
