TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Mon Dec  7 23:59:24 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\hakan\OneDrive\Belgeler\GitHub\fault_tolerant_drives\Softw
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("AdcaRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_AdcaRegs")

     445                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     446 000000cc CDA2          AND       AH,AR2,#0x0001        ; [CPU_ALU] |44| 
         000000cd 0001 
     447 000000ce FF96          LSL       AH,7                  ; [CPU_ALU] |44| 
     448 000000cf CC01!         AND       AL,@$BLOCKED(_AdcaRegs)+1,#0xff7f ; [CPU_FPU] |44| 
         000000d0 FF7F 
     449 000000d1 CBA9          OR        AH,AL                 ; [CPU_ALU] |44| 
     450 000000d2 9701!         MOV       @$BLOCKED(_AdcaRegs)+1,AH ; [CPU_ALU] |44| 
     451                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     452 000000d3 7E3B!         MOV       @$BLOCKED(_AdcaRegs)+59,AR6 ; [CPU_ALU] |45| 
     453 000000d4 92A1          MOV       AL,AR1                ; [CPU_ALU] |45| 
     454                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     455 000000d5 600F          B         $C$L10,NEQ            ; [CPU_ALU] |46| 
     456                      ; branchcc occurs ; [] |46| 
     457 000000d6 761F!         MOVW      DP,#_AdcaRegs+112     ; [CPU_ARAU] 
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   10

         000000d7 0001 
     458                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     459 000000d8 0630!         MOVL      ACC,@$BLOCKED(_AdcaRegs)+112 ; [CPU_ALU] |49| 
     460 000000d9 9000          ANDB      AL,#0                 ; [CPU_ALU] |49| 
     461 000000da 1E30!         MOVL      @$BLOCKED(_AdcaRegs)+112,ACC ; [CPU_ALU] |49| 
     462                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     463 000000db 0632!         MOVL      ACC,@$BLOCKED(_AdcaRegs)+114 ; [CPU_ALU] |50| 
     464 000000dc 9000          ANDB      AL,#0                 ; [CPU_ALU] |50| 
     465 000000dd 1E32!         MOVL      @$BLOCKED(_AdcaRegs)+114,ACC ; [CPU_ALU] |50| 
     466                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     467 000000de 0636!         MOVL      ACC,@$BLOCKED(_AdcaRegs)+118 ; [CPU_ALU] |51| 
     468 000000df 9000          ANDB      AL,#0                 ; [CPU_ALU] |51| 
     469 000000e0 1E36!         MOVL      @$BLOCKED(_AdcaRegs)+118,ACC ; [CPU_ALU] |51| 
     470                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     471 000000e1 0638!         MOVL      ACC,@$BLOCKED(_AdcaRegs)+120 ; [CPU_ALU] |52| 
     472 000000e2 9000          ANDB      AL,#0                 ; [CPU_ALU] |52| 
     473 000000e3 1E38!         MOVL      @$BLOCKED(_AdcaRegs)+120,ACC ; [CPU_ALU] |52| 
     474 000000e4       $C$L10:    
     475 000000e4 82BE          MOVL      XAR3,*--SP            ; [CPU_ALU] 
     476                      .dwcfi  cfa_offset, -6
     477                      .dwcfi  restore_reg, 11
     478 000000e5 86BE          MOVL      XAR2,*--SP            ; [CPU_ALU] 
     479                      .dwcfi  cfa_offset, -4
     480                      .dwcfi  restore_reg, 9
     481 000000e6 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     482                      .dwcfi  cfa_offset, -2
     483                      .dwcfi  restore_reg, 7
     484              $C$DW$22        .dwtag  DW_TAG_TI_branch
     485                      .dwattr $C$DW$22, DW_AT_low_pc(0x00)
     486                      .dwattr $C$DW$22, DW_AT_TI_return
     487              
     488 000000e7 0006          LRETR     ; [CPU_ALU] 
     489                      ; return occurs ; [] 
     490                      .dwattr $C$DW$12, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/so
     491                      .dwattr $C$DW$12, DW_AT_TI_end_line(0x5f)
     492                      .dwattr $C$DW$12, DW_AT_TI_end_column(0x01)
     493                      .dwendentry
     494                      .dwendtag $C$DW$12
     495              
     496              ;**************************************************************
     497              ;* UNDEFINED EXTERNAL REFERENCES                              *
     498              ;**************************************************************
     499                      .global _AdcaRegs
     500                      .global _AdcbRegs
     501                      .global _AdccRegs
     502                      .global _AdcdRegs
     503              
     504              ;***************************************************************
     505              ;* TYPE INFORMATION                                            *
     506              ;***************************************************************
     507              
     508              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     509                      .dwattr $C$DW$T$20, DW_AT_name("ADCBURSTCTL_BITS")
     510                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     511              $C$DW$23        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   11

     512                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     513                      .dwattr $C$DW$23, DW_AT_name("BURSTTRIGSEL")
     514                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
     515                      .dwattr $C$DW$23, DW_AT_bit_offset(0x0a)
     516                      .dwattr $C$DW$23, DW_AT_bit_size(0x06)
     517                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     518                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     519              
     520              $C$DW$24        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     522                      .dwattr $C$DW$24, DW_AT_name("rsvd1")
     523                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_rsvd1")
     524                      .dwattr $C$DW$24, DW_AT_bit_offset(0x08)
     525                      .dwattr $C$DW$24, DW_AT_bit_size(0x02)
     526                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     527                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     528              
     529              $C$DW$25        .dwtag  DW_TAG_member
     530                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     531                      .dwattr $C$DW$25, DW_AT_name("BURSTSIZE")
     532                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_BURSTSIZE")
     533                      .dwattr $C$DW$25, DW_AT_bit_offset(0x04)
     534                      .dwattr $C$DW$25, DW_AT_bit_size(0x04)
     535                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     536                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     537              
     538              $C$DW$26        .dwtag  DW_TAG_member
     539                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     540                      .dwattr $C$DW$26, DW_AT_name("rsvd2")
     541                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd2")
     542                      .dwattr $C$DW$26, DW_AT_bit_offset(0x01)
     543                      .dwattr $C$DW$26, DW_AT_bit_size(0x03)
     544                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     545                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     546              
     547              $C$DW$27        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     549                      .dwattr $C$DW$27, DW_AT_name("BURSTEN")
     550                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_BURSTEN")
     551                      .dwattr $C$DW$27, DW_AT_bit_offset(0x00)
     552                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     553                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     555              
     556                      .dwendtag $C$DW$T$20
     557              
     558              
     559              $C$DW$T$21      .dwtag  DW_TAG_union_type
     560                      .dwattr $C$DW$T$21, DW_AT_name("ADCBURSTCTL_REG")
     561                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     562              $C$DW$28        .dwtag  DW_TAG_member
     563                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     564                      .dwattr $C$DW$28, DW_AT_name("all")
     565                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_all")
     566                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   12

     567                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     568              
     569              $C$DW$29        .dwtag  DW_TAG_member
     570                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$20)
     571                      .dwattr $C$DW$29, DW_AT_name("bit")
     572                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_bit")
     573                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     574                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     575              
     576                      .dwendtag $C$DW$T$21
     577              
     578              
     579              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     580                      .dwattr $C$DW$T$22, DW_AT_name("ADCCOUNTER_BITS")
     581                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     582              $C$DW$30        .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     584                      .dwattr $C$DW$30, DW_AT_name("FREECOUNT")
     585                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_FREECOUNT")
     586                      .dwattr $C$DW$30, DW_AT_bit_offset(0x04)
     587                      .dwattr $C$DW$30, DW_AT_bit_size(0x0c)
     588                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     589                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     590              
     591              $C$DW$31        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     593                      .dwattr $C$DW$31, DW_AT_name("rsvd1")
     594                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd1")
     595                      .dwattr $C$DW$31, DW_AT_bit_offset(0x00)
     596                      .dwattr $C$DW$31, DW_AT_bit_size(0x04)
     597                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     598                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     599              
     600                      .dwendtag $C$DW$T$22
     601              
     602              
     603              $C$DW$T$23      .dwtag  DW_TAG_union_type
     604                      .dwattr $C$DW$T$23, DW_AT_name("ADCCOUNTER_REG")
     605                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     606              $C$DW$32        .dwtag  DW_TAG_member
     607                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     608                      .dwattr $C$DW$32, DW_AT_name("all")
     609                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_all")
     610                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     611                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     612              
     613              $C$DW$33        .dwtag  DW_TAG_member
     614                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$22)
     615                      .dwattr $C$DW$33, DW_AT_name("bit")
     616                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_bit")
     617                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     618                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     619              
     620                      .dwendtag $C$DW$T$23
     621              
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   13

     622              
     623              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     624                      .dwattr $C$DW$T$24, DW_AT_name("ADCCTL1_BITS")
     625                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     626              $C$DW$34        .dwtag  DW_TAG_member
     627                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     628                      .dwattr $C$DW$34, DW_AT_name("rsvd1")
     629                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd1")
     630                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0e)
     631                      .dwattr $C$DW$34, DW_AT_bit_size(0x02)
     632                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     633                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     634              
     635              $C$DW$35        .dwtag  DW_TAG_member
     636                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     637                      .dwattr $C$DW$35, DW_AT_name("INTPULSEPOS")
     638                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_INTPULSEPOS")
     639                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0d)
     640                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     641                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     642                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     643              
     644              $C$DW$36        .dwtag  DW_TAG_member
     645                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     646                      .dwattr $C$DW$36, DW_AT_name("rsvd2")
     647                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd2")
     648                      .dwattr $C$DW$36, DW_AT_bit_offset(0x09)
     649                      .dwattr $C$DW$36, DW_AT_bit_size(0x04)
     650                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     651                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     652              
     653              $C$DW$37        .dwtag  DW_TAG_member
     654                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     655                      .dwattr $C$DW$37, DW_AT_name("ADCPWDNZ")
     656                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_ADCPWDNZ")
     657                      .dwattr $C$DW$37, DW_AT_bit_offset(0x08)
     658                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     659                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     660                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     661              
     662              $C$DW$38        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     664                      .dwattr $C$DW$38, DW_AT_name("ADCBSYCHN")
     665                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_ADCBSYCHN")
     666                      .dwattr $C$DW$38, DW_AT_bit_offset(0x04)
     667                      .dwattr $C$DW$38, DW_AT_bit_size(0x04)
     668                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     669                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     670              
     671              $C$DW$39        .dwtag  DW_TAG_member
     672                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     673                      .dwattr $C$DW$39, DW_AT_name("rsvd3")
     674                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd3")
     675                      .dwattr $C$DW$39, DW_AT_bit_offset(0x03)
     676                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   14

     677                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     678                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     679              
     680              $C$DW$40        .dwtag  DW_TAG_member
     681                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     682                      .dwattr $C$DW$40, DW_AT_name("ADCBSY")
     683                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_ADCBSY")
     684                      .dwattr $C$DW$40, DW_AT_bit_offset(0x02)
     685                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     686                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     687                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     688              
     689              $C$DW$41        .dwtag  DW_TAG_member
     690                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     691                      .dwattr $C$DW$41, DW_AT_name("rsvd4")
     692                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd4")
     693                      .dwattr $C$DW$41, DW_AT_bit_offset(0x00)
     694                      .dwattr $C$DW$41, DW_AT_bit_size(0x02)
     695                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     696                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     697              
     698                      .dwendtag $C$DW$T$24
     699              
     700              
     701              $C$DW$T$25      .dwtag  DW_TAG_union_type
     702                      .dwattr $C$DW$T$25, DW_AT_name("ADCCTL1_REG")
     703                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     704              $C$DW$42        .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     706                      .dwattr $C$DW$42, DW_AT_name("all")
     707                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_all")
     708                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     709                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     710              
     711              $C$DW$43        .dwtag  DW_TAG_member
     712                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$24)
     713                      .dwattr $C$DW$43, DW_AT_name("bit")
     714                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_bit")
     715                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     716                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     717              
     718                      .dwendtag $C$DW$T$25
     719              
     720              
     721              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     722                      .dwattr $C$DW$T$26, DW_AT_name("ADCCTL2_BITS")
     723                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     724              $C$DW$44        .dwtag  DW_TAG_member
     725                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     726                      .dwattr $C$DW$44, DW_AT_name("PRESCALE")
     727                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_PRESCALE")
     728                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0c)
     729                      .dwattr $C$DW$44, DW_AT_bit_size(0x04)
     730                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     731                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   15

     732              
     733              $C$DW$45        .dwtag  DW_TAG_member
     734                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     735                      .dwattr $C$DW$45, DW_AT_name("rsvd1")
     736                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_rsvd1")
     737                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0a)
     738                      .dwattr $C$DW$45, DW_AT_bit_size(0x02)
     739                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     740                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     741              
     742              $C$DW$46        .dwtag  DW_TAG_member
     743                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     744                      .dwattr $C$DW$46, DW_AT_name("RESOLUTION")
     745                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_RESOLUTION")
     746                      .dwattr $C$DW$46, DW_AT_bit_offset(0x09)
     747                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     748                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     749                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     750              
     751              $C$DW$47        .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     753                      .dwattr $C$DW$47, DW_AT_name("SIGNALMODE")
     754                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_SIGNALMODE")
     755                      .dwattr $C$DW$47, DW_AT_bit_offset(0x08)
     756                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     757                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     758                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     759              
     760              $C$DW$48        .dwtag  DW_TAG_member
     761                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     762                      .dwattr $C$DW$48, DW_AT_name("rsvd2")
     763                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_rsvd2")
     764                      .dwattr $C$DW$48, DW_AT_bit_offset(0x03)
     765                      .dwattr $C$DW$48, DW_AT_bit_size(0x05)
     766                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     767                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     768              
     769              $C$DW$49        .dwtag  DW_TAG_member
     770                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     771                      .dwattr $C$DW$49, DW_AT_name("rsvd3")
     772                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd3")
     773                      .dwattr $C$DW$49, DW_AT_bit_offset(0x00)
     774                      .dwattr $C$DW$49, DW_AT_bit_size(0x03)
     775                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     776                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     777              
     778                      .dwendtag $C$DW$T$26
     779              
     780              
     781              $C$DW$T$27      .dwtag  DW_TAG_union_type
     782                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL2_REG")
     783                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     784              $C$DW$50        .dwtag  DW_TAG_member
     785                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     786                      .dwattr $C$DW$50, DW_AT_name("all")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   16

     787                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_all")
     788                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     789                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     790              
     791              $C$DW$51        .dwtag  DW_TAG_member
     792                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$26)
     793                      .dwattr $C$DW$51, DW_AT_name("bit")
     794                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_bit")
     795                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     796                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     797              
     798                      .dwendtag $C$DW$T$27
     799              
     800              
     801              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     802                      .dwattr $C$DW$T$28, DW_AT_name("ADCEVTCLR_BITS")
     803                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     804              $C$DW$52        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     806                      .dwattr $C$DW$52, DW_AT_name("PPB1TRIPHI")
     807                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     808                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0f)
     809                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     810                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     811                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     812              
     813              $C$DW$53        .dwtag  DW_TAG_member
     814                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     815                      .dwattr $C$DW$53, DW_AT_name("PPB1TRIPLO")
     816                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     817                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0e)
     818                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     819                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     820                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     821              
     822              $C$DW$54        .dwtag  DW_TAG_member
     823                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     824                      .dwattr $C$DW$54, DW_AT_name("PPB1ZERO")
     825                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PPB1ZERO")
     826                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0d)
     827                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     828                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     829                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     830              
     831              $C$DW$55        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     833                      .dwattr $C$DW$55, DW_AT_name("rsvd1")
     834                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd1")
     835                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0c)
     836                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     837                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     838                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     839              
     840              $C$DW$56        .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   17

     842                      .dwattr $C$DW$56, DW_AT_name("PPB2TRIPHI")
     843                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_PPB2TRIPHI")
     844                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0b)
     845                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     846                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     847                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     848              
     849              $C$DW$57        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     851                      .dwattr $C$DW$57, DW_AT_name("PPB2TRIPLO")
     852                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_PPB2TRIPLO")
     853                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0a)
     854                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     855                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     856                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     857              
     858              $C$DW$58        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     860                      .dwattr $C$DW$58, DW_AT_name("PPB2ZERO")
     861                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_PPB2ZERO")
     862                      .dwattr $C$DW$58, DW_AT_bit_offset(0x09)
     863                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     864                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     865                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     866              
     867              $C$DW$59        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     869                      .dwattr $C$DW$59, DW_AT_name("rsvd2")
     870                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd2")
     871                      .dwattr $C$DW$59, DW_AT_bit_offset(0x08)
     872                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     873                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     874                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     875              
     876              $C$DW$60        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     878                      .dwattr $C$DW$60, DW_AT_name("PPB3TRIPHI")
     879                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PPB3TRIPHI")
     880                      .dwattr $C$DW$60, DW_AT_bit_offset(0x07)
     881                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     882                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     883                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     884              
     885              $C$DW$61        .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     887                      .dwattr $C$DW$61, DW_AT_name("PPB3TRIPLO")
     888                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PPB3TRIPLO")
     889                      .dwattr $C$DW$61, DW_AT_bit_offset(0x06)
     890                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     891                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     893              
     894              $C$DW$62        .dwtag  DW_TAG_member
     895                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     896                      .dwattr $C$DW$62, DW_AT_name("PPB3ZERO")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   18

     897                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PPB3ZERO")
     898                      .dwattr $C$DW$62, DW_AT_bit_offset(0x05)
     899                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     900                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     901                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     902              
     903              $C$DW$63        .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     905                      .dwattr $C$DW$63, DW_AT_name("rsvd3")
     906                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd3")
     907                      .dwattr $C$DW$63, DW_AT_bit_offset(0x04)
     908                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     909                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     910                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     911              
     912              $C$DW$64        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     914                      .dwattr $C$DW$64, DW_AT_name("PPB4TRIPHI")
     915                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PPB4TRIPHI")
     916                      .dwattr $C$DW$64, DW_AT_bit_offset(0x03)
     917                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     918                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     919                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     920              
     921              $C$DW$65        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     923                      .dwattr $C$DW$65, DW_AT_name("PPB4TRIPLO")
     924                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_PPB4TRIPLO")
     925                      .dwattr $C$DW$65, DW_AT_bit_offset(0x02)
     926                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     927                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     928                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     929              
     930              $C$DW$66        .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     932                      .dwattr $C$DW$66, DW_AT_name("PPB4ZERO")
     933                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_PPB4ZERO")
     934                      .dwattr $C$DW$66, DW_AT_bit_offset(0x01)
     935                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     936                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     937                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     938              
     939              $C$DW$67        .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     941                      .dwattr $C$DW$67, DW_AT_name("rsvd4")
     942                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_rsvd4")
     943                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
     944                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     945                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     946                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     947              
     948                      .dwendtag $C$DW$T$28
     949              
     950              
     951              $C$DW$T$29      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   19

     952                      .dwattr $C$DW$T$29, DW_AT_name("ADCEVTCLR_REG")
     953                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     954              $C$DW$68        .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     956                      .dwattr $C$DW$68, DW_AT_name("all")
     957                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_all")
     958                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     959                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     960              
     961              $C$DW$69        .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$28)
     963                      .dwattr $C$DW$69, DW_AT_name("bit")
     964                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_bit")
     965                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     967              
     968                      .dwendtag $C$DW$T$29
     969              
     970              
     971              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     972                      .dwattr $C$DW$T$30, DW_AT_name("ADCEVTINTSEL_BITS")
     973                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     974              $C$DW$70        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$70, DW_AT_name("PPB1TRIPHI")
     977                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     978                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0f)
     979                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     980                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     982              
     983              $C$DW$71        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$71, DW_AT_name("PPB1TRIPLO")
     986                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     987                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0e)
     988                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     989                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     990                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     991              
     992              $C$DW$72        .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     994                      .dwattr $C$DW$72, DW_AT_name("PPB1ZERO")
     995                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_PPB1ZERO")
     996                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0d)
     997                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     998                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1000              
    1001              $C$DW$73        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$73, DW_AT_name("rsvd1")
    1004                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd1")
    1005                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0c)
    1006                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   20

    1007                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1008                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1009              
    1010              $C$DW$74        .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$74, DW_AT_name("PPB2TRIPHI")
    1013                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1014                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0b)
    1015                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1016                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1018              
    1019              $C$DW$75        .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1021                      .dwattr $C$DW$75, DW_AT_name("PPB2TRIPLO")
    1022                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1023                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0a)
    1024                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1025                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1026                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1027              
    1028              $C$DW$76        .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1030                      .dwattr $C$DW$76, DW_AT_name("PPB2ZERO")
    1031                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_PPB2ZERO")
    1032                      .dwattr $C$DW$76, DW_AT_bit_offset(0x09)
    1033                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1034                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1036              
    1037              $C$DW$77        .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$77, DW_AT_name("rsvd2")
    1040                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd2")
    1041                      .dwattr $C$DW$77, DW_AT_bit_offset(0x08)
    1042                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1043                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1045              
    1046              $C$DW$78        .dwtag  DW_TAG_member
    1047                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1048                      .dwattr $C$DW$78, DW_AT_name("PPB3TRIPHI")
    1049                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1050                      .dwattr $C$DW$78, DW_AT_bit_offset(0x07)
    1051                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1052                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1054              
    1055              $C$DW$79        .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$79, DW_AT_name("PPB3TRIPLO")
    1058                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1059                      .dwattr $C$DW$79, DW_AT_bit_offset(0x06)
    1060                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1061                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   21

    1062                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1063              
    1064              $C$DW$80        .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1066                      .dwattr $C$DW$80, DW_AT_name("PPB3ZERO")
    1067                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_PPB3ZERO")
    1068                      .dwattr $C$DW$80, DW_AT_bit_offset(0x05)
    1069                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1070                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1071                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1072              
    1073              $C$DW$81        .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1075                      .dwattr $C$DW$81, DW_AT_name("rsvd3")
    1076                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd3")
    1077                      .dwattr $C$DW$81, DW_AT_bit_offset(0x04)
    1078                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1079                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1081              
    1082              $C$DW$82        .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1084                      .dwattr $C$DW$82, DW_AT_name("PPB4TRIPHI")
    1085                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1086                      .dwattr $C$DW$82, DW_AT_bit_offset(0x03)
    1087                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1088                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1090              
    1091              $C$DW$83        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$83, DW_AT_name("PPB4TRIPLO")
    1094                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1095                      .dwattr $C$DW$83, DW_AT_bit_offset(0x02)
    1096                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1097                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1099              
    1100              $C$DW$84        .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$84, DW_AT_name("PPB4ZERO")
    1103                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_PPB4ZERO")
    1104                      .dwattr $C$DW$84, DW_AT_bit_offset(0x01)
    1105                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1106                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1107                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109              $C$DW$85        .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$85, DW_AT_name("rsvd4")
    1112                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd4")
    1113                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
    1114                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1115                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1116                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   22

    1117              
    1118                      .dwendtag $C$DW$T$30
    1119              
    1120              
    1121              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1122                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTINTSEL_REG")
    1123                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1124              $C$DW$86        .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1126                      .dwattr $C$DW$86, DW_AT_name("all")
    1127                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
    1128                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1129                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1130              
    1131              $C$DW$87        .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$30)
    1133                      .dwattr $C$DW$87, DW_AT_name("bit")
    1134                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
    1135                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1137              
    1138                      .dwendtag $C$DW$T$31
    1139              
    1140              
    1141              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1142                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTSEL_BITS")
    1143                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1144              $C$DW$88        .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1146                      .dwattr $C$DW$88, DW_AT_name("PPB1TRIPHI")
    1147                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1148                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0f)
    1149                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1150                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1151                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1152              
    1153              $C$DW$89        .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1155                      .dwattr $C$DW$89, DW_AT_name("PPB1TRIPLO")
    1156                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1157                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0e)
    1158                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1159                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1160                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1161              
    1162              $C$DW$90        .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1164                      .dwattr $C$DW$90, DW_AT_name("PPB1ZERO")
    1165                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_PPB1ZERO")
    1166                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0d)
    1167                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1168                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1170              
    1171              $C$DW$91        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   23

    1172                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$91, DW_AT_name("rsvd1")
    1174                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd1")
    1175                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0c)
    1176                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1177                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1179              
    1180              $C$DW$92        .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1182                      .dwattr $C$DW$92, DW_AT_name("PPB2TRIPHI")
    1183                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1184                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0b)
    1185                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1186                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1188              
    1189              $C$DW$93        .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1191                      .dwattr $C$DW$93, DW_AT_name("PPB2TRIPLO")
    1192                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1193                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0a)
    1194                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1195                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1196                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1197              
    1198              $C$DW$94        .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1200                      .dwattr $C$DW$94, DW_AT_name("PPB2ZERO")
    1201                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_PPB2ZERO")
    1202                      .dwattr $C$DW$94, DW_AT_bit_offset(0x09)
    1203                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1204                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1205                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207              $C$DW$95        .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1209                      .dwattr $C$DW$95, DW_AT_name("rsvd2")
    1210                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd2")
    1211                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08)
    1212                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1213                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1214                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1215              
    1216              $C$DW$96        .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1218                      .dwattr $C$DW$96, DW_AT_name("PPB3TRIPHI")
    1219                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1220                      .dwattr $C$DW$96, DW_AT_bit_offset(0x07)
    1221                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1222                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1224              
    1225              $C$DW$97        .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   24

    1227                      .dwattr $C$DW$97, DW_AT_name("PPB3TRIPLO")
    1228                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1229                      .dwattr $C$DW$97, DW_AT_bit_offset(0x06)
    1230                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1231                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1232                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1233              
    1234              $C$DW$98        .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1236                      .dwattr $C$DW$98, DW_AT_name("PPB3ZERO")
    1237                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_PPB3ZERO")
    1238                      .dwattr $C$DW$98, DW_AT_bit_offset(0x05)
    1239                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1240                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1242              
    1243              $C$DW$99        .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1245                      .dwattr $C$DW$99, DW_AT_name("rsvd3")
    1246                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd3")
    1247                      .dwattr $C$DW$99, DW_AT_bit_offset(0x04)
    1248                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1249                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1250                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1251              
    1252              $C$DW$100       .dwtag  DW_TAG_member
    1253                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1254                      .dwattr $C$DW$100, DW_AT_name("PPB4TRIPHI")
    1255                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1256                      .dwattr $C$DW$100, DW_AT_bit_offset(0x03)
    1257                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1258                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1259                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1260              
    1261              $C$DW$101       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1263                      .dwattr $C$DW$101, DW_AT_name("PPB4TRIPLO")
    1264                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1265                      .dwattr $C$DW$101, DW_AT_bit_offset(0x02)
    1266                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1267                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1268                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1269              
    1270              $C$DW$102       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$102, DW_AT_name("PPB4ZERO")
    1273                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_PPB4ZERO")
    1274                      .dwattr $C$DW$102, DW_AT_bit_offset(0x01)
    1275                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1276                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1278              
    1279              $C$DW$103       .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1281                      .dwattr $C$DW$103, DW_AT_name("rsvd4")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   25

    1282                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd4")
    1283                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1284                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1285                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1287              
    1288                      .dwendtag $C$DW$T$32
    1289              
    1290              
    1291              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1292                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTSEL_REG")
    1293                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1294              $C$DW$104       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1296                      .dwattr $C$DW$104, DW_AT_name("all")
    1297                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
    1298                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1299                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1300              
    1301              $C$DW$105       .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$32)
    1303                      .dwattr $C$DW$105, DW_AT_name("bit")
    1304                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
    1305                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1307              
    1308                      .dwendtag $C$DW$T$33
    1309              
    1310              
    1311              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1312                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTSTAT_BITS")
    1313                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1314              $C$DW$106       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1316                      .dwattr $C$DW$106, DW_AT_name("PPB1TRIPHI")
    1317                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1318                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0f)
    1319                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1320                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1321                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1322              
    1323              $C$DW$107       .dwtag  DW_TAG_member
    1324                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1325                      .dwattr $C$DW$107, DW_AT_name("PPB1TRIPLO")
    1326                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1327                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0e)
    1328                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1329                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1331              
    1332              $C$DW$108       .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1334                      .dwattr $C$DW$108, DW_AT_name("PPB1ZERO")
    1335                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_PPB1ZERO")
    1336                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0d)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   26

    1337                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1338                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1340              
    1341              $C$DW$109       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
    1344                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
    1345                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0c)
    1346                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1347                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1349              
    1350              $C$DW$110       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1352                      .dwattr $C$DW$110, DW_AT_name("PPB2TRIPHI")
    1353                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1354                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0b)
    1355                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1356                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1358              
    1359              $C$DW$111       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1361                      .dwattr $C$DW$111, DW_AT_name("PPB2TRIPLO")
    1362                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1363                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a)
    1364                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1365                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1367              
    1368              $C$DW$112       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1370                      .dwattr $C$DW$112, DW_AT_name("PPB2ZERO")
    1371                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PPB2ZERO")
    1372                      .dwattr $C$DW$112, DW_AT_bit_offset(0x09)
    1373                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1374                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1376              
    1377              $C$DW$113       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1379                      .dwattr $C$DW$113, DW_AT_name("rsvd2")
    1380                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd2")
    1381                      .dwattr $C$DW$113, DW_AT_bit_offset(0x08)
    1382                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1383                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1385              
    1386              $C$DW$114       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1388                      .dwattr $C$DW$114, DW_AT_name("PPB3TRIPHI")
    1389                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1390                      .dwattr $C$DW$114, DW_AT_bit_offset(0x07)
    1391                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   27

    1392                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395              $C$DW$115       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$115, DW_AT_name("PPB3TRIPLO")
    1398                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1399                      .dwattr $C$DW$115, DW_AT_bit_offset(0x06)
    1400                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1401                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1403              
    1404              $C$DW$116       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1406                      .dwattr $C$DW$116, DW_AT_name("PPB3ZERO")
    1407                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_PPB3ZERO")
    1408                      .dwattr $C$DW$116, DW_AT_bit_offset(0x05)
    1409                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1410                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$117       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$117, DW_AT_name("rsvd3")
    1416                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd3")
    1417                      .dwattr $C$DW$117, DW_AT_bit_offset(0x04)
    1418                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1419                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1420                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1421              
    1422              $C$DW$118       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1424                      .dwattr $C$DW$118, DW_AT_name("PPB4TRIPHI")
    1425                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1426                      .dwattr $C$DW$118, DW_AT_bit_offset(0x03)
    1427                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1428                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1429                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1430              
    1431              $C$DW$119       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1433                      .dwattr $C$DW$119, DW_AT_name("PPB4TRIPLO")
    1434                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1435                      .dwattr $C$DW$119, DW_AT_bit_offset(0x02)
    1436                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1437                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440              $C$DW$120       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1442                      .dwattr $C$DW$120, DW_AT_name("PPB4ZERO")
    1443                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_PPB4ZERO")
    1444                      .dwattr $C$DW$120, DW_AT_bit_offset(0x01)
    1445                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1446                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   28

    1447                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1448              
    1449              $C$DW$121       .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1451                      .dwattr $C$DW$121, DW_AT_name("rsvd4")
    1452                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd4")
    1453                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1454                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1455                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1456                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1457              
    1458                      .dwendtag $C$DW$T$34
    1459              
    1460              
    1461              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1462                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSTAT_REG")
    1463                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1464              $C$DW$122       .dwtag  DW_TAG_member
    1465                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1466                      .dwattr $C$DW$122, DW_AT_name("all")
    1467                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1468                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1469                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1470              
    1471              $C$DW$123       .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$34)
    1473                      .dwattr $C$DW$123, DW_AT_name("bit")
    1474                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1475                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1477              
    1478                      .dwendtag $C$DW$T$35
    1479              
    1480              
    1481              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1482                      .dwattr $C$DW$T$36, DW_AT_name("ADCINTFLGCLR_BITS")
    1483                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1484              $C$DW$124       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$124, DW_AT_name("ADCINT1")
    1487                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_ADCINT1")
    1488                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f)
    1489                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1490                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1492              
    1493              $C$DW$125       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1495                      .dwattr $C$DW$125, DW_AT_name("ADCINT2")
    1496                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_ADCINT2")
    1497                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e)
    1498                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1499                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1501              
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   29

    1502              $C$DW$126       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1504                      .dwattr $C$DW$126, DW_AT_name("ADCINT3")
    1505                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_ADCINT3")
    1506                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0d)
    1507                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1508                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1510              
    1511              $C$DW$127       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1513                      .dwattr $C$DW$127, DW_AT_name("ADCINT4")
    1514                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ADCINT4")
    1515                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0c)
    1516                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1517                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1519              
    1520              $C$DW$128       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1522                      .dwattr $C$DW$128, DW_AT_name("rsvd1")
    1523                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd1")
    1524                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00)
    1525                      .dwattr $C$DW$128, DW_AT_bit_size(0x0c)
    1526                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1528              
    1529                      .dwendtag $C$DW$T$36
    1530              
    1531              
    1532              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1533                      .dwattr $C$DW$T$37, DW_AT_name("ADCINTFLGCLR_REG")
    1534                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1535              $C$DW$129       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1537                      .dwattr $C$DW$129, DW_AT_name("all")
    1538                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_all")
    1539                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1541              
    1542              $C$DW$130       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$36)
    1544                      .dwattr $C$DW$130, DW_AT_name("bit")
    1545                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bit")
    1546                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1548              
    1549                      .dwendtag $C$DW$T$37
    1550              
    1551              
    1552              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1553                      .dwattr $C$DW$T$38, DW_AT_name("ADCINTFLG_BITS")
    1554                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1555              $C$DW$131       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   30

    1557                      .dwattr $C$DW$131, DW_AT_name("ADCINT1")
    1558                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADCINT1")
    1559                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0f)
    1560                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1561                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1563              
    1564              $C$DW$132       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1566                      .dwattr $C$DW$132, DW_AT_name("ADCINT2")
    1567                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ADCINT2")
    1568                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0e)
    1569                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1570                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1571                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$133       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$133, DW_AT_name("ADCINT3")
    1576                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ADCINT3")
    1577                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0d)
    1578                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1579                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1581              
    1582              $C$DW$134       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1584                      .dwattr $C$DW$134, DW_AT_name("ADCINT4")
    1585                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_ADCINT4")
    1586                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0c)
    1587                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1588                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591              $C$DW$135       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1593                      .dwattr $C$DW$135, DW_AT_name("rsvd1")
    1594                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd1")
    1595                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    1596                      .dwattr $C$DW$135, DW_AT_bit_size(0x0c)
    1597                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1599              
    1600                      .dwendtag $C$DW$T$38
    1601              
    1602              
    1603              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1604                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLG_REG")
    1605                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1606              $C$DW$136       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1608                      .dwattr $C$DW$136, DW_AT_name("all")
    1609                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_all")
    1610                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1611                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   31

    1612              
    1613              $C$DW$137       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$38)
    1615                      .dwattr $C$DW$137, DW_AT_name("bit")
    1616                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_bit")
    1617                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1619              
    1620                      .dwendtag $C$DW$T$39
    1621              
    1622              
    1623              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1624                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTOVFCLR_BITS")
    1625                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1626              $C$DW$138       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1628                      .dwattr $C$DW$138, DW_AT_name("ADCINT1")
    1629                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ADCINT1")
    1630                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0f)
    1631                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1632                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1633                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1634              
    1635              $C$DW$139       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1637                      .dwattr $C$DW$139, DW_AT_name("ADCINT2")
    1638                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ADCINT2")
    1639                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0e)
    1640                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1641                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1643              
    1644              $C$DW$140       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1646                      .dwattr $C$DW$140, DW_AT_name("ADCINT3")
    1647                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ADCINT3")
    1648                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0d)
    1649                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1650                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1651                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1652              
    1653              $C$DW$141       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1655                      .dwattr $C$DW$141, DW_AT_name("ADCINT4")
    1656                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ADCINT4")
    1657                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0c)
    1658                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1659                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1661              
    1662              $C$DW$142       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1664                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    1665                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    1666                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   32

    1667                      .dwattr $C$DW$142, DW_AT_bit_size(0x0c)
    1668                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1670              
    1671                      .dwendtag $C$DW$T$40
    1672              
    1673              
    1674              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1675                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTOVFCLR_REG")
    1676                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1677              $C$DW$143       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1679                      .dwattr $C$DW$143, DW_AT_name("all")
    1680                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_all")
    1681                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1682                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1683              
    1684              $C$DW$144       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$40)
    1686                      .dwattr $C$DW$144, DW_AT_name("bit")
    1687                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_bit")
    1688                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1689                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1690              
    1691                      .dwendtag $C$DW$T$41
    1692              
    1693              
    1694              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1695                      .dwattr $C$DW$T$42, DW_AT_name("ADCINTOVF_BITS")
    1696                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1697              $C$DW$145       .dwtag  DW_TAG_member
    1698                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1699                      .dwattr $C$DW$145, DW_AT_name("ADCINT1")
    1700                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCINT1")
    1701                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0f)
    1702                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1703                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1705              
    1706              $C$DW$146       .dwtag  DW_TAG_member
    1707                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1708                      .dwattr $C$DW$146, DW_AT_name("ADCINT2")
    1709                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ADCINT2")
    1710                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0e)
    1711                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1712                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1713                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1714              
    1715              $C$DW$147       .dwtag  DW_TAG_member
    1716                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1717                      .dwattr $C$DW$147, DW_AT_name("ADCINT3")
    1718                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCINT3")
    1719                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0d)
    1720                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1721                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   33

    1722                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1723              
    1724              $C$DW$148       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1726                      .dwattr $C$DW$148, DW_AT_name("ADCINT4")
    1727                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCINT4")
    1728                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0c)
    1729                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1730                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1731                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1732              
    1733              $C$DW$149       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1735                      .dwattr $C$DW$149, DW_AT_name("rsvd1")
    1736                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd1")
    1737                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00)
    1738                      .dwattr $C$DW$149, DW_AT_bit_size(0x0c)
    1739                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1740                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1741              
    1742                      .dwendtag $C$DW$T$42
    1743              
    1744              
    1745              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1746                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTOVF_REG")
    1747                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1748              $C$DW$150       .dwtag  DW_TAG_member
    1749                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1750                      .dwattr $C$DW$150, DW_AT_name("all")
    1751                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_all")
    1752                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1753                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1754              
    1755              $C$DW$151       .dwtag  DW_TAG_member
    1756                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$42)
    1757                      .dwattr $C$DW$151, DW_AT_name("bit")
    1758                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_bit")
    1759                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1760                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1761              
    1762                      .dwendtag $C$DW$T$43
    1763              
    1764              
    1765              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1766                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTSEL1N2_BITS")
    1767                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1768              $C$DW$152       .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1770                      .dwattr $C$DW$152, DW_AT_name("INT1SEL")
    1771                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_INT1SEL")
    1772                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0c)
    1773                      .dwattr $C$DW$152, DW_AT_bit_size(0x04)
    1774                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1775                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1776              
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:24 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   34

    1777              $C$DW$153       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1779                      .dwattr $C$DW$153, DW_AT_name("rsvd1")
    1780                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd1")
    1781                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0b)
    1782                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1783                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1784                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1785              
    1786              $C$DW$154       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1788                      .dwattr $C$DW$154, DW_AT_name("INT1E")
    1789                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_INT1E")
    1790                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0a)
    1791                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1792                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1793                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1794              
    1795              $C$DW$155       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1797                      .dwattr $C$DW$155, DW_AT_name("INT1CONT")
    1798                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_INT1CONT")
    1799                      .dwattr $C$DW$155, DW_AT_bit_offset(0x09)
    1800                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1801                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1802                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1803              
    1804              $C$DW$156       .dwtag  DW_TAG_member
    1805                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1806                      .dwattr $C$DW$156, DW_AT_name("rsvd2")
