TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Mon Dec  7 23:59:49 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../resolver.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\hakan\OneDrive\Belgeler\GitHub\fault_tolerant_drives\Softw
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    1001              $C$DW$43        .dwtag  DW_TAG_TI_branch
    1002                      .dwattr $C$DW$43, DW_AT_low_pc(0x00)
    1003                      .dwattr $C$DW$43, DW_AT_name("_resolver_PostProcess")
    1004                      .dwattr $C$DW$43, DW_AT_TI_call
    1005              
    1006 0000006c 7640'         LCR       #_resolver_PostProcess ; [CPU_ALU] |228| 
         0000006d 0000 
    1007                      ; call occurs [#_resolver_PostProcess] ; [] |228| 
    1008 0000006e       $C$L11:    
    1009 0000006e 761F!         MOVW      DP,#_AdccRegs+4       ; [CPU_ARAU] 
         0000006f 0000 
    1010                      .dwpsn  file "../resolver.c",line 232,column 2,is_stmt,isa 0
    1011 00000070 1A04!         OR        @$BLOCKED(_AdccRegs)+4,#0x0001 ; [CPU_ALU] |232| 
         00000071 0001 
    1012 00000072 FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
    1013                      .dwcfi  cfa_offset, -26
    1014 00000073 761F!         MOVW      DP,#_PieCtrlRegs+1    ; [CPU_ARAU] 
         00000074 0000 
    1015 00000075 E2AF          MOV32     R3H,*--SP             ; [CPU_FPU] 
         00000076 03BE 
    1016                      .dwcfi  cfa_offset, -24
    1017                      .dwcfi  restore_reg, 55
    1018                      .dwpsn  file "../resolver.c",line 233,column 2,is_stmt,isa 0
    1019 00000077 56BF!         MOVB      @$BLOCKED(_PieCtrlRegs)+1,#1,UNC ; [CPU_ALU] |233| 
         00000078 0101 
    1020 00000079 E2AF          MOV32     R2H,*--SP             ; [CPU_FPU] 
         0000007a 02BE 
    1021                      .dwcfi  cfa_offset, -22
    1022                      .dwcfi  restore_reg, 51
    1023 0000007b E2AF          MOV32     R1H,*--SP             ; [CPU_FPU] 
         0000007c 01BE 
    1024                      .dwcfi  cfa_offset, -20
    1025                      .dwcfi  restore_reg, 47
    1026 0000007d E2AF          MOV32     R0H,*--SP             ; [CPU_FPU] 
         0000007e 00BE 
    1027                      .dwcfi  cfa_offset, -18
    1028                      .dwcfi  restore_reg, 43
    1029 0000007f E280          MOV32     STF,*--SP             ; [CPU_FPU] 
         00000080 00BE 
    1030                      .dwcfi  cfa_offset, -16
    1031                      .dwcfi  restore_reg, 40
    1032 00000081 C5BE          MOVL      XAR7,*--SP            ; [CPU_ALU] 
    1033                      .dwcfi  cfa_offset, -14
    1034                      .dwcfi  restore_reg, 18
    1035 00000082 C4BE          MOVL      XAR6,*--SP            ; [CPU_ALU] 
    1036                      .dwcfi  cfa_offset, -12
    1037                      .dwcfi  restore_reg, 16
    1038 00000083 83BE          MOVL      XAR5,*--SP            ; [CPU_ALU] 
    1039                      .dwcfi  cfa_offset, -10
    1040                      .dwcfi  restore_reg, 14
    1041 00000084 8ABE          MOVL      XAR4,*--SP            ; [CPU_ALU] 
    1042                      .dwcfi  cfa_offset, -8
    1043                      .dwcfi  restore_reg, 12
    1044 00000085 87BE          MOVL      XT,*--SP              ; [CPU_ALU] 
    1045                      .dwcfi  cfa_offset, -6
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   23

    1046                      .dwcfi  restore_reg, 22
    1047                      .dwcfi  restore_reg, 21
    1048 00000086 0003          POP       AR1H:AR0H             ; [CPU_ALU] 
    1049                      .dwcfi  cfa_offset, -4
    1050                      .dwcfi  restore_reg, 5
    1051                      .dwcfi  restore_reg, 7
    1052 00000087 3B30          SETC      INTM, DBGM            ; [CPU_ALU] 
    1053 00000088 FFF1          POP       RB                    ; [CPU_FPU] 
    1054                      .dwcfi  cfa_offset, -2
    1055                      .dwcfi  restore_reg, 74
    1056 00000089 7617          NASP      ; [CPU_ALU] 
    1057              $C$DW$44        .dwtag  DW_TAG_TI_branch
    1058                      .dwattr $C$DW$44, DW_AT_low_pc(0x00)
    1059                      .dwattr $C$DW$44, DW_AT_TI_return
    1060              
    1061 0000008a 7602          IRET      ; [CPU_ALU] 
    1062                      ; return occurs ; [] 
    1063                      .dwattr $C$DW$40, DW_AT_TI_end_file("../resolver.c")
    1064                      .dwattr $C$DW$40, DW_AT_TI_end_line(0xec)
    1065                      .dwattr $C$DW$40, DW_AT_TI_end_column(0x01)
    1066                      .dwendentry
    1067                      .dwendtag $C$DW$40
    1068              
    1069              ;**************************************************************
    1070              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1071              ;**************************************************************
    1072                      .global _resolver_algo_Float
    1073                      .global _DacaRegs
    1074                      .global _AdccResultRegs
    1075                      .global _AdcdResultRegs
    1076                      .global _PieCtrlRegs
    1077                      .global _AdccRegs
    1078              
    1079              ;***************************************************************
    1080              ;* TYPE INFORMATION                                            *
    1081              ;***************************************************************
    1082              
    1083              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1084                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x14)
    1085              $C$DW$45        .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
    1087                      .dwattr $C$DW$45, DW_AT_name("firLag")
    1088                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_firLag")
    1089                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1091              
    1092              $C$DW$46        .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$46, DW_AT_name("FIR32")
    1095                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_FIR32")
    1096                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1097                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1098              
    1099              $C$DW$47        .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   24

    1101                      .dwattr $C$DW$47, DW_AT_name("TUNING")
    1102                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_TUNING")
    1103                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1104                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1105              
    1106              $C$DW$48        .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
    1108                      .dwattr $C$DW$48, DW_AT_name("TABLE_LENGTH")
    1109                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_TABLE_LENGTH")
    1110                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1111                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1112              
    1113              $C$DW$49        .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$16)
    1115                      .dwattr $C$DW$49, DW_AT_name("offsetS")
    1116                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_offsetS")
    1117                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1118                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1119              
    1120              $C$DW$50        .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$16)
    1122                      .dwattr $C$DW$50, DW_AT_name("offsetC")
    1123                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_offsetC")
    1124                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1125                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1126              
    1127              $C$DW$51        .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$16)
    1129                      .dwattr $C$DW$51, DW_AT_name("testAngle")
    1130                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_testAngle")
    1131                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1132                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1133              
    1134              $C$DW$52        .dwtag  DW_TAG_member
    1135                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$16)
    1136                      .dwattr $C$DW$52, DW_AT_name("SAMPLING_TIME")
    1137                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_SAMPLING_TIME")
    1138                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1139                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1140              
    1141              $C$DW$53        .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$16)
    1143                      .dwattr $C$DW$53, DW_AT_name("errorWfT")
    1144                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_errorWfT")
    1145                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1146                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1147              
    1148              $C$DW$54        .dwtag  DW_TAG_member
    1149                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$16)
    1150                      .dwattr $C$DW$54, DW_AT_name("picon_K0")
    1151                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_picon_K0")
    1152                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1153                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1154              
    1155              $C$DW$55        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   25

    1156                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$16)
    1157                      .dwattr $C$DW$55, DW_AT_name("picon_K1")
    1158                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_picon_K1")
    1159                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1160                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1161              
    1162              $C$DW$56        .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$16)
    1164                      .dwattr $C$DW$56, DW_AT_name("rpsMax")
    1165                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rpsMax")
    1166                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1167                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1168              
    1169                      .dwendtag $C$DW$T$20
    1170              
    1171              $C$DW$T$223     .dwtag  DW_TAG_typedef
    1172                      .dwattr $C$DW$T$223, DW_AT_name("RESOLVER_INPUT")
    1173                      .dwattr $C$DW$T$223, DW_AT_type(*$C$DW$T$20)
    1174                      .dwattr $C$DW$T$223, DW_AT_language(DW_LANG_C)
    1175              
    1176              
    1177              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1178                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x22)
    1179              $C$DW$57        .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$16)
    1181                      .dwattr $C$DW$57, DW_AT_name("angleRaw")
    1182                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_angleRaw")
    1183                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1184                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1185              
    1186              $C$DW$58        .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$16)
    1188                      .dwattr $C$DW$58, DW_AT_name("angleObs")
    1189                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_angleObs")
    1190                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1191                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1192              
    1193              $C$DW$59        .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$16)
    1195                      .dwattr $C$DW$59, DW_AT_name("angleOut")
    1196                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_angleOut")
    1197                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1198                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1199              
    1200              $C$DW$60        .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$16)
    1202                      .dwattr $C$DW$60, DW_AT_name("rpsObs")
    1203                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rpsObs")
    1204                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1205                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207              $C$DW$61        .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$16)
    1209                      .dwattr $C$DW$61, DW_AT_name("errorNew")
    1210                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_errorNew")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   26

    1211                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1212                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1213              
    1214              $C$DW$62        .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$16)
    1216                      .dwattr $C$DW$62, DW_AT_name("resMag")
    1217                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_resMag")
    1218                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1219                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1220              
    1221              $C$DW$63        .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$16)
    1223                      .dwattr $C$DW$63, DW_AT_name("sinFIRout")
    1224                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_sinFIRout")
    1225                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1226                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1227              
    1228              $C$DW$64        .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$16)
    1230                      .dwattr $C$DW$64, DW_AT_name("cosFIRout")
    1231                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_cosFIRout")
    1232                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1233                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1234              
    1235              $C$DW$65        .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
    1237                      .dwattr $C$DW$65, DW_AT_name("angleRaw20")
    1238                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_angleRaw20")
    1239                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1240                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1241              
    1242              $C$DW$66        .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$21)
    1244                      .dwattr $C$DW$66, DW_AT_name("angleObs20")
    1245                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_angleObs20")
    1246                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1247                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1248              
    1249              $C$DW$67        .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$21)
    1251                      .dwattr $C$DW$67, DW_AT_name("angleOut20")
    1252                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_angleOut20")
    1253                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1254                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1255              
    1256              $C$DW$68        .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$21)
    1258                      .dwattr $C$DW$68, DW_AT_name("rpsObs20")
    1259                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rpsObs20")
    1260                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1261                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1262              
    1263              $C$DW$69        .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$21)
    1265                      .dwattr $C$DW$69, DW_AT_name("errorNew20")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   27

    1266                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_errorNew20")
    1267                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1268                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1269              
    1270              $C$DW$70        .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
    1272                      .dwattr $C$DW$70, DW_AT_name("resMag20")
    1273                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_resMag20")
    1274                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1275                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1276              
    1277              $C$DW$71        .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$16)
    1279                      .dwattr $C$DW$71, DW_AT_name("sin_input")
    1280                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_sin_input")
    1281                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1282                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1283              
    1284              $C$DW$72        .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$16)
    1286                      .dwattr $C$DW$72, DW_AT_name("cos_input")
    1287                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_cos_input")
    1288                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1289                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1290              
    1291              $C$DW$73        .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1293                      .dwattr $C$DW$73, DW_AT_name("sineIndex")
    1294                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_sineIndex")
    1295                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1296                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1297              
    1298                      .dwendtag $C$DW$T$22
    1299              
    1300              $C$DW$T$224     .dwtag  DW_TAG_typedef
    1301                      .dwattr $C$DW$T$224, DW_AT_name("RESOLVER_OUTPUT")
    1302                      .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$22)
    1303                      .dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C)
    1304              
    1305              
    1306              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1307                      .dwattr $C$DW$T$23, DW_AT_name("ADCBURSTCTL_BITS")
    1308                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1309              $C$DW$74        .dwtag  DW_TAG_member
    1310                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1311                      .dwattr $C$DW$74, DW_AT_name("BURSTTRIGSEL")
    1312                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
    1313                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0a)
    1314                      .dwattr $C$DW$74, DW_AT_bit_size(0x06)
    1315                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1316                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1317              
    1318              $C$DW$75        .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1320                      .dwattr $C$DW$75, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   28

    1321                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd1")
    1322                      .dwattr $C$DW$75, DW_AT_bit_offset(0x08)
    1323                      .dwattr $C$DW$75, DW_AT_bit_size(0x02)
    1324                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1326              
    1327              $C$DW$76        .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$76, DW_AT_name("BURSTSIZE")
    1330                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_BURSTSIZE")
    1331                      .dwattr $C$DW$76, DW_AT_bit_offset(0x04)
    1332                      .dwattr $C$DW$76, DW_AT_bit_size(0x04)
    1333                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1334                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1335              
    1336              $C$DW$77        .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1338                      .dwattr $C$DW$77, DW_AT_name("rsvd2")
    1339                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd2")
    1340                      .dwattr $C$DW$77, DW_AT_bit_offset(0x01)
    1341                      .dwattr $C$DW$77, DW_AT_bit_size(0x03)
    1342                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1343                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1344              
    1345              $C$DW$78        .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1347                      .dwattr $C$DW$78, DW_AT_name("BURSTEN")
    1348                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_BURSTEN")
    1349                      .dwattr $C$DW$78, DW_AT_bit_offset(0x00)
    1350                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1351                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1353              
    1354                      .dwendtag $C$DW$T$23
    1355              
    1356              
    1357              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1358                      .dwattr $C$DW$T$24, DW_AT_name("ADCBURSTCTL_REG")
    1359                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1360              $C$DW$79        .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1362                      .dwattr $C$DW$79, DW_AT_name("all")
    1363                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_all")
    1364                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1366              
    1367              $C$DW$80        .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$23)
    1369                      .dwattr $C$DW$80, DW_AT_name("bit")
    1370                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_bit")
    1371                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1372                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1373              
    1374                      .dwendtag $C$DW$T$24
    1375              
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   29

    1376              
    1377              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1378                      .dwattr $C$DW$T$25, DW_AT_name("ADCCOUNTER_BITS")
    1379                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1380              $C$DW$81        .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1382                      .dwattr $C$DW$81, DW_AT_name("FREECOUNT")
    1383                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_FREECOUNT")
    1384                      .dwattr $C$DW$81, DW_AT_bit_offset(0x04)
    1385                      .dwattr $C$DW$81, DW_AT_bit_size(0x0c)
    1386                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1387                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1388              
    1389              $C$DW$82        .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1391                      .dwattr $C$DW$82, DW_AT_name("rsvd1")
    1392                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd1")
    1393                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1394                      .dwattr $C$DW$82, DW_AT_bit_size(0x04)
    1395                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1396                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1397              
    1398                      .dwendtag $C$DW$T$25
    1399              
    1400              
    1401              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1402                      .dwattr $C$DW$T$26, DW_AT_name("ADCCOUNTER_REG")
    1403                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1404              $C$DW$83        .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1406                      .dwattr $C$DW$83, DW_AT_name("all")
    1407                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_all")
    1408                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1410              
    1411              $C$DW$84        .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$25)
    1413                      .dwattr $C$DW$84, DW_AT_name("bit")
    1414                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_bit")
    1415                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1417              
    1418                      .dwendtag $C$DW$T$26
    1419              
    1420              
    1421              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1422                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL1_BITS")
    1423                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1424              $C$DW$85        .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1426                      .dwattr $C$DW$85, DW_AT_name("rsvd1")
    1427                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd1")
    1428                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0e)
    1429                      .dwattr $C$DW$85, DW_AT_bit_size(0x02)
    1430                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   30

    1431                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1432              
    1433              $C$DW$86        .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1435                      .dwattr $C$DW$86, DW_AT_name("INTPULSEPOS")
    1436                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_INTPULSEPOS")
    1437                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0d)
    1438                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1439                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1441              
    1442              $C$DW$87        .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1444                      .dwattr $C$DW$87, DW_AT_name("rsvd2")
    1445                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd2")
    1446                      .dwattr $C$DW$87, DW_AT_bit_offset(0x09)
    1447                      .dwattr $C$DW$87, DW_AT_bit_size(0x04)
    1448                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1449                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1450              
    1451              $C$DW$88        .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1453                      .dwattr $C$DW$88, DW_AT_name("ADCPWDNZ")
    1454                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ADCPWDNZ")
    1455                      .dwattr $C$DW$88, DW_AT_bit_offset(0x08)
    1456                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1457                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1459              
    1460              $C$DW$89        .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1462                      .dwattr $C$DW$89, DW_AT_name("ADCBSYCHN")
    1463                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ADCBSYCHN")
    1464                      .dwattr $C$DW$89, DW_AT_bit_offset(0x04)
    1465                      .dwattr $C$DW$89, DW_AT_bit_size(0x04)
    1466                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1468              
    1469              $C$DW$90        .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1471                      .dwattr $C$DW$90, DW_AT_name("rsvd3")
    1472                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd3")
    1473                      .dwattr $C$DW$90, DW_AT_bit_offset(0x03)
    1474                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1475                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1477              
    1478              $C$DW$91        .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1480                      .dwattr $C$DW$91, DW_AT_name("ADCBSY")
    1481                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ADCBSY")
    1482                      .dwattr $C$DW$91, DW_AT_bit_offset(0x02)
    1483                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1484                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1485                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   31

    1486              
    1487              $C$DW$92        .dwtag  DW_TAG_member
    1488                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1489                      .dwattr $C$DW$92, DW_AT_name("rsvd4")
    1490                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd4")
    1491                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
    1492                      .dwattr $C$DW$92, DW_AT_bit_size(0x02)
    1493                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496                      .dwendtag $C$DW$T$27
    1497              
    1498              
    1499              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1500                      .dwattr $C$DW$T$28, DW_AT_name("ADCCTL1_REG")
    1501                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1502              $C$DW$93        .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1504                      .dwattr $C$DW$93, DW_AT_name("all")
    1505                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_all")
    1506                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1508              
    1509              $C$DW$94        .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$27)
    1511                      .dwattr $C$DW$94, DW_AT_name("bit")
    1512                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_bit")
    1513                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1514                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1515              
    1516                      .dwendtag $C$DW$T$28
    1517              
    1518              
    1519              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1520                      .dwattr $C$DW$T$29, DW_AT_name("ADCCTL2_BITS")
    1521                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1522              $C$DW$95        .dwtag  DW_TAG_member
    1523                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1524                      .dwattr $C$DW$95, DW_AT_name("PRESCALE")
    1525                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_PRESCALE")
    1526                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0c)
    1527                      .dwattr $C$DW$95, DW_AT_bit_size(0x04)
    1528                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1529                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1530              
    1531              $C$DW$96        .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1533                      .dwattr $C$DW$96, DW_AT_name("rsvd1")
    1534                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd1")
    1535                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0a)
    1536                      .dwattr $C$DW$96, DW_AT_bit_size(0x02)
    1537                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1538                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1539              
    1540              $C$DW$97        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   32

    1541                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1542                      .dwattr $C$DW$97, DW_AT_name("RESOLUTION")
    1543                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_RESOLUTION")
    1544                      .dwattr $C$DW$97, DW_AT_bit_offset(0x09)
    1545                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1546                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1548              
    1549              $C$DW$98        .dwtag  DW_TAG_member
    1550                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1551                      .dwattr $C$DW$98, DW_AT_name("SIGNALMODE")
    1552                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_SIGNALMODE")
    1553                      .dwattr $C$DW$98, DW_AT_bit_offset(0x08)
    1554                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1555                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1556                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1557              
    1558              $C$DW$99        .dwtag  DW_TAG_member
    1559                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1560                      .dwattr $C$DW$99, DW_AT_name("rsvd2")
    1561                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd2")
    1562                      .dwattr $C$DW$99, DW_AT_bit_offset(0x03)
    1563                      .dwattr $C$DW$99, DW_AT_bit_size(0x05)
    1564                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1565                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1566              
    1567              $C$DW$100       .dwtag  DW_TAG_member
    1568                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1569                      .dwattr $C$DW$100, DW_AT_name("rsvd3")
    1570                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd3")
    1571                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00)
    1572                      .dwattr $C$DW$100, DW_AT_bit_size(0x03)
    1573                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1574                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1575              
    1576                      .dwendtag $C$DW$T$29
    1577              
    1578              
    1579              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1580                      .dwattr $C$DW$T$30, DW_AT_name("ADCCTL2_REG")
    1581                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1582              $C$DW$101       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1584                      .dwattr $C$DW$101, DW_AT_name("all")
    1585                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1586                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1587                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1588              
    1589              $C$DW$102       .dwtag  DW_TAG_member
    1590                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$29)
    1591                      .dwattr $C$DW$102, DW_AT_name("bit")
    1592                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1593                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1594                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1595              
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   33

    1596                      .dwendtag $C$DW$T$30
    1597              
    1598              
    1599              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1600                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTCLR_BITS")
    1601                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1602              $C$DW$103       .dwtag  DW_TAG_member
    1603                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1604                      .dwattr $C$DW$103, DW_AT_name("PPB1TRIPHI")
    1605                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1606                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0f)
    1607                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1608                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1609                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1610              
    1611              $C$DW$104       .dwtag  DW_TAG_member
    1612                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1613                      .dwattr $C$DW$104, DW_AT_name("PPB1TRIPLO")
    1614                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1615                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e)
    1616                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1617                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1619              
    1620              $C$DW$105       .dwtag  DW_TAG_member
    1621                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1622                      .dwattr $C$DW$105, DW_AT_name("PPB1ZERO")
    1623                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_PPB1ZERO")
    1624                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0d)
    1625                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1626                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1627                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1628              
    1629              $C$DW$106       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1631                      .dwattr $C$DW$106, DW_AT_name("rsvd1")
    1632                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd1")
    1633                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0c)
    1634                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1635                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1637              
    1638              $C$DW$107       .dwtag  DW_TAG_member
    1639                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1640                      .dwattr $C$DW$107, DW_AT_name("PPB2TRIPHI")
    1641                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1642                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0b)
    1643                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1644                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1645                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1646              
    1647              $C$DW$108       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1649                      .dwattr $C$DW$108, DW_AT_name("PPB2TRIPLO")
    1650                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_PPB2TRIPLO")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   34

    1651                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0a)
    1652                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1653                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1654                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1655              
    1656              $C$DW$109       .dwtag  DW_TAG_member
    1657                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1658                      .dwattr $C$DW$109, DW_AT_name("PPB2ZERO")
    1659                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_PPB2ZERO")
    1660                      .dwattr $C$DW$109, DW_AT_bit_offset(0x09)
    1661                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1662                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1663                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1664              
    1665              $C$DW$110       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1667                      .dwattr $C$DW$110, DW_AT_name("rsvd2")
    1668                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd2")
    1669                      .dwattr $C$DW$110, DW_AT_bit_offset(0x08)
    1670                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1671                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1673              
    1674              $C$DW$111       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1676                      .dwattr $C$DW$111, DW_AT_name("PPB3TRIPHI")
    1677                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1678                      .dwattr $C$DW$111, DW_AT_bit_offset(0x07)
    1679                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1680                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1681                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1682              
    1683              $C$DW$112       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1685                      .dwattr $C$DW$112, DW_AT_name("PPB3TRIPLO")
    1686                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1687                      .dwattr $C$DW$112, DW_AT_bit_offset(0x06)
    1688                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1689                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1690                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1691              
    1692              $C$DW$113       .dwtag  DW_TAG_member
    1693                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1694                      .dwattr $C$DW$113, DW_AT_name("PPB3ZERO")
    1695                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_PPB3ZERO")
    1696                      .dwattr $C$DW$113, DW_AT_bit_offset(0x05)
    1697                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1698                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1699                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1700              
    1701              $C$DW$114       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1703                      .dwattr $C$DW$114, DW_AT_name("rsvd3")
    1704                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd3")
    1705                      .dwattr $C$DW$114, DW_AT_bit_offset(0x04)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   35

    1706                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1707                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1709              
    1710              $C$DW$115       .dwtag  DW_TAG_member
    1711                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1712                      .dwattr $C$DW$115, DW_AT_name("PPB4TRIPHI")
    1713                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1714                      .dwattr $C$DW$115, DW_AT_bit_offset(0x03)
    1715                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1716                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1717                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1718              
    1719              $C$DW$116       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1721                      .dwattr $C$DW$116, DW_AT_name("PPB4TRIPLO")
    1722                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1723                      .dwattr $C$DW$116, DW_AT_bit_offset(0x02)
    1724                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1725                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1726                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1727              
    1728              $C$DW$117       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1730                      .dwattr $C$DW$117, DW_AT_name("PPB4ZERO")
    1731                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_PPB4ZERO")
    1732                      .dwattr $C$DW$117, DW_AT_bit_offset(0x01)
    1733                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1734                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1736              
    1737              $C$DW$118       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1739                      .dwattr $C$DW$118, DW_AT_name("rsvd4")
    1740                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd4")
    1741                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    1742                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1743                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1745              
    1746                      .dwendtag $C$DW$T$31
    1747              
    1748              
    1749              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1750                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTCLR_REG")
    1751                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1752              $C$DW$119       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$119, DW_AT_name("all")
    1755                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    1756                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1758              
    1759              $C$DW$120       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   36

    1761                      .dwattr $C$DW$120, DW_AT_name("bit")
    1762                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    1763                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1764                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1765              
    1766                      .dwendtag $C$DW$T$32
    1767              
    1768              
    1769              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1770                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTINTSEL_BITS")
    1771                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1772              $C$DW$121       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1774                      .dwattr $C$DW$121, DW_AT_name("PPB1TRIPHI")
    1775                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1776                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0f)
    1777                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1778                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1779                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1780              
    1781              $C$DW$122       .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1783                      .dwattr $C$DW$122, DW_AT_name("PPB1TRIPLO")
    1784                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1785                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e)
    1786                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1787                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1788                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1789              
    1790              $C$DW$123       .dwtag  DW_TAG_member
    1791                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1792                      .dwattr $C$DW$123, DW_AT_name("PPB1ZERO")
    1793                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_PPB1ZERO")
    1794                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0d)
    1795                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1796                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1797                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1798              
    1799              $C$DW$124       .dwtag  DW_TAG_member
    1800                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1801                      .dwattr $C$DW$124, DW_AT_name("rsvd1")
    1802                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd1")
    1803                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0c)
    1804                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1805                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1806                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1807              
    1808              $C$DW$125       .dwtag  DW_TAG_member
    1809                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1810                      .dwattr $C$DW$125, DW_AT_name("PPB2TRIPHI")
    1811                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1812                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0b)
    1813                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1814                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1815                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   37

    1816              
    1817              $C$DW$126       .dwtag  DW_TAG_member
    1818                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1819                      .dwattr $C$DW$126, DW_AT_name("PPB2TRIPLO")
    1820                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1821                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0a)
    1822                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1823                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1824                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1825              
    1826              $C$DW$127       .dwtag  DW_TAG_member
    1827                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1828                      .dwattr $C$DW$127, DW_AT_name("PPB2ZERO")
    1829                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_PPB2ZERO")
    1830                      .dwattr $C$DW$127, DW_AT_bit_offset(0x09)
    1831                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1832                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1833                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1834              
    1835              $C$DW$128       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1837                      .dwattr $C$DW$128, DW_AT_name("rsvd2")
    1838                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd2")
    1839                      .dwattr $C$DW$128, DW_AT_bit_offset(0x08)
    1840                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1841                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1842                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1843              
    1844              $C$DW$129       .dwtag  DW_TAG_member
    1845                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1846                      .dwattr $C$DW$129, DW_AT_name("PPB3TRIPHI")
    1847                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1848                      .dwattr $C$DW$129, DW_AT_bit_offset(0x07)
    1849                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1850                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1851                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1852              
    1853              $C$DW$130       .dwtag  DW_TAG_member
    1854                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1855                      .dwattr $C$DW$130, DW_AT_name("PPB3TRIPLO")
    1856                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1857                      .dwattr $C$DW$130, DW_AT_bit_offset(0x06)
    1858                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1859                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1860                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1861              
    1862              $C$DW$131       .dwtag  DW_TAG_member
    1863                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1864                      .dwattr $C$DW$131, DW_AT_name("PPB3ZERO")
    1865                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PPB3ZERO")
    1866                      .dwattr $C$DW$131, DW_AT_bit_offset(0x05)
    1867                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1868                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1869                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1870              
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   38

    1871              $C$DW$132       .dwtag  DW_TAG_member
    1872                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1873                      .dwattr $C$DW$132, DW_AT_name("rsvd3")
    1874                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd3")
    1875                      .dwattr $C$DW$132, DW_AT_bit_offset(0x04)
    1876                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1877                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1878                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1879              
    1880              $C$DW$133       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1882                      .dwattr $C$DW$133, DW_AT_name("PPB4TRIPHI")
    1883                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1884                      .dwattr $C$DW$133, DW_AT_bit_offset(0x03)
    1885                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1886                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1887                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1888              
    1889              $C$DW$134       .dwtag  DW_TAG_member
    1890                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1891                      .dwattr $C$DW$134, DW_AT_name("PPB4TRIPLO")
    1892                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1893                      .dwattr $C$DW$134, DW_AT_bit_offset(0x02)
    1894                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1895                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1896                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1897              
    1898              $C$DW$135       .dwtag  DW_TAG_member
    1899                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1900                      .dwattr $C$DW$135, DW_AT_name("PPB4ZERO")
    1901                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PPB4ZERO")
    1902                      .dwattr $C$DW$135, DW_AT_bit_offset(0x01)
    1903                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1904                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1905                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1906              
    1907              $C$DW$136       .dwtag  DW_TAG_member
    1908                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1909                      .dwattr $C$DW$136, DW_AT_name("rsvd4")
    1910                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd4")
    1911                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    1912                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1913                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1914                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1915              
    1916                      .dwendtag $C$DW$T$33
    1917              
    1918              
    1919              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1920                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTINTSEL_REG")
    1921                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1922              $C$DW$137       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1924                      .dwattr $C$DW$137, DW_AT_name("all")
    1925                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   39

    1926                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1927                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1928              
    1929              $C$DW$138       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$33)
    1931                      .dwattr $C$DW$138, DW_AT_name("bit")
    1932                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_bit")
    1933                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1934                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1935              
    1936                      .dwendtag $C$DW$T$34
    1937              
    1938              
    1939              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1940                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSEL_BITS")
    1941                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1942              $C$DW$139       .dwtag  DW_TAG_member
    1943                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1944                      .dwattr $C$DW$139, DW_AT_name("PPB1TRIPHI")
    1945                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1946                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0f)
    1947                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1948                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1949                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1950              
    1951              $C$DW$140       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1953                      .dwattr $C$DW$140, DW_AT_name("PPB1TRIPLO")
    1954                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1955                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0e)
    1956                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1957                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1958                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1959              
    1960              $C$DW$141       .dwtag  DW_TAG_member
    1961                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1962                      .dwattr $C$DW$141, DW_AT_name("PPB1ZERO")
    1963                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_PPB1ZERO")
    1964                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0d)
    1965                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1966                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1967                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1968              
    1969              $C$DW$142       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1971                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    1972                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    1973                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0c)
    1974                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1975                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1976                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1977              
    1978              $C$DW$143       .dwtag  DW_TAG_member
    1979                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1980                      .dwattr $C$DW$143, DW_AT_name("PPB2TRIPHI")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   40

    1981                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1982                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0b)
    1983                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1984                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1985                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1986              
    1987              $C$DW$144       .dwtag  DW_TAG_member
    1988                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1989                      .dwattr $C$DW$144, DW_AT_name("PPB2TRIPLO")
    1990                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1991                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0a)
    1992                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1993                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1994                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1995              
    1996              $C$DW$145       .dwtag  DW_TAG_member
    1997                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1998                      .dwattr $C$DW$145, DW_AT_name("PPB2ZERO")
    1999                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PPB2ZERO")
    2000                      .dwattr $C$DW$145, DW_AT_bit_offset(0x09)
    2001                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2002                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2003                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2004              
    2005              $C$DW$146       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2007                      .dwattr $C$DW$146, DW_AT_name("rsvd2")
    2008                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd2")
    2009                      .dwattr $C$DW$146, DW_AT_bit_offset(0x08)
    2010                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2011                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2012                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2013              
    2014              $C$DW$147       .dwtag  DW_TAG_member
    2015                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2016                      .dwattr $C$DW$147, DW_AT_name("PPB3TRIPHI")
    2017                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2018                      .dwattr $C$DW$147, DW_AT_bit_offset(0x07)
    2019                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2020                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2021                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2022              
    2023              $C$DW$148       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2025                      .dwattr $C$DW$148, DW_AT_name("PPB3TRIPLO")
    2026                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2027                      .dwattr $C$DW$148, DW_AT_bit_offset(0x06)
    2028                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2029                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2030                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2031              
    2032              $C$DW$149       .dwtag  DW_TAG_member
    2033                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2034                      .dwattr $C$DW$149, DW_AT_name("PPB3ZERO")
    2035                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PPB3ZERO")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   41

    2036                      .dwattr $C$DW$149, DW_AT_bit_offset(0x05)
    2037                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2038                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2039                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2040              
    2041              $C$DW$150       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2043                      .dwattr $C$DW$150, DW_AT_name("rsvd3")
    2044                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd3")
    2045                      .dwattr $C$DW$150, DW_AT_bit_offset(0x04)
    2046                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2047                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2048                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2049              
    2050              $C$DW$151       .dwtag  DW_TAG_member
    2051                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2052                      .dwattr $C$DW$151, DW_AT_name("PPB4TRIPHI")
    2053                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2054                      .dwattr $C$DW$151, DW_AT_bit_offset(0x03)
    2055                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2056                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2057                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2058              
    2059              $C$DW$152       .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2061                      .dwattr $C$DW$152, DW_AT_name("PPB4TRIPLO")
    2062                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2063                      .dwattr $C$DW$152, DW_AT_bit_offset(0x02)
    2064                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2065                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2066                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2067              
    2068              $C$DW$153       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2070                      .dwattr $C$DW$153, DW_AT_name("PPB4ZERO")
    2071                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PPB4ZERO")
    2072                      .dwattr $C$DW$153, DW_AT_bit_offset(0x01)
    2073                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2074                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2075                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2076              
    2077              $C$DW$154       .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2079                      .dwattr $C$DW$154, DW_AT_name("rsvd4")
    2080                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd4")
    2081                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    2082                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2083                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2084                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2085              
    2086                      .dwendtag $C$DW$T$35
    2087              
    2088              
    2089              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2090                      .dwattr $C$DW$T$36, DW_AT_name("ADCEVTSEL_REG")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   42

    2091                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2092              $C$DW$155       .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2094                      .dwattr $C$DW$155, DW_AT_name("all")
    2095                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_all")
    2096                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2097                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2098              
    2099              $C$DW$156       .dwtag  DW_TAG_member
    2100                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$35)
    2101                      .dwattr $C$DW$156, DW_AT_name("bit")
    2102                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_bit")
    2103                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2104                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2105              
    2106                      .dwendtag $C$DW$T$36
    2107              
    2108              
    2109              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2110                      .dwattr $C$DW$T$37, DW_AT_name("ADCEVTSTAT_BITS")
    2111                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2112              $C$DW$157       .dwtag  DW_TAG_member
    2113                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2114                      .dwattr $C$DW$157, DW_AT_name("PPB1TRIPHI")
    2115                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2116                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0f)
    2117                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2118                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2119                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2120              
    2121              $C$DW$158       .dwtag  DW_TAG_member
    2122                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2123                      .dwattr $C$DW$158, DW_AT_name("PPB1TRIPLO")
    2124                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2125                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0e)
    2126                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2127                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2128                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2129              
    2130              $C$DW$159       .dwtag  DW_TAG_member
    2131                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2132                      .dwattr $C$DW$159, DW_AT_name("PPB1ZERO")
    2133                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PPB1ZERO")
    2134                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0d)
    2135                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2136                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2137                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2138              
    2139              $C$DW$160       .dwtag  DW_TAG_member
    2140                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2141                      .dwattr $C$DW$160, DW_AT_name("rsvd1")
    2142                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd1")
    2143                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0c)
    2144                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2145                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   43

    2146                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2147              
    2148              $C$DW$161       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2150                      .dwattr $C$DW$161, DW_AT_name("PPB2TRIPHI")
    2151                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2152                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0b)
    2153                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2154                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2155                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2156              
    2157              $C$DW$162       .dwtag  DW_TAG_member
    2158                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2159                      .dwattr $C$DW$162, DW_AT_name("PPB2TRIPLO")
    2160                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2161                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0a)
    2162                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2163                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2164                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2165              
    2166              $C$DW$163       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2168                      .dwattr $C$DW$163, DW_AT_name("PPB2ZERO")
    2169                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PPB2ZERO")
    2170                      .dwattr $C$DW$163, DW_AT_bit_offset(0x09)
    2171                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2172                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2173                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2174              
    2175              $C$DW$164       .dwtag  DW_TAG_member
    2176                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2177                      .dwattr $C$DW$164, DW_AT_name("rsvd2")
    2178                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd2")
    2179                      .dwattr $C$DW$164, DW_AT_bit_offset(0x08)
    2180                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2181                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2182                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2183              
    2184              $C$DW$165       .dwtag  DW_TAG_member
    2185                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2186                      .dwattr $C$DW$165, DW_AT_name("PPB3TRIPHI")
    2187                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2188                      .dwattr $C$DW$165, DW_AT_bit_offset(0x07)
    2189                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2190                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2191                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2192              
    2193              $C$DW$166       .dwtag  DW_TAG_member
    2194                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2195                      .dwattr $C$DW$166, DW_AT_name("PPB3TRIPLO")
    2196                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2197                      .dwattr $C$DW$166, DW_AT_bit_offset(0x06)
    2198                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2199                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2200                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   44

    2201              
    2202              $C$DW$167       .dwtag  DW_TAG_member
    2203                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2204                      .dwattr $C$DW$167, DW_AT_name("PPB3ZERO")
    2205                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PPB3ZERO")
    2206                      .dwattr $C$DW$167, DW_AT_bit_offset(0x05)
    2207                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2208                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2209                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2210              
    2211              $C$DW$168       .dwtag  DW_TAG_member
    2212                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2213                      .dwattr $C$DW$168, DW_AT_name("rsvd3")
    2214                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd3")
    2215                      .dwattr $C$DW$168, DW_AT_bit_offset(0x04)
    2216                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2217                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2218                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2219              
    2220              $C$DW$169       .dwtag  DW_TAG_member
    2221                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2222                      .dwattr $C$DW$169, DW_AT_name("PPB4TRIPHI")
    2223                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2224                      .dwattr $C$DW$169, DW_AT_bit_offset(0x03)
    2225                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2226                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2227                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2228              
    2229              $C$DW$170       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2231                      .dwattr $C$DW$170, DW_AT_name("PPB4TRIPLO")
    2232                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2233                      .dwattr $C$DW$170, DW_AT_bit_offset(0x02)
    2234                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2235                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2236                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2237              
    2238              $C$DW$171       .dwtag  DW_TAG_member
    2239                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2240                      .dwattr $C$DW$171, DW_AT_name("PPB4ZERO")
    2241                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PPB4ZERO")
    2242                      .dwattr $C$DW$171, DW_AT_bit_offset(0x01)
    2243                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2244                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2245                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2246              
    2247              $C$DW$172       .dwtag  DW_TAG_member
    2248                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2249                      .dwattr $C$DW$172, DW_AT_name("rsvd4")
    2250                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd4")
    2251                      .dwattr $C$DW$172, DW_AT_bit_offset(0x00)
    2252                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2253                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2254                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2255              
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   45

    2256                      .dwendtag $C$DW$T$37
    2257              
    2258              
    2259              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2260                      .dwattr $C$DW$T$38, DW_AT_name("ADCEVTSTAT_REG")
    2261                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2262              $C$DW$173       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2264                      .dwattr $C$DW$173, DW_AT_name("all")
    2265                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_all")
    2266                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2267                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2268              
    2269              $C$DW$174       .dwtag  DW_TAG_member
    2270                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$37)
    2271                      .dwattr $C$DW$174, DW_AT_name("bit")
    2272                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_bit")
    2273                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2274                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2275              
    2276                      .dwendtag $C$DW$T$38
    2277              
    2278              
    2279              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2280                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLGCLR_BITS")
    2281                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2282              $C$DW$175       .dwtag  DW_TAG_member
    2283                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2284                      .dwattr $C$DW$175, DW_AT_name("ADCINT1")
    2285                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_ADCINT1")
    2286                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0f)
    2287                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2288                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2289                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2290              
    2291              $C$DW$176       .dwtag  DW_TAG_member
    2292                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2293                      .dwattr $C$DW$176, DW_AT_name("ADCINT2")
    2294                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ADCINT2")
    2295                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0e)
    2296                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2297                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2298                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2299              
    2300              $C$DW$177       .dwtag  DW_TAG_member
    2301                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2302                      .dwattr $C$DW$177, DW_AT_name("ADCINT3")
    2303                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_ADCINT3")
    2304                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0d)
    2305                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2306                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2307                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2308              
    2309              $C$DW$178       .dwtag  DW_TAG_member
    2310                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
resolver.asm                                                         PAGE   46

    2311                      .dwattr $C$DW$178, DW_AT_name("ADCINT4")
    2312                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_ADCINT4")
    2313                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0c)
    2314                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2315                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2316                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2317              
    2318              $C$DW$179       .dwtag  DW_TAG_member
    2319                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2320                      .dwattr $C$DW$179, DW_AT_name("rsvd1")
    2321                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd1")
    2322                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00)
    2323                      .dwattr $C$DW$179, DW_AT_bit_size(0x0c)
    2324                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2325                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2326              
    2327                      .dwendtag $C$DW$T$39
    2328              
    2329              
    2330              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2331                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTFLGCLR_REG")
    2332                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2333              $C$DW$180       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2335                      .dwattr $C$DW$180, DW_AT_name("all")
    2336                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_all")
    2337                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2338                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2339              
    2340              $C$DW$181       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$39)
    2342                      .dwattr $C$DW$181, DW_AT_name("bit")
    2343                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_bit")
    2344                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2345                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2346              
    2347                      .dwendtag $C$DW$T$40
    2348              
    2349              
    2350              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2351                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTFLG_BITS")
    2352                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2353              $C$DW$182       .dwtag  DW_TAG_member
    2354                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2355                      .dwattr $C$DW$182, DW_AT_name("ADCINT1")
    2356                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_ADCINT1")
    2357                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0f)
    2358                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2359                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2360                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2361              
    2362              $C$DW$183       .dwtag  DW_TAG_member
    2363                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2364                      .dwattr $C$DW$183, DW_AT_name("ADCINT2")
    2365                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_ADCINT2")
TMS320C2000 Assembler PC v20.2.1 Mon Dec  7 23:59:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
