TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Sat Jul 18 15:28:13 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../endat.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Desktop\servodrive_TMIDDK\IDDK_PM_Servo_F2837x-v2\F2
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("PM_endat22_generateCRCTable")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PM_endat22_generateCRCTable")

         0000037b 0000 
    2229                      ; call occurs [#_PM_endat22_getCrcNorm] ; [] |129| 
    2230 0000037c 761F-         MOVW      DP,#_crc5_result      ; [CPU_ARAU] 
         0000037d 0000 
    2231 0000037e 9600-         MOV       @_crc5_result,AL      ; [CPU_ALU] |129| 
    2232 0000037f 761F-         MOVW      DP,#_endat22Data+7    ; [CPU_ARAU] 
         00000380 0001 
    2233                      .dwpsn  file "../endat.c",line 131,column 3,is_stmt,isa 0
    2234 00000381 9307-         MOV       AH,@_endat22Data+7    ; [CPU_ALU] |131| 
    2235              $C$DW$151       .dwtag  DW_TAG_TI_branch
    2236                      .dwattr $C$DW$151, DW_AT_low_pc(0x00)
    2237                      .dwattr $C$DW$151, DW_AT_name("_CheckCRC")
    2238                      .dwattr $C$DW$151, DW_AT_TI_call
    2239              
    2240 00000382 7640'         LCR       #_CheckCRC            ; [CPU_ALU] |131| 
         00000383 0002 
    2241                      ; call occurs [#_CheckCRC] ; [] |131| 
    2242 00000384 5200          CMPB      AL,#0                 ; [CPU_ALU] |131| 
    2243 00000385 6002          B         $C$L28,NEQ            ; [CPU_ALU] |131| 
    2244                      ; branchcc occurs ; [] |131| 
    2245 00000386 7625   ESTOP0
    2246 00000387       $C$L28:    
    2247                      .dwpsn  file "../endat.c",line 137,column 3,is_stmt,isa 0
    2248 00000387 9206-         MOV       AL,@_endat22Data+6    ; [CPU_ALU] |137| 
    2249                      .dwpsn  file "../endat.c",line 139,column 3,is_stmt,isa 0
    2250 00000388 8F00          MOVL      XAR4,#7998            ; [CPU_ARAU] |139| 
         00000389 1F3E 
    2251                      .dwpsn  file "../endat.c",line 137,column 3,is_stmt,isa 0
    2252 0000038a 90FF          ANDB      AL,#0xff              ; [CPU_ALU] |137| 
    2253 0000038b FF69          SPM       #0                    ; [CPU_ALU] 
    2254 0000038c 0EA9          MOVU      ACC,AL                ; [CPU_ALU] |137| 
    2255 0000038d 1E16-         MOVL      @_endat22Data+22,ACC  ; [CPU_ALU] |137| 
    2256                      .dwpsn  file "../endat.c",line 139,column 3,is_stmt,isa 0
    2257 0000038e A8A9          MOVL      ACC,XAR4              ; [CPU_ALU] |139| 
    2258              $C$DW$152       .dwtag  DW_TAG_TI_branch
    2259                      .dwattr $C$DW$152, DW_AT_low_pc(0x00)
    2260                      .dwattr $C$DW$152, DW_AT_name("_F28x_usDelay")
    2261                      .dwattr $C$DW$152, DW_AT_TI_call
    2262              
    2263 0000038f 7640!         LCR       #_F28x_usDelay        ; [CPU_ALU] |139| 
         00000390 0000 
    2264                      ; call occurs [#_F28x_usDelay] ; [] |139| 
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   47

    2265 00000391 FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
    2266                      .dwcfi  cfa_offset, -4
    2267 00000392 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
    2268                      .dwcfi  cfa_offset, -2
    2269                      .dwcfi  restore_reg, 7
    2270              $C$DW$153       .dwtag  DW_TAG_TI_branch
    2271                      .dwattr $C$DW$153, DW_AT_low_pc(0x00)
    2272                      .dwattr $C$DW$153, DW_AT_TI_return
    2273              
    2274 00000393 0006          LRETR     ; [CPU_ALU] 
    2275                      ; return occurs ; [] 
    2276                      .dwattr $C$DW$121, DW_AT_TI_end_file("../endat.c")
    2277                      .dwattr $C$DW$121, DW_AT_TI_end_line(0x8c)
    2278                      .dwattr $C$DW$121, DW_AT_TI_end_column(0x01)
    2279                      .dwendentry
    2280                      .dwendtag $C$DW$121
    2281              
    2282              ;**************************************************************
    2283              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2284              ;**************************************************************
    2285                      .global _PM_endat22_generateCRCTable
    2286                      .global _PM_endat22_setupPeriph
    2287                      .global _F28x_usDelay
    2288                      .global _PM_endat22_setFreq
    2289                      .global _PM_endat22_startOperation
    2290                      .global _PM_endat22_setupCommand
    2291                      .global _PM_endat22_receiveData
    2292                      .global _PM_endat22_getDelayCompVal
    2293                      .global _PM_endat22_getCrcNorm
    2294                      .global _PM_endat22_getCrcPos
    2295                      .global _SpibRegs
    2296                      .global _PieCtrlRegs
    2297                      .global _InputXbarRegs
    2298                      .global _GpioDataRegs
    2299                      .global _CpuSysRegs
    2300                      .global _EPwm4Regs
    2301                      .global _GpioCtrlRegs
    2302                      .global _PieVectTable
    2303              
    2304              ;***************************************************************
    2305              ;* TYPE INFORMATION                                            *
    2306              ;***************************************************************
    2307              
    2308              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2309                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x5e)
    2310              $C$DW$154       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    2312                      .dwattr $C$DW$154, DW_AT_name("position_lo")
    2313                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_position_lo")
    2314                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2315                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2316              
    2317              $C$DW$155       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    2319                      .dwattr $C$DW$155, DW_AT_name("position_hi")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   48

    2320                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_position_hi")
    2321                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2322                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2323              
    2324              $C$DW$156       .dwtag  DW_TAG_member
    2325                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$22)
    2326                      .dwattr $C$DW$156, DW_AT_name("error1")
    2327                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_error1")
    2328                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2329                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2330              
    2331              $C$DW$157       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$22)
    2333                      .dwattr $C$DW$157, DW_AT_name("error2")
    2334                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_error2")
    2335                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2336                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2337              
    2338              $C$DW$158       .dwtag  DW_TAG_member
    2339                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$22)
    2340                      .dwattr $C$DW$158, DW_AT_name("data")
    2341                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_data")
    2342                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2343                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2344              
    2345              $C$DW$159       .dwtag  DW_TAG_member
    2346                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$22)
    2347                      .dwattr $C$DW$159, DW_AT_name("data_crc")
    2348                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_data_crc")
    2349                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2350                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2351              
    2352              $C$DW$160       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$22)
    2354                      .dwattr $C$DW$160, DW_AT_name("address")
    2355                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_address")
    2356                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2357                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2358              
    2359              $C$DW$161       .dwtag  DW_TAG_member
    2360                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    2361                      .dwattr $C$DW$161, DW_AT_name("additional_data1")
    2362                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_additional_data1")
    2363                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2364                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2365              
    2366              $C$DW$162       .dwtag  DW_TAG_member
    2367                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2368                      .dwattr $C$DW$162, DW_AT_name("additional_data2")
    2369                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_additional_data2")
    2370                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2371                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2372              
    2373              $C$DW$163       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   49

    2375                      .dwattr $C$DW$163, DW_AT_name("additional_data1_crc")
    2376                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_additional_data1_crc")
    2377                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2378                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2379              
    2380              $C$DW$164       .dwtag  DW_TAG_member
    2381                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2382                      .dwattr $C$DW$164, DW_AT_name("additional_data2_crc")
    2383                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_additional_data2_crc")
    2384                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2385                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2386              
    2387              $C$DW$165       .dwtag  DW_TAG_member
    2388                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    2389                      .dwattr $C$DW$165, DW_AT_name("test_lo")
    2390                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_test_lo")
    2391                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2392                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2393              
    2394              $C$DW$166       .dwtag  DW_TAG_member
    2395                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2396                      .dwattr $C$DW$166, DW_AT_name("test_hi")
    2397                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_test_hi")
    2398                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2399                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2400              
    2401              $C$DW$167       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    2403                      .dwattr $C$DW$167, DW_AT_name("position_clocks")
    2404                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_position_clocks")
    2405                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2406                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2407              
    2408              $C$DW$168       .dwtag  DW_TAG_member
    2409                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$24)
    2410                      .dwattr $C$DW$168, DW_AT_name("spi")
    2411                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_spi")
    2412                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2413                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2414              
    2415              $C$DW$169       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    2417                      .dwattr $C$DW$169, DW_AT_name("delay_comp")
    2418                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_delay_comp")
    2419                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2420                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2421              
    2422              $C$DW$170       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$25)
    2424                      .dwattr $C$DW$170, DW_AT_name("sdata")
    2425                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_sdata")
    2426                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2427                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2428              
    2429              $C$DW$171       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   50

    2430                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$25)
    2431                      .dwattr $C$DW$171, DW_AT_name("rdata")
    2432                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rdata")
    2433                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2434                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2435              
    2436              $C$DW$172       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    2438                      .dwattr $C$DW$172, DW_AT_name("dataReady")
    2439                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_dataReady")
    2440                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2441                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2442              
    2443              $C$DW$173       .dwtag  DW_TAG_member
    2444                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    2445                      .dwattr $C$DW$173, DW_AT_name("fifo_level")
    2446                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_fifo_level")
    2447                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    2448                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2449              
    2450                      .dwendtag $C$DW$T$26
    2451              
    2452              $C$DW$T$539     .dwtag  DW_TAG_typedef
    2453                      .dwattr $C$DW$T$539, DW_AT_name("ENDAT_DATA_STRUCT")
    2454                      .dwattr $C$DW$T$539, DW_AT_type(*$C$DW$T$26)
    2455                      .dwattr $C$DW$T$539, DW_AT_language(DW_LANG_C)
    2456              
    2457              
    2458              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2459                      .dwattr $C$DW$T$28, DW_AT_name("AQCSFRC_BITS")
    2460                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2461              $C$DW$174       .dwtag  DW_TAG_member
    2462                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$27)
    2463                      .dwattr $C$DW$174, DW_AT_name("CSFA")
    2464                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_CSFA")
    2465                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0e)
    2466                      .dwattr $C$DW$174, DW_AT_bit_size(0x02)
    2467                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2468                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2469              
    2470              $C$DW$175       .dwtag  DW_TAG_member
    2471                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$27)
    2472                      .dwattr $C$DW$175, DW_AT_name("CSFB")
    2473                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_CSFB")
    2474                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0c)
    2475                      .dwattr $C$DW$175, DW_AT_bit_size(0x02)
    2476                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2477                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2478              
    2479              $C$DW$176       .dwtag  DW_TAG_member
    2480                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
    2481                      .dwattr $C$DW$176, DW_AT_name("rsvd1")
    2482                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd1")
    2483                      .dwattr $C$DW$176, DW_AT_bit_offset(0x00)
    2484                      .dwattr $C$DW$176, DW_AT_bit_size(0x0c)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   51

    2485                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2486                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2487              
    2488                      .dwendtag $C$DW$T$28
    2489              
    2490              
    2491              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2492                      .dwattr $C$DW$T$29, DW_AT_name("AQCSFRC_REG")
    2493                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2494              $C$DW$177       .dwtag  DW_TAG_member
    2495                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    2496                      .dwattr $C$DW$177, DW_AT_name("all")
    2497                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_all")
    2498                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2499                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2500              
    2501              $C$DW$178       .dwtag  DW_TAG_member
    2502                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$28)
    2503                      .dwattr $C$DW$178, DW_AT_name("bit")
    2504                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_bit")
    2505                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2506                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2507              
    2508                      .dwendtag $C$DW$T$29
    2509              
    2510              
    2511              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2512                      .dwattr $C$DW$T$30, DW_AT_name("AQCTLA2_BITS")
    2513                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2514              $C$DW$179       .dwtag  DW_TAG_member
    2515                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$27)
    2516                      .dwattr $C$DW$179, DW_AT_name("T1U")
    2517                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_T1U")
    2518                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0e)
    2519                      .dwattr $C$DW$179, DW_AT_bit_size(0x02)
    2520                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2521                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2522              
    2523              $C$DW$180       .dwtag  DW_TAG_member
    2524                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    2525                      .dwattr $C$DW$180, DW_AT_name("T1D")
    2526                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_T1D")
    2527                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0c)
    2528                      .dwattr $C$DW$180, DW_AT_bit_size(0x02)
    2529                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2530                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2531              
    2532              $C$DW$181       .dwtag  DW_TAG_member
    2533                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$27)
    2534                      .dwattr $C$DW$181, DW_AT_name("T2U")
    2535                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_T2U")
    2536                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0a)
    2537                      .dwattr $C$DW$181, DW_AT_bit_size(0x02)
    2538                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2539                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   52

    2540              
    2541              $C$DW$182       .dwtag  DW_TAG_member
    2542                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$27)
    2543                      .dwattr $C$DW$182, DW_AT_name("T2D")
    2544                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_T2D")
    2545                      .dwattr $C$DW$182, DW_AT_bit_offset(0x08)
    2546                      .dwattr $C$DW$182, DW_AT_bit_size(0x02)
    2547                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2548                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2549              
    2550              $C$DW$183       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$27)
    2552                      .dwattr $C$DW$183, DW_AT_name("rsvd1")
    2553                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd1")
    2554                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00)
    2555                      .dwattr $C$DW$183, DW_AT_bit_size(0x08)
    2556                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2557                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2558              
    2559                      .dwendtag $C$DW$T$30
    2560              
    2561              
    2562              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2563                      .dwattr $C$DW$T$31, DW_AT_name("AQCTLA2_REG")
    2564                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2565              $C$DW$184       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$27)
    2567                      .dwattr $C$DW$184, DW_AT_name("all")
    2568                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_all")
    2569                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2570                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2571              
    2572              $C$DW$185       .dwtag  DW_TAG_member
    2573                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$30)
    2574                      .dwattr $C$DW$185, DW_AT_name("bit")
    2575                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_bit")
    2576                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2577                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2578              
    2579                      .dwendtag $C$DW$T$31
    2580              
    2581              
    2582              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2583                      .dwattr $C$DW$T$32, DW_AT_name("AQCTLA_BITS")
    2584                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2585              $C$DW$186       .dwtag  DW_TAG_member
    2586                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    2587                      .dwattr $C$DW$186, DW_AT_name("ZRO")
    2588                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_ZRO")
    2589                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0e)
    2590                      .dwattr $C$DW$186, DW_AT_bit_size(0x02)
    2591                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2592                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2593              
    2594              $C$DW$187       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   53

    2595                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$27)
    2596                      .dwattr $C$DW$187, DW_AT_name("PRD")
    2597                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PRD")
    2598                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0c)
    2599                      .dwattr $C$DW$187, DW_AT_bit_size(0x02)
    2600                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2601                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2602              
    2603              $C$DW$188       .dwtag  DW_TAG_member
    2604                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    2605                      .dwattr $C$DW$188, DW_AT_name("CAU")
    2606                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_CAU")
    2607                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0a)
    2608                      .dwattr $C$DW$188, DW_AT_bit_size(0x02)
    2609                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2610                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2611              
    2612              $C$DW$189       .dwtag  DW_TAG_member
    2613                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    2614                      .dwattr $C$DW$189, DW_AT_name("CAD")
    2615                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_CAD")
    2616                      .dwattr $C$DW$189, DW_AT_bit_offset(0x08)
    2617                      .dwattr $C$DW$189, DW_AT_bit_size(0x02)
    2618                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2619                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2620              
    2621              $C$DW$190       .dwtag  DW_TAG_member
    2622                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$27)
    2623                      .dwattr $C$DW$190, DW_AT_name("CBU")
    2624                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_CBU")
    2625                      .dwattr $C$DW$190, DW_AT_bit_offset(0x06)
    2626                      .dwattr $C$DW$190, DW_AT_bit_size(0x02)
    2627                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2628                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2629              
    2630              $C$DW$191       .dwtag  DW_TAG_member
    2631                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    2632                      .dwattr $C$DW$191, DW_AT_name("CBD")
    2633                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_CBD")
    2634                      .dwattr $C$DW$191, DW_AT_bit_offset(0x04)
    2635                      .dwattr $C$DW$191, DW_AT_bit_size(0x02)
    2636                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2637                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2638              
    2639              $C$DW$192       .dwtag  DW_TAG_member
    2640                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$27)
    2641                      .dwattr $C$DW$192, DW_AT_name("rsvd1")
    2642                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd1")
    2643                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00)
    2644                      .dwattr $C$DW$192, DW_AT_bit_size(0x04)
    2645                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2646                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2647              
    2648                      .dwendtag $C$DW$T$32
    2649              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   54

    2650              
    2651              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2652                      .dwattr $C$DW$T$33, DW_AT_name("AQCTLA_REG")
    2653                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2654              $C$DW$193       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
    2656                      .dwattr $C$DW$193, DW_AT_name("all")
    2657                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_all")
    2658                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2659                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2660              
    2661              $C$DW$194       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$32)
    2663                      .dwattr $C$DW$194, DW_AT_name("bit")
    2664                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_bit")
    2665                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2666                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2667              
    2668                      .dwendtag $C$DW$T$33
    2669              
    2670              
    2671              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2672                      .dwattr $C$DW$T$34, DW_AT_name("AQCTLB2_BITS")
    2673                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2674              $C$DW$195       .dwtag  DW_TAG_member
    2675                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$27)
    2676                      .dwattr $C$DW$195, DW_AT_name("T1U")
    2677                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_T1U")
    2678                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0e)
    2679                      .dwattr $C$DW$195, DW_AT_bit_size(0x02)
    2680                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2681                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2682              
    2683              $C$DW$196       .dwtag  DW_TAG_member
    2684                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$27)
    2685                      .dwattr $C$DW$196, DW_AT_name("T1D")
    2686                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_T1D")
    2687                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0c)
    2688                      .dwattr $C$DW$196, DW_AT_bit_size(0x02)
    2689                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2690                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2691              
    2692              $C$DW$197       .dwtag  DW_TAG_member
    2693                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    2694                      .dwattr $C$DW$197, DW_AT_name("T2U")
    2695                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_T2U")
    2696                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0a)
    2697                      .dwattr $C$DW$197, DW_AT_bit_size(0x02)
    2698                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2699                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2700              
    2701              $C$DW$198       .dwtag  DW_TAG_member
    2702                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$27)
    2703                      .dwattr $C$DW$198, DW_AT_name("T2D")
    2704                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_T2D")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   55

    2705                      .dwattr $C$DW$198, DW_AT_bit_offset(0x08)
    2706                      .dwattr $C$DW$198, DW_AT_bit_size(0x02)
    2707                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2708                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2709              
    2710              $C$DW$199       .dwtag  DW_TAG_member
    2711                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$27)
    2712                      .dwattr $C$DW$199, DW_AT_name("rsvd1")
    2713                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_rsvd1")
    2714                      .dwattr $C$DW$199, DW_AT_bit_offset(0x00)
    2715                      .dwattr $C$DW$199, DW_AT_bit_size(0x08)
    2716                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2717                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2718              
    2719                      .dwendtag $C$DW$T$34
    2720              
    2721              
    2722              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2723                      .dwattr $C$DW$T$35, DW_AT_name("AQCTLB2_REG")
    2724                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2725              $C$DW$200       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    2727                      .dwattr $C$DW$200, DW_AT_name("all")
    2728                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_all")
    2729                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2730                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2731              
    2732              $C$DW$201       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$34)
    2734                      .dwattr $C$DW$201, DW_AT_name("bit")
    2735                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_bit")
    2736                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2737                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2738              
    2739                      .dwendtag $C$DW$T$35
    2740              
    2741              
    2742              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2743                      .dwattr $C$DW$T$36, DW_AT_name("AQCTLB_BITS")
    2744                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2745              $C$DW$202       .dwtag  DW_TAG_member
    2746                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$27)
    2747                      .dwattr $C$DW$202, DW_AT_name("ZRO")
    2748                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_ZRO")
    2749                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0e)
    2750                      .dwattr $C$DW$202, DW_AT_bit_size(0x02)
    2751                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2752                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2753              
    2754              $C$DW$203       .dwtag  DW_TAG_member
    2755                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$27)
    2756                      .dwattr $C$DW$203, DW_AT_name("PRD")
    2757                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_PRD")
    2758                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0c)
    2759                      .dwattr $C$DW$203, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   56

    2760                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2761                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2762              
    2763              $C$DW$204       .dwtag  DW_TAG_member
    2764                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$27)
    2765                      .dwattr $C$DW$204, DW_AT_name("CAU")
    2766                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_CAU")
    2767                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0a)
    2768                      .dwattr $C$DW$204, DW_AT_bit_size(0x02)
    2769                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2770                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2771              
    2772              $C$DW$205       .dwtag  DW_TAG_member
    2773                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$27)
    2774                      .dwattr $C$DW$205, DW_AT_name("CAD")
    2775                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_CAD")
    2776                      .dwattr $C$DW$205, DW_AT_bit_offset(0x08)
    2777                      .dwattr $C$DW$205, DW_AT_bit_size(0x02)
    2778                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2779                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2780              
    2781              $C$DW$206       .dwtag  DW_TAG_member
    2782                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$27)
    2783                      .dwattr $C$DW$206, DW_AT_name("CBU")
    2784                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_CBU")
    2785                      .dwattr $C$DW$206, DW_AT_bit_offset(0x06)
    2786                      .dwattr $C$DW$206, DW_AT_bit_size(0x02)
    2787                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2788                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2789              
    2790              $C$DW$207       .dwtag  DW_TAG_member
    2791                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$27)
    2792                      .dwattr $C$DW$207, DW_AT_name("CBD")
    2793                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_CBD")
    2794                      .dwattr $C$DW$207, DW_AT_bit_offset(0x04)
    2795                      .dwattr $C$DW$207, DW_AT_bit_size(0x02)
    2796                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2797                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2798              
    2799              $C$DW$208       .dwtag  DW_TAG_member
    2800                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$27)
    2801                      .dwattr $C$DW$208, DW_AT_name("rsvd1")
    2802                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_rsvd1")
    2803                      .dwattr $C$DW$208, DW_AT_bit_offset(0x00)
    2804                      .dwattr $C$DW$208, DW_AT_bit_size(0x04)
    2805                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2806                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2807              
    2808                      .dwendtag $C$DW$T$36
    2809              
    2810              
    2811              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2812                      .dwattr $C$DW$T$37, DW_AT_name("AQCTLB_REG")
    2813                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2814              $C$DW$209       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   57

    2815                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$27)
    2816                      .dwattr $C$DW$209, DW_AT_name("all")
    2817                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_all")
    2818                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2819                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2820              
    2821              $C$DW$210       .dwtag  DW_TAG_member
    2822                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$36)
    2823                      .dwattr $C$DW$210, DW_AT_name("bit")
    2824                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_bit")
    2825                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2826                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2827              
    2828                      .dwendtag $C$DW$T$37
    2829              
    2830              
    2831              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2832                      .dwattr $C$DW$T$38, DW_AT_name("AQCTL_BITS")
    2833                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2834              $C$DW$211       .dwtag  DW_TAG_member
    2835                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$27)
    2836                      .dwattr $C$DW$211, DW_AT_name("LDAQAMODE")
    2837                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_LDAQAMODE")
    2838                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0e)
    2839                      .dwattr $C$DW$211, DW_AT_bit_size(0x02)
    2840                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2841                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2842              
    2843              $C$DW$212       .dwtag  DW_TAG_member
    2844                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$27)
    2845                      .dwattr $C$DW$212, DW_AT_name("LDAQBMODE")
    2846                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_LDAQBMODE")
    2847                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0c)
    2848                      .dwattr $C$DW$212, DW_AT_bit_size(0x02)
    2849                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2850                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2851              
    2852              $C$DW$213       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$27)
    2854                      .dwattr $C$DW$213, DW_AT_name("SHDWAQAMODE")
    2855                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_SHDWAQAMODE")
    2856                      .dwattr $C$DW$213, DW_AT_bit_offset(0x0b)
    2857                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2858                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2859                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2860              
    2861              $C$DW$214       .dwtag  DW_TAG_member
    2862                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$27)
    2863                      .dwattr $C$DW$214, DW_AT_name("rsvd1")
    2864                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_rsvd1")
    2865                      .dwattr $C$DW$214, DW_AT_bit_offset(0x0a)
    2866                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    2867                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2868                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2869              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   58

    2870              $C$DW$215       .dwtag  DW_TAG_member
    2871                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$27)
    2872                      .dwattr $C$DW$215, DW_AT_name("SHDWAQBMODE")
    2873                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_SHDWAQBMODE")
    2874                      .dwattr $C$DW$215, DW_AT_bit_offset(0x09)
    2875                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    2876                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2877                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2878              
    2879              $C$DW$216       .dwtag  DW_TAG_member
    2880                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$27)
    2881                      .dwattr $C$DW$216, DW_AT_name("rsvd2")
    2882                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_rsvd2")
    2883                      .dwattr $C$DW$216, DW_AT_bit_offset(0x08)
    2884                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    2885                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2886                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2887              
    2888              $C$DW$217       .dwtag  DW_TAG_member
    2889                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
    2890                      .dwattr $C$DW$217, DW_AT_name("LDAQASYNC")
    2891                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_LDAQASYNC")
    2892                      .dwattr $C$DW$217, DW_AT_bit_offset(0x06)
    2893                      .dwattr $C$DW$217, DW_AT_bit_size(0x02)
    2894                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2895                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2896              
    2897              $C$DW$218       .dwtag  DW_TAG_member
    2898                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$27)
    2899                      .dwattr $C$DW$218, DW_AT_name("LDAQBSYNC")
    2900                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_LDAQBSYNC")
    2901                      .dwattr $C$DW$218, DW_AT_bit_offset(0x04)
    2902                      .dwattr $C$DW$218, DW_AT_bit_size(0x02)
    2903                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2904                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2905              
    2906              $C$DW$219       .dwtag  DW_TAG_member
    2907                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$27)
    2908                      .dwattr $C$DW$219, DW_AT_name("rsvd3")
    2909                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_rsvd3")
    2910                      .dwattr $C$DW$219, DW_AT_bit_offset(0x00)
    2911                      .dwattr $C$DW$219, DW_AT_bit_size(0x04)
    2912                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2913                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2914              
    2915                      .dwendtag $C$DW$T$38
    2916              
    2917              
    2918              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2919                      .dwattr $C$DW$T$39, DW_AT_name("AQCTL_REG")
    2920                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2921              $C$DW$220       .dwtag  DW_TAG_member
    2922                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$27)
    2923                      .dwattr $C$DW$220, DW_AT_name("all")
    2924                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   59

    2925                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2926                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2927              
    2928              $C$DW$221       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$38)
    2930                      .dwattr $C$DW$221, DW_AT_name("bit")
    2931                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_bit")
    2932                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2933                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2934              
    2935                      .dwendtag $C$DW$T$39
    2936              
    2937              
    2938              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2939                      .dwattr $C$DW$T$40, DW_AT_name("AQSFRC_BITS")
    2940                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2941              $C$DW$222       .dwtag  DW_TAG_member
    2942                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$27)
    2943                      .dwattr $C$DW$222, DW_AT_name("ACTSFA")
    2944                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_ACTSFA")
    2945                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0e)
    2946                      .dwattr $C$DW$222, DW_AT_bit_size(0x02)
    2947                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2948                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2949              
    2950              $C$DW$223       .dwtag  DW_TAG_member
    2951                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$27)
    2952                      .dwattr $C$DW$223, DW_AT_name("OTSFA")
    2953                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_OTSFA")
    2954                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0d)
    2955                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    2956                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2957                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2958              
    2959              $C$DW$224       .dwtag  DW_TAG_member
    2960                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$27)
    2961                      .dwattr $C$DW$224, DW_AT_name("ACTSFB")
    2962                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_ACTSFB")
    2963                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0b)
    2964                      .dwattr $C$DW$224, DW_AT_bit_size(0x02)
    2965                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2966                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2967              
    2968              $C$DW$225       .dwtag  DW_TAG_member
    2969                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$27)
    2970                      .dwattr $C$DW$225, DW_AT_name("OTSFB")
    2971                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_OTSFB")
    2972                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0a)
    2973                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    2974                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2975                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2976              
    2977              $C$DW$226       .dwtag  DW_TAG_member
    2978                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$27)
    2979                      .dwattr $C$DW$226, DW_AT_name("RLDCSF")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   60

    2980                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_RLDCSF")
    2981                      .dwattr $C$DW$226, DW_AT_bit_offset(0x08)
    2982                      .dwattr $C$DW$226, DW_AT_bit_size(0x02)
    2983                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2984                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2985              
    2986              $C$DW$227       .dwtag  DW_TAG_member
    2987                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$27)
    2988                      .dwattr $C$DW$227, DW_AT_name("rsvd1")
    2989                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_rsvd1")
    2990                      .dwattr $C$DW$227, DW_AT_bit_offset(0x00)
    2991                      .dwattr $C$DW$227, DW_AT_bit_size(0x08)
    2992                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2993                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2994              
    2995                      .dwendtag $C$DW$T$40
    2996              
    2997              
    2998              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2999                      .dwattr $C$DW$T$41, DW_AT_name("AQSFRC_REG")
    3000                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    3001              $C$DW$228       .dwtag  DW_TAG_member
    3002                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
    3003                      .dwattr $C$DW$228, DW_AT_name("all")
    3004                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_all")
    3005                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3006                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3007              
    3008              $C$DW$229       .dwtag  DW_TAG_member
    3009                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$40)
    3010                      .dwattr $C$DW$229, DW_AT_name("bit")
    3011                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_bit")
    3012                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3013                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3014              
    3015                      .dwendtag $C$DW$T$41
    3016              
    3017              
    3018              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3019                      .dwattr $C$DW$T$42, DW_AT_name("AQTSRCSEL_BITS")
    3020                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    3021              $C$DW$230       .dwtag  DW_TAG_member
    3022                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$27)
    3023                      .dwattr $C$DW$230, DW_AT_name("T1SEL")
    3024                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_T1SEL")
    3025                      .dwattr $C$DW$230, DW_AT_bit_offset(0x0c)
    3026                      .dwattr $C$DW$230, DW_AT_bit_size(0x04)
    3027                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3028                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3029              
    3030              $C$DW$231       .dwtag  DW_TAG_member
    3031                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$27)
    3032                      .dwattr $C$DW$231, DW_AT_name("T2SEL")
    3033                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_T2SEL")
    3034                      .dwattr $C$DW$231, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   61

    3035                      .dwattr $C$DW$231, DW_AT_bit_size(0x04)
    3036                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3037                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3038              
    3039              $C$DW$232       .dwtag  DW_TAG_member
    3040                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$27)
    3041                      .dwattr $C$DW$232, DW_AT_name("rsvd1")
    3042                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_rsvd1")
    3043                      .dwattr $C$DW$232, DW_AT_bit_offset(0x00)
    3044                      .dwattr $C$DW$232, DW_AT_bit_size(0x08)
    3045                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3046                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3047              
    3048                      .dwendtag $C$DW$T$42
    3049              
    3050              
    3051              $C$DW$T$43      .dwtag  DW_TAG_union_type
    3052                      .dwattr $C$DW$T$43, DW_AT_name("AQTSRCSEL_REG")
    3053                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    3054              $C$DW$233       .dwtag  DW_TAG_member
    3055                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$27)
    3056                      .dwattr $C$DW$233, DW_AT_name("all")
    3057                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_all")
    3058                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3059                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3060              
    3061              $C$DW$234       .dwtag  DW_TAG_member
    3062                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$42)
    3063                      .dwattr $C$DW$234, DW_AT_name("bit")
    3064                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_bit")
    3065                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3066                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3067              
    3068                      .dwendtag $C$DW$T$43
    3069              
    3070              
    3071              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3072                      .dwattr $C$DW$T$44, DW_AT_name("CMPA_BITS")
    3073                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    3074              $C$DW$235       .dwtag  DW_TAG_member
    3075                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$27)
    3076                      .dwattr $C$DW$235, DW_AT_name("CMPAHR")
    3077                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_CMPAHR")
    3078                      .dwattr $C$DW$235, DW_AT_bit_offset(0x00)
    3079                      .dwattr $C$DW$235, DW_AT_bit_size(0x10)
    3080                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3081                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3082              
    3083              $C$DW$236       .dwtag  DW_TAG_member
    3084                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
    3085                      .dwattr $C$DW$236, DW_AT_name("CMPA")
    3086                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_CMPA")
    3087                      .dwattr $C$DW$236, DW_AT_bit_offset(0x00)
    3088                      .dwattr $C$DW$236, DW_AT_bit_size(0x10)
    3089                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   62

    3090                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3091              
    3092                      .dwendtag $C$DW$T$44
    3093              
    3094              
    3095              $C$DW$T$46      .dwtag  DW_TAG_union_type
    3096                      .dwattr $C$DW$T$46, DW_AT_name("CMPA_REG")
    3097                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    3098              $C$DW$237       .dwtag  DW_TAG_member
    3099                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$45)
    3100                      .dwattr $C$DW$237, DW_AT_name("all")
    3101                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_all")
    3102                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3103                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3104              
    3105              $C$DW$238       .dwtag  DW_TAG_member
    3106                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$44)
    3107                      .dwattr $C$DW$238, DW_AT_name("bit")
    3108                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_bit")
    3109                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3110                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3111              
    3112                      .dwendtag $C$DW$T$46
    3113              
    3114              
    3115              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3116                      .dwattr $C$DW$T$47, DW_AT_name("CMPB_BITS")
    3117                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    3118              $C$DW$239       .dwtag  DW_TAG_member
    3119                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$27)
    3120                      .dwattr $C$DW$239, DW_AT_name("CMPBHR")
    3121                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_CMPBHR")
    3122                      .dwattr $C$DW$239, DW_AT_bit_offset(0x00)
    3123                      .dwattr $C$DW$239, DW_AT_bit_size(0x10)
    3124                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3125                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3126              
    3127              $C$DW$240       .dwtag  DW_TAG_member
    3128                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$27)
    3129                      .dwattr $C$DW$240, DW_AT_name("CMPB")
    3130                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_CMPB")
    3131                      .dwattr $C$DW$240, DW_AT_bit_offset(0x00)
    3132                      .dwattr $C$DW$240, DW_AT_bit_size(0x10)
    3133                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3134                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3135              
    3136                      .dwendtag $C$DW$T$47
    3137              
    3138              
    3139              $C$DW$T$48      .dwtag  DW_TAG_union_type
    3140                      .dwattr $C$DW$T$48, DW_AT_name("CMPB_REG")
    3141                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3142              $C$DW$241       .dwtag  DW_TAG_member
    3143                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$45)
    3144                      .dwattr $C$DW$241, DW_AT_name("all")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   63

    3145                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_all")
    3146                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3147                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3148              
    3149              $C$DW$242       .dwtag  DW_TAG_member
    3150                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$47)
    3151                      .dwattr $C$DW$242, DW_AT_name("bit")
    3152                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_bit")
    3153                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3154                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3155              
    3156                      .dwendtag $C$DW$T$48
    3157              
    3158              
    3159              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3160                      .dwattr $C$DW$T$49, DW_AT_name("CMPCTL2_BITS")
    3161                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    3162              $C$DW$243       .dwtag  DW_TAG_member
    3163                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$27)
    3164                      .dwattr $C$DW$243, DW_AT_name("LOADCMODE")
    3165                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_LOADCMODE")
    3166                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0e)
    3167                      .dwattr $C$DW$243, DW_AT_bit_size(0x02)
    3168                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3169                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3170              
    3171              $C$DW$244       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$27)
    3173                      .dwattr $C$DW$244, DW_AT_name("LOADDMODE")
    3174                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_LOADDMODE")
    3175                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0c)
    3176                      .dwattr $C$DW$244, DW_AT_bit_size(0x02)
    3177                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3178                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3179              
    3180              $C$DW$245       .dwtag  DW_TAG_member
    3181                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$27)
    3182                      .dwattr $C$DW$245, DW_AT_name("SHDWCMODE")
    3183                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_SHDWCMODE")
    3184                      .dwattr $C$DW$245, DW_AT_bit_offset(0x0b)
    3185                      .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    3186                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3187                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3188              
    3189              $C$DW$246       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$27)
    3191                      .dwattr $C$DW$246, DW_AT_name("rsvd1")
    3192                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_rsvd1")
    3193                      .dwattr $C$DW$246, DW_AT_bit_offset(0x0a)
    3194                      .dwattr $C$DW$246, DW_AT_bit_size(0x01)
    3195                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3196                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3197              
    3198              $C$DW$247       .dwtag  DW_TAG_member
    3199                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   64

    3200                      .dwattr $C$DW$247, DW_AT_name("SHDWDMODE")
    3201                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_SHDWDMODE")
    3202                      .dwattr $C$DW$247, DW_AT_bit_offset(0x09)
    3203                      .dwattr $C$DW$247, DW_AT_bit_size(0x01)
    3204                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3205                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3206              
    3207              $C$DW$248       .dwtag  DW_TAG_member
    3208                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$27)
    3209                      .dwattr $C$DW$248, DW_AT_name("rsvd2")
    3210                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_rsvd2")
    3211                      .dwattr $C$DW$248, DW_AT_bit_offset(0x06)
    3212                      .dwattr $C$DW$248, DW_AT_bit_size(0x03)
    3213                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3214                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3215              
    3216              $C$DW$249       .dwtag  DW_TAG_member
    3217                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$27)
    3218                      .dwattr $C$DW$249, DW_AT_name("LOADCSYNC")
    3219                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_LOADCSYNC")
    3220                      .dwattr $C$DW$249, DW_AT_bit_offset(0x04)
    3221                      .dwattr $C$DW$249, DW_AT_bit_size(0x02)
    3222                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3223                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3224              
    3225              $C$DW$250       .dwtag  DW_TAG_member
    3226                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$27)
    3227                      .dwattr $C$DW$250, DW_AT_name("LOADDSYNC")
    3228                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_LOADDSYNC")
    3229                      .dwattr $C$DW$250, DW_AT_bit_offset(0x02)
    3230                      .dwattr $C$DW$250, DW_AT_bit_size(0x02)
    3231                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3232                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3233              
    3234              $C$DW$251       .dwtag  DW_TAG_member
    3235                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$27)
    3236                      .dwattr $C$DW$251, DW_AT_name("rsvd3")
    3237                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_rsvd3")
    3238                      .dwattr $C$DW$251, DW_AT_bit_offset(0x00)
    3239                      .dwattr $C$DW$251, DW_AT_bit_size(0x02)
    3240                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3241                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3242              
    3243                      .dwendtag $C$DW$T$49
    3244              
    3245              
    3246              $C$DW$T$50      .dwtag  DW_TAG_union_type
    3247                      .dwattr $C$DW$T$50, DW_AT_name("CMPCTL2_REG")
    3248                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    3249              $C$DW$252       .dwtag  DW_TAG_member
    3250                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$27)
    3251                      .dwattr $C$DW$252, DW_AT_name("all")
    3252                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_all")
    3253                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3254                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   65

    3255              
    3256              $C$DW$253       .dwtag  DW_TAG_member
    3257                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$49)
    3258                      .dwattr $C$DW$253, DW_AT_name("bit")
    3259                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_bit")
    3260                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3261                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3262              
    3263                      .dwendtag $C$DW$T$50
    3264              
    3265              
    3266              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3267                      .dwattr $C$DW$T$51, DW_AT_name("CMPCTL_BITS")
    3268                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    3269              $C$DW$254       .dwtag  DW_TAG_member
    3270                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    3271                      .dwattr $C$DW$254, DW_AT_name("LOADAMODE")
    3272                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_LOADAMODE")
    3273                      .dwattr $C$DW$254, DW_AT_bit_offset(0x0e)
    3274                      .dwattr $C$DW$254, DW_AT_bit_size(0x02)
    3275                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3276                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3277              
    3278              $C$DW$255       .dwtag  DW_TAG_member
    3279                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    3280                      .dwattr $C$DW$255, DW_AT_name("LOADBMODE")
    3281                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_LOADBMODE")
    3282                      .dwattr $C$DW$255, DW_AT_bit_offset(0x0c)
    3283                      .dwattr $C$DW$255, DW_AT_bit_size(0x02)
    3284                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3285                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3286              
    3287              $C$DW$256       .dwtag  DW_TAG_member
    3288                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    3289                      .dwattr $C$DW$256, DW_AT_name("SHDWAMODE")
    3290                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_SHDWAMODE")
    3291                      .dwattr $C$DW$256, DW_AT_bit_offset(0x0b)
    3292                      .dwattr $C$DW$256, DW_AT_bit_size(0x01)
    3293                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3294                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3295              
    3296              $C$DW$257       .dwtag  DW_TAG_member
    3297                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    3298                      .dwattr $C$DW$257, DW_AT_name("rsvd1")
    3299                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_rsvd1")
    3300                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0a)
    3301                      .dwattr $C$DW$257, DW_AT_bit_size(0x01)
    3302                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3303                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3304              
    3305              $C$DW$258       .dwtag  DW_TAG_member
    3306                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$27)
    3307                      .dwattr $C$DW$258, DW_AT_name("SHDWBMODE")
    3308                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_SHDWBMODE")
    3309                      .dwattr $C$DW$258, DW_AT_bit_offset(0x09)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   66

    3310                      .dwattr $C$DW$258, DW_AT_bit_size(0x01)
    3311                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3312                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3313              
    3314              $C$DW$259       .dwtag  DW_TAG_member
    3315                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    3316                      .dwattr $C$DW$259, DW_AT_name("rsvd2")
    3317                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_rsvd2")
    3318                      .dwattr $C$DW$259, DW_AT_bit_offset(0x08)
    3319                      .dwattr $C$DW$259, DW_AT_bit_size(0x01)
    3320                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3321                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3322              
    3323              $C$DW$260       .dwtag  DW_TAG_member
    3324                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$27)
    3325                      .dwattr $C$DW$260, DW_AT_name("SHDWAFULL")
    3326                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_SHDWAFULL")
    3327                      .dwattr $C$DW$260, DW_AT_bit_offset(0x07)
    3328                      .dwattr $C$DW$260, DW_AT_bit_size(0x01)
    3329                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3330                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3331              
    3332              $C$DW$261       .dwtag  DW_TAG_member
    3333                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$27)
    3334                      .dwattr $C$DW$261, DW_AT_name("SHDWBFULL")
    3335                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_SHDWBFULL")
    3336                      .dwattr $C$DW$261, DW_AT_bit_offset(0x06)
    3337                      .dwattr $C$DW$261, DW_AT_bit_size(0x01)
    3338                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3339                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3340              
    3341              $C$DW$262       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$27)
    3343                      .dwattr $C$DW$262, DW_AT_name("LOADASYNC")
    3344                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_LOADASYNC")
    3345                      .dwattr $C$DW$262, DW_AT_bit_offset(0x04)
    3346                      .dwattr $C$DW$262, DW_AT_bit_size(0x02)
    3347                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3348                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3349              
    3350              $C$DW$263       .dwtag  DW_TAG_member
    3351                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$27)
    3352                      .dwattr $C$DW$263, DW_AT_name("LOADBSYNC")
    3353                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_LOADBSYNC")
    3354                      .dwattr $C$DW$263, DW_AT_bit_offset(0x02)
    3355                      .dwattr $C$DW$263, DW_AT_bit_size(0x02)
    3356                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3357                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3358              
    3359              $C$DW$264       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$27)
    3361                      .dwattr $C$DW$264, DW_AT_name("rsvd3")
    3362                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_rsvd3")
    3363                      .dwattr $C$DW$264, DW_AT_bit_offset(0x00)
    3364                      .dwattr $C$DW$264, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   67

    3365                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3366                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3367              
    3368                      .dwendtag $C$DW$T$51
    3369              
    3370              
    3371              $C$DW$T$52      .dwtag  DW_TAG_union_type
    3372                      .dwattr $C$DW$T$52, DW_AT_name("CMPCTL_REG")
    3373                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    3374              $C$DW$265       .dwtag  DW_TAG_member
    3375                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$27)
    3376                      .dwattr $C$DW$265, DW_AT_name("all")
    3377                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_all")
    3378                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3379                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3380              
    3381              $C$DW$266       .dwtag  DW_TAG_member
    3382                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$51)
    3383                      .dwattr $C$DW$266, DW_AT_name("bit")
    3384                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_bit")
    3385                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3386                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3387              
    3388                      .dwendtag $C$DW$T$52
    3389              
    3390              
    3391              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3392                      .dwattr $C$DW$T$53, DW_AT_name("CPUSYSLOCK1_BITS")
    3393                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
    3394              $C$DW$267       .dwtag  DW_TAG_member
    3395                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$27)
    3396                      .dwattr $C$DW$267, DW_AT_name("HIBBOOTMODE")
    3397                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    3398                      .dwattr $C$DW$267, DW_AT_bit_offset(0x0f)
    3399                      .dwattr $C$DW$267, DW_AT_bit_size(0x01)
    3400                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3401                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3402              
    3403              $C$DW$268       .dwtag  DW_TAG_member
    3404                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$27)
    3405                      .dwattr $C$DW$268, DW_AT_name("IORESTOREADDR")
    3406                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_IORESTOREADDR")
    3407                      .dwattr $C$DW$268, DW_AT_bit_offset(0x0e)
    3408                      .dwattr $C$DW$268, DW_AT_bit_size(0x01)
    3409                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3410                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3411              
    3412              $C$DW$269       .dwtag  DW_TAG_member
    3413                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$27)
    3414                      .dwattr $C$DW$269, DW_AT_name("PIEVERRADDR")
    3415                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_PIEVERRADDR")
    3416                      .dwattr $C$DW$269, DW_AT_bit_offset(0x0d)
    3417                      .dwattr $C$DW$269, DW_AT_bit_size(0x01)
    3418                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3419                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   68

    3420              
    3421              $C$DW$270       .dwtag  DW_TAG_member
    3422                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$27)
    3423                      .dwattr $C$DW$270, DW_AT_name("PCLKCR0")
    3424                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_PCLKCR0")
    3425                      .dwattr $C$DW$270, DW_AT_bit_offset(0x0c)
    3426                      .dwattr $C$DW$270, DW_AT_bit_size(0x01)
    3427                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3428                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3429              
    3430              $C$DW$271       .dwtag  DW_TAG_member
    3431                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$27)
    3432                      .dwattr $C$DW$271, DW_AT_name("PCLKCR1")
    3433                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_PCLKCR1")
    3434                      .dwattr $C$DW$271, DW_AT_bit_offset(0x0b)
    3435                      .dwattr $C$DW$271, DW_AT_bit_size(0x01)
    3436                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3437                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3438              
    3439              $C$DW$272       .dwtag  DW_TAG_member
    3440                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$27)
    3441                      .dwattr $C$DW$272, DW_AT_name("PCLKCR2")
    3442                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_PCLKCR2")
    3443                      .dwattr $C$DW$272, DW_AT_bit_offset(0x0a)
    3444                      .dwattr $C$DW$272, DW_AT_bit_size(0x01)
    3445                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3446                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3447              
    3448              $C$DW$273       .dwtag  DW_TAG_member
    3449                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$27)
    3450                      .dwattr $C$DW$273, DW_AT_name("PCLKCR3")
    3451                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_PCLKCR3")
    3452                      .dwattr $C$DW$273, DW_AT_bit_offset(0x09)
    3453                      .dwattr $C$DW$273, DW_AT_bit_size(0x01)
    3454                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3455                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3456              
    3457              $C$DW$274       .dwtag  DW_TAG_member
    3458                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$27)
    3459                      .dwattr $C$DW$274, DW_AT_name("PCLKCR4")
    3460                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_PCLKCR4")
    3461                      .dwattr $C$DW$274, DW_AT_bit_offset(0x08)
    3462                      .dwattr $C$DW$274, DW_AT_bit_size(0x01)
    3463                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3464                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3465              
    3466              $C$DW$275       .dwtag  DW_TAG_member
    3467                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$27)
    3468                      .dwattr $C$DW$275, DW_AT_name("PCLKCR5")
    3469                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_PCLKCR5")
    3470                      .dwattr $C$DW$275, DW_AT_bit_offset(0x07)
    3471                      .dwattr $C$DW$275, DW_AT_bit_size(0x01)
    3472                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3473                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3474              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   69

    3475              $C$DW$276       .dwtag  DW_TAG_member
    3476                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$27)
    3477                      .dwattr $C$DW$276, DW_AT_name("PCLKCR6")
    3478                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_PCLKCR6")
    3479                      .dwattr $C$DW$276, DW_AT_bit_offset(0x06)
    3480                      .dwattr $C$DW$276, DW_AT_bit_size(0x01)
    3481                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3482                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3483              
    3484              $C$DW$277       .dwtag  DW_TAG_member
    3485                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$27)
    3486                      .dwattr $C$DW$277, DW_AT_name("PCLKCR7")
    3487                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_PCLKCR7")
    3488                      .dwattr $C$DW$277, DW_AT_bit_offset(0x05)
    3489                      .dwattr $C$DW$277, DW_AT_bit_size(0x01)
    3490                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3491                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3492              
    3493              $C$DW$278       .dwtag  DW_TAG_member
    3494                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$27)
    3495                      .dwattr $C$DW$278, DW_AT_name("PCLKCR8")
    3496                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_PCLKCR8")
    3497                      .dwattr $C$DW$278, DW_AT_bit_offset(0x04)
    3498                      .dwattr $C$DW$278, DW_AT_bit_size(0x01)
    3499                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3500                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3501              
    3502              $C$DW$279       .dwtag  DW_TAG_member
    3503                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$27)
    3504                      .dwattr $C$DW$279, DW_AT_name("PCLKCR9")
    3505                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_PCLKCR9")
    3506                      .dwattr $C$DW$279, DW_AT_bit_offset(0x03)
    3507                      .dwattr $C$DW$279, DW_AT_bit_size(0x01)
    3508                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3509                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3510              
    3511              $C$DW$280       .dwtag  DW_TAG_member
    3512                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$27)
    3513                      .dwattr $C$DW$280, DW_AT_name("PCLKCR10")
    3514                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_PCLKCR10")
    3515                      .dwattr $C$DW$280, DW_AT_bit_offset(0x02)
    3516                      .dwattr $C$DW$280, DW_AT_bit_size(0x01)
    3517                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3518                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3519              
    3520              $C$DW$281       .dwtag  DW_TAG_member
    3521                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$27)
    3522                      .dwattr $C$DW$281, DW_AT_name("PCLKCR11")
    3523                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_PCLKCR11")
    3524                      .dwattr $C$DW$281, DW_AT_bit_offset(0x01)
    3525                      .dwattr $C$DW$281, DW_AT_bit_size(0x01)
    3526                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3527                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3528              
    3529              $C$DW$282       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   70

    3530                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$27)
    3531                      .dwattr $C$DW$282, DW_AT_name("PCLKCR12")
    3532                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_PCLKCR12")
    3533                      .dwattr $C$DW$282, DW_AT_bit_offset(0x00)
    3534                      .dwattr $C$DW$282, DW_AT_bit_size(0x01)
    3535                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3536                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3537              
    3538              $C$DW$283       .dwtag  DW_TAG_member
    3539                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$27)
    3540                      .dwattr $C$DW$283, DW_AT_name("PCLKCR13")
    3541                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_PCLKCR13")
    3542                      .dwattr $C$DW$283, DW_AT_bit_offset(0x0f)
    3543                      .dwattr $C$DW$283, DW_AT_bit_size(0x01)
    3544                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3545                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3546              
    3547              $C$DW$284       .dwtag  DW_TAG_member
    3548                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$27)
    3549                      .dwattr $C$DW$284, DW_AT_name("PCLKCR14")
    3550                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_PCLKCR14")
    3551                      .dwattr $C$DW$284, DW_AT_bit_offset(0x0e)
    3552                      .dwattr $C$DW$284, DW_AT_bit_size(0x01)
    3553                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3554                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3555              
    3556              $C$DW$285       .dwtag  DW_TAG_member
    3557                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$27)
    3558                      .dwattr $C$DW$285, DW_AT_name("PCLKCR15")
    3559                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_PCLKCR15")
    3560                      .dwattr $C$DW$285, DW_AT_bit_offset(0x0d)
    3561                      .dwattr $C$DW$285, DW_AT_bit_size(0x01)
    3562                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3563                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3564              
    3565              $C$DW$286       .dwtag  DW_TAG_member
    3566                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$27)
    3567                      .dwattr $C$DW$286, DW_AT_name("PCLKCR16")
    3568                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_PCLKCR16")
    3569                      .dwattr $C$DW$286, DW_AT_bit_offset(0x0c)
    3570                      .dwattr $C$DW$286, DW_AT_bit_size(0x01)
    3571                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3572                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3573              
    3574              $C$DW$287       .dwtag  DW_TAG_member
    3575                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$27)
    3576                      .dwattr $C$DW$287, DW_AT_name("SECMSEL")
    3577                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_SECMSEL")
    3578                      .dwattr $C$DW$287, DW_AT_bit_offset(0x0b)
    3579                      .dwattr $C$DW$287, DW_AT_bit_size(0x01)
    3580                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3581                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3582              
    3583              $C$DW$288       .dwtag  DW_TAG_member
    3584                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
endat.asm                                                            PAGE   71

    3585                      .dwattr $C$DW$288, DW_AT_name("LPMCR")
    3586                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_LPMCR")
    3587                      .dwattr $C$DW$288, DW_AT_bit_offset(0x0a)
    3588                      .dwattr $C$DW$288, DW_AT_bit_size(0x01)
    3589                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3590                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3591              
    3592              $C$DW$289       .dwtag  DW_TAG_member
    3593                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$27)
    3594                      .dwattr $C$DW$289, DW_AT_name("GPIOLPMSEL0")
    3595                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    3596                      .dwattr $C$DW$289, DW_AT_bit_offset(0x09)
    3597                      .dwattr $C$DW$289, DW_AT_bit_size(0x01)
