TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Sat Jul 18 15:28:03 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Desktop\servodrive_TMIDDK\IDDK_PM_Servo_F2837x-v2\F2
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("AdcaRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_AdcaRegs")

     447 000000cb 9701!         MOV       @_AdcaRegs+1,AH       ; [CPU_ALU] |43| 
     448                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     449 000000cc CDA2          AND       AH,AR2,#0x0001        ; [CPU_ALU] |44| 
         000000cd 0001 
     450 000000ce FF96          LSL       AH,7                  ; [CPU_ALU] |44| 
     451 000000cf CC01!         AND       AL,@_AdcaRegs+1,#0xff7f ; [CPU_FPU] |44| 
         000000d0 FF7F 
     452 000000d1 CBA9          OR        AH,AL                 ; [CPU_ALU] |44| 
     453 000000d2 9701!         MOV       @_AdcaRegs+1,AH       ; [CPU_ALU] |44| 
     454                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     455 000000d3 7E3B!         MOV       @_AdcaRegs+59,AR6     ; [CPU_ALU] |45| 
     456 000000d4 92A1          MOV       AL,AR1                ; [CPU_ALU] |45| 
     457                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   10

     458 000000d5 600F          B         $C$L10,NEQ            ; [CPU_ALU] |46| 
     459                      ; branchcc occurs ; [] |46| 
     460 000000d6 761F!         MOVW      DP,#_AdcaRegs+112     ; [CPU_ARAU] 
         000000d7 0001 
     461                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     462 000000d8 0630!         MOVL      ACC,@_AdcaRegs+112    ; [CPU_ALU] |49| 
     463 000000d9 9000          ANDB      AL,#0                 ; [CPU_ALU] |49| 
     464 000000da 1E30!         MOVL      @_AdcaRegs+112,ACC    ; [CPU_ALU] |49| 
     465                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     466 000000db 0632!         MOVL      ACC,@_AdcaRegs+114    ; [CPU_ALU] |50| 
     467 000000dc 9000          ANDB      AL,#0                 ; [CPU_ALU] |50| 
     468 000000dd 1E32!         MOVL      @_AdcaRegs+114,ACC    ; [CPU_ALU] |50| 
     469                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     470 000000de 0636!         MOVL      ACC,@_AdcaRegs+118    ; [CPU_ALU] |51| 
     471 000000df 9000          ANDB      AL,#0                 ; [CPU_ALU] |51| 
     472 000000e0 1E36!         MOVL      @_AdcaRegs+118,ACC    ; [CPU_ALU] |51| 
     473                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     474 000000e1 0638!         MOVL      ACC,@_AdcaRegs+120    ; [CPU_ALU] |52| 
     475 000000e2 9000          ANDB      AL,#0                 ; [CPU_ALU] |52| 
     476 000000e3 1E38!         MOVL      @_AdcaRegs+120,ACC    ; [CPU_ALU] |52| 
     477 000000e4       $C$L10:    
     478 000000e4 82BE          MOVL      XAR3,*--SP            ; [CPU_ALU] 
     479                      .dwcfi  cfa_offset, -6
     480                      .dwcfi  restore_reg, 11
     481 000000e5 86BE          MOVL      XAR2,*--SP            ; [CPU_ALU] 
     482                      .dwcfi  cfa_offset, -4
     483                      .dwcfi  restore_reg, 9
     484 000000e6 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     485                      .dwcfi  cfa_offset, -2
     486                      .dwcfi  restore_reg, 7
     487              $C$DW$22        .dwtag  DW_TAG_TI_branch
     488                      .dwattr $C$DW$22, DW_AT_low_pc(0x00)
     489                      .dwattr $C$DW$22, DW_AT_TI_return
     490              
     491 000000e7 0006          LRETR     ; [CPU_ALU] 
     492                      ; return occurs ; [] 
     493                      .dwattr $C$DW$12, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/so
     494                      .dwattr $C$DW$12, DW_AT_TI_end_line(0x5f)
     495                      .dwattr $C$DW$12, DW_AT_TI_end_column(0x01)
     496                      .dwendentry
     497                      .dwendtag $C$DW$12
     498              
     499              ;**************************************************************
     500              ;* UNDEFINED EXTERNAL REFERENCES                              *
     501              ;**************************************************************
     502                      .global _AdcaRegs
     503                      .global _AdcbRegs
     504                      .global _AdccRegs
     505                      .global _AdcdRegs
     506              
     507              ;***************************************************************
     508              ;* TYPE INFORMATION                                            *
     509              ;***************************************************************
     510              
     511              $C$DW$T$20      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   11

     512                      .dwattr $C$DW$T$20, DW_AT_name("ADCBURSTCTL_BITS")
     513                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     514              $C$DW$23        .dwtag  DW_TAG_member
     515                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     516                      .dwattr $C$DW$23, DW_AT_name("BURSTTRIGSEL")
     517                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
     518                      .dwattr $C$DW$23, DW_AT_bit_offset(0x0a)
     519                      .dwattr $C$DW$23, DW_AT_bit_size(0x06)
     520                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     521                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     522              
     523              $C$DW$24        .dwtag  DW_TAG_member
     524                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     525                      .dwattr $C$DW$24, DW_AT_name("rsvd1")
     526                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_rsvd1")
     527                      .dwattr $C$DW$24, DW_AT_bit_offset(0x08)
     528                      .dwattr $C$DW$24, DW_AT_bit_size(0x02)
     529                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     530                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     531              
     532              $C$DW$25        .dwtag  DW_TAG_member
     533                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     534                      .dwattr $C$DW$25, DW_AT_name("BURSTSIZE")
     535                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_BURSTSIZE")
     536                      .dwattr $C$DW$25, DW_AT_bit_offset(0x04)
     537                      .dwattr $C$DW$25, DW_AT_bit_size(0x04)
     538                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     539                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     540              
     541              $C$DW$26        .dwtag  DW_TAG_member
     542                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     543                      .dwattr $C$DW$26, DW_AT_name("rsvd2")
     544                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd2")
     545                      .dwattr $C$DW$26, DW_AT_bit_offset(0x01)
     546                      .dwattr $C$DW$26, DW_AT_bit_size(0x03)
     547                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     548                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     549              
     550              $C$DW$27        .dwtag  DW_TAG_member
     551                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     552                      .dwattr $C$DW$27, DW_AT_name("BURSTEN")
     553                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_BURSTEN")
     554                      .dwattr $C$DW$27, DW_AT_bit_offset(0x00)
     555                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     556                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     557                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     558              
     559                      .dwendtag $C$DW$T$20
     560              
     561              
     562              $C$DW$T$21      .dwtag  DW_TAG_union_type
     563                      .dwattr $C$DW$T$21, DW_AT_name("ADCBURSTCTL_REG")
     564                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     565              $C$DW$28        .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   12

     567                      .dwattr $C$DW$28, DW_AT_name("all")
     568                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_all")
     569                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     570                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     571              
     572              $C$DW$29        .dwtag  DW_TAG_member
     573                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$20)
     574                      .dwattr $C$DW$29, DW_AT_name("bit")
     575                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_bit")
     576                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     577                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     578              
     579                      .dwendtag $C$DW$T$21
     580              
     581              
     582              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     583                      .dwattr $C$DW$T$22, DW_AT_name("ADCCOUNTER_BITS")
     584                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     585              $C$DW$30        .dwtag  DW_TAG_member
     586                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     587                      .dwattr $C$DW$30, DW_AT_name("FREECOUNT")
     588                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_FREECOUNT")
     589                      .dwattr $C$DW$30, DW_AT_bit_offset(0x04)
     590                      .dwattr $C$DW$30, DW_AT_bit_size(0x0c)
     591                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     592                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     593              
     594              $C$DW$31        .dwtag  DW_TAG_member
     595                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     596                      .dwattr $C$DW$31, DW_AT_name("rsvd1")
     597                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd1")
     598                      .dwattr $C$DW$31, DW_AT_bit_offset(0x00)
     599                      .dwattr $C$DW$31, DW_AT_bit_size(0x04)
     600                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     601                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     602              
     603                      .dwendtag $C$DW$T$22
     604              
     605              
     606              $C$DW$T$23      .dwtag  DW_TAG_union_type
     607                      .dwattr $C$DW$T$23, DW_AT_name("ADCCOUNTER_REG")
     608                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     609              $C$DW$32        .dwtag  DW_TAG_member
     610                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     611                      .dwattr $C$DW$32, DW_AT_name("all")
     612                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_all")
     613                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     614                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     615              
     616              $C$DW$33        .dwtag  DW_TAG_member
     617                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$22)
     618                      .dwattr $C$DW$33, DW_AT_name("bit")
     619                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_bit")
     620                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     621                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   13

     622              
     623                      .dwendtag $C$DW$T$23
     624              
     625              
     626              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     627                      .dwattr $C$DW$T$24, DW_AT_name("ADCCTL1_BITS")
     628                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     629              $C$DW$34        .dwtag  DW_TAG_member
     630                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     631                      .dwattr $C$DW$34, DW_AT_name("rsvd1")
     632                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd1")
     633                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0e)
     634                      .dwattr $C$DW$34, DW_AT_bit_size(0x02)
     635                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     636                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     637              
     638              $C$DW$35        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     640                      .dwattr $C$DW$35, DW_AT_name("INTPULSEPOS")
     641                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_INTPULSEPOS")
     642                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0d)
     643                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     644                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     645                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     646              
     647              $C$DW$36        .dwtag  DW_TAG_member
     648                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     649                      .dwattr $C$DW$36, DW_AT_name("rsvd2")
     650                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd2")
     651                      .dwattr $C$DW$36, DW_AT_bit_offset(0x09)
     652                      .dwattr $C$DW$36, DW_AT_bit_size(0x04)
     653                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     654                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     655              
     656              $C$DW$37        .dwtag  DW_TAG_member
     657                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     658                      .dwattr $C$DW$37, DW_AT_name("ADCPWDNZ")
     659                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_ADCPWDNZ")
     660                      .dwattr $C$DW$37, DW_AT_bit_offset(0x08)
     661                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     662                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     663                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     664              
     665              $C$DW$38        .dwtag  DW_TAG_member
     666                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     667                      .dwattr $C$DW$38, DW_AT_name("ADCBSYCHN")
     668                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_ADCBSYCHN")
     669                      .dwattr $C$DW$38, DW_AT_bit_offset(0x04)
     670                      .dwattr $C$DW$38, DW_AT_bit_size(0x04)
     671                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     672                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     673              
     674              $C$DW$39        .dwtag  DW_TAG_member
     675                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     676                      .dwattr $C$DW$39, DW_AT_name("rsvd3")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   14

     677                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd3")
     678                      .dwattr $C$DW$39, DW_AT_bit_offset(0x03)
     679                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     680                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     681                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     682              
     683              $C$DW$40        .dwtag  DW_TAG_member
     684                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     685                      .dwattr $C$DW$40, DW_AT_name("ADCBSY")
     686                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_ADCBSY")
     687                      .dwattr $C$DW$40, DW_AT_bit_offset(0x02)
     688                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     689                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     691              
     692              $C$DW$41        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     694                      .dwattr $C$DW$41, DW_AT_name("rsvd4")
     695                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd4")
     696                      .dwattr $C$DW$41, DW_AT_bit_offset(0x00)
     697                      .dwattr $C$DW$41, DW_AT_bit_size(0x02)
     698                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     699                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     700              
     701                      .dwendtag $C$DW$T$24
     702              
     703              
     704              $C$DW$T$25      .dwtag  DW_TAG_union_type
     705                      .dwattr $C$DW$T$25, DW_AT_name("ADCCTL1_REG")
     706                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     707              $C$DW$42        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     709                      .dwattr $C$DW$42, DW_AT_name("all")
     710                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_all")
     711                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     712                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     713              
     714              $C$DW$43        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$24)
     716                      .dwattr $C$DW$43, DW_AT_name("bit")
     717                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_bit")
     718                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     719                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     720              
     721                      .dwendtag $C$DW$T$25
     722              
     723              
     724              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     725                      .dwattr $C$DW$T$26, DW_AT_name("ADCCTL2_BITS")
     726                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     727              $C$DW$44        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     729                      .dwattr $C$DW$44, DW_AT_name("PRESCALE")
     730                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_PRESCALE")
     731                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   15

     732                      .dwattr $C$DW$44, DW_AT_bit_size(0x04)
     733                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     734                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     735              
     736              $C$DW$45        .dwtag  DW_TAG_member
     737                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     738                      .dwattr $C$DW$45, DW_AT_name("rsvd1")
     739                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_rsvd1")
     740                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0a)
     741                      .dwattr $C$DW$45, DW_AT_bit_size(0x02)
     742                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     743                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     744              
     745              $C$DW$46        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     747                      .dwattr $C$DW$46, DW_AT_name("RESOLUTION")
     748                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_RESOLUTION")
     749                      .dwattr $C$DW$46, DW_AT_bit_offset(0x09)
     750                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     751                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     752                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     753              
     754              $C$DW$47        .dwtag  DW_TAG_member
     755                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     756                      .dwattr $C$DW$47, DW_AT_name("SIGNALMODE")
     757                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_SIGNALMODE")
     758                      .dwattr $C$DW$47, DW_AT_bit_offset(0x08)
     759                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     760                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     761                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     762              
     763              $C$DW$48        .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     765                      .dwattr $C$DW$48, DW_AT_name("rsvd2")
     766                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_rsvd2")
     767                      .dwattr $C$DW$48, DW_AT_bit_offset(0x03)
     768                      .dwattr $C$DW$48, DW_AT_bit_size(0x05)
     769                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     770                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     771              
     772              $C$DW$49        .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     774                      .dwattr $C$DW$49, DW_AT_name("rsvd3")
     775                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd3")
     776                      .dwattr $C$DW$49, DW_AT_bit_offset(0x00)
     777                      .dwattr $C$DW$49, DW_AT_bit_size(0x03)
     778                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     779                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     780              
     781                      .dwendtag $C$DW$T$26
     782              
     783              
     784              $C$DW$T$27      .dwtag  DW_TAG_union_type
     785                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL2_REG")
     786                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   16

     787              $C$DW$50        .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     789                      .dwattr $C$DW$50, DW_AT_name("all")
     790                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_all")
     791                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     792                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     793              
     794              $C$DW$51        .dwtag  DW_TAG_member
     795                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$26)
     796                      .dwattr $C$DW$51, DW_AT_name("bit")
     797                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_bit")
     798                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     799                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     800              
     801                      .dwendtag $C$DW$T$27
     802              
     803              
     804              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     805                      .dwattr $C$DW$T$28, DW_AT_name("ADCEVTCLR_BITS")
     806                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     807              $C$DW$52        .dwtag  DW_TAG_member
     808                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     809                      .dwattr $C$DW$52, DW_AT_name("PPB1TRIPHI")
     810                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     811                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0f)
     812                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     813                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     814                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     815              
     816              $C$DW$53        .dwtag  DW_TAG_member
     817                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     818                      .dwattr $C$DW$53, DW_AT_name("PPB1TRIPLO")
     819                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     820                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0e)
     821                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     822                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     824              
     825              $C$DW$54        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     827                      .dwattr $C$DW$54, DW_AT_name("PPB1ZERO")
     828                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PPB1ZERO")
     829                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0d)
     830                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     831                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     832                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     833              
     834              $C$DW$55        .dwtag  DW_TAG_member
     835                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     836                      .dwattr $C$DW$55, DW_AT_name("rsvd1")
     837                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd1")
     838                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0c)
     839                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     840                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     841                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   17

     842              
     843              $C$DW$56        .dwtag  DW_TAG_member
     844                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     845                      .dwattr $C$DW$56, DW_AT_name("PPB2TRIPHI")
     846                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_PPB2TRIPHI")
     847                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0b)
     848                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     849                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     851              
     852              $C$DW$57        .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     854                      .dwattr $C$DW$57, DW_AT_name("PPB2TRIPLO")
     855                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_PPB2TRIPLO")
     856                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0a)
     857                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     858                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     859                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     860              
     861              $C$DW$58        .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     863                      .dwattr $C$DW$58, DW_AT_name("PPB2ZERO")
     864                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_PPB2ZERO")
     865                      .dwattr $C$DW$58, DW_AT_bit_offset(0x09)
     866                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     867                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     868                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     869              
     870              $C$DW$59        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     872                      .dwattr $C$DW$59, DW_AT_name("rsvd2")
     873                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd2")
     874                      .dwattr $C$DW$59, DW_AT_bit_offset(0x08)
     875                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     876                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     877                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     878              
     879              $C$DW$60        .dwtag  DW_TAG_member
     880                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     881                      .dwattr $C$DW$60, DW_AT_name("PPB3TRIPHI")
     882                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PPB3TRIPHI")
     883                      .dwattr $C$DW$60, DW_AT_bit_offset(0x07)
     884                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     885                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     886                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     887              
     888              $C$DW$61        .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     890                      .dwattr $C$DW$61, DW_AT_name("PPB3TRIPLO")
     891                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PPB3TRIPLO")
     892                      .dwattr $C$DW$61, DW_AT_bit_offset(0x06)
     893                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     894                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     895                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     896              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   18

     897              $C$DW$62        .dwtag  DW_TAG_member
     898                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     899                      .dwattr $C$DW$62, DW_AT_name("PPB3ZERO")
     900                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PPB3ZERO")
     901                      .dwattr $C$DW$62, DW_AT_bit_offset(0x05)
     902                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     903                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     904                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     905              
     906              $C$DW$63        .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     908                      .dwattr $C$DW$63, DW_AT_name("rsvd3")
     909                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd3")
     910                      .dwattr $C$DW$63, DW_AT_bit_offset(0x04)
     911                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     912                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     913                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     914              
     915              $C$DW$64        .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     917                      .dwattr $C$DW$64, DW_AT_name("PPB4TRIPHI")
     918                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PPB4TRIPHI")
     919                      .dwattr $C$DW$64, DW_AT_bit_offset(0x03)
     920                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     921                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     922                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     923              
     924              $C$DW$65        .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     926                      .dwattr $C$DW$65, DW_AT_name("PPB4TRIPLO")
     927                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_PPB4TRIPLO")
     928                      .dwattr $C$DW$65, DW_AT_bit_offset(0x02)
     929                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     930                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     931                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     932              
     933              $C$DW$66        .dwtag  DW_TAG_member
     934                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     935                      .dwattr $C$DW$66, DW_AT_name("PPB4ZERO")
     936                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_PPB4ZERO")
     937                      .dwattr $C$DW$66, DW_AT_bit_offset(0x01)
     938                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     939                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     940                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     941              
     942              $C$DW$67        .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     944                      .dwattr $C$DW$67, DW_AT_name("rsvd4")
     945                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_rsvd4")
     946                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
     947                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     948                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     949                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     950              
     951                      .dwendtag $C$DW$T$28
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   19

     952              
     953              
     954              $C$DW$T$29      .dwtag  DW_TAG_union_type
     955                      .dwattr $C$DW$T$29, DW_AT_name("ADCEVTCLR_REG")
     956                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     957              $C$DW$68        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     959                      .dwattr $C$DW$68, DW_AT_name("all")
     960                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_all")
     961                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     962                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     963              
     964              $C$DW$69        .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$28)
     966                      .dwattr $C$DW$69, DW_AT_name("bit")
     967                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_bit")
     968                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     969                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     970              
     971                      .dwendtag $C$DW$T$29
     972              
     973              
     974              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     975                      .dwattr $C$DW$T$30, DW_AT_name("ADCEVTINTSEL_BITS")
     976                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     977              $C$DW$70        .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     979                      .dwattr $C$DW$70, DW_AT_name("PPB1TRIPHI")
     980                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     981                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0f)
     982                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     983                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     984                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     985              
     986              $C$DW$71        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     988                      .dwattr $C$DW$71, DW_AT_name("PPB1TRIPLO")
     989                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     990                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0e)
     991                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     992                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995              $C$DW$72        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$72, DW_AT_name("PPB1ZERO")
     998                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_PPB1ZERO")
     999                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0d)
    1000                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1001                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1003              
    1004              $C$DW$73        .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1006                      .dwattr $C$DW$73, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   20

    1007                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd1")
    1008                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0c)
    1009                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1010                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1011                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1012              
    1013              $C$DW$74        .dwtag  DW_TAG_member
    1014                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1015                      .dwattr $C$DW$74, DW_AT_name("PPB2TRIPHI")
    1016                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1017                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0b)
    1018                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1019                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1020                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1021              
    1022              $C$DW$75        .dwtag  DW_TAG_member
    1023                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1024                      .dwattr $C$DW$75, DW_AT_name("PPB2TRIPLO")
    1025                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1026                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0a)
    1027                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1028                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1029                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1030              
    1031              $C$DW$76        .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1033                      .dwattr $C$DW$76, DW_AT_name("PPB2ZERO")
    1034                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_PPB2ZERO")
    1035                      .dwattr $C$DW$76, DW_AT_bit_offset(0x09)
    1036                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1037                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1039              
    1040              $C$DW$77        .dwtag  DW_TAG_member
    1041                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1042                      .dwattr $C$DW$77, DW_AT_name("rsvd2")
    1043                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd2")
    1044                      .dwattr $C$DW$77, DW_AT_bit_offset(0x08)
    1045                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1046                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1047                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1048              
    1049              $C$DW$78        .dwtag  DW_TAG_member
    1050                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1051                      .dwattr $C$DW$78, DW_AT_name("PPB3TRIPHI")
    1052                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1053                      .dwattr $C$DW$78, DW_AT_bit_offset(0x07)
    1054                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1055                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1056                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1057              
    1058              $C$DW$79        .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1060                      .dwattr $C$DW$79, DW_AT_name("PPB3TRIPLO")
    1061                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_PPB3TRIPLO")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   21

    1062                      .dwattr $C$DW$79, DW_AT_bit_offset(0x06)
    1063                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1064                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1065                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1066              
    1067              $C$DW$80        .dwtag  DW_TAG_member
    1068                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1069                      .dwattr $C$DW$80, DW_AT_name("PPB3ZERO")
    1070                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_PPB3ZERO")
    1071                      .dwattr $C$DW$80, DW_AT_bit_offset(0x05)
    1072                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1073                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1074                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1075              
    1076              $C$DW$81        .dwtag  DW_TAG_member
    1077                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1078                      .dwattr $C$DW$81, DW_AT_name("rsvd3")
    1079                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd3")
    1080                      .dwattr $C$DW$81, DW_AT_bit_offset(0x04)
    1081                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1082                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1083                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1084              
    1085              $C$DW$82        .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1087                      .dwattr $C$DW$82, DW_AT_name("PPB4TRIPHI")
    1088                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1089                      .dwattr $C$DW$82, DW_AT_bit_offset(0x03)
    1090                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1091                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1092                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1093              
    1094              $C$DW$83        .dwtag  DW_TAG_member
    1095                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1096                      .dwattr $C$DW$83, DW_AT_name("PPB4TRIPLO")
    1097                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1098                      .dwattr $C$DW$83, DW_AT_bit_offset(0x02)
    1099                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1100                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1101                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1102              
    1103              $C$DW$84        .dwtag  DW_TAG_member
    1104                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1105                      .dwattr $C$DW$84, DW_AT_name("PPB4ZERO")
    1106                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_PPB4ZERO")
    1107                      .dwattr $C$DW$84, DW_AT_bit_offset(0x01)
    1108                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1109                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1110                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1111              
    1112              $C$DW$85        .dwtag  DW_TAG_member
    1113                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1114                      .dwattr $C$DW$85, DW_AT_name("rsvd4")
    1115                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd4")
    1116                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   22

    1117                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1118                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1119                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1120              
    1121                      .dwendtag $C$DW$T$30
    1122              
    1123              
    1124              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1125                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTINTSEL_REG")
    1126                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1127              $C$DW$86        .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1129                      .dwattr $C$DW$86, DW_AT_name("all")
    1130                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
    1131                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1132                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1133              
    1134              $C$DW$87        .dwtag  DW_TAG_member
    1135                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$30)
    1136                      .dwattr $C$DW$87, DW_AT_name("bit")
    1137                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
    1138                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1139                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1140              
    1141                      .dwendtag $C$DW$T$31
    1142              
    1143              
    1144              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1145                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTSEL_BITS")
    1146                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1147              $C$DW$88        .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1149                      .dwattr $C$DW$88, DW_AT_name("PPB1TRIPHI")
    1150                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1151                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0f)
    1152                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1153                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1154                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1155              
    1156              $C$DW$89        .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1158                      .dwattr $C$DW$89, DW_AT_name("PPB1TRIPLO")
    1159                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1160                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0e)
    1161                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1162                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1163                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1164              
    1165              $C$DW$90        .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1167                      .dwattr $C$DW$90, DW_AT_name("PPB1ZERO")
    1168                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_PPB1ZERO")
    1169                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0d)
    1170                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1171                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   23

    1172                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1173              
    1174              $C$DW$91        .dwtag  DW_TAG_member
    1175                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1176                      .dwattr $C$DW$91, DW_AT_name("rsvd1")
    1177                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd1")
    1178                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0c)
    1179                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1180                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1181                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1182              
    1183              $C$DW$92        .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1185                      .dwattr $C$DW$92, DW_AT_name("PPB2TRIPHI")
    1186                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1187                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0b)
    1188                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1189                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1190                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1191              
    1192              $C$DW$93        .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1194                      .dwattr $C$DW$93, DW_AT_name("PPB2TRIPLO")
    1195                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1196                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0a)
    1197                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1198                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1200              
    1201              $C$DW$94        .dwtag  DW_TAG_member
    1202                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1203                      .dwattr $C$DW$94, DW_AT_name("PPB2ZERO")
    1204                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_PPB2ZERO")
    1205                      .dwattr $C$DW$94, DW_AT_bit_offset(0x09)
    1206                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1207                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1208                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1209              
    1210              $C$DW$95        .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1212                      .dwattr $C$DW$95, DW_AT_name("rsvd2")
    1213                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd2")
    1214                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08)
    1215                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1216                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1217                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1218              
    1219              $C$DW$96        .dwtag  DW_TAG_member
    1220                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1221                      .dwattr $C$DW$96, DW_AT_name("PPB3TRIPHI")
    1222                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1223                      .dwattr $C$DW$96, DW_AT_bit_offset(0x07)
    1224                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1225                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1226                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   24

    1227              
    1228              $C$DW$97        .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1230                      .dwattr $C$DW$97, DW_AT_name("PPB3TRIPLO")
    1231                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1232                      .dwattr $C$DW$97, DW_AT_bit_offset(0x06)
    1233                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1234                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1236              
    1237              $C$DW$98        .dwtag  DW_TAG_member
    1238                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1239                      .dwattr $C$DW$98, DW_AT_name("PPB3ZERO")
    1240                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_PPB3ZERO")
    1241                      .dwattr $C$DW$98, DW_AT_bit_offset(0x05)
    1242                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1243                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1244                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1245              
    1246              $C$DW$99        .dwtag  DW_TAG_member
    1247                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1248                      .dwattr $C$DW$99, DW_AT_name("rsvd3")
    1249                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd3")
    1250                      .dwattr $C$DW$99, DW_AT_bit_offset(0x04)
    1251                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1252                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1253                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1254              
    1255              $C$DW$100       .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1257                      .dwattr $C$DW$100, DW_AT_name("PPB4TRIPHI")
    1258                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1259                      .dwattr $C$DW$100, DW_AT_bit_offset(0x03)
    1260                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1261                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1263              
    1264              $C$DW$101       .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1266                      .dwattr $C$DW$101, DW_AT_name("PPB4TRIPLO")
    1267                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1268                      .dwattr $C$DW$101, DW_AT_bit_offset(0x02)
    1269                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1270                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1271                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1272              
    1273              $C$DW$102       .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1275                      .dwattr $C$DW$102, DW_AT_name("PPB4ZERO")
    1276                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_PPB4ZERO")
    1277                      .dwattr $C$DW$102, DW_AT_bit_offset(0x01)
    1278                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1279                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1280                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1281              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   25

    1282              $C$DW$103       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1284                      .dwattr $C$DW$103, DW_AT_name("rsvd4")
    1285                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd4")
    1286                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1287                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1288                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1289                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1290              
    1291                      .dwendtag $C$DW$T$32
    1292              
    1293              
    1294              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1295                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTSEL_REG")
    1296                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1297              $C$DW$104       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1299                      .dwattr $C$DW$104, DW_AT_name("all")
    1300                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
    1301                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1302                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1303              
    1304              $C$DW$105       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$32)
    1306                      .dwattr $C$DW$105, DW_AT_name("bit")
    1307                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
    1308                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1309                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1310              
    1311                      .dwendtag $C$DW$T$33
    1312              
    1313              
    1314              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1315                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTSTAT_BITS")
    1316                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1317              $C$DW$106       .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1319                      .dwattr $C$DW$106, DW_AT_name("PPB1TRIPHI")
    1320                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1321                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0f)
    1322                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1323                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1324                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1325              
    1326              $C$DW$107       .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1328                      .dwattr $C$DW$107, DW_AT_name("PPB1TRIPLO")
    1329                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1330                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0e)
    1331                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1332                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1334              
    1335              $C$DW$108       .dwtag  DW_TAG_member
    1336                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   26

    1337                      .dwattr $C$DW$108, DW_AT_name("PPB1ZERO")
    1338                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_PPB1ZERO")
    1339                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0d)
    1340                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1341                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1343              
    1344              $C$DW$109       .dwtag  DW_TAG_member
    1345                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1346                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
    1347                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
    1348                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0c)
    1349                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1350                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1352              
    1353              $C$DW$110       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1355                      .dwattr $C$DW$110, DW_AT_name("PPB2TRIPHI")
    1356                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1357                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0b)
    1358                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1359                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1360                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1361              
    1362              $C$DW$111       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1364                      .dwattr $C$DW$111, DW_AT_name("PPB2TRIPLO")
    1365                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1366                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a)
    1367                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1368                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1369                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1370              
    1371              $C$DW$112       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1373                      .dwattr $C$DW$112, DW_AT_name("PPB2ZERO")
    1374                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PPB2ZERO")
    1375                      .dwattr $C$DW$112, DW_AT_bit_offset(0x09)
    1376                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1377                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1379              
    1380              $C$DW$113       .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1382                      .dwattr $C$DW$113, DW_AT_name("rsvd2")
    1383                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd2")
    1384                      .dwattr $C$DW$113, DW_AT_bit_offset(0x08)
    1385                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1386                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1387                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1388              
    1389              $C$DW$114       .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1391                      .dwattr $C$DW$114, DW_AT_name("PPB3TRIPHI")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   27

    1392                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1393                      .dwattr $C$DW$114, DW_AT_bit_offset(0x07)
    1394                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1395                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1396                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1397              
    1398              $C$DW$115       .dwtag  DW_TAG_member
    1399                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1400                      .dwattr $C$DW$115, DW_AT_name("PPB3TRIPLO")
    1401                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1402                      .dwattr $C$DW$115, DW_AT_bit_offset(0x06)
    1403                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1404                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1406              
    1407              $C$DW$116       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1409                      .dwattr $C$DW$116, DW_AT_name("PPB3ZERO")
    1410                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_PPB3ZERO")
    1411                      .dwattr $C$DW$116, DW_AT_bit_offset(0x05)
    1412                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1413                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1414                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1415              
    1416              $C$DW$117       .dwtag  DW_TAG_member
    1417                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1418                      .dwattr $C$DW$117, DW_AT_name("rsvd3")
    1419                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd3")
    1420                      .dwattr $C$DW$117, DW_AT_bit_offset(0x04)
    1421                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1422                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1424              
    1425              $C$DW$118       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1427                      .dwattr $C$DW$118, DW_AT_name("PPB4TRIPHI")
    1428                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1429                      .dwattr $C$DW$118, DW_AT_bit_offset(0x03)
    1430                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1431                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1432                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1433              
    1434              $C$DW$119       .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1436                      .dwattr $C$DW$119, DW_AT_name("PPB4TRIPLO")
    1437                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1438                      .dwattr $C$DW$119, DW_AT_bit_offset(0x02)
    1439                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1440                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1442              
    1443              $C$DW$120       .dwtag  DW_TAG_member
    1444                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1445                      .dwattr $C$DW$120, DW_AT_name("PPB4ZERO")
    1446                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_PPB4ZERO")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   28

    1447                      .dwattr $C$DW$120, DW_AT_bit_offset(0x01)
    1448                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1449                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1450                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1451              
    1452              $C$DW$121       .dwtag  DW_TAG_member
    1453                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1454                      .dwattr $C$DW$121, DW_AT_name("rsvd4")
    1455                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd4")
    1456                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1457                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1458                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1460              
    1461                      .dwendtag $C$DW$T$34
    1462              
    1463              
    1464              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1465                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSTAT_REG")
    1466                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1467              $C$DW$122       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1469                      .dwattr $C$DW$122, DW_AT_name("all")
    1470                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1471                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1473              
    1474              $C$DW$123       .dwtag  DW_TAG_member
    1475                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$34)
    1476                      .dwattr $C$DW$123, DW_AT_name("bit")
    1477                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1478                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1479                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1480              
    1481                      .dwendtag $C$DW$T$35
    1482              
    1483              
    1484              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1485                      .dwattr $C$DW$T$36, DW_AT_name("ADCINTFLGCLR_BITS")
    1486                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1487              $C$DW$124       .dwtag  DW_TAG_member
    1488                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1489                      .dwattr $C$DW$124, DW_AT_name("ADCINT1")
    1490                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_ADCINT1")
    1491                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f)
    1492                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1493                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496              $C$DW$125       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1498                      .dwattr $C$DW$125, DW_AT_name("ADCINT2")
    1499                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_ADCINT2")
    1500                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e)
    1501                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   29

    1502                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1503                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1504              
    1505              $C$DW$126       .dwtag  DW_TAG_member
    1506                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1507                      .dwattr $C$DW$126, DW_AT_name("ADCINT3")
    1508                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_ADCINT3")
    1509                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0d)
    1510                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1511                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1513              
    1514              $C$DW$127       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1516                      .dwattr $C$DW$127, DW_AT_name("ADCINT4")
    1517                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ADCINT4")
    1518                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0c)
    1519                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1520                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1521                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1522              
    1523              $C$DW$128       .dwtag  DW_TAG_member
    1524                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1525                      .dwattr $C$DW$128, DW_AT_name("rsvd1")
    1526                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd1")
    1527                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00)
    1528                      .dwattr $C$DW$128, DW_AT_bit_size(0x0c)
    1529                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1530                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1531              
    1532                      .dwendtag $C$DW$T$36
    1533              
    1534              
    1535              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1536                      .dwattr $C$DW$T$37, DW_AT_name("ADCINTFLGCLR_REG")
    1537                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1538              $C$DW$129       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1540                      .dwattr $C$DW$129, DW_AT_name("all")
    1541                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_all")
    1542                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1543                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1544              
    1545              $C$DW$130       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$36)
    1547                      .dwattr $C$DW$130, DW_AT_name("bit")
    1548                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bit")
    1549                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1550                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1551              
    1552                      .dwendtag $C$DW$T$37
    1553              
    1554              
    1555              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1556                      .dwattr $C$DW$T$38, DW_AT_name("ADCINTFLG_BITS")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   30

    1557                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1558              $C$DW$131       .dwtag  DW_TAG_member
    1559                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1560                      .dwattr $C$DW$131, DW_AT_name("ADCINT1")
    1561                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADCINT1")
    1562                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0f)
    1563                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1564                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1565                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1566              
    1567              $C$DW$132       .dwtag  DW_TAG_member
    1568                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1569                      .dwattr $C$DW$132, DW_AT_name("ADCINT2")
    1570                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ADCINT2")
    1571                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0e)
    1572                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1573                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1574                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1575              
    1576              $C$DW$133       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1578                      .dwattr $C$DW$133, DW_AT_name("ADCINT3")
    1579                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ADCINT3")
    1580                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0d)
    1581                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1582                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1583                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1584              
    1585              $C$DW$134       .dwtag  DW_TAG_member
    1586                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1587                      .dwattr $C$DW$134, DW_AT_name("ADCINT4")
    1588                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_ADCINT4")
    1589                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0c)
    1590                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1591                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1592                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1593              
    1594              $C$DW$135       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1596                      .dwattr $C$DW$135, DW_AT_name("rsvd1")
    1597                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd1")
    1598                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    1599                      .dwattr $C$DW$135, DW_AT_bit_size(0x0c)
    1600                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1601                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1602              
    1603                      .dwendtag $C$DW$T$38
    1604              
    1605              
    1606              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1607                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLG_REG")
    1608                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1609              $C$DW$136       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1611                      .dwattr $C$DW$136, DW_AT_name("all")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   31

    1612                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_all")
    1613                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1615              
    1616              $C$DW$137       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$38)
    1618                      .dwattr $C$DW$137, DW_AT_name("bit")
    1619                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_bit")
    1620                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1621                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1622              
    1623                      .dwendtag $C$DW$T$39
    1624              
    1625              
    1626              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1627                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTOVFCLR_BITS")
    1628                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1629              $C$DW$138       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1631                      .dwattr $C$DW$138, DW_AT_name("ADCINT1")
    1632                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ADCINT1")
    1633                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0f)
    1634                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1635                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1637              
    1638              $C$DW$139       .dwtag  DW_TAG_member
    1639                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1640                      .dwattr $C$DW$139, DW_AT_name("ADCINT2")
    1641                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ADCINT2")
    1642                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0e)
    1643                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1644                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1645                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1646              
    1647              $C$DW$140       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1649                      .dwattr $C$DW$140, DW_AT_name("ADCINT3")
    1650                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ADCINT3")
    1651                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0d)
    1652                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1653                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1654                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1655              
    1656              $C$DW$141       .dwtag  DW_TAG_member
    1657                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1658                      .dwattr $C$DW$141, DW_AT_name("ADCINT4")
    1659                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ADCINT4")
    1660                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0c)
    1661                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1662                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1663                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1664              
    1665              $C$DW$142       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   32

    1667                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    1668                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    1669                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    1670                      .dwattr $C$DW$142, DW_AT_bit_size(0x0c)
    1671                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1673              
    1674                      .dwendtag $C$DW$T$40
    1675              
    1676              
    1677              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1678                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTOVFCLR_REG")
    1679                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1680              $C$DW$143       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1682                      .dwattr $C$DW$143, DW_AT_name("all")
    1683                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_all")
    1684                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1685                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1686              
    1687              $C$DW$144       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$40)
    1689                      .dwattr $C$DW$144, DW_AT_name("bit")
    1690                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_bit")
    1691                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1693              
    1694                      .dwendtag $C$DW$T$41
    1695              
    1696              
    1697              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1698                      .dwattr $C$DW$T$42, DW_AT_name("ADCINTOVF_BITS")
    1699                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1700              $C$DW$145       .dwtag  DW_TAG_member
    1701                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1702                      .dwattr $C$DW$145, DW_AT_name("ADCINT1")
    1703                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCINT1")
    1704                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0f)
    1705                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1706                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1707                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1708              
    1709              $C$DW$146       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1711                      .dwattr $C$DW$146, DW_AT_name("ADCINT2")
    1712                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ADCINT2")
    1713                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0e)
    1714                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1715                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1716                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1717              
    1718              $C$DW$147       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1720                      .dwattr $C$DW$147, DW_AT_name("ADCINT3")
    1721                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCINT3")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   33

    1722                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0d)
    1723                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1724                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1725                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1726              
    1727              $C$DW$148       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1729                      .dwattr $C$DW$148, DW_AT_name("ADCINT4")
    1730                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCINT4")
    1731                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0c)
    1732                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1733                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1734                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1735              
    1736              $C$DW$149       .dwtag  DW_TAG_member
    1737                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1738                      .dwattr $C$DW$149, DW_AT_name("rsvd1")
    1739                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd1")
    1740                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00)
    1741                      .dwattr $C$DW$149, DW_AT_bit_size(0x0c)
    1742                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1743                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1744              
    1745                      .dwendtag $C$DW$T$42
    1746              
    1747              
    1748              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1749                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTOVF_REG")
    1750                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1751              $C$DW$150       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1753                      .dwattr $C$DW$150, DW_AT_name("all")
    1754                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_all")
    1755                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1756                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1757              
    1758              $C$DW$151       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$42)
    1760                      .dwattr $C$DW$151, DW_AT_name("bit")
    1761                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_bit")
    1762                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1763                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1764              
    1765                      .dwendtag $C$DW$T$43
    1766              
    1767              
    1768              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1769                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTSEL1N2_BITS")
    1770                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1771              $C$DW$152       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1773                      .dwattr $C$DW$152, DW_AT_name("INT1SEL")
    1774                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_INT1SEL")
    1775                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0c)
    1776                      .dwattr $C$DW$152, DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:03 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   34

    1777                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1778                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1779              
    1780              $C$DW$153       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1782                      .dwattr $C$DW$153, DW_AT_name("rsvd1")
    1783                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd1")
    1784                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0b)
    1785                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1786                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1787                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1788              
    1789              $C$DW$154       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1791                      .dwattr $C$DW$154, DW_AT_name("INT1E")
    1792                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_INT1E")
    1793                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0a)
    1794                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1795                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1796                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1797              
    1798              $C$DW$155       .dwtag  DW_TAG_member
    1799                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1800                      .dwattr $C$DW$155, DW_AT_name("INT1CONT")
    1801                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_INT1CONT")
    1802                      .dwattr $C$DW$155, DW_AT_bit_offset(0x09)
    1803                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1804                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1805                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1806              
    1807              $C$DW$156       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
