TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Sat Jul 18 15:28:07 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Desktop\servodrive_TMIDDK\IDDK_PM_Servo_F2837x-v2\F2
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("InputXbarRegs")

    1460              _GPIO_EnableUnbondedIOPullups:
    1461              ;* AL    assigned to _pin_count
    1462              $C$DW$77        .dwtag  DW_TAG_variable
    1463                      .dwattr $C$DW$77, DW_AT_name("pin_count")
    1464                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_pin_count")
    1465                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$6)
    1466                      .dwattr $C$DW$77, DW_AT_location[DW_OP_reg0]
    1467              
    1468                      .dwcfi  cfa_offset, -2
    1469                      .dwcfi  save_reg_to_mem, 26, 0
    1470 000001bd 761F!         MOVW      DP,#_DevCfgRegs+8     ; [CPU_ARAU] 
         000001be 0000 
    1471 000001bf 2901          CLRC      SXM                   ; [CPU_ALU] 
    1472                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Gpio.c",li
    1473 000001c0 0608!         MOVL      ACC,@_DevCfgRegs+8    ; [CPU_ALU] |320| 
    1474 000001c1 FF47          SFR       ACC,8                 ; [CPU_ALU] |320| 
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   29

    1475 000001c2 9007          ANDB      AL,#0x07              ; [CPU_ALU] |320| 
    1476 000001c3 5205          CMPB      AL,#5                 ; [CPU_ALU] |320| 
    1477 000001c4 6106          B         $C$L18,EQ             ; [CPU_ALU] |320| 
    1478                      ; branchcc occurs ; [] |320| 
    1479                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Gpio.c",li
    1480 000001c5 5206          CMPB      AL,#6                 ; [CPU_ALU] |331| 
    1481 000001c6 6006          B         $C$L19,NEQ            ; [CPU_ALU] |331| 
    1482                      ; branchcc occurs ; [] |331| 
    1483                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Gpio.c",li
    1484              $C$DW$78        .dwtag  DW_TAG_TI_branch
    1485                      .dwattr $C$DW$78, DW_AT_low_pc(0x00)
    1486                      .dwattr $C$DW$78, DW_AT_name("_GPIO_EnableUnbondedIOPullupsFor176Pin")
    1487                      .dwattr $C$DW$78, DW_AT_TI_call
    1488              
    1489 000001c7 7640'         LCR       #_GPIO_EnableUnbondedIOPullupsFor176Pin ; [CPU_ALU] |333| 
         000001c8 017F 
    1490                      ; call occurs [#_GPIO_EnableUnbondedIOPullupsFor176Pin] ; [] |333| 
    1491                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Gpio.c",li
    1492 000001c9 6F03          B         $C$L19,UNC            ; [CPU_ALU] |334| 
    1493                      ; branch occurs ; [] |334| 
    1494 000001ca       $C$L18:    
    1495                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Gpio.c",li
    1496              $C$DW$79        .dwtag  DW_TAG_TI_branch
    1497                      .dwattr $C$DW$79, DW_AT_low_pc(0x00)
    1498                      .dwattr $C$DW$79, DW_AT_name("_GPIO_EnableUnbondedIOPullupsFor100Pin")
    1499                      .dwattr $C$DW$79, DW_AT_TI_call
    1500              
    1501 000001ca 7640'         LCR       #_GPIO_EnableUnbondedIOPullupsFor100Pin ; [CPU_ALU] |329| 
         000001cb 0198 
    1502                      ; call occurs [#_GPIO_EnableUnbondedIOPullupsFor100Pin] ; [] |329| 
    1503              $C$L19:    
    1504              $C$DW$80        .dwtag  DW_TAG_TI_branch
    1505                      .dwattr $C$DW$80, DW_AT_low_pc(0x00)
    1506                      .dwattr $C$DW$80, DW_AT_TI_return
    1507              
    1508 000001cc 0006          LRETR     ; [CPU_ALU] 
    1509                      ; return occurs ; [] 
    1510                      .dwattr $C$DW$76, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/so
    1511                      .dwattr $C$DW$76, DW_AT_TI_end_line(0x154)
    1512                      .dwattr $C$DW$76, DW_AT_TI_end_column(0x02)
    1513                      .dwendentry
    1514                      .dwendtag $C$DW$76
    1515              
    1516              ;**************************************************************
    1517              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1518              ;**************************************************************
    1519                      .global _InputXbarRegs
    1520                      .global _GpioDataRegs
    1521                      .global _DevCfgRegs
    1522                      .global _GpioCtrlRegs
    1523              
    1524              ;***************************************************************
    1525              ;* TYPE INFORMATION                                            *
    1526              ;***************************************************************
    1527              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   30

    1528              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1529                      .dwattr $C$DW$T$20, DW_AT_name("CPU2RESCTL_BITS")
    1530                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1531              $C$DW$81        .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1533                      .dwattr $C$DW$81, DW_AT_name("RESET")
    1534                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_RESET")
    1535                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0f)
    1536                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1537                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1538                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1539              
    1540              $C$DW$82        .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1542                      .dwattr $C$DW$82, DW_AT_name("rsvd1")
    1543                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd1")
    1544                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1545                      .dwattr $C$DW$82, DW_AT_bit_size(0x0f)
    1546                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1548              
    1549              $C$DW$83        .dwtag  DW_TAG_member
    1550                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1551                      .dwattr $C$DW$83, DW_AT_name("KEY")
    1552                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_KEY")
    1553                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00)
    1554                      .dwattr $C$DW$83, DW_AT_bit_size(0x10)
    1555                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1556                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1557              
    1558                      .dwendtag $C$DW$T$20
    1559              
    1560              
    1561              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1562                      .dwattr $C$DW$T$22, DW_AT_name("CPU2RESCTL_REG")
    1563                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1564              $C$DW$84        .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1566                      .dwattr $C$DW$84, DW_AT_name("all")
    1567                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_all")
    1568                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1569                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1570              
    1571              $C$DW$85        .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    1573                      .dwattr $C$DW$85, DW_AT_name("bit")
    1574                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_bit")
    1575                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1576                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1577              
    1578                      .dwendtag $C$DW$T$22
    1579              
    1580              
    1581              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1582                      .dwattr $C$DW$T$23, DW_AT_name("CPUSEL0_BITS")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   31

    1583                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1584              $C$DW$86        .dwtag  DW_TAG_member
    1585                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1586                      .dwattr $C$DW$86, DW_AT_name("EPWM1")
    1587                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_EPWM1")
    1588                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0f)
    1589                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1590                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1591                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1592              
    1593              $C$DW$87        .dwtag  DW_TAG_member
    1594                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1595                      .dwattr $C$DW$87, DW_AT_name("EPWM2")
    1596                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_EPWM2")
    1597                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0e)
    1598                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1599                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1600                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1601              
    1602              $C$DW$88        .dwtag  DW_TAG_member
    1603                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1604                      .dwattr $C$DW$88, DW_AT_name("EPWM3")
    1605                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_EPWM3")
    1606                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0d)
    1607                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1608                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1609                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1610              
    1611              $C$DW$89        .dwtag  DW_TAG_member
    1612                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1613                      .dwattr $C$DW$89, DW_AT_name("EPWM4")
    1614                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_EPWM4")
    1615                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0c)
    1616                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1617                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1619              
    1620              $C$DW$90        .dwtag  DW_TAG_member
    1621                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1622                      .dwattr $C$DW$90, DW_AT_name("EPWM5")
    1623                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_EPWM5")
    1624                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0b)
    1625                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1626                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1627                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1628              
    1629              $C$DW$91        .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1631                      .dwattr $C$DW$91, DW_AT_name("EPWM6")
    1632                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_EPWM6")
    1633                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0a)
    1634                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1635                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1637              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   32

    1638              $C$DW$92        .dwtag  DW_TAG_member
    1639                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1640                      .dwattr $C$DW$92, DW_AT_name("EPWM7")
    1641                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_EPWM7")
    1642                      .dwattr $C$DW$92, DW_AT_bit_offset(0x09)
    1643                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1644                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1645                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1646              
    1647              $C$DW$93        .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1649                      .dwattr $C$DW$93, DW_AT_name("EPWM8")
    1650                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_EPWM8")
    1651                      .dwattr $C$DW$93, DW_AT_bit_offset(0x08)
    1652                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1653                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1654                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1655              
    1656              $C$DW$94        .dwtag  DW_TAG_member
    1657                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1658                      .dwattr $C$DW$94, DW_AT_name("EPWM9")
    1659                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_EPWM9")
    1660                      .dwattr $C$DW$94, DW_AT_bit_offset(0x07)
    1661                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1662                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1663                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1664              
    1665              $C$DW$95        .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1667                      .dwattr $C$DW$95, DW_AT_name("EPWM10")
    1668                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_EPWM10")
    1669                      .dwattr $C$DW$95, DW_AT_bit_offset(0x06)
    1670                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1671                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1673              
    1674              $C$DW$96        .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1676                      .dwattr $C$DW$96, DW_AT_name("EPWM11")
    1677                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_EPWM11")
    1678                      .dwattr $C$DW$96, DW_AT_bit_offset(0x05)
    1679                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1680                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1681                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1682              
    1683              $C$DW$97        .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1685                      .dwattr $C$DW$97, DW_AT_name("EPWM12")
    1686                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_EPWM12")
    1687                      .dwattr $C$DW$97, DW_AT_bit_offset(0x04)
    1688                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1689                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1690                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1691              
    1692              $C$DW$98        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   33

    1693                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1694                      .dwattr $C$DW$98, DW_AT_name("rsvd1")
    1695                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd1")
    1696                      .dwattr $C$DW$98, DW_AT_bit_offset(0x03)
    1697                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1698                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1699                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1700              
    1701              $C$DW$99        .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1703                      .dwattr $C$DW$99, DW_AT_name("rsvd2")
    1704                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd2")
    1705                      .dwattr $C$DW$99, DW_AT_bit_offset(0x02)
    1706                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1707                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1709              
    1710              $C$DW$100       .dwtag  DW_TAG_member
    1711                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1712                      .dwattr $C$DW$100, DW_AT_name("rsvd3")
    1713                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd3")
    1714                      .dwattr $C$DW$100, DW_AT_bit_offset(0x01)
    1715                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1716                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1717                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1718              
    1719              $C$DW$101       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1721                      .dwattr $C$DW$101, DW_AT_name("rsvd4")
    1722                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd4")
    1723                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1724                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1725                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1726                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1727              
    1728              $C$DW$102       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1730                      .dwattr $C$DW$102, DW_AT_name("rsvd5")
    1731                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd5")
    1732                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    1733                      .dwattr $C$DW$102, DW_AT_bit_size(0x10)
    1734                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1735                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1736              
    1737                      .dwendtag $C$DW$T$23
    1738              
    1739              
    1740              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1741                      .dwattr $C$DW$T$24, DW_AT_name("CPUSEL0_REG")
    1742                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1743              $C$DW$103       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
    1745                      .dwattr $C$DW$103, DW_AT_name("all")
    1746                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_all")
    1747                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   34

    1748                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1749              
    1750              $C$DW$104       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$23)
    1752                      .dwattr $C$DW$104, DW_AT_name("bit")
    1753                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_bit")
    1754                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1755                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1756              
    1757                      .dwendtag $C$DW$T$24
    1758              
    1759              
    1760              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1761                      .dwattr $C$DW$T$25, DW_AT_name("CPUSEL11_BITS")
    1762                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1763              $C$DW$105       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1765                      .dwattr $C$DW$105, DW_AT_name("ADC_A")
    1766                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ADC_A")
    1767                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0f)
    1768                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1769                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1770                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1771              
    1772              $C$DW$106       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1774                      .dwattr $C$DW$106, DW_AT_name("ADC_B")
    1775                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_ADC_B")
    1776                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0e)
    1777                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1778                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1779                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1780              
    1781              $C$DW$107       .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1783                      .dwattr $C$DW$107, DW_AT_name("ADC_C")
    1784                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_ADC_C")
    1785                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0d)
    1786                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1787                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1788                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1789              
    1790              $C$DW$108       .dwtag  DW_TAG_member
    1791                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1792                      .dwattr $C$DW$108, DW_AT_name("ADC_D")
    1793                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_ADC_D")
    1794                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0c)
    1795                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1796                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1797                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1798              
    1799              $C$DW$109       .dwtag  DW_TAG_member
    1800                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1801                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
    1802                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   35

    1803                      .dwattr $C$DW$109, DW_AT_bit_offset(0x00)
    1804                      .dwattr $C$DW$109, DW_AT_bit_size(0x0c)
    1805                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1806                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1807              
    1808              $C$DW$110       .dwtag  DW_TAG_member
    1809                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1810                      .dwattr $C$DW$110, DW_AT_name("rsvd2")
    1811                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd2")
    1812                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1813                      .dwattr $C$DW$110, DW_AT_bit_size(0x10)
    1814                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1815                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1816              
    1817                      .dwendtag $C$DW$T$25
    1818              
    1819              
    1820              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1821                      .dwattr $C$DW$T$26, DW_AT_name("CPUSEL11_REG")
    1822                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1823              $C$DW$111       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$21)
    1825                      .dwattr $C$DW$111, DW_AT_name("all")
    1826                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1827                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1828                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1829              
    1830              $C$DW$112       .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$25)
    1832                      .dwattr $C$DW$112, DW_AT_name("bit")
    1833                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    1834                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1835                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1836              
    1837                      .dwendtag $C$DW$T$26
    1838              
    1839              
    1840              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1841                      .dwattr $C$DW$T$27, DW_AT_name("CPUSEL12_BITS")
    1842                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1843              $C$DW$113       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1845                      .dwattr $C$DW$113, DW_AT_name("CMPSS1")
    1846                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_CMPSS1")
    1847                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0f)
    1848                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1849                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1850                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1851              
    1852              $C$DW$114       .dwtag  DW_TAG_member
    1853                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1854                      .dwattr $C$DW$114, DW_AT_name("CMPSS2")
    1855                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_CMPSS2")
    1856                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0e)
    1857                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   36

    1858                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1859                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1860              
    1861              $C$DW$115       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1863                      .dwattr $C$DW$115, DW_AT_name("CMPSS3")
    1864                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_CMPSS3")
    1865                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0d)
    1866                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1867                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1868                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1869              
    1870              $C$DW$116       .dwtag  DW_TAG_member
    1871                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1872                      .dwattr $C$DW$116, DW_AT_name("CMPSS4")
    1873                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_CMPSS4")
    1874                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0c)
    1875                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1876                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1877                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1878              
    1879              $C$DW$117       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1881                      .dwattr $C$DW$117, DW_AT_name("CMPSS5")
    1882                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_CMPSS5")
    1883                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0b)
    1884                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1885                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1886                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1887              
    1888              $C$DW$118       .dwtag  DW_TAG_member
    1889                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1890                      .dwattr $C$DW$118, DW_AT_name("CMPSS6")
    1891                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_CMPSS6")
    1892                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0a)
    1893                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1894                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1895                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1896              
    1897              $C$DW$119       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1899                      .dwattr $C$DW$119, DW_AT_name("CMPSS7")
    1900                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_CMPSS7")
    1901                      .dwattr $C$DW$119, DW_AT_bit_offset(0x09)
    1902                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1903                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1904                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1905              
    1906              $C$DW$120       .dwtag  DW_TAG_member
    1907                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1908                      .dwattr $C$DW$120, DW_AT_name("CMPSS8")
    1909                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_CMPSS8")
    1910                      .dwattr $C$DW$120, DW_AT_bit_offset(0x08)
    1911                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1912                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   37

    1913                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1914              
    1915              $C$DW$121       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1917                      .dwattr $C$DW$121, DW_AT_name("rsvd1")
    1918                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd1")
    1919                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1920                      .dwattr $C$DW$121, DW_AT_bit_size(0x08)
    1921                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1922                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1923              
    1924              $C$DW$122       .dwtag  DW_TAG_member
    1925                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1926                      .dwattr $C$DW$122, DW_AT_name("rsvd2")
    1927                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd2")
    1928                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00)
    1929                      .dwattr $C$DW$122, DW_AT_bit_size(0x10)
    1930                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1931                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1932              
    1933                      .dwendtag $C$DW$T$27
    1934              
    1935              
    1936              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1937                      .dwattr $C$DW$T$28, DW_AT_name("CPUSEL12_REG")
    1938                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1939              $C$DW$123       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$21)
    1941                      .dwattr $C$DW$123, DW_AT_name("all")
    1942                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_all")
    1943                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1944                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1945              
    1946              $C$DW$124       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$27)
    1948                      .dwattr $C$DW$124, DW_AT_name("bit")
    1949                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bit")
    1950                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1951                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1952              
    1953                      .dwendtag $C$DW$T$28
    1954              
    1955              
    1956              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1957                      .dwattr $C$DW$T$29, DW_AT_name("CPUSEL14_BITS")
    1958                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1959              $C$DW$125       .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1961                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    1962                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
    1963                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0f)
    1964                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1965                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1966                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1967              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   38

    1968              $C$DW$126       .dwtag  DW_TAG_member
    1969                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1970                      .dwattr $C$DW$126, DW_AT_name("rsvd2")
    1971                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd2")
    1972                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0e)
    1973                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1974                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1975                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1976              
    1977              $C$DW$127       .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1979                      .dwattr $C$DW$127, DW_AT_name("rsvd3")
    1980                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd3")
    1981                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0d)
    1982                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1983                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1984                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1985              
    1986              $C$DW$128       .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1988                      .dwattr $C$DW$128, DW_AT_name("rsvd4")
    1989                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd4")
    1990                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0c)
    1991                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1992                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1993                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1994              
    1995              $C$DW$129       .dwtag  DW_TAG_member
    1996                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1997                      .dwattr $C$DW$129, DW_AT_name("rsvd5")
    1998                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd5")
    1999                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    2000                      .dwattr $C$DW$129, DW_AT_bit_size(0x0c)
    2001                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2002                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2003              
    2004              $C$DW$130       .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2006                      .dwattr $C$DW$130, DW_AT_name("DAC_A")
    2007                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_DAC_A")
    2008                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0f)
    2009                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2010                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2011                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2012              
    2013              $C$DW$131       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2015                      .dwattr $C$DW$131, DW_AT_name("DAC_B")
    2016                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_DAC_B")
    2017                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0e)
    2018                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2019                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2020                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2021              
    2022              $C$DW$132       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   39

    2023                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2024                      .dwattr $C$DW$132, DW_AT_name("DAC_C")
    2025                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_DAC_C")
    2026                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0d)
    2027                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2028                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2029                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2030              
    2031              $C$DW$133       .dwtag  DW_TAG_member
    2032                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2033                      .dwattr $C$DW$133, DW_AT_name("rsvd6")
    2034                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd6")
    2035                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0c)
    2036                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2037                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2038                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2039              
    2040              $C$DW$134       .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2042                      .dwattr $C$DW$134, DW_AT_name("rsvd7")
    2043                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd7")
    2044                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    2045                      .dwattr $C$DW$134, DW_AT_bit_size(0x0c)
    2046                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2047                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2048              
    2049                      .dwendtag $C$DW$T$29
    2050              
    2051              
    2052              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2053                      .dwattr $C$DW$T$30, DW_AT_name("CPUSEL14_REG")
    2054                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2055              $C$DW$135       .dwtag  DW_TAG_member
    2056                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$21)
    2057                      .dwattr $C$DW$135, DW_AT_name("all")
    2058                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_all")
    2059                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2060                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2061              
    2062              $C$DW$136       .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$29)
    2064                      .dwattr $C$DW$136, DW_AT_name("bit")
    2065                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_bit")
    2066                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2067                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2068              
    2069                      .dwendtag $C$DW$T$30
    2070              
    2071              
    2072              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2073                      .dwattr $C$DW$T$31, DW_AT_name("CPUSEL1_BITS")
    2074                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2075              $C$DW$137       .dwtag  DW_TAG_member
    2076                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2077                      .dwattr $C$DW$137, DW_AT_name("ECAP1")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   40

    2078                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ECAP1")
    2079                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0f)
    2080                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2081                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2083              
    2084              $C$DW$138       .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2086                      .dwattr $C$DW$138, DW_AT_name("ECAP2")
    2087                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ECAP2")
    2088                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0e)
    2089                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2090                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2091                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2092              
    2093              $C$DW$139       .dwtag  DW_TAG_member
    2094                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2095                      .dwattr $C$DW$139, DW_AT_name("ECAP3")
    2096                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ECAP3")
    2097                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0d)
    2098                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2099                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2101              
    2102              $C$DW$140       .dwtag  DW_TAG_member
    2103                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2104                      .dwattr $C$DW$140, DW_AT_name("ECAP4")
    2105                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ECAP4")
    2106                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0c)
    2107                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2108                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2109                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2110              
    2111              $C$DW$141       .dwtag  DW_TAG_member
    2112                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2113                      .dwattr $C$DW$141, DW_AT_name("ECAP5")
    2114                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ECAP5")
    2115                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0b)
    2116                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2117                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2118                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2119              
    2120              $C$DW$142       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2122                      .dwattr $C$DW$142, DW_AT_name("ECAP6")
    2123                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ECAP6")
    2124                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0a)
    2125                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2126                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2127                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2128              
    2129              $C$DW$143       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2131                      .dwattr $C$DW$143, DW_AT_name("rsvd1")
    2132                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   41

    2133                      .dwattr $C$DW$143, DW_AT_bit_offset(0x09)
    2134                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2135                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2136                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2137              
    2138              $C$DW$144       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2140                      .dwattr $C$DW$144, DW_AT_name("rsvd2")
    2141                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd2")
    2142                      .dwattr $C$DW$144, DW_AT_bit_offset(0x08)
    2143                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2144                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2145                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2146              
    2147              $C$DW$145       .dwtag  DW_TAG_member
    2148                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2149                      .dwattr $C$DW$145, DW_AT_name("rsvd3")
    2150                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd3")
    2151                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    2152                      .dwattr $C$DW$145, DW_AT_bit_size(0x08)
    2153                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2154                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2155              
    2156              $C$DW$146       .dwtag  DW_TAG_member
    2157                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2158                      .dwattr $C$DW$146, DW_AT_name("rsvd4")
    2159                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd4")
    2160                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    2161                      .dwattr $C$DW$146, DW_AT_bit_size(0x10)
    2162                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2163                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2164              
    2165                      .dwendtag $C$DW$T$31
    2166              
    2167              
    2168              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2169                      .dwattr $C$DW$T$32, DW_AT_name("CPUSEL1_REG")
    2170                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2171              $C$DW$147       .dwtag  DW_TAG_member
    2172                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$21)
    2173                      .dwattr $C$DW$147, DW_AT_name("all")
    2174                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_all")
    2175                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2176                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2177              
    2178              $C$DW$148       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$31)
    2180                      .dwattr $C$DW$148, DW_AT_name("bit")
    2181                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_bit")
    2182                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2183                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2184              
    2185                      .dwendtag $C$DW$T$32
    2186              
    2187              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   42

    2188              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2189                      .dwattr $C$DW$T$33, DW_AT_name("CPUSEL2_BITS")
    2190                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2191              $C$DW$149       .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2193                      .dwattr $C$DW$149, DW_AT_name("EQEP1")
    2194                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_EQEP1")
    2195                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0f)
    2196                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2197                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2199              
    2200              $C$DW$150       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2202                      .dwattr $C$DW$150, DW_AT_name("EQEP2")
    2203                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_EQEP2")
    2204                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0e)
    2205                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2206                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2208              
    2209              $C$DW$151       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2211                      .dwattr $C$DW$151, DW_AT_name("EQEP3")
    2212                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_EQEP3")
    2213                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0d)
    2214                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2215                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2216                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2217              
    2218              $C$DW$152       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2220                      .dwattr $C$DW$152, DW_AT_name("rsvd1")
    2221                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd1")
    2222                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0c)
    2223                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2224                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2225                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2226              
    2227              $C$DW$153       .dwtag  DW_TAG_member
    2228                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2229                      .dwattr $C$DW$153, DW_AT_name("rsvd2")
    2230                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd2")
    2231                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00)
    2232                      .dwattr $C$DW$153, DW_AT_bit_size(0x0c)
    2233                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2234                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2235              
    2236              $C$DW$154       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$154, DW_AT_name("rsvd3")
    2239                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd3")
    2240                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    2241                      .dwattr $C$DW$154, DW_AT_bit_size(0x10)
    2242                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   43

    2243                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2244              
    2245                      .dwendtag $C$DW$T$33
    2246              
    2247              
    2248              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2249                      .dwattr $C$DW$T$34, DW_AT_name("CPUSEL2_REG")
    2250                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2251              $C$DW$155       .dwtag  DW_TAG_member
    2252                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    2253                      .dwattr $C$DW$155, DW_AT_name("all")
    2254                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_all")
    2255                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2256                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2257              
    2258              $C$DW$156       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$33)
    2260                      .dwattr $C$DW$156, DW_AT_name("bit")
    2261                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_bit")
    2262                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2263                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2264              
    2265                      .dwendtag $C$DW$T$34
    2266              
    2267              
    2268              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2269                      .dwattr $C$DW$T$35, DW_AT_name("CPUSEL3_BITS")
    2270                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2271              $C$DW$157       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2273                      .dwattr $C$DW$157, DW_AT_name("rsvd1")
    2274                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd1")
    2275                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0f)
    2276                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2277                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2279              
    2280              $C$DW$158       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2282                      .dwattr $C$DW$158, DW_AT_name("rsvd2")
    2283                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd2")
    2284                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0e)
    2285                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2286                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2288              
    2289              $C$DW$159       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2291                      .dwattr $C$DW$159, DW_AT_name("rsvd3")
    2292                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd3")
    2293                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0d)
    2294                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2295                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2297              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   44

    2298              $C$DW$160       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2300                      .dwattr $C$DW$160, DW_AT_name("rsvd4")
    2301                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd4")
    2302                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0c)
    2303                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2304                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2305                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2306              
    2307              $C$DW$161       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2309                      .dwattr $C$DW$161, DW_AT_name("rsvd5")
    2310                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rsvd5")
    2311                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0b)
    2312                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2313                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2315              
    2316              $C$DW$162       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2318                      .dwattr $C$DW$162, DW_AT_name("rsvd6")
    2319                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd6")
    2320                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0a)
    2321                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2322                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2323                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2324              
    2325              $C$DW$163       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2327                      .dwattr $C$DW$163, DW_AT_name("rsvd7")
    2328                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd7")
    2329                      .dwattr $C$DW$163, DW_AT_bit_offset(0x09)
    2330                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2331                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2332                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2333              
    2334              $C$DW$164       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2336                      .dwattr $C$DW$164, DW_AT_name("rsvd8")
    2337                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd8")
    2338                      .dwattr $C$DW$164, DW_AT_bit_offset(0x08)
    2339                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2340                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2341                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2342              
    2343              $C$DW$165       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2345                      .dwattr $C$DW$165, DW_AT_name("rsvd9")
    2346                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd9")
    2347                      .dwattr $C$DW$165, DW_AT_bit_offset(0x00)
    2348                      .dwattr $C$DW$165, DW_AT_bit_size(0x08)
    2349                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2350                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2351              
    2352              $C$DW$166       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   45

    2353                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2354                      .dwattr $C$DW$166, DW_AT_name("rsvd10")
    2355                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd10")
    2356                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    2357                      .dwattr $C$DW$166, DW_AT_bit_size(0x10)
    2358                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2359                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2360              
    2361                      .dwendtag $C$DW$T$35
    2362              
    2363              
    2364              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2365                      .dwattr $C$DW$T$36, DW_AT_name("CPUSEL3_REG")
    2366                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2367              $C$DW$167       .dwtag  DW_TAG_member
    2368                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    2369                      .dwattr $C$DW$167, DW_AT_name("all")
    2370                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_all")
    2371                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2372                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2373              
    2374              $C$DW$168       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$35)
    2376                      .dwattr $C$DW$168, DW_AT_name("bit")
    2377                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_bit")
    2378                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2379                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2380              
    2381                      .dwendtag $C$DW$T$36
    2382              
    2383              
    2384              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2385                      .dwattr $C$DW$T$37, DW_AT_name("CPUSEL4_BITS")
    2386                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2387              $C$DW$169       .dwtag  DW_TAG_member
    2388                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2389                      .dwattr $C$DW$169, DW_AT_name("SD1")
    2390                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_SD1")
    2391                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0f)
    2392                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2393                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2394                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2395              
    2396              $C$DW$170       .dwtag  DW_TAG_member
    2397                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2398                      .dwattr $C$DW$170, DW_AT_name("SD2")
    2399                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_SD2")
    2400                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0e)
    2401                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2402                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2403                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2404              
    2405              $C$DW$171       .dwtag  DW_TAG_member
    2406                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2407                      .dwattr $C$DW$171, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   46

    2408                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd1")
    2409                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0d)
    2410                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2411                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2412                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2413              
    2414              $C$DW$172       .dwtag  DW_TAG_member
    2415                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2416                      .dwattr $C$DW$172, DW_AT_name("rsvd2")
    2417                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd2")
    2418                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0c)
    2419                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2420                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2421                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2422              
    2423              $C$DW$173       .dwtag  DW_TAG_member
    2424                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2425                      .dwattr $C$DW$173, DW_AT_name("rsvd3")
    2426                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd3")
    2427                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0b)
    2428                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2429                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2430                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2431              
    2432              $C$DW$174       .dwtag  DW_TAG_member
    2433                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2434                      .dwattr $C$DW$174, DW_AT_name("rsvd4")
    2435                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd4")
    2436                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0a)
    2437                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2438                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2439                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2440              
    2441              $C$DW$175       .dwtag  DW_TAG_member
    2442                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2443                      .dwattr $C$DW$175, DW_AT_name("rsvd5")
    2444                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd5")
    2445                      .dwattr $C$DW$175, DW_AT_bit_offset(0x09)
    2446                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2447                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2448                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2449              
    2450              $C$DW$176       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2452                      .dwattr $C$DW$176, DW_AT_name("rsvd6")
    2453                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd6")
    2454                      .dwattr $C$DW$176, DW_AT_bit_offset(0x08)
    2455                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2456                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2457                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2458              
    2459              $C$DW$177       .dwtag  DW_TAG_member
    2460                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2461                      .dwattr $C$DW$177, DW_AT_name("rsvd7")
    2462                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd7")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   47

    2463                      .dwattr $C$DW$177, DW_AT_bit_offset(0x00)
    2464                      .dwattr $C$DW$177, DW_AT_bit_size(0x08)
    2465                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2466                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2467              
    2468              $C$DW$178       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2470                      .dwattr $C$DW$178, DW_AT_name("rsvd8")
    2471                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd8")
    2472                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00)
    2473                      .dwattr $C$DW$178, DW_AT_bit_size(0x10)
    2474                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2475                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2476              
    2477                      .dwendtag $C$DW$T$37
    2478              
    2479              
    2480              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2481                      .dwattr $C$DW$T$38, DW_AT_name("CPUSEL4_REG")
    2482                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2483              $C$DW$179       .dwtag  DW_TAG_member
    2484                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$21)
    2485                      .dwattr $C$DW$179, DW_AT_name("all")
    2486                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_all")
    2487                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2488                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2489              
    2490              $C$DW$180       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$37)
    2492                      .dwattr $C$DW$180, DW_AT_name("bit")
    2493                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_bit")
    2494                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2495                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2496              
    2497                      .dwendtag $C$DW$T$38
    2498              
    2499              
    2500              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2501                      .dwattr $C$DW$T$39, DW_AT_name("CPUSEL5_BITS")
    2502                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2503              $C$DW$181       .dwtag  DW_TAG_member
    2504                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2505                      .dwattr $C$DW$181, DW_AT_name("SCI_A")
    2506                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_SCI_A")
    2507                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0f)
    2508                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2509                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2510                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2511              
    2512              $C$DW$182       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2514                      .dwattr $C$DW$182, DW_AT_name("SCI_B")
    2515                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_SCI_B")
    2516                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0e)
    2517                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   48

    2518                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2519                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2520              
    2521              $C$DW$183       .dwtag  DW_TAG_member
    2522                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2523                      .dwattr $C$DW$183, DW_AT_name("SCI_C")
    2524                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_SCI_C")
    2525                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0d)
    2526                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2527                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2528                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2529              
    2530              $C$DW$184       .dwtag  DW_TAG_member
    2531                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2532                      .dwattr $C$DW$184, DW_AT_name("SCI_D")
    2533                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_SCI_D")
    2534                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0c)
    2535                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2536                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2537                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2538              
    2539              $C$DW$185       .dwtag  DW_TAG_member
    2540                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2541                      .dwattr $C$DW$185, DW_AT_name("rsvd1")
    2542                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd1")
    2543                      .dwattr $C$DW$185, DW_AT_bit_offset(0x00)
    2544                      .dwattr $C$DW$185, DW_AT_bit_size(0x0c)
    2545                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2546                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2547              
    2548              $C$DW$186       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2550                      .dwattr $C$DW$186, DW_AT_name("rsvd2")
    2551                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd2")
    2552                      .dwattr $C$DW$186, DW_AT_bit_offset(0x00)
    2553                      .dwattr $C$DW$186, DW_AT_bit_size(0x10)
    2554                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2555                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2556              
    2557                      .dwendtag $C$DW$T$39
    2558              
    2559              
    2560              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2561                      .dwattr $C$DW$T$40, DW_AT_name("CPUSEL5_REG")
    2562                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2563              $C$DW$187       .dwtag  DW_TAG_member
    2564                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$21)
    2565                      .dwattr $C$DW$187, DW_AT_name("all")
    2566                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_all")
    2567                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2568                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2569              
    2570              $C$DW$188       .dwtag  DW_TAG_member
    2571                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$39)
    2572                      .dwattr $C$DW$188, DW_AT_name("bit")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   49

    2573                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_bit")
    2574                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2575                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2576              
    2577                      .dwendtag $C$DW$T$40
    2578              
    2579              
    2580              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2581                      .dwattr $C$DW$T$41, DW_AT_name("CPUSEL6_BITS")
    2582                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2583              $C$DW$189       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2585                      .dwattr $C$DW$189, DW_AT_name("SPI_A")
    2586                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_SPI_A")
    2587                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0f)
    2588                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2589                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2590                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2591              
    2592              $C$DW$190       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2594                      .dwattr $C$DW$190, DW_AT_name("SPI_B")
    2595                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_SPI_B")
    2596                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0e)
    2597                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2598                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2599                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2600              
    2601              $C$DW$191       .dwtag  DW_TAG_member
    2602                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2603                      .dwattr $C$DW$191, DW_AT_name("SPI_C")
    2604                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_SPI_C")
    2605                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0d)
    2606                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2607                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2608                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2609              
    2610              $C$DW$192       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2612                      .dwattr $C$DW$192, DW_AT_name("rsvd1")
    2613                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd1")
    2614                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0c)
    2615                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2616                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2617                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2618              
    2619              $C$DW$193       .dwtag  DW_TAG_member
    2620                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2621                      .dwattr $C$DW$193, DW_AT_name("rsvd2")
    2622                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd2")
    2623                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00)
    2624                      .dwattr $C$DW$193, DW_AT_bit_size(0x0c)
    2625                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2626                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2627              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   50

    2628              $C$DW$194       .dwtag  DW_TAG_member
    2629                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2630                      .dwattr $C$DW$194, DW_AT_name("rsvd3")
    2631                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rsvd3")
    2632                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0f)
    2633                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2634                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2635                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2636              
    2637              $C$DW$195       .dwtag  DW_TAG_member
    2638                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2639                      .dwattr $C$DW$195, DW_AT_name("rsvd4")
    2640                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd4")
    2641                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0e)
    2642                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2643                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2644                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2645              
    2646              $C$DW$196       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2648                      .dwattr $C$DW$196, DW_AT_name("rsvd5")
    2649                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd5")
    2650                      .dwattr $C$DW$196, DW_AT_bit_offset(0x00)
    2651                      .dwattr $C$DW$196, DW_AT_bit_size(0x0e)
    2652                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2653                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2654              
    2655                      .dwendtag $C$DW$T$41
    2656              
    2657              
    2658              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2659                      .dwattr $C$DW$T$42, DW_AT_name("CPUSEL6_REG")
    2660                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2661              $C$DW$197       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    2663                      .dwattr $C$DW$197, DW_AT_name("all")
    2664                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_all")
    2665                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2666                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2667              
    2668              $C$DW$198       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$41)
    2670                      .dwattr $C$DW$198, DW_AT_name("bit")
    2671                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_bit")
    2672                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2673                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2674              
    2675                      .dwendtag $C$DW$T$42
    2676              
    2677              
    2678              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2679                      .dwattr $C$DW$T$43, DW_AT_name("CPUSEL7_BITS")
    2680                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2681              $C$DW$199       .dwtag  DW_TAG_member
    2682                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   51

    2683                      .dwattr $C$DW$199, DW_AT_name("I2C_A")
    2684                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_I2C_A")
    2685                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0f)
    2686                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2687                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2688                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2689              
    2690              $C$DW$200       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2692                      .dwattr $C$DW$200, DW_AT_name("I2C_B")
    2693                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_I2C_B")
    2694                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0e)
    2695                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2696                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2697                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2698              
    2699              $C$DW$201       .dwtag  DW_TAG_member
    2700                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2701                      .dwattr $C$DW$201, DW_AT_name("rsvd1")
    2702                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd1")
    2703                      .dwattr $C$DW$201, DW_AT_bit_offset(0x00)
    2704                      .dwattr $C$DW$201, DW_AT_bit_size(0x0e)
    2705                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2706                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2707              
    2708              $C$DW$202       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2710                      .dwattr $C$DW$202, DW_AT_name("rsvd2")
    2711                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rsvd2")
    2712                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0f)
    2713                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2714                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2715                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2716              
    2717              $C$DW$203       .dwtag  DW_TAG_member
    2718                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2719                      .dwattr $C$DW$203, DW_AT_name("rsvd3")
    2720                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd3")
    2721                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0e)
    2722                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2723                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2724                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2725              
    2726              $C$DW$204       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2728                      .dwattr $C$DW$204, DW_AT_name("rsvd4")
    2729                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd4")
    2730                      .dwattr $C$DW$204, DW_AT_bit_offset(0x00)
    2731                      .dwattr $C$DW$204, DW_AT_bit_size(0x0e)
    2732                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2733                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2734              
    2735                      .dwendtag $C$DW$T$43
    2736              
    2737              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   52

    2738              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2739                      .dwattr $C$DW$T$44, DW_AT_name("CPUSEL7_REG")
    2740                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2741              $C$DW$205       .dwtag  DW_TAG_member
    2742                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$21)
    2743                      .dwattr $C$DW$205, DW_AT_name("all")
    2744                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_all")
    2745                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2746                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2747              
    2748              $C$DW$206       .dwtag  DW_TAG_member
    2749                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$43)
    2750                      .dwattr $C$DW$206, DW_AT_name("bit")
    2751                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_bit")
    2752                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2753                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2754              
    2755                      .dwendtag $C$DW$T$44
    2756              
    2757              
    2758              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2759                      .dwattr $C$DW$T$45, DW_AT_name("CPUSEL8_BITS")
    2760                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2761              $C$DW$207       .dwtag  DW_TAG_member
    2762                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2763                      .dwattr $C$DW$207, DW_AT_name("CAN_A")
    2764                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_CAN_A")
    2765                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0f)
    2766                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2767                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2768                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2769              
    2770              $C$DW$208       .dwtag  DW_TAG_member
    2771                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2772                      .dwattr $C$DW$208, DW_AT_name("CAN_B")
    2773                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_CAN_B")
    2774                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0e)
    2775                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2776                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2777                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2778              
    2779              $C$DW$209       .dwtag  DW_TAG_member
    2780                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2781                      .dwattr $C$DW$209, DW_AT_name("rsvd1")
    2782                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_rsvd1")
    2783                      .dwattr $C$DW$209, DW_AT_bit_offset(0x0d)
    2784                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2785                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2786                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2787              
    2788              $C$DW$210       .dwtag  DW_TAG_member
    2789                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2790                      .dwattr $C$DW$210, DW_AT_name("rsvd2")
    2791                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd2")
    2792                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:07 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   53

    2793                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2794                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2795                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2796              
    2797              $C$DW$211       .dwtag  DW_TAG_member
    2798                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2799                      .dwattr $C$DW$211, DW_AT_name("rsvd3")
    2800                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd3")
    2801                      .dwattr $C$DW$211, DW_AT_bit_offset(0x00)
    2802                      .dwattr $C$DW$211, DW_AT_bit_size(0x0c)
    2803                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2804                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2805              
    2806              $C$DW$212       .dwtag  DW_TAG_member
    2807                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2808                      .dwattr $C$DW$212, DW_AT_name("rsvd4")
    2809                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd4")
    2810                      .dwattr $C$DW$212, DW_AT_bit_offset(0x00)
    2811                      .dwattr $C$DW$212, DW_AT_bit_size(0x10)
    2812                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2813                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2814              
    2815                      .dwendtag $C$DW$T$45
    2816              
    2817              
    2818              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2819                      .dwattr $C$DW$T$46, DW_AT_name("CPUSEL8_REG")
    2820                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2821              $C$DW$213       .dwtag  DW_TAG_member
    2822                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$21)
    2823                      .dwattr $C$DW$213, DW_AT_name("all")
    2824                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_all")
    2825                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2826                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2827              
    2828              $C$DW$214       .dwtag  DW_TAG_member
    2829                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$45)
    2830                      .dwattr $C$DW$214, DW_AT_name("bit")
    2831                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_bit")
