TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Sat Jul 18 15:28:09 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Desktop\servodrive_TMIDDK\IDDK_PM_Servo_F2837x-v2\F2
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("SDFM")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SDFM")

    1799 000003db 0006          LRETR     ; [CPU_ALU] 
    1800                      ; return occurs ; [] 
    1801                      .dwattr $C$DW$73, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/so
    1802                      .dwattr $C$DW$73, DW_AT_TI_end_line(0x195)
    1803                      .dwattr $C$DW$73, DW_AT_TI_end_column(0x01)
    1804                      .dwendentry
    1805                      .dwendtag $C$DW$73
    1806              
    1807 000003dc               .sect   ".text"
    1808                      .clink
    1809                      .global _SDFM_disableMFE
    1810              
    1811              $C$DW$77        .dwtag  DW_TAG_subprogram
    1812                      .dwattr $C$DW$77, DW_AT_name("SDFM_disableMFE")
    1813                      .dwattr $C$DW$77, DW_AT_low_pc(_SDFM_disableMFE)
    1814                      .dwattr $C$DW$77, DW_AT_high_pc(0x00)
    1815                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_SDFM_disableMFE")
    1816                      .dwattr $C$DW$77, DW_AT_external
    1817                      .dwattr $C$DW$77, DW_AT_TI_begin_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/
    1818                      .dwattr $C$DW$77, DW_AT_TI_begin_line(0x156)
    1819                      .dwattr $C$DW$77, DW_AT_TI_begin_column(0x06)
    1820                      .dwattr $C$DW$77, DW_AT_TI_max_frame_size(-2)
    1821                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_sdfm_drive
    1822              
    1823                      .dwfde $C$DW$CIE, _SDFM_disableMFE
    1824              $C$DW$78        .dwtag  DW_TAG_formal_parameter
    1825                      .dwattr $C$DW$78, DW_AT_name("sdfmNumber")
    1826                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_sdfmNumber")
    1827                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1828                      .dwattr $C$DW$78, DW_AT_location[DW_OP_reg0]
    1829              
    1830              
    1831              ;***************************************************************
    1832              ;* FNAME: _SDFM_disableMFE              FR SIZE:   0           *
    1833              ;*                                                             *
    1834              ;* FUNCTION ENVIRONMENT                                        *
    1835              ;*                                                             *
    1836              ;* FUNCTION PROPERTIES                                         *
    1837              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1838              ;***************************************************************
    1839              
    1840 000003dc       _SDFM_disableMFE:
    1841                      .dwcfi  cfa_offset, -2
    1842                      .dwcfi  save_reg_to_mem, 26, 0
    1843 000003dc 7622   EALLOW
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   39

    1844 000003dd 2901          CLRC      SXM                   ; [CPU_ALU] 
    1845                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_sdfm_drive
    1846 000003de 8F00!         MOVL      XAR4,#_SDFM           ; [CPU_ARAU] |346| 
         000003df 0000 
    1847 000003e0 5603          MOV       ACC,AL << 1           ; [CPU_ALU] |346| 
         000003e1 01A9 
    1848 000003e2 5601          ADDL      XAR4,ACC              ; [CPU_ALU] |346| 
         000003e3 00A4 
    1849 000003e4 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_ALU] |346| 
    1850 000003e5 18F4          AND       *+XAR4[6],#0xf7ff     ; [CPU_ALU] |346| 
         000003e6 F7FF 
    1851 000003e7 761A   EDIS
    1852 000003e8 FF69          SPM       #0                    ; [CPU_ALU] 
    1853              $C$DW$79        .dwtag  DW_TAG_TI_branch
    1854                      .dwattr $C$DW$79, DW_AT_low_pc(0x00)
    1855                      .dwattr $C$DW$79, DW_AT_TI_return
    1856              
    1857 000003e9 0006          LRETR     ; [CPU_ALU] 
    1858                      ; return occurs ; [] 
    1859                      .dwattr $C$DW$77, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/so
    1860                      .dwattr $C$DW$77, DW_AT_TI_end_line(0x15d)
    1861                      .dwattr $C$DW$77, DW_AT_TI_end_column(0x01)
    1862                      .dwendentry
    1863                      .dwendtag $C$DW$77
    1864              
    1865              ;**************************************************************
    1866              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1867              ;**************************************************************
    1868                      .global _SDFM
    1869              
    1870              ;***************************************************************
    1871              ;* TYPE INFORMATION                                            *
    1872              ;***************************************************************
    1873              
    1874              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1875                      .dwattr $C$DW$T$20, DW_AT_name("SDCMPH1_BITS")
    1876                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1877              $C$DW$80        .dwtag  DW_TAG_member
    1878                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1879                      .dwattr $C$DW$80, DW_AT_name("HLT")
    1880                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_HLT")
    1881                      .dwattr $C$DW$80, DW_AT_bit_offset(0x01)
    1882                      .dwattr $C$DW$80, DW_AT_bit_size(0x0f)
    1883                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1884                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1885              
    1886              $C$DW$81        .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1888                      .dwattr $C$DW$81, DW_AT_name("rsvd1")
    1889                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd1")
    1890                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00)
    1891                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1892                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1893                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1894              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   40

    1895                      .dwendtag $C$DW$T$20
    1896              
    1897              
    1898              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1899                      .dwattr $C$DW$T$21, DW_AT_name("SDCMPH1_REG")
    1900                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1901              $C$DW$82        .dwtag  DW_TAG_member
    1902                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1903                      .dwattr $C$DW$82, DW_AT_name("all")
    1904                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_all")
    1905                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1906                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1907              
    1908              $C$DW$83        .dwtag  DW_TAG_member
    1909                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    1910                      .dwattr $C$DW$83, DW_AT_name("bit")
    1911                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_bit")
    1912                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1913                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1914              
    1915                      .dwendtag $C$DW$T$21
    1916              
    1917              
    1918              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1919                      .dwattr $C$DW$T$22, DW_AT_name("SDCMPH2_BITS")
    1920                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1921              $C$DW$84        .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1923                      .dwattr $C$DW$84, DW_AT_name("HLT")
    1924                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_HLT")
    1925                      .dwattr $C$DW$84, DW_AT_bit_offset(0x01)
    1926                      .dwattr $C$DW$84, DW_AT_bit_size(0x0f)
    1927                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1928                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1929              
    1930              $C$DW$85        .dwtag  DW_TAG_member
    1931                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1932                      .dwattr $C$DW$85, DW_AT_name("rsvd1")
    1933                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd1")
    1934                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
    1935                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1936                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1937                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1938              
    1939                      .dwendtag $C$DW$T$22
    1940              
    1941              
    1942              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1943                      .dwattr $C$DW$T$23, DW_AT_name("SDCMPH2_REG")
    1944                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1945              $C$DW$86        .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1947                      .dwattr $C$DW$86, DW_AT_name("all")
    1948                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
    1949                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   41

    1950                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1951              
    1952              $C$DW$87        .dwtag  DW_TAG_member
    1953                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$22)
    1954                      .dwattr $C$DW$87, DW_AT_name("bit")
    1955                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
    1956                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1957                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1958              
    1959                      .dwendtag $C$DW$T$23
    1960              
    1961              
    1962              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1963                      .dwattr $C$DW$T$24, DW_AT_name("SDCMPH3_BITS")
    1964                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1965              $C$DW$88        .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1967                      .dwattr $C$DW$88, DW_AT_name("HLT")
    1968                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_HLT")
    1969                      .dwattr $C$DW$88, DW_AT_bit_offset(0x01)
    1970                      .dwattr $C$DW$88, DW_AT_bit_size(0x0f)
    1971                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1972                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1973              
    1974              $C$DW$89        .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1976                      .dwattr $C$DW$89, DW_AT_name("rsvd1")
    1977                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd1")
    1978                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
    1979                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1980                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1981                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1982              
    1983                      .dwendtag $C$DW$T$24
    1984              
    1985              
    1986              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1987                      .dwattr $C$DW$T$25, DW_AT_name("SDCMPH3_REG")
    1988                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1989              $C$DW$90        .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1991                      .dwattr $C$DW$90, DW_AT_name("all")
    1992                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
    1993                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1994                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1995              
    1996              $C$DW$91        .dwtag  DW_TAG_member
    1997                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$24)
    1998                      .dwattr $C$DW$91, DW_AT_name("bit")
    1999                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
    2000                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2002              
    2003                      .dwendtag $C$DW$T$25
    2004              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   42

    2005              
    2006              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2007                      .dwattr $C$DW$T$26, DW_AT_name("SDCMPH4_BITS")
    2008                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    2009              $C$DW$92        .dwtag  DW_TAG_member
    2010                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    2011                      .dwattr $C$DW$92, DW_AT_name("HLT")
    2012                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_HLT")
    2013                      .dwattr $C$DW$92, DW_AT_bit_offset(0x01)
    2014                      .dwattr $C$DW$92, DW_AT_bit_size(0x0f)
    2015                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2016                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2017              
    2018              $C$DW$93        .dwtag  DW_TAG_member
    2019                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    2020                      .dwattr $C$DW$93, DW_AT_name("rsvd1")
    2021                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd1")
    2022                      .dwattr $C$DW$93, DW_AT_bit_offset(0x00)
    2023                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    2024                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2025                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2026              
    2027                      .dwendtag $C$DW$T$26
    2028              
    2029              
    2030              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2031                      .dwattr $C$DW$T$27, DW_AT_name("SDCMPH4_REG")
    2032                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2033              $C$DW$94        .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    2035                      .dwattr $C$DW$94, DW_AT_name("all")
    2036                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_all")
    2037                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2038                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2039              
    2040              $C$DW$95        .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$26)
    2042                      .dwattr $C$DW$95, DW_AT_name("bit")
    2043                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_bit")
    2044                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2045                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2046              
    2047                      .dwendtag $C$DW$T$27
    2048              
    2049              
    2050              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2051                      .dwattr $C$DW$T$28, DW_AT_name("SDCMPL1_BITS")
    2052                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2053              $C$DW$96        .dwtag  DW_TAG_member
    2054                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    2055                      .dwattr $C$DW$96, DW_AT_name("LLT")
    2056                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_LLT")
    2057                      .dwattr $C$DW$96, DW_AT_bit_offset(0x01)
    2058                      .dwattr $C$DW$96, DW_AT_bit_size(0x0f)
    2059                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   43

    2060                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2061              
    2062              $C$DW$97        .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    2064                      .dwattr $C$DW$97, DW_AT_name("rsvd1")
    2065                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd1")
    2066                      .dwattr $C$DW$97, DW_AT_bit_offset(0x00)
    2067                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    2068                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2069                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2070              
    2071                      .dwendtag $C$DW$T$28
    2072              
    2073              
    2074              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2075                      .dwattr $C$DW$T$29, DW_AT_name("SDCMPL1_REG")
    2076                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2077              $C$DW$98        .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    2079                      .dwattr $C$DW$98, DW_AT_name("all")
    2080                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_all")
    2081                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2083              
    2084              $C$DW$99        .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$28)
    2086                      .dwattr $C$DW$99, DW_AT_name("bit")
    2087                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_bit")
    2088                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2089                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2090              
    2091                      .dwendtag $C$DW$T$29
    2092              
    2093              
    2094              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2095                      .dwattr $C$DW$T$30, DW_AT_name("SDCMPL2_BITS")
    2096                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2097              $C$DW$100       .dwtag  DW_TAG_member
    2098                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    2099                      .dwattr $C$DW$100, DW_AT_name("LLT")
    2100                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_LLT")
    2101                      .dwattr $C$DW$100, DW_AT_bit_offset(0x01)
    2102                      .dwattr $C$DW$100, DW_AT_bit_size(0x0f)
    2103                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2104                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2105              
    2106              $C$DW$101       .dwtag  DW_TAG_member
    2107                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2108                      .dwattr $C$DW$101, DW_AT_name("rsvd1")
    2109                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd1")
    2110                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    2111                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    2112                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2114              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   44

    2115                      .dwendtag $C$DW$T$30
    2116              
    2117              
    2118              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2119                      .dwattr $C$DW$T$31, DW_AT_name("SDCMPL2_REG")
    2120                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2121              $C$DW$102       .dwtag  DW_TAG_member
    2122                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    2123                      .dwattr $C$DW$102, DW_AT_name("all")
    2124                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    2125                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2126                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2127              
    2128              $C$DW$103       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$30)
    2130                      .dwattr $C$DW$103, DW_AT_name("bit")
    2131                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    2132                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2133                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2134              
    2135                      .dwendtag $C$DW$T$31
    2136              
    2137              
    2138              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2139                      .dwattr $C$DW$T$32, DW_AT_name("SDCMPL3_BITS")
    2140                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2141              $C$DW$104       .dwtag  DW_TAG_member
    2142                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2143                      .dwattr $C$DW$104, DW_AT_name("LLT")
    2144                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_LLT")
    2145                      .dwattr $C$DW$104, DW_AT_bit_offset(0x01)
    2146                      .dwattr $C$DW$104, DW_AT_bit_size(0x0f)
    2147                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2148                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2149              
    2150              $C$DW$105       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2152                      .dwattr $C$DW$105, DW_AT_name("rsvd1")
    2153                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd1")
    2154                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    2155                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    2156                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2157                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2158              
    2159                      .dwendtag $C$DW$T$32
    2160              
    2161              
    2162              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2163                      .dwattr $C$DW$T$33, DW_AT_name("SDCMPL3_REG")
    2164                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2165              $C$DW$106       .dwtag  DW_TAG_member
    2166                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    2167                      .dwattr $C$DW$106, DW_AT_name("all")
    2168                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    2169                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   45

    2170                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2171              
    2172              $C$DW$107       .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$32)
    2174                      .dwattr $C$DW$107, DW_AT_name("bit")
    2175                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    2176                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2177                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2178              
    2179                      .dwendtag $C$DW$T$33
    2180              
    2181              
    2182              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2183                      .dwattr $C$DW$T$34, DW_AT_name("SDCMPL4_BITS")
    2184                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2185              $C$DW$108       .dwtag  DW_TAG_member
    2186                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2187                      .dwattr $C$DW$108, DW_AT_name("LLT")
    2188                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_LLT")
    2189                      .dwattr $C$DW$108, DW_AT_bit_offset(0x01)
    2190                      .dwattr $C$DW$108, DW_AT_bit_size(0x0f)
    2191                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2192                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2193              
    2194              $C$DW$109       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2196                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
    2197                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
    2198                      .dwattr $C$DW$109, DW_AT_bit_offset(0x00)
    2199                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    2200                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2201                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2202              
    2203                      .dwendtag $C$DW$T$34
    2204              
    2205              
    2206              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2207                      .dwattr $C$DW$T$35, DW_AT_name("SDCMPL4_REG")
    2208                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2209              $C$DW$110       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2211                      .dwattr $C$DW$110, DW_AT_name("all")
    2212                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_all")
    2213                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2214                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2215              
    2216              $C$DW$111       .dwtag  DW_TAG_member
    2217                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$34)
    2218                      .dwattr $C$DW$111, DW_AT_name("bit")
    2219                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_bit")
    2220                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2221                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2222              
    2223                      .dwendtag $C$DW$T$35
    2224              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   46

    2225              
    2226              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2227                      .dwattr $C$DW$T$36, DW_AT_name("SDCPARM1_BITS")
    2228                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2229              $C$DW$112       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2231                      .dwattr $C$DW$112, DW_AT_name("COSR")
    2232                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_COSR")
    2233                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0b)
    2234                      .dwattr $C$DW$112, DW_AT_bit_size(0x05)
    2235                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2236                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2237              
    2238              $C$DW$113       .dwtag  DW_TAG_member
    2239                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2240                      .dwattr $C$DW$113, DW_AT_name("IEH")
    2241                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_IEH")
    2242                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0a)
    2243                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    2244                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2245                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2246              
    2247              $C$DW$114       .dwtag  DW_TAG_member
    2248                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2249                      .dwattr $C$DW$114, DW_AT_name("IEL")
    2250                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_IEL")
    2251                      .dwattr $C$DW$114, DW_AT_bit_offset(0x09)
    2252                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    2253                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2254                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2255              
    2256              $C$DW$115       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2258                      .dwattr $C$DW$115, DW_AT_name("CS1_CS0")
    2259                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_CS1_CS0")
    2260                      .dwattr $C$DW$115, DW_AT_bit_offset(0x07)
    2261                      .dwattr $C$DW$115, DW_AT_bit_size(0x02)
    2262                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2263                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2264              
    2265              $C$DW$116       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2267                      .dwattr $C$DW$116, DW_AT_name("MFIE")
    2268                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_MFIE")
    2269                      .dwattr $C$DW$116, DW_AT_bit_offset(0x06)
    2270                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    2271                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2272                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2273              
    2274              $C$DW$117       .dwtag  DW_TAG_member
    2275                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2276                      .dwattr $C$DW$117, DW_AT_name("rsvd1")
    2277                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd1")
    2278                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    2279                      .dwattr $C$DW$117, DW_AT_bit_size(0x06)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   47

    2280                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2281                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2282              
    2283                      .dwendtag $C$DW$T$36
    2284              
    2285              
    2286              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2287                      .dwattr $C$DW$T$37, DW_AT_name("SDCPARM1_REG")
    2288                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2289              $C$DW$118       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2291                      .dwattr $C$DW$118, DW_AT_name("all")
    2292                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_all")
    2293                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2294                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2295              
    2296              $C$DW$119       .dwtag  DW_TAG_member
    2297                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$36)
    2298                      .dwattr $C$DW$119, DW_AT_name("bit")
    2299                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_bit")
    2300                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2301                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2302              
    2303                      .dwendtag $C$DW$T$37
    2304              
    2305              
    2306              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2307                      .dwattr $C$DW$T$38, DW_AT_name("SDCPARM2_BITS")
    2308                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2309              $C$DW$120       .dwtag  DW_TAG_member
    2310                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2311                      .dwattr $C$DW$120, DW_AT_name("COSR")
    2312                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_COSR")
    2313                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0b)
    2314                      .dwattr $C$DW$120, DW_AT_bit_size(0x05)
    2315                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2316                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2317              
    2318              $C$DW$121       .dwtag  DW_TAG_member
    2319                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2320                      .dwattr $C$DW$121, DW_AT_name("IEH")
    2321                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_IEH")
    2322                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0a)
    2323                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    2324                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2325                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2326              
    2327              $C$DW$122       .dwtag  DW_TAG_member
    2328                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2329                      .dwattr $C$DW$122, DW_AT_name("IEL")
    2330                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_IEL")
    2331                      .dwattr $C$DW$122, DW_AT_bit_offset(0x09)
    2332                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    2333                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2334                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   48

    2335              
    2336              $C$DW$123       .dwtag  DW_TAG_member
    2337                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2338                      .dwattr $C$DW$123, DW_AT_name("CS1_CS0")
    2339                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_CS1_CS0")
    2340                      .dwattr $C$DW$123, DW_AT_bit_offset(0x07)
    2341                      .dwattr $C$DW$123, DW_AT_bit_size(0x02)
    2342                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2343                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2344              
    2345              $C$DW$124       .dwtag  DW_TAG_member
    2346                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2347                      .dwattr $C$DW$124, DW_AT_name("MFIE")
    2348                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_MFIE")
    2349                      .dwattr $C$DW$124, DW_AT_bit_offset(0x06)
    2350                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    2351                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2352                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2353              
    2354              $C$DW$125       .dwtag  DW_TAG_member
    2355                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2356                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    2357                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
    2358                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00)
    2359                      .dwattr $C$DW$125, DW_AT_bit_size(0x06)
    2360                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2361                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2362              
    2363                      .dwendtag $C$DW$T$38
    2364              
    2365              
    2366              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2367                      .dwattr $C$DW$T$39, DW_AT_name("SDCPARM2_REG")
    2368                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2369              $C$DW$126       .dwtag  DW_TAG_member
    2370                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2371                      .dwattr $C$DW$126, DW_AT_name("all")
    2372                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_all")
    2373                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2374                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2375              
    2376              $C$DW$127       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$38)
    2378                      .dwattr $C$DW$127, DW_AT_name("bit")
    2379                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_bit")
    2380                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2381                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2382              
    2383                      .dwendtag $C$DW$T$39
    2384              
    2385              
    2386              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2387                      .dwattr $C$DW$T$40, DW_AT_name("SDCPARM3_BITS")
    2388                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2389              $C$DW$128       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   49

    2390                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2391                      .dwattr $C$DW$128, DW_AT_name("COSR")
    2392                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_COSR")
    2393                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0b)
    2394                      .dwattr $C$DW$128, DW_AT_bit_size(0x05)
    2395                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2396                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2397              
    2398              $C$DW$129       .dwtag  DW_TAG_member
    2399                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2400                      .dwattr $C$DW$129, DW_AT_name("IEH")
    2401                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_IEH")
    2402                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0a)
    2403                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    2404                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2405                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2406              
    2407              $C$DW$130       .dwtag  DW_TAG_member
    2408                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2409                      .dwattr $C$DW$130, DW_AT_name("IEL")
    2410                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_IEL")
    2411                      .dwattr $C$DW$130, DW_AT_bit_offset(0x09)
    2412                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2413                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2414                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2415              
    2416              $C$DW$131       .dwtag  DW_TAG_member
    2417                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2418                      .dwattr $C$DW$131, DW_AT_name("CS1_CS0")
    2419                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_CS1_CS0")
    2420                      .dwattr $C$DW$131, DW_AT_bit_offset(0x07)
    2421                      .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    2422                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2423                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2424              
    2425              $C$DW$132       .dwtag  DW_TAG_member
    2426                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2427                      .dwattr $C$DW$132, DW_AT_name("MFIE")
    2428                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_MFIE")
    2429                      .dwattr $C$DW$132, DW_AT_bit_offset(0x06)
    2430                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2431                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2432                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2433              
    2434              $C$DW$133       .dwtag  DW_TAG_member
    2435                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2436                      .dwattr $C$DW$133, DW_AT_name("rsvd1")
    2437                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd1")
    2438                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00)
    2439                      .dwattr $C$DW$133, DW_AT_bit_size(0x06)
    2440                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2441                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2442              
    2443                      .dwendtag $C$DW$T$40
    2444              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   50

    2445              
    2446              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2447                      .dwattr $C$DW$T$41, DW_AT_name("SDCPARM3_REG")
    2448                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2449              $C$DW$134       .dwtag  DW_TAG_member
    2450                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2451                      .dwattr $C$DW$134, DW_AT_name("all")
    2452                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_all")
    2453                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2454                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2455              
    2456              $C$DW$135       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$40)
    2458                      .dwattr $C$DW$135, DW_AT_name("bit")
    2459                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_bit")
    2460                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2461                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2462              
    2463                      .dwendtag $C$DW$T$41
    2464              
    2465              
    2466              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2467                      .dwattr $C$DW$T$42, DW_AT_name("SDCPARM4_BITS")
    2468                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2469              $C$DW$136       .dwtag  DW_TAG_member
    2470                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2471                      .dwattr $C$DW$136, DW_AT_name("COSR")
    2472                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_COSR")
    2473                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0b)
    2474                      .dwattr $C$DW$136, DW_AT_bit_size(0x05)
    2475                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2476                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2477              
    2478              $C$DW$137       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2480                      .dwattr $C$DW$137, DW_AT_name("IEH")
    2481                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_IEH")
    2482                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0a)
    2483                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2484                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2485                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2486              
    2487              $C$DW$138       .dwtag  DW_TAG_member
    2488                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2489                      .dwattr $C$DW$138, DW_AT_name("IEL")
    2490                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_IEL")
    2491                      .dwattr $C$DW$138, DW_AT_bit_offset(0x09)
    2492                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2493                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2494                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2495              
    2496              $C$DW$139       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2498                      .dwattr $C$DW$139, DW_AT_name("CS1_CS0")
    2499                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_CS1_CS0")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   51

    2500                      .dwattr $C$DW$139, DW_AT_bit_offset(0x07)
    2501                      .dwattr $C$DW$139, DW_AT_bit_size(0x02)
    2502                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2503                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2504              
    2505              $C$DW$140       .dwtag  DW_TAG_member
    2506                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2507                      .dwattr $C$DW$140, DW_AT_name("MFIE")
    2508                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_MFIE")
    2509                      .dwattr $C$DW$140, DW_AT_bit_offset(0x06)
    2510                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2511                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2512                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2513              
    2514              $C$DW$141       .dwtag  DW_TAG_member
    2515                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2516                      .dwattr $C$DW$141, DW_AT_name("rsvd1")
    2517                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd1")
    2518                      .dwattr $C$DW$141, DW_AT_bit_offset(0x00)
    2519                      .dwattr $C$DW$141, DW_AT_bit_size(0x06)
    2520                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2521                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2522              
    2523                      .dwendtag $C$DW$T$42
    2524              
    2525              
    2526              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2527                      .dwattr $C$DW$T$43, DW_AT_name("SDCPARM4_REG")
    2528                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2529              $C$DW$142       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2531                      .dwattr $C$DW$142, DW_AT_name("all")
    2532                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_all")
    2533                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2534                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2535              
    2536              $C$DW$143       .dwtag  DW_TAG_member
    2537                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$42)
    2538                      .dwattr $C$DW$143, DW_AT_name("bit")
    2539                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_bit")
    2540                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2541                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2542              
    2543                      .dwendtag $C$DW$T$43
    2544              
    2545              
    2546              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2547                      .dwattr $C$DW$T$44, DW_AT_name("SDCTLPARM1_BITS")
    2548                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2549              $C$DW$144       .dwtag  DW_TAG_member
    2550                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2551                      .dwattr $C$DW$144, DW_AT_name("MOD")
    2552                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_MOD")
    2553                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0e)
    2554                      .dwattr $C$DW$144, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   52

    2555                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2556                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2557              
    2558              $C$DW$145       .dwtag  DW_TAG_member
    2559                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2560                      .dwattr $C$DW$145, DW_AT_name("rsvd1")
    2561                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd1")
    2562                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0d)
    2563                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2564                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2565                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2566              
    2567              $C$DW$146       .dwtag  DW_TAG_member
    2568                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2569                      .dwattr $C$DW$146, DW_AT_name("rsvd2")
    2570                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd2")
    2571                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0c)
    2572                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2573                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2574                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2575              
    2576              $C$DW$147       .dwtag  DW_TAG_member
    2577                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2578                      .dwattr $C$DW$147, DW_AT_name("rsvd3")
    2579                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd3")
    2580                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0b)
    2581                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2582                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2583                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2584              
    2585              $C$DW$148       .dwtag  DW_TAG_member
    2586                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2587                      .dwattr $C$DW$148, DW_AT_name("rsvd4")
    2588                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd4")
    2589                      .dwattr $C$DW$148, DW_AT_bit_offset(0x00)
    2590                      .dwattr $C$DW$148, DW_AT_bit_size(0x0b)
    2591                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2592                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2593              
    2594                      .dwendtag $C$DW$T$44
    2595              
    2596              
    2597              $C$DW$T$45      .dwtag  DW_TAG_union_type
    2598                      .dwattr $C$DW$T$45, DW_AT_name("SDCTLPARM1_REG")
    2599                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2600              $C$DW$149       .dwtag  DW_TAG_member
    2601                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2602                      .dwattr $C$DW$149, DW_AT_name("all")
    2603                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_all")
    2604                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2605                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2606              
    2607              $C$DW$150       .dwtag  DW_TAG_member
    2608                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$44)
    2609                      .dwattr $C$DW$150, DW_AT_name("bit")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   53

    2610                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_bit")
    2611                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2612                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2613              
    2614                      .dwendtag $C$DW$T$45
    2615              
    2616              
    2617              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2618                      .dwattr $C$DW$T$46, DW_AT_name("SDCTLPARM2_BITS")
    2619                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    2620              $C$DW$151       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2622                      .dwattr $C$DW$151, DW_AT_name("MOD")
    2623                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_MOD")
    2624                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0e)
    2625                      .dwattr $C$DW$151, DW_AT_bit_size(0x02)
    2626                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2627                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2628              
    2629              $C$DW$152       .dwtag  DW_TAG_member
    2630                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2631                      .dwattr $C$DW$152, DW_AT_name("rsvd1")
    2632                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd1")
    2633                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0d)
    2634                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2635                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2636                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2637              
    2638              $C$DW$153       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2640                      .dwattr $C$DW$153, DW_AT_name("rsvd2")
    2641                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd2")
    2642                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0c)
    2643                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2644                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2645                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2646              
    2647              $C$DW$154       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2649                      .dwattr $C$DW$154, DW_AT_name("rsvd3")
    2650                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd3")
    2651                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0b)
    2652                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2653                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2654                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2655              
    2656              $C$DW$155       .dwtag  DW_TAG_member
    2657                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2658                      .dwattr $C$DW$155, DW_AT_name("MS")
    2659                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_MS")
    2660                      .dwattr $C$DW$155, DW_AT_bit_offset(0x00)
    2661                      .dwattr $C$DW$155, DW_AT_bit_size(0x0b)
    2662                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2663                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2664              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   54

    2665                      .dwendtag $C$DW$T$46
    2666              
    2667              
    2668              $C$DW$T$47      .dwtag  DW_TAG_union_type
    2669                      .dwattr $C$DW$T$47, DW_AT_name("SDCTLPARM2_REG")
    2670                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    2671              $C$DW$156       .dwtag  DW_TAG_member
    2672                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2673                      .dwattr $C$DW$156, DW_AT_name("all")
    2674                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_all")
    2675                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2676                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2677              
    2678              $C$DW$157       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$46)
    2680                      .dwattr $C$DW$157, DW_AT_name("bit")
    2681                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_bit")
    2682                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2683                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2684              
    2685                      .dwendtag $C$DW$T$47
    2686              
    2687              
    2688              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2689                      .dwattr $C$DW$T$48, DW_AT_name("SDCTLPARM3_BITS")
    2690                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2691              $C$DW$158       .dwtag  DW_TAG_member
    2692                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2693                      .dwattr $C$DW$158, DW_AT_name("MOD")
    2694                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_MOD")
    2695                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0e)
    2696                      .dwattr $C$DW$158, DW_AT_bit_size(0x02)
    2697                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2698                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2699              
    2700              $C$DW$159       .dwtag  DW_TAG_member
    2701                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2702                      .dwattr $C$DW$159, DW_AT_name("rsvd1")
    2703                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd1")
    2704                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0d)
    2705                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2706                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2707                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2708              
    2709              $C$DW$160       .dwtag  DW_TAG_member
    2710                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2711                      .dwattr $C$DW$160, DW_AT_name("rsvd2")
    2712                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd2")
    2713                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0c)
    2714                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2715                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2716                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2717              
    2718              $C$DW$161       .dwtag  DW_TAG_member
    2719                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   55

    2720                      .dwattr $C$DW$161, DW_AT_name("rsvd3")
    2721                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rsvd3")
    2722                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0b)
    2723                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2724                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2725                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2726              
    2727              $C$DW$162       .dwtag  DW_TAG_member
    2728                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2729                      .dwattr $C$DW$162, DW_AT_name("MS")
    2730                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_MS")
    2731                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00)
    2732                      .dwattr $C$DW$162, DW_AT_bit_size(0x0b)
    2733                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2734                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2735              
    2736                      .dwendtag $C$DW$T$48
    2737              
    2738              
    2739              $C$DW$T$49      .dwtag  DW_TAG_union_type
    2740                      .dwattr $C$DW$T$49, DW_AT_name("SDCTLPARM3_REG")
    2741                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    2742              $C$DW$163       .dwtag  DW_TAG_member
    2743                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2744                      .dwattr $C$DW$163, DW_AT_name("all")
    2745                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_all")
    2746                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2747                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2748              
    2749              $C$DW$164       .dwtag  DW_TAG_member
    2750                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$48)
    2751                      .dwattr $C$DW$164, DW_AT_name("bit")
    2752                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_bit")
    2753                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2754                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2755              
    2756                      .dwendtag $C$DW$T$49
    2757              
    2758              
    2759              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2760                      .dwattr $C$DW$T$50, DW_AT_name("SDCTLPARM4_BITS")
    2761                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    2762              $C$DW$165       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2764                      .dwattr $C$DW$165, DW_AT_name("MOD")
    2765                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_MOD")
    2766                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0e)
    2767                      .dwattr $C$DW$165, DW_AT_bit_size(0x02)
    2768                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2769                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2770              
    2771              $C$DW$166       .dwtag  DW_TAG_member
    2772                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2773                      .dwattr $C$DW$166, DW_AT_name("rsvd1")
    2774                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   56

    2775                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0d)
    2776                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2777                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2778                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2779              
    2780              $C$DW$167       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2782                      .dwattr $C$DW$167, DW_AT_name("rsvd2")
    2783                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd2")
    2784                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0c)
    2785                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2786                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2787                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2788              
    2789              $C$DW$168       .dwtag  DW_TAG_member
    2790                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2791                      .dwattr $C$DW$168, DW_AT_name("rsvd3")
    2792                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd3")
    2793                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0b)
    2794                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2795                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2796                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2797              
    2798              $C$DW$169       .dwtag  DW_TAG_member
    2799                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2800                      .dwattr $C$DW$169, DW_AT_name("MS")
    2801                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_MS")
    2802                      .dwattr $C$DW$169, DW_AT_bit_offset(0x00)
    2803                      .dwattr $C$DW$169, DW_AT_bit_size(0x0b)
    2804                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2805                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2806              
    2807                      .dwendtag $C$DW$T$50
    2808              
    2809              
    2810              $C$DW$T$51      .dwtag  DW_TAG_union_type
    2811                      .dwattr $C$DW$T$51, DW_AT_name("SDCTLPARM4_REG")
    2812                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    2813              $C$DW$170       .dwtag  DW_TAG_member
    2814                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2815                      .dwattr $C$DW$170, DW_AT_name("all")
    2816                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_all")
    2817                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2818                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2819              
    2820              $C$DW$171       .dwtag  DW_TAG_member
    2821                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$50)
    2822                      .dwattr $C$DW$171, DW_AT_name("bit")
    2823                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_bit")
    2824                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2825                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2826              
    2827                      .dwendtag $C$DW$T$51
    2828              
    2829              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   57

    2830              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2831                      .dwattr $C$DW$T$52, DW_AT_name("SDCTL_BITS")
    2832                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    2833              $C$DW$172       .dwtag  DW_TAG_member
    2834                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2835                      .dwattr $C$DW$172, DW_AT_name("rsvd1")
    2836                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd1")
    2837                      .dwattr $C$DW$172, DW_AT_bit_offset(0x03)
    2838                      .dwattr $C$DW$172, DW_AT_bit_size(0x0d)
    2839                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2840                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2841              
    2842              $C$DW$173       .dwtag  DW_TAG_member
    2843                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2844                      .dwattr $C$DW$173, DW_AT_name("MIE")
    2845                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_MIE")
    2846                      .dwattr $C$DW$173, DW_AT_bit_offset(0x02)
    2847                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2848                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2849                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2850              
    2851              $C$DW$174       .dwtag  DW_TAG_member
    2852                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2853                      .dwattr $C$DW$174, DW_AT_name("rsvd2")
    2854                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd2")
    2855                      .dwattr $C$DW$174, DW_AT_bit_offset(0x01)
    2856                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2857                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2858                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2859              
    2860              $C$DW$175       .dwtag  DW_TAG_member
    2861                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2862                      .dwattr $C$DW$175, DW_AT_name("rsvd3")
    2863                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd3")
    2864                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    2865                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2866                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2867                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2868              
    2869                      .dwendtag $C$DW$T$52
    2870              
    2871              
    2872              $C$DW$T$53      .dwtag  DW_TAG_union_type
    2873                      .dwattr $C$DW$T$53, DW_AT_name("SDCTL_REG")
    2874                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    2875              $C$DW$176       .dwtag  DW_TAG_member
    2876                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2877                      .dwattr $C$DW$176, DW_AT_name("all")
    2878                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_all")
    2879                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2880                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2881              
    2882              $C$DW$177       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$52)
    2884                      .dwattr $C$DW$177, DW_AT_name("bit")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   58

    2885                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_bit")
    2886                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2887                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2888              
    2889                      .dwendtag $C$DW$T$53
    2890              
    2891              
    2892              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    2893                      .dwattr $C$DW$T$54, DW_AT_name("SDDATA1_BITS")
    2894                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    2895              $C$DW$178       .dwtag  DW_TAG_member
    2896                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2897                      .dwattr $C$DW$178, DW_AT_name("DATA16")
    2898                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_DATA16")
    2899                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00)
    2900                      .dwattr $C$DW$178, DW_AT_bit_size(0x10)
    2901                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2902                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2903              
    2904              $C$DW$179       .dwtag  DW_TAG_member
    2905                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2906                      .dwattr $C$DW$179, DW_AT_name("DATA32HI")
    2907                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_DATA32HI")
    2908                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00)
    2909                      .dwattr $C$DW$179, DW_AT_bit_size(0x10)
    2910                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2911                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2912              
    2913                      .dwendtag $C$DW$T$54
    2914              
    2915              
    2916              $C$DW$T$56      .dwtag  DW_TAG_union_type
    2917                      .dwattr $C$DW$T$56, DW_AT_name("SDDATA1_REG")
    2918                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x02)
    2919              $C$DW$180       .dwtag  DW_TAG_member
    2920                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$55)
    2921                      .dwattr $C$DW$180, DW_AT_name("all")
    2922                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_all")
    2923                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2924                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2925              
    2926              $C$DW$181       .dwtag  DW_TAG_member
    2927                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$54)
    2928                      .dwattr $C$DW$181, DW_AT_name("bit")
    2929                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_bit")
    2930                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2931                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2932              
    2933                      .dwendtag $C$DW$T$56
    2934              
    2935              
    2936              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2937                      .dwattr $C$DW$T$57, DW_AT_name("SDDATA2_BITS")
    2938                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x02)
    2939              $C$DW$182       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   59

    2940                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2941                      .dwattr $C$DW$182, DW_AT_name("DATA16")
    2942                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_DATA16")
    2943                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    2944                      .dwattr $C$DW$182, DW_AT_bit_size(0x10)
    2945                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2946                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2947              
    2948              $C$DW$183       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2950                      .dwattr $C$DW$183, DW_AT_name("DATA32HI")
    2951                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_DATA32HI")
    2952                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00)
    2953                      .dwattr $C$DW$183, DW_AT_bit_size(0x10)
    2954                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2955                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2956              
    2957                      .dwendtag $C$DW$T$57
    2958              
    2959              
    2960              $C$DW$T$58      .dwtag  DW_TAG_union_type
    2961                      .dwattr $C$DW$T$58, DW_AT_name("SDDATA2_REG")
    2962                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x02)
    2963              $C$DW$184       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$55)
    2965                      .dwattr $C$DW$184, DW_AT_name("all")
    2966                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_all")
    2967                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2968                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2969              
    2970              $C$DW$185       .dwtag  DW_TAG_member
    2971                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$57)
    2972                      .dwattr $C$DW$185, DW_AT_name("bit")
    2973                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_bit")
    2974                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2975                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2976              
    2977                      .dwendtag $C$DW$T$58
    2978              
    2979              
    2980              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    2981                      .dwattr $C$DW$T$59, DW_AT_name("SDDATA3_BITS")
    2982                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    2983              $C$DW$186       .dwtag  DW_TAG_member
    2984                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2985                      .dwattr $C$DW$186, DW_AT_name("DATA16")
    2986                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_DATA16")
    2987                      .dwattr $C$DW$186, DW_AT_bit_offset(0x00)
    2988                      .dwattr $C$DW$186, DW_AT_bit_size(0x10)
    2989                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2990                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2991              
    2992              $C$DW$187       .dwtag  DW_TAG_member
    2993                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2994                      .dwattr $C$DW$187, DW_AT_name("DATA32HI")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   60

    2995                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_DATA32HI")
    2996                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    2997                      .dwattr $C$DW$187, DW_AT_bit_size(0x10)
    2998                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2999                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3000              
    3001                      .dwendtag $C$DW$T$59
    3002              
    3003              
    3004              $C$DW$T$60      .dwtag  DW_TAG_union_type
    3005                      .dwattr $C$DW$T$60, DW_AT_name("SDDATA3_REG")
    3006                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
    3007              $C$DW$188       .dwtag  DW_TAG_member
    3008                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$55)
    3009                      .dwattr $C$DW$188, DW_AT_name("all")
    3010                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_all")
    3011                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3012                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3013              
    3014              $C$DW$189       .dwtag  DW_TAG_member
    3015                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$59)
    3016                      .dwattr $C$DW$189, DW_AT_name("bit")
    3017                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_bit")
    3018                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3019                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3020              
    3021                      .dwendtag $C$DW$T$60
    3022              
    3023              
    3024              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3025                      .dwattr $C$DW$T$61, DW_AT_name("SDDATA4_BITS")
    3026                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x02)
    3027              $C$DW$190       .dwtag  DW_TAG_member
    3028                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    3029                      .dwattr $C$DW$190, DW_AT_name("DATA16")
    3030                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_DATA16")
    3031                      .dwattr $C$DW$190, DW_AT_bit_offset(0x00)
    3032                      .dwattr $C$DW$190, DW_AT_bit_size(0x10)
    3033                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3034                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3035              
    3036              $C$DW$191       .dwtag  DW_TAG_member
    3037                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3038                      .dwattr $C$DW$191, DW_AT_name("DATA32HI")
    3039                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_DATA32HI")
    3040                      .dwattr $C$DW$191, DW_AT_bit_offset(0x00)
    3041                      .dwattr $C$DW$191, DW_AT_bit_size(0x10)
    3042                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3043                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3044              
    3045                      .dwendtag $C$DW$T$61
    3046              
    3047              
    3048              $C$DW$T$62      .dwtag  DW_TAG_union_type
    3049                      .dwattr $C$DW$T$62, DW_AT_name("SDDATA4_REG")
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   61

    3050                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x02)
    3051              $C$DW$192       .dwtag  DW_TAG_member
    3052                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$55)
    3053                      .dwattr $C$DW$192, DW_AT_name("all")
    3054                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_all")
    3055                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3056                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3057              
    3058              $C$DW$193       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$61)
    3060                      .dwattr $C$DW$193, DW_AT_name("bit")
    3061                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_bit")
    3062                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3063                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3064              
    3065                      .dwendtag $C$DW$T$62
    3066              
    3067              
    3068              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3069                      .dwattr $C$DW$T$63, DW_AT_name("SDDFPARM1_BITS")
    3070                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
    3071              $C$DW$194       .dwtag  DW_TAG_member
    3072                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    3073                      .dwattr $C$DW$194, DW_AT_name("DOSR")
    3074                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_DOSR")
    3075                      .dwattr $C$DW$194, DW_AT_bit_offset(0x08)
    3076                      .dwattr $C$DW$194, DW_AT_bit_size(0x08)
    3077                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3078                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3079              
    3080              $C$DW$195       .dwtag  DW_TAG_member
    3081                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    3082                      .dwattr $C$DW$195, DW_AT_name("FEN")
    3083                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_FEN")
    3084                      .dwattr $C$DW$195, DW_AT_bit_offset(0x07)
    3085                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    3086                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3087                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3088              
    3089              $C$DW$196       .dwtag  DW_TAG_member
    3090                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    3091                      .dwattr $C$DW$196, DW_AT_name("AE")
    3092                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_AE")
    3093                      .dwattr $C$DW$196, DW_AT_bit_offset(0x06)
    3094                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    3095                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3096                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3097              
    3098              $C$DW$197       .dwtag  DW_TAG_member
    3099                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    3100                      .dwattr $C$DW$197, DW_AT_name("SST")
    3101                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_SST")
    3102                      .dwattr $C$DW$197, DW_AT_bit_offset(0x04)
    3103                      .dwattr $C$DW$197, DW_AT_bit_size(0x02)
    3104                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   62

    3105                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3106              
    3107              $C$DW$198       .dwtag  DW_TAG_member
    3108                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    3109                      .dwattr $C$DW$198, DW_AT_name("FILRESEN")
    3110                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_FILRESEN")
    3111                      .dwattr $C$DW$198, DW_AT_bit_offset(0x03)
    3112                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    3113                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3114                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3115              
    3116              $C$DW$199       .dwtag  DW_TAG_member
    3117                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3118                      .dwattr $C$DW$199, DW_AT_name("rsvd1")
    3119                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_rsvd1")
    3120                      .dwattr $C$DW$199, DW_AT_bit_offset(0x00)
    3121                      .dwattr $C$DW$199, DW_AT_bit_size(0x03)
    3122                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3123                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3124              
    3125                      .dwendtag $C$DW$T$63
    3126              
    3127              
    3128              $C$DW$T$64      .dwtag  DW_TAG_union_type
    3129                      .dwattr $C$DW$T$64, DW_AT_name("SDDFPARM1_REG")
    3130                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    3131              $C$DW$200       .dwtag  DW_TAG_member
    3132                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    3133                      .dwattr $C$DW$200, DW_AT_name("all")
    3134                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_all")
    3135                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3136                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3137              
    3138              $C$DW$201       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$63)
    3140                      .dwattr $C$DW$201, DW_AT_name("bit")
    3141                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_bit")
    3142                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3143                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3144              
    3145                      .dwendtag $C$DW$T$64
    3146              
    3147              
    3148              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3149                      .dwattr $C$DW$T$65, DW_AT_name("SDDFPARM2_BITS")
    3150                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
    3151              $C$DW$202       .dwtag  DW_TAG_member
    3152                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    3153                      .dwattr $C$DW$202, DW_AT_name("DOSR")
    3154                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_DOSR")
    3155                      .dwattr $C$DW$202, DW_AT_bit_offset(0x08)
    3156                      .dwattr $C$DW$202, DW_AT_bit_size(0x08)
    3157                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3158                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3159              
TMS320C2000 Assembler PC v18.12.4 Sat Jul 18 15:28:09 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   63

    3160              $C$DW$203       .dwtag  DW_TAG_member
    3161                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    3162                      .dwattr $C$DW$203, DW_AT_name("FEN")
    3163                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_FEN")
    3164                      .dwattr $C$DW$203, DW_AT_bit_offset(0x07)
    3165                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    3166                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3167                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3168              
    3169              $C$DW$204       .dwtag  DW_TAG_member
    3170                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3171                      .dwattr $C$DW$204, DW_AT_name("AE")
    3172                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_AE")
    3173                      .dwattr $C$DW$204, DW_AT_bit_offset(0x06)
    3174                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    3175                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3176                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3177              
    3178              $C$DW$205       .dwtag  DW_TAG_member
    3179                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3180                      .dwattr $C$DW$205, DW_AT_name("SST")
    3181                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_SST")
    3182                      .dwattr $C$DW$205, DW_AT_bit_offset(0x04)
    3183                      .dwattr $C$DW$205, DW_AT_bit_size(0x02)
    3184                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3185                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3186              
    3187              $C$DW$206       .dwtag  DW_TAG_member
    3188                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3189                      .dwattr $C$DW$206, DW_AT_name("FILRESEN")
    3190                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_FILRESEN")
    3191                      .dwattr $C$DW$206, DW_AT_bit_offset(0x03)
    3192                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    3193                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3194                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3195              
    3196              $C$DW$207       .dwtag  DW_TAG_member
    3197                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3198                      .dwattr $C$DW$207, DW_AT_name("rsvd1")
    3199                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd1")
    3200                      .dwattr $C$DW$207, DW_AT_bit_offset(0x00)
    3201                      .dwattr $C$DW$207, DW_AT_bit_size(0x03)
    3202                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3203                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3204              
    3205                      .dwendtag $C$DW$T$65
    3206              
    3207              
