;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
;* Date/Time created: Sat Jul 18 15:32:26 2020                 *
;***************************************************************
	.compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --quiet --silicon_errata_fpu1_workaround=off --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 --tmu_support=tmu0 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../IDDK_PM_Servo_F2837x.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Desktop\servodrive_TMIDDK\IDDK_PM_Servo_F2837x-v2\F2837x_RAM")
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_HLT+0,32
	.bits		0x7fff,16
			; _HLT @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_LLT+0,32
	.bits		0,16
			; _LLT @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_clkPrescale+0,32
	.bits		0x14,16
			; _clkPrescale @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16

        MOVL      XAR7,@_clarke1        ; [CPU_ALU] |2073| 
	.dwpsn	file "../IDDK_PM_Servo_F2837x.c",line 2074,column 2,is_stmt,isa 0
        MOVL      XAR6,@_clarke1+2      ; [CPU_ALU] |2074| 
	.dwpsn	file "../IDDK_PM_Servo_F2837x.c",line 2072,column 2,is_stmt,isa 0
        MOV32     @_DlogCh2,R6H         ; [CPU_FPU] |2072| 
	.dwpsn	file "../IDDK_PM_Servo_F2837x.c",line 2071,column 2,is_stmt,isa 0
        MOVL      @_DlogCh1,P           ; [CPU_ALU] |2071| 
	.dwpsn	file "../IDDK_PM_Servo_F2837x.c",line 2073,column 2,is_stmt,isa 0
        MOVL      @_DlogCh3,XAR7        ; [CPU_ALU] |2073| 
	.dwpsn	file "../IDDK_PM_Servo_F2837x.c",line 2074,column 2,is_stmt,isa 0
        MOVL      @_DlogCh4,XAR6        ; [CPU_ALU] |2074| 
        MOVW      DP,#_DaccRegs+3       ; [CPU_ARAU] 
	.dwpsn	file "../IDDK_PM_Servo_F2837x.c",line 2080,column 3,is_stmt,isa 0
        MOV       @_DaccRegs+3,AH       ; [CPU_ALU] |2080| 
	.dwpsn	file "../IDDK_PM_Servo_F2837x.c",line 2273,column 2,is_stmt,isa 0
$C$DW$348	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$348, DW_AT_low_pc(0x00)
	.dwattr $C$DW$348, DW_AT_name("_DLOG_4CH_F_FUNC")
	.dwattr $C$DW$348, DW_AT_TI_call

        LCR       #_DLOG_4CH_F_FUNC     ; [CPU_ALU] |2273| 
        ; call occurs [#_DLOG_4CH_F_FUNC] ; [] |2273| 
        MOVW      DP,#_EPwm11Regs+170   ; [CPU_ARAU] 
	.dwpsn	file "../IDDK_PM_Servo_F2837x.c",line 2275,column 5,is_stmt,isa 0
        OR        @_EPwm11Regs+170,#0x0001 ; [CPU_ALU] |2275| 
        MOVW      DP,#_PieCtrlRegs+1    ; [CPU_ARAU] 
	.dwpsn	file "../IDDK_PM_Servo_F2837x.c",line 2276,column 5,is_stmt,isa 0
        MOVB      @_PieCtrlRegs+1,#4,UNC ; [CPU_ALU] |2276| 
        SUBB      SP,#8                 ; [CPU_ARAU] 
	.dwcfi	cfa_offset, -34
        MOV32     R7H,*--SP             ; [CPU_FPU] 
	.dwcfi	cfa_offset, -32
	.dwcfi	restore_reg, 71
        MOV32     R6H,*--SP             ; [CPU_FPU] 
	.dwcfi	cfa_offset, -30
	.dwcfi	restore_reg, 67
        MOV32     R5H,*--SP             ; [CPU_FPU] 
	.dwcfi	cfa_offset, -28
	.dwcfi	restore_reg, 63
        MOV32     R4H,*--SP             ; [CPU_FPU] 
	.dwcfi	cfa_offset, -26
	.dwcfi	restore_reg, 59
        MOV32     R3H,*--SP             ; [CPU_FPU] 
	.dwcfi	cfa_offset, -24
	.dwcfi	restore_reg, 55
        MOV32     R2H,*--SP             ; [CPU_FPU] 
	.dwcfi	cfa_offset, -22
	.dwcfi	restore_reg, 51
        MOV32     R1H,*--SP             ; [CPU_FPU] 
	.dwcfi	cfa_offset, -20
	.dwcfi	restore_reg, 47
        MOV32     R0H,*--SP             ; [CPU_FPU] 
	.dwcfi	cfa_offset, -18
	.dwcfi	restore_reg, 43
        MOV32     STF,*--SP             ; [CPU_FPU] 
	.dwcfi	cfa_offset, -16
	.dwcfi	restore_reg, 40
        MOVL      XAR7,*--SP            ; [CPU_ALU] 
	.dwcfi	cfa_offset, -14
	.dwcfi	restore_reg, 18
        MOVL      XAR6,*--SP            ; [CPU_ALU] 
	.dwcfi	cfa_offset, -12
	.dwcfi	restore_reg, 16
        MOVL      XAR5,*--SP            ; [CPU_ALU] 
	.dwcfi	cfa_offset, -10
	.dwcfi	restore_reg, 14
        MOVL      XAR4,*--SP            ; [CPU_ALU] 
	.dwcfi	cfa_offset, -8
	.dwcfi	restore_reg, 12
        MOVL      XT,*--SP              ; [CPU_ALU] 
	.dwcfi	cfa_offset, -6
	.dwcfi	restore_reg, 22
	.dwcfi	restore_reg, 21
        POP       AR1H:AR0H             ; [CPU_ALU] 
	.dwcfi	cfa_offset, -4
	.dwcfi	restore_reg, 5
	.dwcfi	restore_reg, 7
        SETC      INTM, DBGM            ; [CPU_ALU] 
        POP       RB                    ; [CPU_FPU] 
	.dwcfi	cfa_offset, -2
	.dwcfi	restore_reg, 74
        NASP      ; [CPU_ALU] 
$C$DW$349	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$349, DW_AT_low_pc(0x00)
	.dwattr $C$DW$349, DW_AT_TI_return

        IRET      ; [CPU_ALU] 
        ; return occurs ; [] 
	.dwattr $C$DW$344, DW_AT_TI_end_file("../IDDK_PM_Servo_F2837x.c")
	.dwattr $C$DW$344, DW_AT_TI_end_line(0x8e6)
	.dwattr $C$DW$344, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$344

;**************************************************************
;* UNDEFINED EXTERNAL REFERENCES                              *
;**************************************************************
	.global	_InitSysCtrl
	.global	_InitPieCtrl
	.global	_InitPieVectTable
	.global	_InitEPwm1Gpio
	.global	_InitEPwm2Gpio
	.global	_InitEPwm3Gpio
	.global	_InitEPwm4Gpio
	.global	_InitEPwm5Gpio
	.global	_DLOG_4CH_F_init
	.global	_GPIO_SetupPinOptions
	.global	_GPIO_SetupPinMux
	.global	_Sdfm_configureInputCtrl
	.global	_Sdfm_configureComparator
	.global	_Sdfm_configureData_filter
	.global	_Sdfm_configureExternalreset
	.global	_Sdfm_enableMFE
	.global	_baseParamsInit
	.global	_derivParamsCal
	.global	_init_resolver_Float
	.global	_ResolverISR
	.global	_F28x_usDelay
	.global	_DLOG_4CH_F_FUNC
	.global	_floor
	.global	_SyncSocRegs
	.global	_CpuTimer0Regs
	.global	_CpuTimer1Regs
	.global	_CpuTimer2Regs
	.global	_DacaRegs
	.global	_DacbRegs
	.global	_DaccRegs
	.global	_AdcaResultRegs
	.global	_AdcbResultRegs
	.global	_AdccResultRegs
	.global	_AdcdResultRegs
	.global	_PieCtrlRegs
	.global	_Cmpss1Regs
	.global	_Cmpss2Regs
	.global	_Cmpss3Regs
	.global	_Cmpss6Regs
	.global	_InputXbarRegs
	.global	_EQep1Regs
	.global	_EQep2Regs
	.global	_GpioDataRegs
	.global	_EPwmXbarRegs
	.global	_AdcaRegs
	.global	_AdcbRegs
	.global	_AdccRegs
	.global	_AdcdRegs
	.global	_Sdfm1Regs
	.global	_Sdfm2Regs
	.global	_CpuSysRegs
	.global	_EPwm1Regs
	.global	_EPwm2Regs
	.global	_EPwm3Regs
	.global	_EPwm4Regs
	.global	_EPwm5Regs
	.global	_EPwm6Regs
	.global	_EPwm7Regs
	.global	_EPwm8Regs
	.global	_EPwm9Regs
	.global	_EPwm10Regs
	.global	_EPwm11Regs
	.global	_EPwm12Regs
	.global	_GpioCtrlRegs
	.global	_PieVectTable

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x1a)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$350, DW_AT_name("input_ptr1")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("_input_ptr1")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$351, DW_AT_name("input_ptr2")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("_input_ptr2")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$352, DW_AT_name("input_ptr3")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("_input_ptr3")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$353, DW_AT_name("input_ptr4")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_input_ptr4")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$354, DW_AT_name("output_ptr1")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("_output_ptr1")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$355, DW_AT_name("output_ptr2")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("_output_ptr2")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$356, DW_AT_name("output_ptr3")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("_output_ptr3")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$357, DW_AT_name("output_ptr4")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("_output_ptr4")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$358, DW_AT_name("prev_value")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("_prev_value")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$359, DW_AT_name("trig_value")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("_trig_value")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$360, DW_AT_name("status")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("_status")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$361, DW_AT_name("pre_scalar")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("_pre_scalar")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$362, DW_AT_name("skip_count")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("_skip_count")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$363, DW_AT_name("size")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_size")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$364, DW_AT_name("count")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("_count")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$22

$C$DW$T$875	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$875, DW_AT_name("DLOG_4CH_F")
	.dwattr $C$DW$T$875, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$875, DW_AT_language(DW_LANG_C)

$C$DW$T$876	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$876, DW_AT_type(*$C$DW$T$875)
	.dwattr $C$DW$T$876, DW_AT_address_class(0x20)


$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$365, DW_AT_name("As")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("_As")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$366, DW_AT_name("Bs")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_Bs")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$367, DW_AT_name("Cs")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("_Cs")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$23

$C$DW$T$878	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$878, DW_AT_name("CURRENT_SENSOR")
	.dwattr $C$DW$T$878, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$878, DW_AT_language(DW_LANG_C)


$C$DW$T$879	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$879, DW_AT_type(*$C$DW$T$878)
	.dwattr $C$DW$T$879, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$879, DW_AT_byte_size(0x12)
$C$DW$368	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$368, DW_AT_upper_bound(0x02)

	.dwendtag $C$DW$T$879


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$369, DW_AT_name("As")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("_As")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$370, DW_AT_name("Bs")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("_Bs")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$371, DW_AT_name("Cs")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("_Cs")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$372, DW_AT_name("Alpha")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("_Alpha")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$373, DW_AT_name("Beta")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("_Beta")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$25

$C$DW$T$882	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$882, DW_AT_name("CLARKE")
	.dwattr $C$DW$T$882, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$882, DW_AT_language(DW_LANG_C)


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x0e)
$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$374, DW_AT_name("Alpha")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("_Alpha")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$375, DW_AT_name("Beta")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("_Beta")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$376, DW_AT_name("Angle")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_Angle")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$377, DW_AT_name("Ds")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("_Ds")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$378, DW_AT_name("Qs")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_Qs")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$379, DW_AT_name("Sine")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("_Sine")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$380, DW_AT_name("Cosine")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("_Cosine")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$26

$C$DW$T$883	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$883, DW_AT_name("PARK")
	.dwattr $C$DW$T$883, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$883, DW_AT_language(DW_LANG_C)


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x0e)
$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$381, DW_AT_name("Alpha")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("_Alpha")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$382, DW_AT_name("Beta")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("_Beta")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$383, DW_AT_name("Angle")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("_Angle")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$384, DW_AT_name("Ds")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_Ds")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$385, DW_AT_name("Qs")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_Qs")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$386, DW_AT_name("Sine")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_Sine")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$387, DW_AT_name("Cosine")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_Cosine")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$27

$C$DW$T$884	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$884, DW_AT_name("IPARK")
	.dwattr $C$DW$T$884, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$884, DW_AT_language(DW_LANG_C)


$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x20)
$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$388, DW_AT_name("Ref")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("_Ref")
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$389, DW_AT_name("Fdb")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("_Fdb")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$390, DW_AT_name("Err")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("_Err")
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$391, DW_AT_name("Kp")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("_Kp")
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$392, DW_AT_name("Up")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("_Up")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$393, DW_AT_name("Ui")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("_Ui")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$394, DW_AT_name("Ud")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("_Ud")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$395, DW_AT_name("OutPreSat")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("_OutPreSat")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$396, DW_AT_name("OutMax")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_OutMax")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$397, DW_AT_name("OutMin")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_OutMin")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$398, DW_AT_name("Out")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_Out")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$399, DW_AT_name("SatErr")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_SatErr")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$400, DW_AT_name("Ki")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("_Ki")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$401, DW_AT_name("Kc")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("_Kc")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$402, DW_AT_name("Kd")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("_Kd")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$403, DW_AT_name("Up1")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("_Up1")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$28

$C$DW$T$885	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$885, DW_AT_name("PIDREG3")
	.dwattr $C$DW$T$885, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$885, DW_AT_language(DW_LANG_C)


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x18)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$404, DW_AT_name("Ref")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("_Ref")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$405, DW_AT_name("Fbk")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("_Fbk")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$406, DW_AT_name("Out")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("_Out")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$407, DW_AT_name("Kp")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("_Kp")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$408, DW_AT_name("Ki")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("_Ki")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$409, DW_AT_name("Umax")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("_Umax")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$410, DW_AT_name("Umin")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("_Umin")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$411, DW_AT_name("up")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("_up")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$412, DW_AT_name("ui")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("_ui")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$413, DW_AT_name("v1")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("_v1")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$414, DW_AT_name("i1")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_i1")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$415, DW_AT_name("w1")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_w1")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$29

$C$DW$T$886	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$886, DW_AT_name("PI_CONTROLLER")
	.dwattr $C$DW$T$886, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$886, DW_AT_language(DW_LANG_C)


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$416, DW_AT_name("Ref")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_Ref")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$417, DW_AT_name("Fbk")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_Fbk")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$418, DW_AT_name("Out")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_Out")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$419, DW_AT_name("c1")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_c1")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$420, DW_AT_name("c2")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_c2")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$30

$C$DW$T$33	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$33, DW_AT_name("PID_TERMINALS")
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x0e)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$421, DW_AT_name("Kr")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_Kr")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$422, DW_AT_name("Kp")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_Kp")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$423, DW_AT_name("Ki")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("_Ki")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$424, DW_AT_name("Kd")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_Kd")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$425, DW_AT_name("Km")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_Km")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$426, DW_AT_name("Umax")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_Umax")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$427, DW_AT_name("Umin")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_Umin")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$31

$C$DW$T$34	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$34, DW_AT_name("PID_PARAMETERS")
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$428, DW_AT_name("up")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_up")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$429, DW_AT_name("ui")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_ui")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$430, DW_AT_name("ud")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_ud")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$431, DW_AT_name("v1")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_v1")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$432, DW_AT_name("i1")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_i1")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$433, DW_AT_name("d1")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_d1")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$434, DW_AT_name("d2")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_d2")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$435, DW_AT_name("w1")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_w1")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$32

$C$DW$T$35	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$35, DW_AT_name("PID_DATA")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)


$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x28)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$436, DW_AT_name("term")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_term")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$437, DW_AT_name("param")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_param")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$438, DW_AT_name("data")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_data")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$36

$C$DW$T$887	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$887, DW_AT_name("PID_CONTROLLER")
	.dwattr $C$DW$T$887, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$887, DW_AT_language(DW_LANG_C)


$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x12)
$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$439, DW_AT_name("Ualpha")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_Ualpha")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$440, DW_AT_name("Ubeta")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_Ubeta")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$441, DW_AT_name("Ta")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("_Ta")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$442, DW_AT_name("Tb")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("_Tb")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$443, DW_AT_name("Tc")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_Tc")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$444, DW_AT_name("tmp1")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_tmp1")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$445, DW_AT_name("tmp2")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_tmp2")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$446, DW_AT_name("tmp3")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_tmp3")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$447, DW_AT_name("VecSector")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_VecSector")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$38

$C$DW$T$888	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$888, DW_AT_name("SVGEN")
	.dwattr $C$DW$T$888, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$888, DW_AT_language(DW_LANG_C)


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x10)
$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$448, DW_AT_name("TargetValue")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_TargetValue")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$449, DW_AT_name("RampDelayMax")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_RampDelayMax")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$450, DW_AT_name("RampLowLimit")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_RampLowLimit")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$451, DW_AT_name("RampHighLimit")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_RampHighLimit")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$452, DW_AT_name("RampDelayCount")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_RampDelayCount")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$453, DW_AT_name("SetpointValue")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_SetpointValue")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$454, DW_AT_name("EqualFlag")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_EqualFlag")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$455, DW_AT_name("Tmp")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_Tmp")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$40

$C$DW$T$889	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$889, DW_AT_name("RMPCNTL")
	.dwattr $C$DW$T$889, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$889, DW_AT_language(DW_LANG_C)


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$456, DW_AT_name("Freq")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_Freq")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$457, DW_AT_name("StepAngleMax")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_StepAngleMax")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$458, DW_AT_name("Angle")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_Angle")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$459, DW_AT_name("Gain")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_Gain")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$460, DW_AT_name("Out")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_Out")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$461, DW_AT_name("Offset")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_Offset")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$41

$C$DW$T$890	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$890, DW_AT_name("RAMPGEN")
	.dwattr $C$DW$T$890, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$890, DW_AT_language(DW_LANG_C)


$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x16)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$462, DW_AT_name("DcBusVolt")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_DcBusVolt")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$463, DW_AT_name("MfuncV1")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_MfuncV1")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$464, DW_AT_name("MfuncV2")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_MfuncV2")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$465, DW_AT_name("MfuncV3")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_MfuncV3")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$466, DW_AT_name("OutOfPhase")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_OutOfPhase")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$467, DW_AT_name("VphaseA")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_VphaseA")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$468, DW_AT_name("VphaseB")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_VphaseB")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$469, DW_AT_name("VphaseC")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_VphaseC")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$470, DW_AT_name("Valpha")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_Valpha")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$471, DW_AT_name("Vbeta")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_Vbeta")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$472, DW_AT_name("temp")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_temp")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$42

$C$DW$T$891	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$891, DW_AT_name("PHASEVOLTAGE")
	.dwattr $C$DW$T$891, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$891, DW_AT_language(DW_LANG_C)


$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x14)
$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$473, DW_AT_name("ElecTheta")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_ElecTheta")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$474, DW_AT_name("DirectionQep")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_DirectionQep")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$475, DW_AT_name("OldElecTheta")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("_OldElecTheta")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$476, DW_AT_name("Speed")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("_Speed")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$477, DW_AT_name("BaseRpm")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_BaseRpm")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$478, DW_AT_name("K1")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_K1")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$479, DW_AT_name("K2")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_K2")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$480, DW_AT_name("K3")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_K3")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$481, DW_AT_name("SpeedRpm")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_SpeedRpm")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$482, DW_AT_name("Tmp")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("_Tmp")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$45

$C$DW$T$892	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$892, DW_AT_name("SPEED_MEAS_QEP")
	.dwattr $C$DW$T$892, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$T$892, DW_AT_language(DW_LANG_C)


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x12)
$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$483, DW_AT_name("ElecTheta")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("_ElecTheta")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$484, DW_AT_name("MechTheta")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("_MechTheta")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$485, DW_AT_name("DirectionQep")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("_DirectionQep")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$486, DW_AT_name("QepPeriod")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("_QepPeriod")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$487, DW_AT_name("QepCountIndex")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("_QepCountIndex")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$488, DW_AT_name("RawTheta")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("_RawTheta")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$489, DW_AT_name("MechScaler")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("_MechScaler")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$490, DW_AT_name("LineEncoder")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("_LineEncoder")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$491, DW_AT_name("PolePairs")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_PolePairs")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$492, DW_AT_name("CalibratedAngle")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_CalibratedAngle")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$493, DW_AT_name("IndexSyncFlag")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_IndexSyncFlag")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$46

$C$DW$T$893	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$893, DW_AT_name("QEP")
	.dwattr $C$DW$T$893, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$893, DW_AT_language(DW_LANG_C)


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$494, DW_AT_name("ElecTheta")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_ElecTheta")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$495, DW_AT_name("MechTheta")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("_MechTheta")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$496, DW_AT_name("RawTheta")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_RawTheta")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$497, DW_AT_name("Speed")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_Speed")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$498, DW_AT_name("InitTheta")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_InitTheta")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$499, DW_AT_name("MechScaler")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_MechScaler")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$500, DW_AT_name("StepsPerTurn")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_StepsPerTurn")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$501, DW_AT_name("PolePairs")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_PolePairs")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$47

$C$DW$T$895	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$895, DW_AT_name("RESOLVER")
	.dwattr $C$DW$T$895, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$895, DW_AT_language(DW_LANG_C)

$C$DW$502	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$895)

$C$DW$T$896	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$896, DW_AT_type(*$C$DW$502)


$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x10)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$503, DW_AT_name("ElecTheta")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_ElecTheta")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$504, DW_AT_name("MechTheta")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_MechTheta")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$505, DW_AT_name("RawTheta")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_RawTheta")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$506, DW_AT_name("Speed")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_Speed")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$507, DW_AT_name("InitTheta")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_InitTheta")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$508, DW_AT_name("MechScaler")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_MechScaler")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$509, DW_AT_name("StepsPerTurn")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("_StepsPerTurn")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$510, DW_AT_name("PolePairs")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("_PolePairs")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$48

$C$DW$T$898	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$898, DW_AT_name("ABS_ENCODER")
	.dwattr $C$DW$T$898, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$898, DW_AT_language(DW_LANG_C)

$C$DW$511	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$898)

$C$DW$T$899	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$899, DW_AT_type(*$C$DW$511)


$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_name("ADCBURSTCTL_BITS")
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$512, DW_AT_name("BURSTTRIGSEL")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
	.dwattr $C$DW$512, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$512, DW_AT_bit_size(0x06)
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$513, DW_AT_name("rsvd1")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$513, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$513, DW_AT_bit_size(0x02)
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$514, DW_AT_name("BURSTSIZE")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("_BURSTSIZE")
	.dwattr $C$DW$514, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$514, DW_AT_bit_size(0x04)
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$515, DW_AT_name("rsvd2")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$515, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$515, DW_AT_bit_size(0x03)
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$516, DW_AT_name("BURSTEN")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("_BURSTEN")
	.dwattr $C$DW$516, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$516, DW_AT_bit_size(0x01)
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$49


$C$DW$T$50	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$50, DW_AT_name("ADCBURSTCTL_REG")
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$517, DW_AT_name("all")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$518, DW_AT_name("bit")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$50


$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_name("ADCCOUNTER_BITS")
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$519, DW_AT_name("FREECOUNT")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("_FREECOUNT")
	.dwattr $C$DW$519, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$519, DW_AT_bit_size(0x0c)
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$520, DW_AT_name("rsvd1")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$520, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$520, DW_AT_bit_size(0x04)
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$51


$C$DW$T$52	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$52, DW_AT_name("ADCCOUNTER_REG")
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$521, DW_AT_name("all")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$522, DW_AT_name("bit")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$52


$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_name("ADCCTL1_BITS")
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$523, DW_AT_name("rsvd1")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$523, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$523, DW_AT_bit_size(0x02)
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$524, DW_AT_name("INTPULSEPOS")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("_INTPULSEPOS")
	.dwattr $C$DW$524, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$524, DW_AT_bit_size(0x01)
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$525, DW_AT_name("rsvd2")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$525, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$525, DW_AT_bit_size(0x04)
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$526, DW_AT_name("ADCPWDNZ")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("_ADCPWDNZ")
	.dwattr $C$DW$526, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$526, DW_AT_bit_size(0x01)
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$527, DW_AT_name("ADCBSYCHN")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("_ADCBSYCHN")
	.dwattr $C$DW$527, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$527, DW_AT_bit_size(0x04)
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$528, DW_AT_name("rsvd3")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$528, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$528, DW_AT_bit_size(0x01)
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$529, DW_AT_name("ADCBSY")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("_ADCBSY")
	.dwattr $C$DW$529, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$529, DW_AT_bit_size(0x01)
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$530, DW_AT_name("rsvd4")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("_rsvd4")
	.dwattr $C$DW$530, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$530, DW_AT_bit_size(0x02)
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$53


$C$DW$T$54	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$54, DW_AT_name("ADCCTL1_REG")
	.dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$531, DW_AT_name("all")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$532, DW_AT_name("bit")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$54


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_name("ADCCTL2_BITS")
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$533, DW_AT_name("PRESCALE")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("_PRESCALE")
	.dwattr $C$DW$533, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$533, DW_AT_bit_size(0x04)
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$534, DW_AT_name("rsvd1")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$534, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$534, DW_AT_bit_size(0x02)
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$535, DW_AT_name("RESOLUTION")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("_RESOLUTION")
	.dwattr $C$DW$535, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$535, DW_AT_bit_size(0x01)
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$536, DW_AT_name("SIGNALMODE")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("_SIGNALMODE")
	.dwattr $C$DW$536, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$536, DW_AT_bit_size(0x01)
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$537, DW_AT_name("rsvd2")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$537, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$537, DW_AT_bit_size(0x05)
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$538, DW_AT_name("rsvd3")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$538, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$538, DW_AT_bit_size(0x03)
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$55


$C$DW$T$56	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$56, DW_AT_name("ADCCTL2_REG")
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$539, DW_AT_name("all")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$540, DW_AT_name("bit")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$56


$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_name("ADCEVTCLR_BITS")
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$541, DW_AT_name("PPB1TRIPHI")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("_PPB1TRIPHI")
	.dwattr $C$DW$541, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$541, DW_AT_bit_size(0x01)
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$542, DW_AT_name("PPB1TRIPLO")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("_PPB1TRIPLO")
	.dwattr $C$DW$542, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$542, DW_AT_bit_size(0x01)
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$543, DW_AT_name("PPB1ZERO")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("_PPB1ZERO")
	.dwattr $C$DW$543, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$543, DW_AT_bit_size(0x01)
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$544, DW_AT_name("rsvd1")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$544, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$544, DW_AT_bit_size(0x01)
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$545, DW_AT_name("PPB2TRIPHI")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("_PPB2TRIPHI")
	.dwattr $C$DW$545, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$545, DW_AT_bit_size(0x01)
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$546, DW_AT_name("PPB2TRIPLO")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("_PPB2TRIPLO")
	.dwattr $C$DW$546, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$546, DW_AT_bit_size(0x01)
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$547, DW_AT_name("PPB2ZERO")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("_PPB2ZERO")
	.dwattr $C$DW$547, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$547, DW_AT_bit_size(0x01)
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$548, DW_AT_name("rsvd2")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$548, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$548, DW_AT_bit_size(0x01)
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$549, DW_AT_name("PPB3TRIPHI")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("_PPB3TRIPHI")
	.dwattr $C$DW$549, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$549, DW_AT_bit_size(0x01)
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$550, DW_AT_name("PPB3TRIPLO")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("_PPB3TRIPLO")
	.dwattr $C$DW$550, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$550, DW_AT_bit_size(0x01)
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$551, DW_AT_name("PPB3ZERO")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("_PPB3ZERO")
	.dwattr $C$DW$551, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$551, DW_AT_bit_size(0x01)
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$552, DW_AT_name("rsvd3")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$552, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$552, DW_AT_bit_size(0x01)
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$553, DW_AT_name("PPB4TRIPHI")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("_PPB4TRIPHI")
	.dwattr $C$DW$553, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$553, DW_AT_bit_size(0x01)
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$554, DW_AT_name("PPB4TRIPLO")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("_PPB4TRIPLO")
	.dwattr $C$DW$554, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$554, DW_AT_bit_size(0x01)
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$555, DW_AT_name("PPB4ZERO")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("_PPB4ZERO")
	.dwattr $C$DW$555, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$555, DW_AT_bit_size(0x01)
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$556, DW_AT_name("rsvd4")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("_rsvd4")
	.dwattr $C$DW$556, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$556, DW_AT_bit_size(0x01)
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$57


$C$DW$T$58	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$58, DW_AT_name("ADCEVTCLR_REG")
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$557, DW_AT_name("all")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$558, DW_AT_name("bit")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$58


$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_name("ADCEVTINTSEL_BITS")
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x01)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$559, DW_AT_name("PPB1TRIPHI")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("_PPB1TRIPHI")
	.dwattr $C$DW$559, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$559, DW_AT_bit_size(0x01)
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$560, DW_AT_name("PPB1TRIPLO")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("_PPB1TRIPLO")
	.dwattr $C$DW$560, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$560, DW_AT_bit_size(0x01)
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$561, DW_AT_name("PPB1ZERO")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("_PPB1ZERO")
	.dwattr $C$DW$561, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$561, DW_AT_bit_size(0x01)
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$562, DW_AT_name("rsvd1")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$562, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$562, DW_AT_bit_size(0x01)
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$563, DW_AT_name("PPB2TRIPHI")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("_PPB2TRIPHI")
	.dwattr $C$DW$563, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$563, DW_AT_bit_size(0x01)
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$564, DW_AT_name("PPB2TRIPLO")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("_PPB2TRIPLO")
	.dwattr $C$DW$564, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$564, DW_AT_bit_size(0x01)
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$565, DW_AT_name("PPB2ZERO")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("_PPB2ZERO")
	.dwattr $C$DW$565, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$565, DW_AT_bit_size(0x01)
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$566, DW_AT_name("rsvd2")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$566, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$566, DW_AT_bit_size(0x01)
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$567, DW_AT_name("PPB3TRIPHI")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("_PPB3TRIPHI")
	.dwattr $C$DW$567, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$567, DW_AT_bit_size(0x01)
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$568, DW_AT_name("PPB3TRIPLO")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("_PPB3TRIPLO")
	.dwattr $C$DW$568, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$568, DW_AT_bit_size(0x01)
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$569	.dwtag  DW_TAG_member
	.dwattr $C$DW$569, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$569, DW_AT_name("PPB3ZERO")
	.dwattr $C$DW$569, DW_AT_TI_symbol_name("_PPB3ZERO")
	.dwattr $C$DW$569, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$569, DW_AT_bit_size(0x01)
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$570, DW_AT_name("rsvd3")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$570, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$570, DW_AT_bit_size(0x01)
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$571, DW_AT_name("PPB4TRIPHI")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("_PPB4TRIPHI")
	.dwattr $C$DW$571, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$571, DW_AT_bit_size(0x01)
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$572, DW_AT_name("PPB4TRIPLO")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("_PPB4TRIPLO")
	.dwattr $C$DW$572, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$572, DW_AT_bit_size(0x01)
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$573, DW_AT_name("PPB4ZERO")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("_PPB4ZERO")
	.dwattr $C$DW$573, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$573, DW_AT_bit_size(0x01)
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$574, DW_AT_name("rsvd4")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("_rsvd4")
	.dwattr $C$DW$574, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$574, DW_AT_bit_size(0x01)
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$59


$C$DW$T$60	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$60, DW_AT_name("ADCEVTINTSEL_REG")
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x01)
$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$575, DW_AT_name("all")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$576, DW_AT_name("bit")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$60


$C$DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$61, DW_AT_name("ADCEVTSEL_BITS")
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$577, DW_AT_name("PPB1TRIPHI")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("_PPB1TRIPHI")
	.dwattr $C$DW$577, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$577, DW_AT_bit_size(0x01)
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$578, DW_AT_name("PPB1TRIPLO")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("_PPB1TRIPLO")
	.dwattr $C$DW$578, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$578, DW_AT_bit_size(0x01)
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$579, DW_AT_name("PPB1ZERO")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("_PPB1ZERO")
	.dwattr $C$DW$579, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$579, DW_AT_bit_size(0x01)
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$580, DW_AT_name("rsvd1")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$580, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$580, DW_AT_bit_size(0x01)
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$581, DW_AT_name("PPB2TRIPHI")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("_PPB2TRIPHI")
	.dwattr $C$DW$581, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$581, DW_AT_bit_size(0x01)
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$582, DW_AT_name("PPB2TRIPLO")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("_PPB2TRIPLO")
	.dwattr $C$DW$582, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$582, DW_AT_bit_size(0x01)
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$583, DW_AT_name("PPB2ZERO")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("_PPB2ZERO")
	.dwattr $C$DW$583, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$583, DW_AT_bit_size(0x01)
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$584, DW_AT_name("rsvd2")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$584, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$584, DW_AT_bit_size(0x01)
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$585, DW_AT_name("PPB3TRIPHI")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("_PPB3TRIPHI")
	.dwattr $C$DW$585, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$585, DW_AT_bit_size(0x01)
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$586, DW_AT_name("PPB3TRIPLO")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("_PPB3TRIPLO")
	.dwattr $C$DW$586, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$586, DW_AT_bit_size(0x01)
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$587, DW_AT_name("PPB3ZERO")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("_PPB3ZERO")
	.dwattr $C$DW$587, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$587, DW_AT_bit_size(0x01)
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$588, DW_AT_name("rsvd3")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$588, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$588, DW_AT_bit_size(0x01)
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$589, DW_AT_name("PPB4TRIPHI")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("_PPB4TRIPHI")
	.dwattr $C$DW$589, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$589, DW_AT_bit_size(0x01)
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$590, DW_AT_name("PPB4TRIPLO")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("_PPB4TRIPLO")
	.dwattr $C$DW$590, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$590, DW_AT_bit_size(0x01)
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$591, DW_AT_name("PPB4ZERO")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("_PPB4ZERO")
	.dwattr $C$DW$591, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$591, DW_AT_bit_size(0x01)
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$592, DW_AT_name("rsvd4")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("_rsvd4")
	.dwattr $C$DW$592, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$592, DW_AT_bit_size(0x01)
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$61


$C$DW$T$62	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$62, DW_AT_name("ADCEVTSEL_REG")
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x01)
$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$593, DW_AT_name("all")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$594, DW_AT_name("bit")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$62


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_name("ADCEVTSTAT_BITS")
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$595, DW_AT_name("PPB1TRIPHI")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("_PPB1TRIPHI")
	.dwattr $C$DW$595, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$595, DW_AT_bit_size(0x01)
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$596, DW_AT_name("PPB1TRIPLO")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("_PPB1TRIPLO")
	.dwattr $C$DW$596, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$596, DW_AT_bit_size(0x01)
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$597, DW_AT_name("PPB1ZERO")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("_PPB1ZERO")
	.dwattr $C$DW$597, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$597, DW_AT_bit_size(0x01)
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$598, DW_AT_name("rsvd1")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$598, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$598, DW_AT_bit_size(0x01)
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$599, DW_AT_name("PPB2TRIPHI")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("_PPB2TRIPHI")
	.dwattr $C$DW$599, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$599, DW_AT_bit_size(0x01)
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$600, DW_AT_name("PPB2TRIPLO")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("_PPB2TRIPLO")
	.dwattr $C$DW$600, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$600, DW_AT_bit_size(0x01)
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$601, DW_AT_name("PPB2ZERO")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("_PPB2ZERO")
	.dwattr $C$DW$601, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$601, DW_AT_bit_size(0x01)
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$602, DW_AT_name("rsvd2")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$602, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$602, DW_AT_bit_size(0x01)
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$603, DW_AT_name("PPB3TRIPHI")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("_PPB3TRIPHI")
	.dwattr $C$DW$603, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$603, DW_AT_bit_size(0x01)
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$604, DW_AT_name("PPB3TRIPLO")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("_PPB3TRIPLO")
	.dwattr $C$DW$604, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$604, DW_AT_bit_size(0x01)
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$605, DW_AT_name("PPB3ZERO")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("_PPB3ZERO")
	.dwattr $C$DW$605, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$605, DW_AT_bit_size(0x01)
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$606	.dwtag  DW_TAG_member
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$606, DW_AT_name("rsvd3")
	.dwattr $C$DW$606, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$606, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$606, DW_AT_bit_size(0x01)
	.dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$607	.dwtag  DW_TAG_member
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$607, DW_AT_name("PPB4TRIPHI")
	.dwattr $C$DW$607, DW_AT_TI_symbol_name("_PPB4TRIPHI")
	.dwattr $C$DW$607, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$607, DW_AT_bit_size(0x01)
	.dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$608	.dwtag  DW_TAG_member
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$608, DW_AT_name("PPB4TRIPLO")
	.dwattr $C$DW$608, DW_AT_TI_symbol_name("_PPB4TRIPLO")
	.dwattr $C$DW$608, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$608, DW_AT_bit_size(0x01)
	.dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$609	.dwtag  DW_TAG_member
	.dwattr $C$DW$609, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$609, DW_AT_name("PPB4ZERO")
	.dwattr $C$DW$609, DW_AT_TI_symbol_name("_PPB4ZERO")
	.dwattr $C$DW$609, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$609, DW_AT_bit_size(0x01)
	.dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$610	.dwtag  DW_TAG_member
	.dwattr $C$DW$610, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$610, DW_AT_name("rsvd4")
	.dwattr $C$DW$610, DW_AT_TI_symbol_name("_rsvd4")
	.dwattr $C$DW$610, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$610, DW_AT_bit_size(0x01)
	.dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$63


$C$DW$T$64	.dwtag  DW_TAG_union_type
