TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Sat Nov 14 12:25:46 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../config.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_SetupPinOptions")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GPIO_SetupPinOptions")

    1187 00000167 7640!         LCR       #_AdcSetMode          ; [CPU_ALU] |209| 
         00000168 0000 
    1188                      ; call occurs [#_AdcSetMode] ; [] |209| 
    1189                      .dwpsn  file "../config.c",line 210,column 5,is_stmt,isa 0
    1190 00000169 9A01          MOVB      AL,#1                 ; [CPU_ALU] |210| 
    1191 0000016a D400          MOVB      XAR4,#0               ; [CPU_ALU] |210| 
    1192 0000016b 9B00          MOVB      AH,#0                 ; [CPU_ALU] |210| 
    1193              $C$DW$88        .dwtag  DW_TAG_TI_branch
    1194                      .dwattr $C$DW$88, DW_AT_low_pc(0x00)
    1195                      .dwattr $C$DW$88, DW_AT_name("_AdcSetMode")
    1196                      .dwattr $C$DW$88, DW_AT_TI_call
    1197              
    1198 0000016c 7640!         LCR       #_AdcSetMode          ; [CPU_ALU] |210| 
         0000016d 0000 
    1199                      ; call occurs [#_AdcSetMode] ; [] |210| 
    1200 0000016e 761F!         MOVW      DP,#_AdcaRegs         ; [CPU_ARAU] 
         0000016f 0000 
    1201                      .dwpsn  file "../config.c",line 221,column 2,is_stmt,isa 0
    1202 00000170 8F00          MOVL      XAR4,#39998           ; [CPU_ARAU] |221| 
         00000171 9C3E 
    1203                      .dwpsn  file "../config.c",line 213,column 2,is_stmt,isa 0
    1204 00000172 1A00!         OR        @$BLOCKED(_AdcaRegs),#0x0004 ; [CPU_ALU] |213| 
         00000173 0004 
    1205 00000174 761F!         MOVW      DP,#_AdcbRegs         ; [CPU_ARAU] 
         00000175 0000 
    1206                      .dwpsn  file "../config.c",line 214,column 2,is_stmt,isa 0
    1207 00000176 1A00!         OR        @$BLOCKED(_AdcbRegs),#0x0004 ; [CPU_ALU] |214| 
         00000177 0004 
    1208                      .dwpsn  file "../config.c",line 221,column 2,is_stmt,isa 0
    1209 00000178 A8A9          MOVL      ACC,XAR4              ; [CPU_ALU] |221| 
    1210 00000179 761F!         MOVW      DP,#_AdcaRegs         ; [CPU_ARAU] 
         0000017a 0000 
    1211                      .dwpsn  file "../config.c",line 217,column 2,is_stmt,isa 0
    1212 0000017b 1A00!         OR        @$BLOCKED(_AdcaRegs),#0x0080 ; [CPU_ALU] |217| 
         0000017c 0080 
    1213 0000017d 761F!         MOVW      DP,#_AdcbRegs         ; [CPU_ARAU] 
         0000017e 0000 
    1214                      .dwpsn  file "../config.c",line 218,column 2,is_stmt,isa 0
    1215 0000017f 1A00!         OR        @$BLOCKED(_AdcbRegs),#0x0080 ; [CPU_ALU] |218| 
         00000180 0080 
    1216                      .dwpsn  file "../config.c",line 221,column 2,is_stmt,isa 0
    1217              $C$DW$89        .dwtag  DW_TAG_TI_branch
    1218                      .dwattr $C$DW$89, DW_AT_low_pc(0x00)
    1219                      .dwattr $C$DW$89, DW_AT_name("_F28x_usDelay")
    1220                      .dwattr $C$DW$89, DW_AT_TI_call
    1221              
    1222 00000181 7640!         LCR       #_F28x_usDelay        ; [CPU_ALU] |221| 
         00000182 0000 
    1223                      ; call occurs [#_F28x_usDelay] ; [] |221| 
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   25

    1224 00000183 761A   EDIS
    1225 00000184 FF69          SPM       #0                    ; [CPU_ALU] 
    1226              $C$DW$90        .dwtag  DW_TAG_TI_branch
    1227                      .dwattr $C$DW$90, DW_AT_low_pc(0x00)
    1228                      .dwattr $C$DW$90, DW_AT_TI_return
    1229              
    1230 00000185 0006          LRETR     ; [CPU_ALU] 
    1231                      ; return occurs ; [] 
    1232                      .dwattr $C$DW$86, DW_AT_TI_end_file("../config.c")
    1233                      .dwattr $C$DW$86, DW_AT_TI_end_line(0xe0)
    1234                      .dwattr $C$DW$86, DW_AT_TI_end_column(0x01)
    1235                      .dwendentry
    1236                      .dwendtag $C$DW$86
    1237              
    1238              ;**************************************************************
    1239              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1240              ;**************************************************************
    1241                      .global _GPIO_SetupPinOptions
    1242                      .global _GPIO_SetupPinMux
    1243                      .global _GPIO_WritePin
    1244                      .global _DisableDog
    1245                      .global _GPIO_EnableUnbondedIOPullups
    1246                      .global _InitSysPll
    1247                      .global _InitPeripheralClocks
    1248                      .global _AdcSetMode
    1249                      .global _F28x_usDelay
    1250                      .global _AnalogSubsysRegs
    1251                      .global _AdcaRegs
    1252                      .global _AdcbRegs
    1253                      .global _CpuSysRegs
    1254              
    1255              ;***************************************************************
    1256              ;* TYPE INFORMATION                                            *
    1257              ;***************************************************************
    1258              
    1259              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1260                      .dwattr $C$DW$T$20, DW_AT_name("ADCBURSTCTL_BITS")
    1261                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1262              $C$DW$91        .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1264                      .dwattr $C$DW$91, DW_AT_name("BURSTTRIGSEL")
    1265                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
    1266                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0a)
    1267                      .dwattr $C$DW$91, DW_AT_bit_size(0x06)
    1268                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1270              
    1271              $C$DW$92        .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$92, DW_AT_name("rsvd1")
    1274                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd1")
    1275                      .dwattr $C$DW$92, DW_AT_bit_offset(0x08)
    1276                      .dwattr $C$DW$92, DW_AT_bit_size(0x02)
    1277                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   26

    1279              
    1280              $C$DW$93        .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1282                      .dwattr $C$DW$93, DW_AT_name("BURSTSIZE")
    1283                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_BURSTSIZE")
    1284                      .dwattr $C$DW$93, DW_AT_bit_offset(0x04)
    1285                      .dwattr $C$DW$93, DW_AT_bit_size(0x04)
    1286                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1288              
    1289              $C$DW$94        .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1291                      .dwattr $C$DW$94, DW_AT_name("rsvd2")
    1292                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd2")
    1293                      .dwattr $C$DW$94, DW_AT_bit_offset(0x01)
    1294                      .dwattr $C$DW$94, DW_AT_bit_size(0x03)
    1295                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1296                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1297              
    1298              $C$DW$95        .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1300                      .dwattr $C$DW$95, DW_AT_name("BURSTEN")
    1301                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_BURSTEN")
    1302                      .dwattr $C$DW$95, DW_AT_bit_offset(0x00)
    1303                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1304                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1305                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1306              
    1307                      .dwendtag $C$DW$T$20
    1308              
    1309              
    1310              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1311                      .dwattr $C$DW$T$21, DW_AT_name("ADCBURSTCTL_REG")
    1312                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1313              $C$DW$96        .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1315                      .dwattr $C$DW$96, DW_AT_name("all")
    1316                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_all")
    1317                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1318                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1319              
    1320              $C$DW$97        .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    1322                      .dwattr $C$DW$97, DW_AT_name("bit")
    1323                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_bit")
    1324                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1326              
    1327                      .dwendtag $C$DW$T$21
    1328              
    1329              
    1330              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1331                      .dwattr $C$DW$T$22, DW_AT_name("ADCCOUNTER_BITS")
    1332                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1333              $C$DW$98        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   27

    1334                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$98, DW_AT_name("FREECOUNT")
    1336                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_FREECOUNT")
    1337                      .dwattr $C$DW$98, DW_AT_bit_offset(0x04)
    1338                      .dwattr $C$DW$98, DW_AT_bit_size(0x0c)
    1339                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1341              
    1342              $C$DW$99        .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1344                      .dwattr $C$DW$99, DW_AT_name("rsvd1")
    1345                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd1")
    1346                      .dwattr $C$DW$99, DW_AT_bit_offset(0x00)
    1347                      .dwattr $C$DW$99, DW_AT_bit_size(0x04)
    1348                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1349                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1350              
    1351                      .dwendtag $C$DW$T$22
    1352              
    1353              
    1354              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1355                      .dwattr $C$DW$T$23, DW_AT_name("ADCCOUNTER_REG")
    1356                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1357              $C$DW$100       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1359                      .dwattr $C$DW$100, DW_AT_name("all")
    1360                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_all")
    1361                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1362                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1363              
    1364              $C$DW$101       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$22)
    1366                      .dwattr $C$DW$101, DW_AT_name("bit")
    1367                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_bit")
    1368                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1369                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1370              
    1371                      .dwendtag $C$DW$T$23
    1372              
    1373              
    1374              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1375                      .dwattr $C$DW$T$24, DW_AT_name("ADCCTL1_BITS")
    1376                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1377              $C$DW$102       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1379                      .dwattr $C$DW$102, DW_AT_name("rsvd1")
    1380                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd1")
    1381                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0e)
    1382                      .dwattr $C$DW$102, DW_AT_bit_size(0x02)
    1383                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1385              
    1386              $C$DW$103       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1388                      .dwattr $C$DW$103, DW_AT_name("INTPULSEPOS")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   28

    1389                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_INTPULSEPOS")
    1390                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0d)
    1391                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1392                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395              $C$DW$104       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$104, DW_AT_name("rsvd2")
    1398                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd2")
    1399                      .dwattr $C$DW$104, DW_AT_bit_offset(0x09)
    1400                      .dwattr $C$DW$104, DW_AT_bit_size(0x04)
    1401                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1403              
    1404              $C$DW$105       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1406                      .dwattr $C$DW$105, DW_AT_name("ADCPWDNZ")
    1407                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ADCPWDNZ")
    1408                      .dwattr $C$DW$105, DW_AT_bit_offset(0x08)
    1409                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1410                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$106       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$106, DW_AT_name("ADCBSYCHN")
    1416                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_ADCBSYCHN")
    1417                      .dwattr $C$DW$106, DW_AT_bit_offset(0x04)
    1418                      .dwattr $C$DW$106, DW_AT_bit_size(0x04)
    1419                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1420                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1421              
    1422              $C$DW$107       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1424                      .dwattr $C$DW$107, DW_AT_name("rsvd3")
    1425                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd3")
    1426                      .dwattr $C$DW$107, DW_AT_bit_offset(0x03)
    1427                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1428                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1429                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1430              
    1431              $C$DW$108       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1433                      .dwattr $C$DW$108, DW_AT_name("ADCBSY")
    1434                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_ADCBSY")
    1435                      .dwattr $C$DW$108, DW_AT_bit_offset(0x02)
    1436                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1437                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440              $C$DW$109       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1442                      .dwattr $C$DW$109, DW_AT_name("rsvd4")
    1443                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd4")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   29

    1444                      .dwattr $C$DW$109, DW_AT_bit_offset(0x00)
    1445                      .dwattr $C$DW$109, DW_AT_bit_size(0x02)
    1446                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1447                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1448              
    1449                      .dwendtag $C$DW$T$24
    1450              
    1451              
    1452              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1453                      .dwattr $C$DW$T$25, DW_AT_name("ADCCTL1_REG")
    1454                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1455              $C$DW$110       .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1457                      .dwattr $C$DW$110, DW_AT_name("all")
    1458                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_all")
    1459                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1460                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1461              
    1462              $C$DW$111       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$24)
    1464                      .dwattr $C$DW$111, DW_AT_name("bit")
    1465                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_bit")
    1466                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1468              
    1469                      .dwendtag $C$DW$T$25
    1470              
    1471              
    1472              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1473                      .dwattr $C$DW$T$26, DW_AT_name("ADCCTL2_BITS")
    1474                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1475              $C$DW$112       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1477                      .dwattr $C$DW$112, DW_AT_name("PRESCALE")
    1478                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PRESCALE")
    1479                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0c)
    1480                      .dwattr $C$DW$112, DW_AT_bit_size(0x04)
    1481                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1483              
    1484              $C$DW$113       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$113, DW_AT_name("rsvd1")
    1487                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd1")
    1488                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0a)
    1489                      .dwattr $C$DW$113, DW_AT_bit_size(0x02)
    1490                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1492              
    1493              $C$DW$114       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1495                      .dwattr $C$DW$114, DW_AT_name("RESOLUTION")
    1496                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_RESOLUTION")
    1497                      .dwattr $C$DW$114, DW_AT_bit_offset(0x09)
    1498                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   30

    1499                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1501              
    1502              $C$DW$115       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1504                      .dwattr $C$DW$115, DW_AT_name("SIGNALMODE")
    1505                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_SIGNALMODE")
    1506                      .dwattr $C$DW$115, DW_AT_bit_offset(0x08)
    1507                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1508                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1510              
    1511              $C$DW$116       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1513                      .dwattr $C$DW$116, DW_AT_name("rsvd2")
    1514                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd2")
    1515                      .dwattr $C$DW$116, DW_AT_bit_offset(0x03)
    1516                      .dwattr $C$DW$116, DW_AT_bit_size(0x05)
    1517                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1519              
    1520              $C$DW$117       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1522                      .dwattr $C$DW$117, DW_AT_name("rsvd3")
    1523                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd3")
    1524                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    1525                      .dwattr $C$DW$117, DW_AT_bit_size(0x03)
    1526                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1528              
    1529                      .dwendtag $C$DW$T$26
    1530              
    1531              
    1532              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1533                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL2_REG")
    1534                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1535              $C$DW$118       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1537                      .dwattr $C$DW$118, DW_AT_name("all")
    1538                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_all")
    1539                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1541              
    1542              $C$DW$119       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$26)
    1544                      .dwattr $C$DW$119, DW_AT_name("bit")
    1545                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_bit")
    1546                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1548              
    1549                      .dwendtag $C$DW$T$27
    1550              
    1551              
    1552              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1553                      .dwattr $C$DW$T$28, DW_AT_name("ADCEVTCLR_BITS")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   31

    1554                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1555              $C$DW$120       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1557                      .dwattr $C$DW$120, DW_AT_name("PPB1TRIPHI")
    1558                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1559                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0f)
    1560                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1561                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1563              
    1564              $C$DW$121       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1566                      .dwattr $C$DW$121, DW_AT_name("PPB1TRIPLO")
    1567                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1568                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0e)
    1569                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1570                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1571                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$122       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$122, DW_AT_name("PPB1ZERO")
    1576                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_PPB1ZERO")
    1577                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0d)
    1578                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1579                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1581              
    1582              $C$DW$123       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1584                      .dwattr $C$DW$123, DW_AT_name("rsvd1")
    1585                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd1")
    1586                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0c)
    1587                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1588                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591              $C$DW$124       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1593                      .dwattr $C$DW$124, DW_AT_name("PPB2TRIPHI")
    1594                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1595                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0b)
    1596                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1597                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1599              
    1600              $C$DW$125       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1602                      .dwattr $C$DW$125, DW_AT_name("PPB2TRIPLO")
    1603                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1604                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0a)
    1605                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1606                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1607                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1608              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   32

    1609              $C$DW$126       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1611                      .dwattr $C$DW$126, DW_AT_name("PPB2ZERO")
    1612                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_PPB2ZERO")
    1613                      .dwattr $C$DW$126, DW_AT_bit_offset(0x09)
    1614                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1615                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1616                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1617              
    1618              $C$DW$127       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1620                      .dwattr $C$DW$127, DW_AT_name("rsvd2")
    1621                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd2")
    1622                      .dwattr $C$DW$127, DW_AT_bit_offset(0x08)
    1623                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1624                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1625                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1626              
    1627              $C$DW$128       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1629                      .dwattr $C$DW$128, DW_AT_name("PPB3TRIPHI")
    1630                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1631                      .dwattr $C$DW$128, DW_AT_bit_offset(0x07)
    1632                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1633                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1634                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1635              
    1636              $C$DW$129       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1638                      .dwattr $C$DW$129, DW_AT_name("PPB3TRIPLO")
    1639                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1640                      .dwattr $C$DW$129, DW_AT_bit_offset(0x06)
    1641                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1642                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1644              
    1645              $C$DW$130       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1647                      .dwattr $C$DW$130, DW_AT_name("PPB3ZERO")
    1648                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_PPB3ZERO")
    1649                      .dwattr $C$DW$130, DW_AT_bit_offset(0x05)
    1650                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1651                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1652                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1653              
    1654              $C$DW$131       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1656                      .dwattr $C$DW$131, DW_AT_name("rsvd3")
    1657                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd3")
    1658                      .dwattr $C$DW$131, DW_AT_bit_offset(0x04)
    1659                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1660                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1661                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1662              
    1663              $C$DW$132       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   33

    1664                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1665                      .dwattr $C$DW$132, DW_AT_name("PPB4TRIPHI")
    1666                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1667                      .dwattr $C$DW$132, DW_AT_bit_offset(0x03)
    1668                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1669                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1670                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1671              
    1672              $C$DW$133       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1674                      .dwattr $C$DW$133, DW_AT_name("PPB4TRIPLO")
    1675                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1676                      .dwattr $C$DW$133, DW_AT_bit_offset(0x02)
    1677                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1678                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1680              
    1681              $C$DW$134       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1683                      .dwattr $C$DW$134, DW_AT_name("PPB4ZERO")
    1684                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PPB4ZERO")
    1685                      .dwattr $C$DW$134, DW_AT_bit_offset(0x01)
    1686                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1687                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1689              
    1690              $C$DW$135       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1692                      .dwattr $C$DW$135, DW_AT_name("rsvd4")
    1693                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd4")
    1694                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    1695                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1696                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1698              
    1699                      .dwendtag $C$DW$T$28
    1700              
    1701              
    1702              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1703                      .dwattr $C$DW$T$29, DW_AT_name("ADCEVTCLR_REG")
    1704                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1705              $C$DW$136       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1707                      .dwattr $C$DW$136, DW_AT_name("all")
    1708                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_all")
    1709                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1710                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1711              
    1712              $C$DW$137       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$28)
    1714                      .dwattr $C$DW$137, DW_AT_name("bit")
    1715                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_bit")
    1716                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1717                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1718              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   34

    1719                      .dwendtag $C$DW$T$29
    1720              
    1721              
    1722              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1723                      .dwattr $C$DW$T$30, DW_AT_name("ADCEVTINTSEL_BITS")
    1724                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1725              $C$DW$138       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1727                      .dwattr $C$DW$138, DW_AT_name("PPB1TRIPHI")
    1728                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1729                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0f)
    1730                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1731                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1733              
    1734              $C$DW$139       .dwtag  DW_TAG_member
    1735                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1736                      .dwattr $C$DW$139, DW_AT_name("PPB1TRIPLO")
    1737                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1738                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0e)
    1739                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1740                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1741                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1742              
    1743              $C$DW$140       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$140, DW_AT_name("PPB1ZERO")
    1746                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_PPB1ZERO")
    1747                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0d)
    1748                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1749                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1751              
    1752              $C$DW$141       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$141, DW_AT_name("rsvd1")
    1755                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd1")
    1756                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0c)
    1757                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1758                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1759                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1760              
    1761              $C$DW$142       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1763                      .dwattr $C$DW$142, DW_AT_name("PPB2TRIPHI")
    1764                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1765                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0b)
    1766                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1767                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1769              
    1770              $C$DW$143       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$143, DW_AT_name("PPB2TRIPLO")
    1773                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PPB2TRIPLO")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   35

    1774                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0a)
    1775                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1776                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1777                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1778              
    1779              $C$DW$144       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1781                      .dwattr $C$DW$144, DW_AT_name("PPB2ZERO")
    1782                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PPB2ZERO")
    1783                      .dwattr $C$DW$144, DW_AT_bit_offset(0x09)
    1784                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1785                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1786                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1787              
    1788              $C$DW$145       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1790                      .dwattr $C$DW$145, DW_AT_name("rsvd2")
    1791                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd2")
    1792                      .dwattr $C$DW$145, DW_AT_bit_offset(0x08)
    1793                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1794                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1795                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1796              
    1797              $C$DW$146       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1799                      .dwattr $C$DW$146, DW_AT_name("PPB3TRIPHI")
    1800                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1801                      .dwattr $C$DW$146, DW_AT_bit_offset(0x07)
    1802                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1803                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1804                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1805              
    1806              $C$DW$147       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1808                      .dwattr $C$DW$147, DW_AT_name("PPB3TRIPLO")
    1809                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1810                      .dwattr $C$DW$147, DW_AT_bit_offset(0x06)
    1811                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1812                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1813                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1814              
    1815              $C$DW$148       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1817                      .dwattr $C$DW$148, DW_AT_name("PPB3ZERO")
    1818                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PPB3ZERO")
    1819                      .dwattr $C$DW$148, DW_AT_bit_offset(0x05)
    1820                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1821                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1823              
    1824              $C$DW$149       .dwtag  DW_TAG_member
    1825                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1826                      .dwattr $C$DW$149, DW_AT_name("rsvd3")
    1827                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd3")
    1828                      .dwattr $C$DW$149, DW_AT_bit_offset(0x04)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   36

    1829                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1830                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1831                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1832              
    1833              $C$DW$150       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1835                      .dwattr $C$DW$150, DW_AT_name("PPB4TRIPHI")
    1836                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1837                      .dwattr $C$DW$150, DW_AT_bit_offset(0x03)
    1838                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1839                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1840                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1841              
    1842              $C$DW$151       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1844                      .dwattr $C$DW$151, DW_AT_name("PPB4TRIPLO")
    1845                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1846                      .dwattr $C$DW$151, DW_AT_bit_offset(0x02)
    1847                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1848                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1849                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1850              
    1851              $C$DW$152       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1853                      .dwattr $C$DW$152, DW_AT_name("PPB4ZERO")
    1854                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PPB4ZERO")
    1855                      .dwattr $C$DW$152, DW_AT_bit_offset(0x01)
    1856                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1857                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1858                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1859              
    1860              $C$DW$153       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1862                      .dwattr $C$DW$153, DW_AT_name("rsvd4")
    1863                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd4")
    1864                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00)
    1865                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1866                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1867                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1868              
    1869                      .dwendtag $C$DW$T$30
    1870              
    1871              
    1872              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1873                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTINTSEL_REG")
    1874                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1875              $C$DW$154       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1877                      .dwattr $C$DW$154, DW_AT_name("all")
    1878                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_all")
    1879                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1880                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1881              
    1882              $C$DW$155       .dwtag  DW_TAG_member
    1883                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$30)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   37

    1884                      .dwattr $C$DW$155, DW_AT_name("bit")
    1885                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_bit")
    1886                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1887                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1888              
    1889                      .dwendtag $C$DW$T$31
    1890              
    1891              
    1892              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1893                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTSEL_BITS")
    1894                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1895              $C$DW$156       .dwtag  DW_TAG_member
    1896                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1897                      .dwattr $C$DW$156, DW_AT_name("PPB1TRIPHI")
    1898                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1899                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0f)
    1900                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1901                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1903              
    1904              $C$DW$157       .dwtag  DW_TAG_member
    1905                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1906                      .dwattr $C$DW$157, DW_AT_name("PPB1TRIPLO")
    1907                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1908                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0e)
    1909                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1910                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1911                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1912              
    1913              $C$DW$158       .dwtag  DW_TAG_member
    1914                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1915                      .dwattr $C$DW$158, DW_AT_name("PPB1ZERO")
    1916                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_PPB1ZERO")
    1917                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0d)
    1918                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    1919                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1920                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1921              
    1922              $C$DW$159       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1924                      .dwattr $C$DW$159, DW_AT_name("rsvd1")
    1925                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd1")
    1926                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0c)
    1927                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    1928                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1929                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1930              
    1931              $C$DW$160       .dwtag  DW_TAG_member
    1932                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1933                      .dwattr $C$DW$160, DW_AT_name("PPB2TRIPHI")
    1934                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1935                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0b)
    1936                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    1937                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1938                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   38

    1939              
    1940              $C$DW$161       .dwtag  DW_TAG_member
    1941                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1942                      .dwattr $C$DW$161, DW_AT_name("PPB2TRIPLO")
    1943                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1944                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0a)
    1945                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    1946                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1947                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1948              
    1949              $C$DW$162       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1951                      .dwattr $C$DW$162, DW_AT_name("PPB2ZERO")
    1952                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PPB2ZERO")
    1953                      .dwattr $C$DW$162, DW_AT_bit_offset(0x09)
    1954                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    1955                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1956                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1957              
    1958              $C$DW$163       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1960                      .dwattr $C$DW$163, DW_AT_name("rsvd2")
    1961                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd2")
    1962                      .dwattr $C$DW$163, DW_AT_bit_offset(0x08)
    1963                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1964                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1965                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1966              
    1967              $C$DW$164       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1969                      .dwattr $C$DW$164, DW_AT_name("PPB3TRIPHI")
    1970                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1971                      .dwattr $C$DW$164, DW_AT_bit_offset(0x07)
    1972                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    1973                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1974                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1975              
    1976              $C$DW$165       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1978                      .dwattr $C$DW$165, DW_AT_name("PPB3TRIPLO")
    1979                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1980                      .dwattr $C$DW$165, DW_AT_bit_offset(0x06)
    1981                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    1982                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1983                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1984              
    1985              $C$DW$166       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$166, DW_AT_name("PPB3ZERO")
    1988                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PPB3ZERO")
    1989                      .dwattr $C$DW$166, DW_AT_bit_offset(0x05)
    1990                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    1991                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1992                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1993              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   39

    1994              $C$DW$167       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1996                      .dwattr $C$DW$167, DW_AT_name("rsvd3")
    1997                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd3")
    1998                      .dwattr $C$DW$167, DW_AT_bit_offset(0x04)
    1999                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2000                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2002              
    2003              $C$DW$168       .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2005                      .dwattr $C$DW$168, DW_AT_name("PPB4TRIPHI")
    2006                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2007                      .dwattr $C$DW$168, DW_AT_bit_offset(0x03)
    2008                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2009                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2011              
    2012              $C$DW$169       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2014                      .dwattr $C$DW$169, DW_AT_name("PPB4TRIPLO")
    2015                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2016                      .dwattr $C$DW$169, DW_AT_bit_offset(0x02)
    2017                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2018                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2020              
    2021              $C$DW$170       .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2023                      .dwattr $C$DW$170, DW_AT_name("PPB4ZERO")
    2024                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PPB4ZERO")
    2025                      .dwattr $C$DW$170, DW_AT_bit_offset(0x01)
    2026                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2027                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2028                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2029              
    2030              $C$DW$171       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2032                      .dwattr $C$DW$171, DW_AT_name("rsvd4")
    2033                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd4")
    2034                      .dwattr $C$DW$171, DW_AT_bit_offset(0x00)
    2035                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2036                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2037                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2038              
    2039                      .dwendtag $C$DW$T$32
    2040              
    2041              
    2042              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2043                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTSEL_REG")
    2044                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2045              $C$DW$172       .dwtag  DW_TAG_member
    2046                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2047                      .dwattr $C$DW$172, DW_AT_name("all")
    2048                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   40

    2049                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2050                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2051              
    2052              $C$DW$173       .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$32)
    2054                      .dwattr $C$DW$173, DW_AT_name("bit")
    2055                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_bit")
    2056                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2057                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2058              
    2059                      .dwendtag $C$DW$T$33
    2060              
    2061              
    2062              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2063                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTSTAT_BITS")
    2064                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2065              $C$DW$174       .dwtag  DW_TAG_member
    2066                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2067                      .dwattr $C$DW$174, DW_AT_name("PPB1TRIPHI")
    2068                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2069                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0f)
    2070                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2071                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2072                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2073              
    2074              $C$DW$175       .dwtag  DW_TAG_member
    2075                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2076                      .dwattr $C$DW$175, DW_AT_name("PPB1TRIPLO")
    2077                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2078                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0e)
    2079                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2080                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2081                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2082              
    2083              $C$DW$176       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2085                      .dwattr $C$DW$176, DW_AT_name("PPB1ZERO")
    2086                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PPB1ZERO")
    2087                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0d)
    2088                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2089                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2090                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2091              
    2092              $C$DW$177       .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2094                      .dwattr $C$DW$177, DW_AT_name("rsvd1")
    2095                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd1")
    2096                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0c)
    2097                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2098                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2100              
    2101              $C$DW$178       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2103                      .dwattr $C$DW$178, DW_AT_name("PPB2TRIPHI")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   41

    2104                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2105                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0b)
    2106                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2107                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2108                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2109              
    2110              $C$DW$179       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2112                      .dwattr $C$DW$179, DW_AT_name("PPB2TRIPLO")
    2113                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2114                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0a)
    2115                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2116                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2117                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2118              
    2119              $C$DW$180       .dwtag  DW_TAG_member
    2120                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2121                      .dwattr $C$DW$180, DW_AT_name("PPB2ZERO")
    2122                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_PPB2ZERO")
    2123                      .dwattr $C$DW$180, DW_AT_bit_offset(0x09)
    2124                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2125                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2126                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2127              
    2128              $C$DW$181       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2130                      .dwattr $C$DW$181, DW_AT_name("rsvd2")
    2131                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd2")
    2132                      .dwattr $C$DW$181, DW_AT_bit_offset(0x08)
    2133                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2134                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2135                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2136              
    2137              $C$DW$182       .dwtag  DW_TAG_member
    2138                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2139                      .dwattr $C$DW$182, DW_AT_name("PPB3TRIPHI")
    2140                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2141                      .dwattr $C$DW$182, DW_AT_bit_offset(0x07)
    2142                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2143                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2144                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2145              
    2146              $C$DW$183       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2148                      .dwattr $C$DW$183, DW_AT_name("PPB3TRIPLO")
    2149                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2150                      .dwattr $C$DW$183, DW_AT_bit_offset(0x06)
    2151                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2152                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2154              
    2155              $C$DW$184       .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2157                      .dwattr $C$DW$184, DW_AT_name("PPB3ZERO")
    2158                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_PPB3ZERO")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   42

    2159                      .dwattr $C$DW$184, DW_AT_bit_offset(0x05)
    2160                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2161                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2162                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2163              
    2164              $C$DW$185       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2166                      .dwattr $C$DW$185, DW_AT_name("rsvd3")
    2167                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd3")
    2168                      .dwattr $C$DW$185, DW_AT_bit_offset(0x04)
    2169                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2170                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2171                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2172              
    2173              $C$DW$186       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2175                      .dwattr $C$DW$186, DW_AT_name("PPB4TRIPHI")
    2176                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2177                      .dwattr $C$DW$186, DW_AT_bit_offset(0x03)
    2178                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2179                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2180                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2181              
    2182              $C$DW$187       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2184                      .dwattr $C$DW$187, DW_AT_name("PPB4TRIPLO")
    2185                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2186                      .dwattr $C$DW$187, DW_AT_bit_offset(0x02)
    2187                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2188                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2189                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2190              
    2191              $C$DW$188       .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2193                      .dwattr $C$DW$188, DW_AT_name("PPB4ZERO")
    2194                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_PPB4ZERO")
    2195                      .dwattr $C$DW$188, DW_AT_bit_offset(0x01)
    2196                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2197                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2199              
    2200              $C$DW$189       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2202                      .dwattr $C$DW$189, DW_AT_name("rsvd4")
    2203                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd4")
    2204                      .dwattr $C$DW$189, DW_AT_bit_offset(0x00)
    2205                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2206                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2208              
    2209                      .dwendtag $C$DW$T$34
    2210              
    2211              
    2212              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2213                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSTAT_REG")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   43

    2214                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2215              $C$DW$190       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2217                      .dwattr $C$DW$190, DW_AT_name("all")
    2218                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_all")
    2219                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2221              
    2222              $C$DW$191       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$34)
    2224                      .dwattr $C$DW$191, DW_AT_name("bit")
    2225                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_bit")
    2226                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2227                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2228              
    2229                      .dwendtag $C$DW$T$35
    2230              
    2231              
    2232              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2233                      .dwattr $C$DW$T$36, DW_AT_name("ADCINTFLGCLR_BITS")
    2234                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2235              $C$DW$192       .dwtag  DW_TAG_member
    2236                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2237                      .dwattr $C$DW$192, DW_AT_name("ADCINT1")
    2238                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_ADCINT1")
    2239                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0f)
    2240                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2241                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2242                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2243              
    2244              $C$DW$193       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2246                      .dwattr $C$DW$193, DW_AT_name("ADCINT2")
    2247                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_ADCINT2")
    2248                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0e)
    2249                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2250                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2251                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2252              
    2253              $C$DW$194       .dwtag  DW_TAG_member
    2254                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2255                      .dwattr $C$DW$194, DW_AT_name("ADCINT3")
    2256                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_ADCINT3")
    2257                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0d)
    2258                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2259                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2260                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2261              
    2262              $C$DW$195       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2264                      .dwattr $C$DW$195, DW_AT_name("ADCINT4")
    2265                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_ADCINT4")
    2266                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0c)
    2267                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2268                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   44

    2269                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2270              
    2271              $C$DW$196       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2273                      .dwattr $C$DW$196, DW_AT_name("rsvd1")
    2274                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd1")
    2275                      .dwattr $C$DW$196, DW_AT_bit_offset(0x00)
    2276                      .dwattr $C$DW$196, DW_AT_bit_size(0x0c)
    2277                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2279              
    2280                      .dwendtag $C$DW$T$36
    2281              
    2282              
    2283              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2284                      .dwattr $C$DW$T$37, DW_AT_name("ADCINTFLGCLR_REG")
    2285                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2286              $C$DW$197       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2288                      .dwattr $C$DW$197, DW_AT_name("all")
    2289                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_all")
    2290                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2291                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2292              
    2293              $C$DW$198       .dwtag  DW_TAG_member
    2294                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$36)
    2295                      .dwattr $C$DW$198, DW_AT_name("bit")
    2296                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_bit")
    2297                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2298                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2299              
    2300                      .dwendtag $C$DW$T$37
    2301              
    2302              
    2303              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2304                      .dwattr $C$DW$T$38, DW_AT_name("ADCINTFLG_BITS")
    2305                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2306              $C$DW$199       .dwtag  DW_TAG_member
    2307                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2308                      .dwattr $C$DW$199, DW_AT_name("ADCINT1")
    2309                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_ADCINT1")
    2310                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0f)
    2311                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2312                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2313                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2314              
    2315              $C$DW$200       .dwtag  DW_TAG_member
    2316                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2317                      .dwattr $C$DW$200, DW_AT_name("ADCINT2")
    2318                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_ADCINT2")
    2319                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0e)
    2320                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2321                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2322                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2323              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   45

    2324              $C$DW$201       .dwtag  DW_TAG_member
    2325                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2326                      .dwattr $C$DW$201, DW_AT_name("ADCINT3")
    2327                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_ADCINT3")
    2328                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0d)
    2329                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2330                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2331                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2332              
    2333              $C$DW$202       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2335                      .dwattr $C$DW$202, DW_AT_name("ADCINT4")
    2336                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_ADCINT4")
    2337                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0c)
    2338                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2339                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2340                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2341              
    2342              $C$DW$203       .dwtag  DW_TAG_member
    2343                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2344                      .dwattr $C$DW$203, DW_AT_name("rsvd1")
    2345                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd1")
    2346                      .dwattr $C$DW$203, DW_AT_bit_offset(0x00)
    2347                      .dwattr $C$DW$203, DW_AT_bit_size(0x0c)
    2348                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2349                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2350              
    2351                      .dwendtag $C$DW$T$38
    2352              
    2353              
    2354              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2355                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLG_REG")
    2356                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2357              $C$DW$204       .dwtag  DW_TAG_member
    2358                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2359                      .dwattr $C$DW$204, DW_AT_name("all")
    2360                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_all")
    2361                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2362                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2363              
    2364              $C$DW$205       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$38)
    2366                      .dwattr $C$DW$205, DW_AT_name("bit")
    2367                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_bit")
    2368                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2369                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2370              
    2371                      .dwendtag $C$DW$T$39
    2372              
    2373              
    2374              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2375                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTOVFCLR_BITS")
    2376                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2377              $C$DW$206       .dwtag  DW_TAG_member
    2378                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   46

    2379                      .dwattr $C$DW$206, DW_AT_name("ADCINT1")
    2380                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_ADCINT1")
    2381                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0f)
    2382                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2383                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2384                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2385              
    2386              $C$DW$207       .dwtag  DW_TAG_member
    2387                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2388                      .dwattr $C$DW$207, DW_AT_name("ADCINT2")
    2389                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_ADCINT2")
    2390                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0e)
    2391                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2392                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2393                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2394              
    2395              $C$DW$208       .dwtag  DW_TAG_member
    2396                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2397                      .dwattr $C$DW$208, DW_AT_name("ADCINT3")
    2398                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_ADCINT3")
    2399                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0d)
    2400                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2401                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2402                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2403              
    2404              $C$DW$209       .dwtag  DW_TAG_member
    2405                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2406                      .dwattr $C$DW$209, DW_AT_name("ADCINT4")
    2407                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_ADCINT4")
    2408                      .dwattr $C$DW$209, DW_AT_bit_offset(0x0c)
    2409                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2410                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2411                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2412              
    2413              $C$DW$210       .dwtag  DW_TAG_member
    2414                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2415                      .dwattr $C$DW$210, DW_AT_name("rsvd1")
    2416                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd1")
    2417                      .dwattr $C$DW$210, DW_AT_bit_offset(0x00)
    2418                      .dwattr $C$DW$210, DW_AT_bit_size(0x0c)
    2419                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2420                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2421              
    2422                      .dwendtag $C$DW$T$40
    2423              
    2424              
    2425              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2426                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTOVFCLR_REG")
    2427                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2428              $C$DW$211       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2430                      .dwattr $C$DW$211, DW_AT_name("all")
    2431                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_all")
    2432                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2433                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   47

    2434              
    2435              $C$DW$212       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$40)
    2437                      .dwattr $C$DW$212, DW_AT_name("bit")
    2438                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_bit")
    2439                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2440                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2441              
    2442                      .dwendtag $C$DW$T$41
    2443              
    2444              
    2445              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2446                      .dwattr $C$DW$T$42, DW_AT_name("ADCINTOVF_BITS")
    2447                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2448              $C$DW$213       .dwtag  DW_TAG_member
    2449                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2450                      .dwattr $C$DW$213, DW_AT_name("ADCINT1")
    2451                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_ADCINT1")
    2452                      .dwattr $C$DW$213, DW_AT_bit_offset(0x0f)
    2453                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2454                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2455                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2456              
    2457              $C$DW$214       .dwtag  DW_TAG_member
    2458                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2459                      .dwattr $C$DW$214, DW_AT_name("ADCINT2")
    2460                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_ADCINT2")
    2461                      .dwattr $C$DW$214, DW_AT_bit_offset(0x0e)
    2462                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    2463                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2464                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2465              
    2466              $C$DW$215       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2468                      .dwattr $C$DW$215, DW_AT_name("ADCINT3")
    2469                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_ADCINT3")
    2470                      .dwattr $C$DW$215, DW_AT_bit_offset(0x0d)
    2471                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    2472                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2473                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2474              
    2475              $C$DW$216       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2477                      .dwattr $C$DW$216, DW_AT_name("ADCINT4")
    2478                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_ADCINT4")
    2479                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0c)
    2480                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    2481                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2482                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2483              
    2484              $C$DW$217       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2486                      .dwattr $C$DW$217, DW_AT_name("rsvd1")
    2487                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_rsvd1")
    2488                      .dwattr $C$DW$217, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   48

    2489                      .dwattr $C$DW$217, DW_AT_bit_size(0x0c)
    2490                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2491                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2492              
    2493                      .dwendtag $C$DW$T$42
    2494              
    2495              
    2496              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2497                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTOVF_REG")
    2498                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2499              $C$DW$218       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2501                      .dwattr $C$DW$218, DW_AT_name("all")
    2502                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_all")
    2503                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2504                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2505              
    2506              $C$DW$219       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$42)
    2508                      .dwattr $C$DW$219, DW_AT_name("bit")
    2509                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_bit")
    2510                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2511                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2512              
    2513                      .dwendtag $C$DW$T$43
    2514              
    2515              
    2516              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2517                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTSEL1N2_BITS")
    2518                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2519              $C$DW$220       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2521                      .dwattr $C$DW$220, DW_AT_name("INT1SEL")
    2522                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_INT1SEL")
    2523                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0c)
    2524                      .dwattr $C$DW$220, DW_AT_bit_size(0x04)
    2525                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2526                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2527              
    2528              $C$DW$221       .dwtag  DW_TAG_member
    2529                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2530                      .dwattr $C$DW$221, DW_AT_name("rsvd1")
    2531                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_rsvd1")
    2532                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0b)
    2533                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    2534                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2535                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2536              
    2537              $C$DW$222       .dwtag  DW_TAG_member
    2538                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2539                      .dwattr $C$DW$222, DW_AT_name("INT1E")
    2540                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_INT1E")
    2541                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0a)
    2542                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    2543                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   49

    2544                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2545              
    2546              $C$DW$223       .dwtag  DW_TAG_member
    2547                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
