TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Sat Nov 14 12:25:47 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drv8305.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DRV8305_SPI_Write")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DRV8305_SPI_Write")

     626 00000106 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |158| 
     627                      .dwpsn  file "../drv8305.c",line 157,column 2,is_stmt,isa 0
     628 00000107 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |157| 
     629                      .dwpsn  file "../drv8305.c",line 158,column 2,is_stmt,isa 0
     630 00000108 9A02          MOVB      AL,#2                 ; [CPU_ALU] |158| 
     631              $C$DW$40        .dwtag  DW_TAG_TI_branch
     632                      .dwattr $C$DW$40, DW_AT_low_pc(0x00)
     633                      .dwattr $C$DW$40, DW_AT_name("_DRV8305_SPI_Read")
     634                      .dwattr $C$DW$40, DW_AT_TI_call
     635              
     636 00000109 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |158| 
         0000010a 0000 
     637                      ; call occurs [#_DRV8305_SPI_Read] ; [] |158| 
     638 0000010b 8D00          MOVL      XAR0,#317             ; [CPU_ALU] |158| 
         0000010c 013D 
     639 0000010d CCA9          AND       AL,AL,#0x07e7         ; [CPU_ALU] |158| 
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   14

         0000010e 07E7 
     640                      .dwpsn  file "../drv8305.c",line 159,column 2,is_stmt,isa 0
     641 0000010f 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |159| 
     642                      .dwpsn  file "../drv8305.c",line 158,column 2,is_stmt,isa 0
     643 00000110 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |158| 
     644                      .dwpsn  file "../drv8305.c",line 159,column 2,is_stmt,isa 0
     645 00000111 9A03          MOVB      AL,#3                 ; [CPU_ALU] |159| 
     646              $C$DW$41        .dwtag  DW_TAG_TI_branch
     647                      .dwattr $C$DW$41, DW_AT_low_pc(0x00)
     648                      .dwattr $C$DW$41, DW_AT_name("_DRV8305_SPI_Read")
     649                      .dwattr $C$DW$41, DW_AT_TI_call
     650              
     651 00000112 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |159| 
         00000113 0000 
     652                      ; call occurs [#_DRV8305_SPI_Read] ; [] |159| 
     653 00000114 8D00          MOVL      XAR0,#318             ; [CPU_ALU] |159| 
         00000115 013E 
     654 00000116 CCA9          AND       AL,AL,#0x0777         ; [CPU_ALU] |159| 
         00000117 0777 
     655                      .dwpsn  file "../drv8305.c",line 160,column 2,is_stmt,isa 0
     656 00000118 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |160| 
     657                      .dwpsn  file "../drv8305.c",line 159,column 2,is_stmt,isa 0
     658 00000119 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |159| 
     659                      .dwpsn  file "../drv8305.c",line 160,column 2,is_stmt,isa 0
     660 0000011a 9A04          MOVB      AL,#4                 ; [CPU_ALU] |160| 
     661              $C$DW$42        .dwtag  DW_TAG_TI_branch
     662                      .dwattr $C$DW$42, DW_AT_low_pc(0x00)
     663                      .dwattr $C$DW$42, DW_AT_name("_DRV8305_SPI_Read")
     664                      .dwattr $C$DW$42, DW_AT_TI_call
     665              
     666 0000011b 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |160| 
         0000011c 0000 
     667                      ; call occurs [#_DRV8305_SPI_Read] ; [] |160| 
     668 0000011d 8D00          MOVL      XAR0,#319             ; [CPU_ALU] |160| 
         0000011e 013F 
     669 0000011f CCA9          AND       AL,AL,#0x07e0         ; [CPU_ALU] |160| 
         00000120 07E0 
     670 00000121 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |160| 
     671 00000122 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     672                      .dwcfi  cfa_offset, -2
     673                      .dwcfi  restore_reg, 7
     674              $C$DW$43        .dwtag  DW_TAG_TI_branch
     675                      .dwattr $C$DW$43, DW_AT_low_pc(0x00)
     676                      .dwattr $C$DW$43, DW_AT_TI_return
     677              
     678 00000123 0006          LRETR     ; [CPU_ALU] 
     679                      ; return occurs ; [] 
     680                      .dwattr $C$DW$36, DW_AT_TI_end_file("../drv8305.c")
     681                      .dwattr $C$DW$36, DW_AT_TI_end_line(0xb7)
     682                      .dwattr $C$DW$36, DW_AT_TI_end_column(0x01)
     683                      .dwendentry
     684                      .dwendtag $C$DW$36
     685              
     686              ;**************************************************************
     687              ;* UNDEFINED EXTERNAL REFERENCES                              *
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   15

     688              ;**************************************************************
     689                      .global _DRV8305_SPI_Write
     690                      .global _DRV8305_SPI_Read
     691              
     692              ;***************************************************************
     693              ;* TYPE INFORMATION                                            *
     694              ;***************************************************************
     695              
     696              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     697                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     698              $C$DW$44        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     700                      .dwattr $C$DW$44, DW_AT_name("As")
     701                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_As")
     702                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     704              
     705              $C$DW$45        .dwtag  DW_TAG_member
     706                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     707                      .dwattr $C$DW$45, DW_AT_name("Bs")
     708                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_Bs")
     709                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     710                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     711              
     712              $C$DW$46        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     714                      .dwattr $C$DW$46, DW_AT_name("Cs")
     715                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_Cs")
     716                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     717                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     718              
     719              $C$DW$47        .dwtag  DW_TAG_member
     720                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     721                      .dwattr $C$DW$47, DW_AT_name("Alpha")
     722                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_Alpha")
     723                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     724                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     725              
     726              $C$DW$48        .dwtag  DW_TAG_member
     727                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     728                      .dwattr $C$DW$48, DW_AT_name("Beta")
     729                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_Beta")
     730                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     731                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     732              
     733                      .dwendtag $C$DW$T$20
     734              
     735              $C$DW$T$65      .dwtag  DW_TAG_typedef
     736                      .dwattr $C$DW$T$65, DW_AT_name("CLARKE")
     737                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$20)
     738                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     739              
     740              
     741              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     742                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   16

     743              $C$DW$49        .dwtag  DW_TAG_member
     744                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     745                      .dwattr $C$DW$49, DW_AT_name("Alpha")
     746                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_Alpha")
     747                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     748                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     749              
     750              $C$DW$50        .dwtag  DW_TAG_member
     751                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     752                      .dwattr $C$DW$50, DW_AT_name("Beta")
     753                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_Beta")
     754                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     755                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     756              
     757              $C$DW$51        .dwtag  DW_TAG_member
     758                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     759                      .dwattr $C$DW$51, DW_AT_name("Angle")
     760                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_Angle")
     761                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     762                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     763              
     764              $C$DW$52        .dwtag  DW_TAG_member
     765                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     766                      .dwattr $C$DW$52, DW_AT_name("Ds")
     767                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_Ds")
     768                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     769                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     770              
     771              $C$DW$53        .dwtag  DW_TAG_member
     772                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     773                      .dwattr $C$DW$53, DW_AT_name("Qs")
     774                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_Qs")
     775                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     776                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     777              
     778              $C$DW$54        .dwtag  DW_TAG_member
     779                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     780                      .dwattr $C$DW$54, DW_AT_name("Sine")
     781                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Sine")
     782                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     783                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     784              
     785              $C$DW$55        .dwtag  DW_TAG_member
     786                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     787                      .dwattr $C$DW$55, DW_AT_name("Cosine")
     788                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_Cosine")
     789                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     790                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     791              
     792                      .dwendtag $C$DW$T$21
     793              
     794              $C$DW$T$66      .dwtag  DW_TAG_typedef
     795                      .dwattr $C$DW$T$66, DW_AT_name("PARK")
     796                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
     797                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   17

     798              
     799              
     800              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     801                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     802              $C$DW$56        .dwtag  DW_TAG_member
     803                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     804                      .dwattr $C$DW$56, DW_AT_name("Alpha")
     805                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_Alpha")
     806                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     807                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     808              
     809              $C$DW$57        .dwtag  DW_TAG_member
     810                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     811                      .dwattr $C$DW$57, DW_AT_name("Beta")
     812                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_Beta")
     813                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     814                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     815              
     816              $C$DW$58        .dwtag  DW_TAG_member
     817                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     818                      .dwattr $C$DW$58, DW_AT_name("Angle")
     819                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_Angle")
     820                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     821                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     822              
     823              $C$DW$59        .dwtag  DW_TAG_member
     824                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     825                      .dwattr $C$DW$59, DW_AT_name("Ds")
     826                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_Ds")
     827                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     828                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     829              
     830              $C$DW$60        .dwtag  DW_TAG_member
     831                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     832                      .dwattr $C$DW$60, DW_AT_name("Qs")
     833                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Qs")
     834                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     835                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     836              
     837              $C$DW$61        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     839                      .dwattr $C$DW$61, DW_AT_name("Sine")
     840                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Sine")
     841                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     842                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     843              
     844              $C$DW$62        .dwtag  DW_TAG_member
     845                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     846                      .dwattr $C$DW$62, DW_AT_name("Cosine")
     847                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Cosine")
     848                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     849                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     850              
     851                      .dwendtag $C$DW$T$22
     852              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   18

     853              $C$DW$T$67      .dwtag  DW_TAG_typedef
     854                      .dwattr $C$DW$T$67, DW_AT_name("IPARK")
     855                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
     856                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     857              
     858              
     859              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     860                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
     861              $C$DW$63        .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     863                      .dwattr $C$DW$63, DW_AT_name("Ref")
     864                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_Ref")
     865                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     866                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     867              
     868              $C$DW$64        .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     870                      .dwattr $C$DW$64, DW_AT_name("Fbk")
     871                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_Fbk")
     872                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     873                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     874              
     875              $C$DW$65        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     877                      .dwattr $C$DW$65, DW_AT_name("Out")
     878                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Out")
     879                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     880                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     881              
     882              $C$DW$66        .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     884                      .dwattr $C$DW$66, DW_AT_name("Kp")
     885                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Kp")
     886                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     887                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     888              
     889              $C$DW$67        .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     891                      .dwattr $C$DW$67, DW_AT_name("Ki")
     892                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Ki")
     893                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     894                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     895              
     896              $C$DW$68        .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     898                      .dwattr $C$DW$68, DW_AT_name("Umax")
     899                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Umax")
     900                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     901                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     902              
     903              $C$DW$69        .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     905                      .dwattr $C$DW$69, DW_AT_name("Umin")
     906                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Umin")
     907                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   19

     908                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     909              
     910              $C$DW$70        .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     912                      .dwattr $C$DW$70, DW_AT_name("up")
     913                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_up")
     914                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     915                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     916              
     917              $C$DW$71        .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     919                      .dwattr $C$DW$71, DW_AT_name("ui")
     920                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_ui")
     921                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     922                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     923              
     924              $C$DW$72        .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     926                      .dwattr $C$DW$72, DW_AT_name("v1")
     927                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_v1")
     928                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     929                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     930              
     931              $C$DW$73        .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     933                      .dwattr $C$DW$73, DW_AT_name("i1")
     934                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_i1")
     935                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     936                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     937              
     938              $C$DW$74        .dwtag  DW_TAG_member
     939                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     940                      .dwattr $C$DW$74, DW_AT_name("w1")
     941                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_w1")
     942                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     943                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     944              
     945                      .dwendtag $C$DW$T$23
     946              
     947              $C$DW$T$68      .dwtag  DW_TAG_typedef
     948                      .dwattr $C$DW$T$68, DW_AT_name("PI_CONTROLLER")
     949                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
     950                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     951              
     952              
     953              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     954                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
     955              $C$DW$75        .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     957                      .dwattr $C$DW$75, DW_AT_name("Ref")
     958                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_Ref")
     959                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     960                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     961              
     962              $C$DW$76        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   20

     963                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     964                      .dwattr $C$DW$76, DW_AT_name("Fbk")
     965                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Fbk")
     966                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     967                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     968              
     969              $C$DW$77        .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     971                      .dwattr $C$DW$77, DW_AT_name("Out")
     972                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Out")
     973                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     974                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     975              
     976              $C$DW$78        .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     978                      .dwattr $C$DW$78, DW_AT_name("c1")
     979                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_c1")
     980                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     981                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     982              
     983              $C$DW$79        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$79, DW_AT_name("c2")
     986                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_c2")
     987                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     988                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     989              
     990                      .dwendtag $C$DW$T$24
     991              
     992              $C$DW$T$27      .dwtag  DW_TAG_typedef
     993                      .dwattr $C$DW$T$27, DW_AT_name("PID_TERMINALS")
     994                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
     995                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     996              
     997              
     998              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     999                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    1000              $C$DW$80        .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1002                      .dwattr $C$DW$80, DW_AT_name("Kr")
    1003                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_Kr")
    1004                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1005                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1006              
    1007              $C$DW$81        .dwtag  DW_TAG_member
    1008                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1009                      .dwattr $C$DW$81, DW_AT_name("Kp")
    1010                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_Kp")
    1011                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1012                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1013              
    1014              $C$DW$82        .dwtag  DW_TAG_member
    1015                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1016                      .dwattr $C$DW$82, DW_AT_name("Ki")
    1017                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Ki")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   21

    1018                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1019                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1020              
    1021              $C$DW$83        .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1023                      .dwattr $C$DW$83, DW_AT_name("Kd")
    1024                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Kd")
    1025                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1026                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1027              
    1028              $C$DW$84        .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1030                      .dwattr $C$DW$84, DW_AT_name("Km")
    1031                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Km")
    1032                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1033                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1034              
    1035              $C$DW$85        .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1037                      .dwattr $C$DW$85, DW_AT_name("Umax")
    1038                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Umax")
    1039                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1040                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1041              
    1042              $C$DW$86        .dwtag  DW_TAG_member
    1043                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1044                      .dwattr $C$DW$86, DW_AT_name("Umin")
    1045                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Umin")
    1046                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1047                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1048              
    1049                      .dwendtag $C$DW$T$25
    1050              
    1051              $C$DW$T$28      .dwtag  DW_TAG_typedef
    1052                      .dwattr $C$DW$T$28, DW_AT_name("PID_PARAMETERS")
    1053                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    1054                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1055              
    1056              
    1057              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1058                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    1059              $C$DW$87        .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1061                      .dwattr $C$DW$87, DW_AT_name("up")
    1062                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_up")
    1063                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1065              
    1066              $C$DW$88        .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1068                      .dwattr $C$DW$88, DW_AT_name("ui")
    1069                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ui")
    1070                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1071                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1072              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   22

    1073              $C$DW$89        .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1075                      .dwattr $C$DW$89, DW_AT_name("ud")
    1076                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ud")
    1077                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1078                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1079              
    1080              $C$DW$90        .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1082                      .dwattr $C$DW$90, DW_AT_name("v1")
    1083                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_v1")
    1084                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1085                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1086              
    1087              $C$DW$91        .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1089                      .dwattr $C$DW$91, DW_AT_name("i1")
    1090                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_i1")
    1091                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1092                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1093              
    1094              $C$DW$92        .dwtag  DW_TAG_member
    1095                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1096                      .dwattr $C$DW$92, DW_AT_name("d1")
    1097                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_d1")
    1098                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1099                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1100              
    1101              $C$DW$93        .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1103                      .dwattr $C$DW$93, DW_AT_name("d2")
    1104                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_d2")
    1105                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1106                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1107              
    1108              $C$DW$94        .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1110                      .dwattr $C$DW$94, DW_AT_name("w1")
    1111                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_w1")
    1112                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1113                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1114              
    1115                      .dwendtag $C$DW$T$26
    1116              
    1117              $C$DW$T$29      .dwtag  DW_TAG_typedef
    1118                      .dwattr $C$DW$T$29, DW_AT_name("PID_DATA")
    1119                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    1120                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1121              
    1122              
    1123              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1124                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
    1125              $C$DW$95        .dwtag  DW_TAG_member
    1126                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$27)
    1127                      .dwattr $C$DW$95, DW_AT_name("term")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   23

    1128                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_term")
    1129                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1130                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1131              
    1132              $C$DW$96        .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$28)
    1134                      .dwattr $C$DW$96, DW_AT_name("param")
    1135                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_param")
    1136                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1137                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1138              
    1139              $C$DW$97        .dwtag  DW_TAG_member
    1140                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$29)
    1141                      .dwattr $C$DW$97, DW_AT_name("data")
    1142                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_data")
    1143                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1144                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1145              
    1146                      .dwendtag $C$DW$T$30
    1147              
    1148              $C$DW$T$69      .dwtag  DW_TAG_typedef
    1149                      .dwattr $C$DW$T$69, DW_AT_name("PID_CONTROLLER")
    1150                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$30)
    1151                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1152              
    1153              
    1154              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1155                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
    1156              $C$DW$98        .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1158                      .dwattr $C$DW$98, DW_AT_name("Ualpha")
    1159                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_Ualpha")
    1160                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1162              
    1163              $C$DW$99        .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1165                      .dwattr $C$DW$99, DW_AT_name("Ubeta")
    1166                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_Ubeta")
    1167                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1168                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1169              
    1170              $C$DW$100       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1172                      .dwattr $C$DW$100, DW_AT_name("Ta")
    1173                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_Ta")
    1174                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1175                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1176              
    1177              $C$DW$101       .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1179                      .dwattr $C$DW$101, DW_AT_name("Tb")
    1180                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_Tb")
    1181                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1182                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   24

    1183              
    1184              $C$DW$102       .dwtag  DW_TAG_member
    1185                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1186                      .dwattr $C$DW$102, DW_AT_name("Tc")
    1187                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_Tc")
    1188                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1189                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1190              
    1191              $C$DW$103       .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1193                      .dwattr $C$DW$103, DW_AT_name("tmp1")
    1194                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_tmp1")
    1195                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1196                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1197              
    1198              $C$DW$104       .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1200                      .dwattr $C$DW$104, DW_AT_name("tmp2")
    1201                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_tmp2")
    1202                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1203                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1204              
    1205              $C$DW$105       .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1207                      .dwattr $C$DW$105, DW_AT_name("tmp3")
    1208                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_tmp3")
    1209                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1210                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1211              
    1212              $C$DW$106       .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$31)
    1214                      .dwattr $C$DW$106, DW_AT_name("VecSector")
    1215                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_VecSector")
    1216                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1217                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1218              
    1219                      .dwendtag $C$DW$T$32
    1220              
    1221              $C$DW$T$70      .dwtag  DW_TAG_typedef
    1222                      .dwattr $C$DW$T$70, DW_AT_name("SVGEN")
    1223                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
    1224                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1225              
    1226              
    1227              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1228                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    1229              $C$DW$107       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1231                      .dwattr $C$DW$107, DW_AT_name("TargetValue")
    1232                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_TargetValue")
    1233                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1235              
    1236              $C$DW$108       .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   25

    1238                      .dwattr $C$DW$108, DW_AT_name("RampDelayMax")
    1239                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_RampDelayMax")
    1240                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1241                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1242              
    1243              $C$DW$109       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1245                      .dwattr $C$DW$109, DW_AT_name("RampLowLimit")
    1246                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_RampLowLimit")
    1247                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1248                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1249              
    1250              $C$DW$110       .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1252                      .dwattr $C$DW$110, DW_AT_name("RampHighLimit")
    1253                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_RampHighLimit")
    1254                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1255                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1256              
    1257              $C$DW$111       .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$33)
    1259                      .dwattr $C$DW$111, DW_AT_name("RampDelayCount")
    1260                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_RampDelayCount")
    1261                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1262                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1263              
    1264              $C$DW$112       .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1266                      .dwattr $C$DW$112, DW_AT_name("SetpointValue")
    1267                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_SetpointValue")
    1268                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1269                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1270              
    1271              $C$DW$113       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$33)
    1273                      .dwattr $C$DW$113, DW_AT_name("EqualFlag")
    1274                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_EqualFlag")
    1275                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1276                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1277              
    1278              $C$DW$114       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1280                      .dwattr $C$DW$114, DW_AT_name("Tmp")
    1281                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_Tmp")
    1282                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1283                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1284              
    1285                      .dwendtag $C$DW$T$34
    1286              
    1287              $C$DW$T$71      .dwtag  DW_TAG_typedef
    1288                      .dwattr $C$DW$T$71, DW_AT_name("RMPCNTL")
    1289                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    1290                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1291              
    1292              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   26

    1293              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1294                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    1295              $C$DW$115       .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1297                      .dwattr $C$DW$115, DW_AT_name("Freq")
    1298                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_Freq")
    1299                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1300                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1301              
    1302              $C$DW$116       .dwtag  DW_TAG_member
    1303                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1304                      .dwattr $C$DW$116, DW_AT_name("StepAngleMax")
    1305                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_StepAngleMax")
    1306                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1307                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1308              
    1309              $C$DW$117       .dwtag  DW_TAG_member
    1310                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1311                      .dwattr $C$DW$117, DW_AT_name("Angle")
    1312                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_Angle")
    1313                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1314                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1315              
    1316              $C$DW$118       .dwtag  DW_TAG_member
    1317                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1318                      .dwattr $C$DW$118, DW_AT_name("Gain")
    1319                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_Gain")
    1320                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1321                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1322              
    1323              $C$DW$119       .dwtag  DW_TAG_member
    1324                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1325                      .dwattr $C$DW$119, DW_AT_name("Out")
    1326                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_Out")
    1327                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1328                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1329              
    1330              $C$DW$120       .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1332                      .dwattr $C$DW$120, DW_AT_name("Offset")
    1333                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_Offset")
    1334                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1335                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1336              
    1337                      .dwendtag $C$DW$T$35
    1338              
    1339              $C$DW$T$72      .dwtag  DW_TAG_typedef
    1340                      .dwattr $C$DW$T$72, DW_AT_name("RAMPGEN")
    1341                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    1342                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1343              
    1344              
    1345              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1346                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
    1347              $C$DW$121       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   27

    1348                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1349                      .dwattr $C$DW$121, DW_AT_name("DcBusVolt")
    1350                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_DcBusVolt")
    1351                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1353              
    1354              $C$DW$122       .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1356                      .dwattr $C$DW$122, DW_AT_name("MfuncV1")
    1357                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_MfuncV1")
    1358                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1359                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1360              
    1361              $C$DW$123       .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1363                      .dwattr $C$DW$123, DW_AT_name("MfuncV2")
    1364                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_MfuncV2")
    1365                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1366                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1367              
    1368              $C$DW$124       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1370                      .dwattr $C$DW$124, DW_AT_name("MfuncV3")
    1371                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_MfuncV3")
    1372                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1373                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1374              
    1375              $C$DW$125       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$31)
    1377                      .dwattr $C$DW$125, DW_AT_name("OutOfPhase")
    1378                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_OutOfPhase")
    1379                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1380                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1381              
    1382              $C$DW$126       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1384                      .dwattr $C$DW$126, DW_AT_name("VphaseA")
    1385                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_VphaseA")
    1386                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1387                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1388              
    1389              $C$DW$127       .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1391                      .dwattr $C$DW$127, DW_AT_name("VphaseB")
    1392                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_VphaseB")
    1393                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1394                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1395              
    1396              $C$DW$128       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1398                      .dwattr $C$DW$128, DW_AT_name("VphaseC")
    1399                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_VphaseC")
    1400                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1401                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1402              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   28

    1403              $C$DW$129       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1405                      .dwattr $C$DW$129, DW_AT_name("Valpha")
    1406                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_Valpha")
    1407                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1408                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1409              
    1410              $C$DW$130       .dwtag  DW_TAG_member
    1411                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1412                      .dwattr $C$DW$130, DW_AT_name("Vbeta")
    1413                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_Vbeta")
    1414                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1415                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1416              
    1417              $C$DW$131       .dwtag  DW_TAG_member
    1418                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1419                      .dwattr $C$DW$131, DW_AT_name("temp")
    1420                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_temp")
    1421                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1422                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1423              
    1424                      .dwendtag $C$DW$T$36
    1425              
    1426              $C$DW$T$73      .dwtag  DW_TAG_typedef
    1427                      .dwattr $C$DW$T$73, DW_AT_name("PHASEVOLTAGE")
    1428                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$36)
    1429                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1430              
    1431              
    1432              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1433                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    1434              $C$DW$132       .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1436                      .dwattr $C$DW$132, DW_AT_name("ElecTheta")
    1437                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ElecTheta")
    1438                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1439                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1440              
    1441              $C$DW$133       .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$33)
    1443                      .dwattr $C$DW$133, DW_AT_name("DirectionQep")
    1444                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_DirectionQep")
    1445                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1446                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1447              
    1448              $C$DW$134       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1450                      .dwattr $C$DW$134, DW_AT_name("OldElecTheta")
    1451                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_OldElecTheta")
    1452                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1453                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1454              
    1455              $C$DW$135       .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1457                      .dwattr $C$DW$135, DW_AT_name("Speed")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   29

    1458                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_Speed")
    1459                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1460                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1461              
    1462              $C$DW$136       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$33)
    1464                      .dwattr $C$DW$136, DW_AT_name("BaseRpm")
    1465                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_BaseRpm")
    1466                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1467                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1468              
    1469              $C$DW$137       .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$37)
    1471                      .dwattr $C$DW$137, DW_AT_name("K1")
    1472                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_K1")
    1473                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1474                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1475              
    1476              $C$DW$138       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1478                      .dwattr $C$DW$138, DW_AT_name("K2")
    1479                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_K2")
    1480                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1481                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1482              
    1483              $C$DW$139       .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1485                      .dwattr $C$DW$139, DW_AT_name("K3")
    1486                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_K3")
    1487                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1488                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1489              
    1490              $C$DW$140       .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$38)
    1492                      .dwattr $C$DW$140, DW_AT_name("SpeedRpm")
    1493                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_SpeedRpm")
    1494                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1495                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1496              
    1497              $C$DW$141       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1499                      .dwattr $C$DW$141, DW_AT_name("Tmp")
    1500                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_Tmp")
    1501                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1502                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1503              
    1504                      .dwendtag $C$DW$T$39
    1505              
    1506              $C$DW$T$74      .dwtag  DW_TAG_typedef
    1507                      .dwattr $C$DW$T$74, DW_AT_name("SPEED_MEAS_QEP")
    1508                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$39)
    1509                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1510              
    1511              
    1512              $C$DW$T$41      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   30

    1513                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    1514              $C$DW$142       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$40)
    1516                      .dwattr $C$DW$142, DW_AT_name("ElecTheta")
    1517                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ElecTheta")
    1518                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1519                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1520              
    1521              $C$DW$143       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$40)
    1523                      .dwattr $C$DW$143, DW_AT_name("MechTheta")
    1524                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_MechTheta")
    1525                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1526                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1527              
    1528              $C$DW$144       .dwtag  DW_TAG_member
    1529                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$31)
    1530                      .dwattr $C$DW$144, DW_AT_name("DirectionQep")
    1531                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_DirectionQep")
    1532                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1533                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1534              
    1535              $C$DW$145       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$31)
    1537                      .dwattr $C$DW$145, DW_AT_name("QepPeriod")
    1538                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_QepPeriod")
    1539                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1540                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1541              
    1542              $C$DW$146       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$33)
    1544                      .dwattr $C$DW$146, DW_AT_name("QepCountIndex")
    1545                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_QepCountIndex")
    1546                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1547                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1548              
    1549              $C$DW$147       .dwtag  DW_TAG_member
    1550                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$38)
    1551                      .dwattr $C$DW$147, DW_AT_name("RawTheta")
    1552                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_RawTheta")
    1553                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1554                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1555              
    1556              $C$DW$148       .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$40)
    1558                      .dwattr $C$DW$148, DW_AT_name("MechScaler")
    1559                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_MechScaler")
    1560                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1561                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1562              
    1563              $C$DW$149       .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$31)
    1565                      .dwattr $C$DW$149, DW_AT_name("LineEncoder")
    1566                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_LineEncoder")
    1567                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   31

    1568                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1569              
    1570              $C$DW$150       .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$31)
    1572                      .dwattr $C$DW$150, DW_AT_name("PolePairs")
    1573                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PolePairs")
    1574                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1575                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1576              
    1577              $C$DW$151       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$38)
    1579                      .dwattr $C$DW$151, DW_AT_name("CalibratedAngle")
    1580                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_CalibratedAngle")
    1581                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1582                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1583              
    1584              $C$DW$152       .dwtag  DW_TAG_member
    1585                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$31)
    1586                      .dwattr $C$DW$152, DW_AT_name("IndexSyncFlag")
    1587                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_IndexSyncFlag")
    1588                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1589                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591                      .dwendtag $C$DW$T$41
    1592              
    1593              $C$DW$T$75      .dwtag  DW_TAG_typedef
    1594                      .dwattr $C$DW$T$75, DW_AT_name("QEP")
    1595                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    1596                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1597              
    1598              
    1599              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1600                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x07)
    1601              $C$DW$153       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$42)
    1603                      .dwattr $C$DW$153, DW_AT_name("stat_reg1")
    1604                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_stat_reg1")
    1605                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1606                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1607              
    1608              $C$DW$154       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$43)
    1610                      .dwattr $C$DW$154, DW_AT_name("stat_reg2")
    1611                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_stat_reg2")
    1612                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1613                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1614              
    1615              $C$DW$155       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$44)
    1617                      .dwattr $C$DW$155, DW_AT_name("cntrl_reg1")
    1618                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_cntrl_reg1")
    1619                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1620                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1621              
    1622              $C$DW$156       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   32

    1623                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$45)
    1624                      .dwattr $C$DW$156, DW_AT_name("cntrl_reg2")
    1625                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_cntrl_reg2")
    1626                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1627                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1628              
    1629              $C$DW$157       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$31)
    1631                      .dwattr $C$DW$157, DW_AT_name("readCntrl1")
    1632                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_readCntrl1")
    1633                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1634                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1635              
    1636              $C$DW$158       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$31)
    1638                      .dwattr $C$DW$158, DW_AT_name("readCntrl2")
    1639                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_readCntrl2")
    1640                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1641                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1642              
    1643              $C$DW$159       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$31)
    1645                      .dwattr $C$DW$159, DW_AT_name("DRV_fault")
    1646                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_DRV_fault")
    1647                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1648                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1649              
    1650                      .dwendtag $C$DW$T$46
    1651              
    1652              $C$DW$T$76      .dwtag  DW_TAG_typedef
    1653                      .dwattr $C$DW$T$76, DW_AT_name("DRV8301_Vars")
    1654                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$46)
    1655                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1656              
    1657              
    1658              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    1659                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x15)
    1660              $C$DW$160       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$31)
    1662                      .dwattr $C$DW$160, DW_AT_name("Rsvd0")
    1663                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_Rsvd0")
    1664                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1665                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1666              
    1667              $C$DW$161       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$47)
    1669                      .dwattr $C$DW$161, DW_AT_name("status1_wwd")
    1670                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_status1_wwd")
    1671                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1672                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1673              
    1674              $C$DW$162       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$48)
    1676                      .dwattr $C$DW$162, DW_AT_name("status2_ov_vds")
    1677                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_status2_ov_vds")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   33

    1678                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1679                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1680              
    1681              $C$DW$163       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$49)
    1683                      .dwattr $C$DW$163, DW_AT_name("status3_IC")
    1684                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_status3_IC")
    1685                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1686                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1687              
    1688              $C$DW$164       .dwtag  DW_TAG_member
    1689                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$50)
    1690                      .dwattr $C$DW$164, DW_AT_name("status4_gd_Vgs")
    1691                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    1692                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1693                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1694              
    1695              $C$DW$165       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$51)
    1697                      .dwattr $C$DW$165, DW_AT_name("cntrl5_hs_gd")
    1698                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    1699                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1700                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1701              
    1702              $C$DW$166       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$52)
    1704                      .dwattr $C$DW$166, DW_AT_name("cntrl6_ls_gd")
    1705                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    1706                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1707                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1708              
    1709              $C$DW$167       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$53)
    1711                      .dwattr $C$DW$167, DW_AT_name("cntrl7_gd")
    1712                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_cntrl7_gd")
    1713                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1714                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1715              
    1716              $C$DW$168       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$31)
    1718                      .dwattr $C$DW$168, DW_AT_name("Rsvd8")
    1719                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_Rsvd8")
    1720                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1721                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1722              
    1723              $C$DW$169       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$54)
    1725                      .dwattr $C$DW$169, DW_AT_name("cntrl9_IC_ops")
    1726                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    1727                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1728                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1729              
    1730              $C$DW$170       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$55)
    1732                      .dwattr $C$DW$170, DW_AT_name("cntrlA_shunt_amp")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   34

    1733                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    1734                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1735                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1736              
    1737              $C$DW$171       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$56)
    1739                      .dwattr $C$DW$171, DW_AT_name("cntrlB_Vreg")
    1740                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    1741                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1742                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1743              
    1744              $C$DW$172       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$57)
    1746                      .dwattr $C$DW$172, DW_AT_name("cntrlC_Vds_SNS")
    1747                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    1748                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1749                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1750              
    1751              $C$DW$173       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$31)
    1753                      .dwattr $C$DW$173, DW_AT_name("readCntrl5")
    1754                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_readCntrl5")
    1755                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1756                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1757              
    1758              $C$DW$174       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$31)
    1760                      .dwattr $C$DW$174, DW_AT_name("readCntrl6")
    1761                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_readCntrl6")
    1762                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1763                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1764              
    1765              $C$DW$175       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$31)
    1767                      .dwattr $C$DW$175, DW_AT_name("readCntrl7")
    1768                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_readCntrl7")
    1769                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1770                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1771              
    1772              $C$DW$176       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$31)
    1774                      .dwattr $C$DW$176, DW_AT_name("readCntrl9")
    1775                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_readCntrl9")
    1776                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1777                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1778              
    1779              $C$DW$177       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$31)
    1781                      .dwattr $C$DW$177, DW_AT_name("readCntrlA")
    1782                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_readCntrlA")
    1783                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1784                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1785              
    1786              $C$DW$178       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   35

    1788                      .dwattr $C$DW$178, DW_AT_name("readCntrlB")
    1789                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_readCntrlB")
    1790                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1791                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1792              
    1793              $C$DW$179       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$31)
    1795                      .dwattr $C$DW$179, DW_AT_name("readCntrlC")
    1796                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_readCntrlC")
    1797                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1798                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1799              
    1800              $C$DW$180       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$31)
    1802                      .dwattr $C$DW$180, DW_AT_name("DRV_fault")
    1803                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_DRV_fault")
    1804                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1805                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1806              
    1807                      .dwendtag $C$DW$T$58
    1808              
    1809              $C$DW$T$77      .dwtag  DW_TAG_typedef
    1810                      .dwattr $C$DW$T$77, DW_AT_name("DRV8305_Vars")
    1811                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$58)
    1812                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1813              
    1814              
    1815              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    1816                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x150)
    1817              $C$DW$181       .dwtag  DW_TAG_member
    1818                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$60)
    1819                      .dwattr $C$DW$181, DW_AT_name("PwmARegs")
    1820                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_PwmARegs")
    1821                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1823              
    1824              $C$DW$182       .dwtag  DW_TAG_member
    1825                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$60)
    1826                      .dwattr $C$DW$182, DW_AT_name("PwmBRegs")
    1827                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PwmBRegs")
    1828                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1829                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1830              
    1831              $C$DW$183       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$60)
    1833                      .dwattr $C$DW$183, DW_AT_name("PwmCRegs")
    1834                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_PwmCRegs")
    1835                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1836                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1837              
    1838              $C$DW$184       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$62)
    1840                      .dwattr $C$DW$184, DW_AT_name("QepRegs")
    1841                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_QepRegs")
    1842                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   36

    1843                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1844              
    1845              $C$DW$185       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$64)
    1847                      .dwattr $C$DW$185, DW_AT_name("SpiRegs")
    1848                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_SpiRegs")
    1849                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1850                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1851              
    1852              $C$DW$186       .dwtag  DW_TAG_member
    1853                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$31)
    1854                      .dwattr $C$DW$186, DW_AT_name("drvScsPin")
    1855                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_drvScsPin")
    1856                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1857                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1858              
    1859              $C$DW$187       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1861                      .dwattr $C$DW$187, DW_AT_name("offset_shntA")
    1862                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_offset_shntA")
    1863                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1864                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1865              
    1866              $C$DW$188       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1868                      .dwattr $C$DW$188, DW_AT_name("offset_shntB")
    1869                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_offset_shntB")
    1870                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1871                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1872              
    1873              $C$DW$189       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1875                      .dwattr $C$DW$189, DW_AT_name("offset_shntC")
    1876                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_offset_shntC")
    1877                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1878                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1879              
    1880              $C$DW$190       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1882                      .dwattr $C$DW$190, DW_AT_name("VdTesting")
    1883                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_VdTesting")
    1884                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1885                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1886              
    1887              $C$DW$191       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1889                      .dwattr $C$DW$191, DW_AT_name("VqTesting")
    1890                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_VqTesting")
    1891                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1892                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1893              
    1894              $C$DW$192       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1896                      .dwattr $C$DW$192, DW_AT_name("IdRef")
    1897                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_IdRef")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   37

    1898                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1899                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1900              
    1901              $C$DW$193       .dwtag  DW_TAG_member
    1902                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1903                      .dwattr $C$DW$193, DW_AT_name("IqRef")
    1904                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_IqRef")
    1905                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1906                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1907              
    1908              $C$DW$194       .dwtag  DW_TAG_member
    1909                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    1910                      .dwattr $C$DW$194, DW_AT_name("SpeedRef")
    1911                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_SpeedRef")
    1912                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1913                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1914              
    1915              $C$DW$195       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    1917                      .dwattr $C$DW$195, DW_AT_name("ElecTheta")
    1918                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_ElecTheta")
    1919                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1920                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1921              
    1922              $C$DW$196       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    1924                      .dwattr $C$DW$196, DW_AT_name("MechTheta")
    1925                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_MechTheta")
    1926                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1927                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1928              
    1929              $C$DW$197       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$40)
    1931                      .dwattr $C$DW$197, DW_AT_name("currentAs")
    1932                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_currentAs")
    1933                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1934                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1935              
    1936              $C$DW$198       .dwtag  DW_TAG_member
    1937                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$40)
    1938                      .dwattr $C$DW$198, DW_AT_name("currentBs")
    1939                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_currentBs")
    1940                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1941                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1942              
    1943              $C$DW$199       .dwtag  DW_TAG_member
    1944                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$40)
    1945                      .dwattr $C$DW$199, DW_AT_name("currentCs")
    1946                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_currentCs")
    1947                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1948                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1949              
    1950              $C$DW$200       .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$38)
    1952                      .dwattr $C$DW$200, DW_AT_name("alignCntr")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   38

    1953                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_alignCntr")
    1954                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1955                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1956              
    1957              $C$DW$201       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$38)
    1959                      .dwattr $C$DW$201, DW_AT_name("alignCnt")
    1960                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_alignCnt")
    1961                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1962                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1963              
    1964              $C$DW$202       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$31)
    1966                      .dwattr $C$DW$202, DW_AT_name("lsw")
    1967                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_lsw")
    1968                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1969                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1970              
    1971              $C$DW$203       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$31)
    1973                      .dwattr $C$DW$203, DW_AT_name("TripFlagDMC")
    1974                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_TripFlagDMC")
    1975                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1976                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1977              
    1978              $C$DW$204       .dwtag  DW_TAG_member
    1979                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$31)
    1980                      .dwattr $C$DW$204, DW_AT_name("clearTripFlagDMC")
    1981                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_clearTripFlagDMC")
    1982                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1983                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1984              
    1985              $C$DW$205       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$31)
    1987                      .dwattr $C$DW$205, DW_AT_name("RunMotor")
