TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Sat Nov 14 12:25:47 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drv8301.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DRV8301_SPI_Write")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DRV8301_SPI_Write")

drv8301.asm                                                          PAGE    8

     363                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$280)
     364                      .dwattr $C$DW$24, DW_AT_location[DW_OP_reg12]
     365              
     366              
     367              ;***************************************************************
     368              ;* FNAME: _DRV8301_diagnostics          FR SIZE:   2           *
     369              ;*                                                             *
     370              ;* FUNCTION ENVIRONMENT                                        *
     371              ;*                                                             *
     372              ;* FUNCTION PROPERTIES                                         *
     373              ;*                            0 Parameter,  0 Auto,  2 SOE     *
     374              ;***************************************************************
     375              
     376              _DRV8301_diagnostics:
     377              ;* AR1   assigned to _motor
     378              $C$DW$25        .dwtag  DW_TAG_variable
     379                      .dwattr $C$DW$25, DW_AT_name("motor")
     380                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_motor")
     381                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$281)
     382                      .dwattr $C$DW$25, DW_AT_location[DW_OP_reg6]
     383              
     384                      .dwcfi  cfa_offset, -2
     385                      .dwcfi  save_reg_to_mem, 26, 0
     386 0000006d B2BD          MOVL      *SP++,XAR1            ; [CPU_ALU] 
     387                      .dwcfi  save_reg_to_mem, 7, 2
     388                      .dwcfi  cfa_offset, -4
     389                      .dwpsn  file "../drv8301.c",line 134,column 2,is_stmt,isa 0
     390 0000006e 9A00          MOVB      AL,#0                 ; [CPU_ALU] |134| 
     391                      .dwpsn  file "../drv8301.c",line 132,column 1,is_stmt,isa 0
     392 0000006f 8BA4          MOVL      XAR1,XAR4             ; [CPU_ALU] |132| 
     393                      .dwpsn  file "../drv8301.c",line 134,column 2,is_stmt,isa 0
     394              $C$DW$26        .dwtag  DW_TAG_TI_branch
     395                      .dwattr $C$DW$26, DW_AT_low_pc(0x00)
     396                      .dwattr $C$DW$26, DW_AT_name("_DRV8301_SPI_Read")
     397                      .dwattr $C$DW$26, DW_AT_TI_call
     398              
     399 00000070 7640!         LCR       #_DRV8301_SPI_Read    ; [CPU_ALU] |134| 
         00000071 0000 
     400                      ; call occurs [#_DRV8301_SPI_Read] ; [] |134| 
     401 00000072 8D00          MOVL      XAR0,#308             ; [CPU_ALU] |134| 
         00000073 0134 
     402 00000074 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |134| 
     403                      .dwpsn  file "../drv8301.c",line 137,column 2,is_stmt,isa 0
     404 00000075 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |137| 
     405 00000076 9A01          MOVB      AL,#1                 ; [CPU_ALU] |137| 
     406              $C$DW$27        .dwtag  DW_TAG_TI_branch
     407                      .dwattr $C$DW$27, DW_AT_low_pc(0x00)
     408                      .dwattr $C$DW$27, DW_AT_name("_DRV8301_SPI_Read")
     409                      .dwattr $C$DW$27, DW_AT_TI_call
     410              
     411 00000077 7640!         LCR       #_DRV8301_SPI_Read    ; [CPU_ALU] |137| 
         00000078 0000 
     412                      ; call occurs [#_DRV8301_SPI_Read] ; [] |137| 
     413 00000079 8D00          MOVL      XAR0,#309             ; [CPU_ALU] |137| 
         0000007a 0135 
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    9

     414 0000007b 9080          ANDB      AL,#128               ; [CPU_ALU] |137| 
     415 0000007c 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |137| 
     416 0000007d 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     417                      .dwcfi  cfa_offset, -2
     418                      .dwcfi  restore_reg, 7
     419              $C$DW$28        .dwtag  DW_TAG_TI_branch
     420                      .dwattr $C$DW$28, DW_AT_low_pc(0x00)
     421                      .dwattr $C$DW$28, DW_AT_TI_return
     422              
     423 0000007e 0006          LRETR     ; [CPU_ALU] 
     424                      ; return occurs ; [] 
     425                      .dwattr $C$DW$23, DW_AT_TI_end_file("../drv8301.c")
     426                      .dwattr $C$DW$23, DW_AT_TI_end_line(0x96)
     427                      .dwattr $C$DW$23, DW_AT_TI_end_column(0x01)
     428                      .dwendentry
     429                      .dwendtag $C$DW$23
     430              
     431              ;**************************************************************
     432              ;* UNDEFINED EXTERNAL REFERENCES                              *
     433              ;**************************************************************
     434                      .global _DRV8301_SPI_Write
     435                      .global _DRV8301_SPI_Read
     436              
     437              ;***************************************************************
     438              ;* TYPE INFORMATION                                            *
     439              ;***************************************************************
     440              
     441              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     442                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     443              $C$DW$29        .dwtag  DW_TAG_member
     444                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     445                      .dwattr $C$DW$29, DW_AT_name("As")
     446                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_As")
     447                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     448                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     449              
     450              $C$DW$30        .dwtag  DW_TAG_member
     451                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     452                      .dwattr $C$DW$30, DW_AT_name("Bs")
     453                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_Bs")
     454                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     455                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     456              
     457              $C$DW$31        .dwtag  DW_TAG_member
     458                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     459                      .dwattr $C$DW$31, DW_AT_name("Cs")
     460                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_Cs")
     461                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     462                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     463              
     464              $C$DW$32        .dwtag  DW_TAG_member
     465                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     466                      .dwattr $C$DW$32, DW_AT_name("Alpha")
     467                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_Alpha")
     468                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   10

     469                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     470              
     471              $C$DW$33        .dwtag  DW_TAG_member
     472                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     473                      .dwattr $C$DW$33, DW_AT_name("Beta")
     474                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_Beta")
     475                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     476                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     477              
     478                      .dwendtag $C$DW$T$20
     479              
     480              $C$DW$T$65      .dwtag  DW_TAG_typedef
     481                      .dwattr $C$DW$T$65, DW_AT_name("CLARKE")
     482                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$20)
     483                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     484              
     485              
     486              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     487                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     488              $C$DW$34        .dwtag  DW_TAG_member
     489                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     490                      .dwattr $C$DW$34, DW_AT_name("Alpha")
     491                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_Alpha")
     492                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     493                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     494              
     495              $C$DW$35        .dwtag  DW_TAG_member
     496                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     497                      .dwattr $C$DW$35, DW_AT_name("Beta")
     498                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_Beta")
     499                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     500                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     501              
     502              $C$DW$36        .dwtag  DW_TAG_member
     503                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     504                      .dwattr $C$DW$36, DW_AT_name("Angle")
     505                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_Angle")
     506                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     507                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     508              
     509              $C$DW$37        .dwtag  DW_TAG_member
     510                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     511                      .dwattr $C$DW$37, DW_AT_name("Ds")
     512                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_Ds")
     513                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     514                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     515              
     516              $C$DW$38        .dwtag  DW_TAG_member
     517                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     518                      .dwattr $C$DW$38, DW_AT_name("Qs")
     519                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_Qs")
     520                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     521                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     522              
     523              $C$DW$39        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   11

     524                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     525                      .dwattr $C$DW$39, DW_AT_name("Sine")
     526                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_Sine")
     527                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     528                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     529              
     530              $C$DW$40        .dwtag  DW_TAG_member
     531                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     532                      .dwattr $C$DW$40, DW_AT_name("Cosine")
     533                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_Cosine")
     534                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     535                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     536              
     537                      .dwendtag $C$DW$T$21
     538              
     539              $C$DW$T$66      .dwtag  DW_TAG_typedef
     540                      .dwattr $C$DW$T$66, DW_AT_name("PARK")
     541                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
     542                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     543              
     544              
     545              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     546                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     547              $C$DW$41        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     549                      .dwattr $C$DW$41, DW_AT_name("Alpha")
     550                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_Alpha")
     551                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     552                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     553              
     554              $C$DW$42        .dwtag  DW_TAG_member
     555                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     556                      .dwattr $C$DW$42, DW_AT_name("Beta")
     557                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_Beta")
     558                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     559                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     560              
     561              $C$DW$43        .dwtag  DW_TAG_member
     562                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     563                      .dwattr $C$DW$43, DW_AT_name("Angle")
     564                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_Angle")
     565                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     566                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     567              
     568              $C$DW$44        .dwtag  DW_TAG_member
     569                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     570                      .dwattr $C$DW$44, DW_AT_name("Ds")
     571                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_Ds")
     572                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     573                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     574              
     575              $C$DW$45        .dwtag  DW_TAG_member
     576                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     577                      .dwattr $C$DW$45, DW_AT_name("Qs")
     578                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_Qs")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   12

     579                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     580                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     581              
     582              $C$DW$46        .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     584                      .dwattr $C$DW$46, DW_AT_name("Sine")
     585                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_Sine")
     586                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     587                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     588              
     589              $C$DW$47        .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     591                      .dwattr $C$DW$47, DW_AT_name("Cosine")
     592                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_Cosine")
     593                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     594                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     595              
     596                      .dwendtag $C$DW$T$22
     597              
     598              $C$DW$T$67      .dwtag  DW_TAG_typedef
     599                      .dwattr $C$DW$T$67, DW_AT_name("IPARK")
     600                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
     601                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     602              
     603              
     604              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     605                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
     606              $C$DW$48        .dwtag  DW_TAG_member
     607                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     608                      .dwattr $C$DW$48, DW_AT_name("Ref")
     609                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_Ref")
     610                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     611                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     612              
     613              $C$DW$49        .dwtag  DW_TAG_member
     614                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     615                      .dwattr $C$DW$49, DW_AT_name("Fbk")
     616                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_Fbk")
     617                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     618                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     619              
     620              $C$DW$50        .dwtag  DW_TAG_member
     621                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     622                      .dwattr $C$DW$50, DW_AT_name("Out")
     623                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_Out")
     624                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     625                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     626              
     627              $C$DW$51        .dwtag  DW_TAG_member
     628                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     629                      .dwattr $C$DW$51, DW_AT_name("Kp")
     630                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_Kp")
     631                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     632                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     633              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   13

     634              $C$DW$52        .dwtag  DW_TAG_member
     635                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     636                      .dwattr $C$DW$52, DW_AT_name("Ki")
     637                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_Ki")
     638                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     639                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     640              
     641              $C$DW$53        .dwtag  DW_TAG_member
     642                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     643                      .dwattr $C$DW$53, DW_AT_name("Umax")
     644                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_Umax")
     645                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     646                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     647              
     648              $C$DW$54        .dwtag  DW_TAG_member
     649                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     650                      .dwattr $C$DW$54, DW_AT_name("Umin")
     651                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Umin")
     652                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     653                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     654              
     655              $C$DW$55        .dwtag  DW_TAG_member
     656                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     657                      .dwattr $C$DW$55, DW_AT_name("up")
     658                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_up")
     659                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     660                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     661              
     662              $C$DW$56        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     664                      .dwattr $C$DW$56, DW_AT_name("ui")
     665                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_ui")
     666                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     667                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     668              
     669              $C$DW$57        .dwtag  DW_TAG_member
     670                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     671                      .dwattr $C$DW$57, DW_AT_name("v1")
     672                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_v1")
     673                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     674                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     675              
     676              $C$DW$58        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     678                      .dwattr $C$DW$58, DW_AT_name("i1")
     679                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_i1")
     680                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     681                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     682              
     683              $C$DW$59        .dwtag  DW_TAG_member
     684                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     685                      .dwattr $C$DW$59, DW_AT_name("w1")
     686                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_w1")
     687                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     688                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   14

     689              
     690                      .dwendtag $C$DW$T$23
     691              
     692              $C$DW$T$68      .dwtag  DW_TAG_typedef
     693                      .dwattr $C$DW$T$68, DW_AT_name("PI_CONTROLLER")
     694                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
     695                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     696              
     697              
     698              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     699                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
     700              $C$DW$60        .dwtag  DW_TAG_member
     701                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     702                      .dwattr $C$DW$60, DW_AT_name("Ref")
     703                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Ref")
     704                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     705                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     706              
     707              $C$DW$61        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     709                      .dwattr $C$DW$61, DW_AT_name("Fbk")
     710                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Fbk")
     711                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     712                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     713              
     714              $C$DW$62        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     716                      .dwattr $C$DW$62, DW_AT_name("Out")
     717                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Out")
     718                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     719                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     720              
     721              $C$DW$63        .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     723                      .dwattr $C$DW$63, DW_AT_name("c1")
     724                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_c1")
     725                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     726                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     727              
     728              $C$DW$64        .dwtag  DW_TAG_member
     729                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     730                      .dwattr $C$DW$64, DW_AT_name("c2")
     731                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_c2")
     732                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     733                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     734              
     735                      .dwendtag $C$DW$T$24
     736              
     737              $C$DW$T$27      .dwtag  DW_TAG_typedef
     738                      .dwattr $C$DW$T$27, DW_AT_name("PID_TERMINALS")
     739                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
     740                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     741              
     742              
     743              $C$DW$T$25      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   15

     744                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
     745              $C$DW$65        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     747                      .dwattr $C$DW$65, DW_AT_name("Kr")
     748                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Kr")
     749                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     750                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     751              
     752              $C$DW$66        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     754                      .dwattr $C$DW$66, DW_AT_name("Kp")
     755                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Kp")
     756                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     757                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     758              
     759              $C$DW$67        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$67, DW_AT_name("Ki")
     762                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Ki")
     763                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     764                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     765              
     766              $C$DW$68        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$68, DW_AT_name("Kd")
     769                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Kd")
     770                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     771                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     772              
     773              $C$DW$69        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     775                      .dwattr $C$DW$69, DW_AT_name("Km")
     776                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Km")
     777                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     778                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     779              
     780              $C$DW$70        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     782                      .dwattr $C$DW$70, DW_AT_name("Umax")
     783                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_Umax")
     784                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     785                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     786              
     787              $C$DW$71        .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     789                      .dwattr $C$DW$71, DW_AT_name("Umin")
     790                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_Umin")
     791                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     792                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     793              
     794                      .dwendtag $C$DW$T$25
     795              
     796              $C$DW$T$28      .dwtag  DW_TAG_typedef
     797                      .dwattr $C$DW$T$28, DW_AT_name("PID_PARAMETERS")
     798                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   16

     799                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     800              
     801              
     802              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     803                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
     804              $C$DW$72        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     806                      .dwattr $C$DW$72, DW_AT_name("up")
     807                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_up")
     808                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     809                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     810              
     811              $C$DW$73        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     813                      .dwattr $C$DW$73, DW_AT_name("ui")
     814                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_ui")
     815                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     816                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     817              
     818              $C$DW$74        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     820                      .dwattr $C$DW$74, DW_AT_name("ud")
     821                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_ud")
     822                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     823                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     824              
     825              $C$DW$75        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     827                      .dwattr $C$DW$75, DW_AT_name("v1")
     828                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_v1")
     829                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     830                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     831              
     832              $C$DW$76        .dwtag  DW_TAG_member
     833                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     834                      .dwattr $C$DW$76, DW_AT_name("i1")
     835                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_i1")
     836                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     837                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     838              
     839              $C$DW$77        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     841                      .dwattr $C$DW$77, DW_AT_name("d1")
     842                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_d1")
     843                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     844                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     845              
     846              $C$DW$78        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$78, DW_AT_name("d2")
     849                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_d2")
     850                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     851                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     852              
     853              $C$DW$79        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   17

     854                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     855                      .dwattr $C$DW$79, DW_AT_name("w1")
     856                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_w1")
     857                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     858                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     859              
     860                      .dwendtag $C$DW$T$26
     861              
     862              $C$DW$T$29      .dwtag  DW_TAG_typedef
     863                      .dwattr $C$DW$T$29, DW_AT_name("PID_DATA")
     864                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
     865                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     866              
     867              
     868              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     869                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
     870              $C$DW$80        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$27)
     872                      .dwattr $C$DW$80, DW_AT_name("term")
     873                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_term")
     874                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     875                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     876              
     877              $C$DW$81        .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$28)
     879                      .dwattr $C$DW$81, DW_AT_name("param")
     880                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_param")
     881                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     882                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     883              
     884              $C$DW$82        .dwtag  DW_TAG_member
     885                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$29)
     886                      .dwattr $C$DW$82, DW_AT_name("data")
     887                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_data")
     888                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     889                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     890              
     891                      .dwendtag $C$DW$T$30
     892              
     893              $C$DW$T$69      .dwtag  DW_TAG_typedef
     894                      .dwattr $C$DW$T$69, DW_AT_name("PID_CONTROLLER")
     895                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$30)
     896                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
     897              
     898              
     899              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     900                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
     901              $C$DW$83        .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     903                      .dwattr $C$DW$83, DW_AT_name("Ualpha")
     904                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Ualpha")
     905                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     907              
     908              $C$DW$84        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   18

     909                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     910                      .dwattr $C$DW$84, DW_AT_name("Ubeta")
     911                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Ubeta")
     912                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     913                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     914              
     915              $C$DW$85        .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     917                      .dwattr $C$DW$85, DW_AT_name("Ta")
     918                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Ta")
     919                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     920                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     921              
     922              $C$DW$86        .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     924                      .dwattr $C$DW$86, DW_AT_name("Tb")
     925                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Tb")
     926                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     927                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     928              
     929              $C$DW$87        .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     931                      .dwattr $C$DW$87, DW_AT_name("Tc")
     932                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_Tc")
     933                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     934                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     935              
     936              $C$DW$88        .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     938                      .dwattr $C$DW$88, DW_AT_name("tmp1")
     939                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_tmp1")
     940                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     941                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     942              
     943              $C$DW$89        .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     945                      .dwattr $C$DW$89, DW_AT_name("tmp2")
     946                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_tmp2")
     947                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     948                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     949              
     950              $C$DW$90        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     952                      .dwattr $C$DW$90, DW_AT_name("tmp3")
     953                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_tmp3")
     954                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     955                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     956              
     957              $C$DW$91        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$31)
     959                      .dwattr $C$DW$91, DW_AT_name("VecSector")
     960                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_VecSector")
     961                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     962                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     963              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   19

     964                      .dwendtag $C$DW$T$32
     965              
     966              $C$DW$T$70      .dwtag  DW_TAG_typedef
     967                      .dwattr $C$DW$T$70, DW_AT_name("SVGEN")
     968                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
     969                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
     970              
     971              
     972              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     973                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
     974              $C$DW$92        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$92, DW_AT_name("TargetValue")
     977                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_TargetValue")
     978                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     979                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     980              
     981              $C$DW$93        .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$33)
     983                      .dwattr $C$DW$93, DW_AT_name("RampDelayMax")
     984                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_RampDelayMax")
     985                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     986                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     987              
     988              $C$DW$94        .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     990                      .dwattr $C$DW$94, DW_AT_name("RampLowLimit")
     991                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_RampLowLimit")
     992                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     993                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995              $C$DW$95        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$95, DW_AT_name("RampHighLimit")
     998                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_RampHighLimit")
     999                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1000                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1001              
    1002              $C$DW$96        .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$33)
    1004                      .dwattr $C$DW$96, DW_AT_name("RampDelayCount")
    1005                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_RampDelayCount")
    1006                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1007                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1008              
    1009              $C$DW$97        .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1011                      .dwattr $C$DW$97, DW_AT_name("SetpointValue")
    1012                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_SetpointValue")
    1013                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1014                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1015              
    1016              $C$DW$98        .dwtag  DW_TAG_member
    1017                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$33)
    1018                      .dwattr $C$DW$98, DW_AT_name("EqualFlag")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   20

    1019                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_EqualFlag")
    1020                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1021                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1022              
    1023              $C$DW$99        .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1025                      .dwattr $C$DW$99, DW_AT_name("Tmp")
    1026                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_Tmp")
    1027                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1028                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1029              
    1030                      .dwendtag $C$DW$T$34
    1031              
    1032              $C$DW$T$71      .dwtag  DW_TAG_typedef
    1033                      .dwattr $C$DW$T$71, DW_AT_name("RMPCNTL")
    1034                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    1035                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1036              
    1037              
    1038              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1039                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    1040              $C$DW$100       .dwtag  DW_TAG_member
    1041                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1042                      .dwattr $C$DW$100, DW_AT_name("Freq")
    1043                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_Freq")
    1044                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1046              
    1047              $C$DW$101       .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1049                      .dwattr $C$DW$101, DW_AT_name("StepAngleMax")
    1050                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_StepAngleMax")
    1051                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1052                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1053              
    1054              $C$DW$102       .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1056                      .dwattr $C$DW$102, DW_AT_name("Angle")
    1057                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_Angle")
    1058                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1059                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1060              
    1061              $C$DW$103       .dwtag  DW_TAG_member
    1062                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1063                      .dwattr $C$DW$103, DW_AT_name("Gain")
    1064                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_Gain")
    1065                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1066                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1067              
    1068              $C$DW$104       .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1070                      .dwattr $C$DW$104, DW_AT_name("Out")
    1071                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_Out")
    1072                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1073                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   21

    1074              
    1075              $C$DW$105       .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1077                      .dwattr $C$DW$105, DW_AT_name("Offset")
    1078                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_Offset")
    1079                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1080                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1081              
    1082                      .dwendtag $C$DW$T$35
    1083              
    1084              $C$DW$T$72      .dwtag  DW_TAG_typedef
    1085                      .dwattr $C$DW$T$72, DW_AT_name("RAMPGEN")
    1086                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    1087                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1088              
    1089              
    1090              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1091                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
    1092              $C$DW$106       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$106, DW_AT_name("DcBusVolt")
    1095                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_DcBusVolt")
    1096                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1098              
    1099              $C$DW$107       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1101                      .dwattr $C$DW$107, DW_AT_name("MfuncV1")
    1102                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_MfuncV1")
    1103                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1104                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1105              
    1106              $C$DW$108       .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1108                      .dwattr $C$DW$108, DW_AT_name("MfuncV2")
    1109                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_MfuncV2")
    1110                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1111                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1112              
    1113              $C$DW$109       .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1115                      .dwattr $C$DW$109, DW_AT_name("MfuncV3")
    1116                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_MfuncV3")
    1117                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1118                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1119              
    1120              $C$DW$110       .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$31)
    1122                      .dwattr $C$DW$110, DW_AT_name("OutOfPhase")
    1123                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_OutOfPhase")
    1124                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1125                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1126              
    1127              $C$DW$111       .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   22

    1129                      .dwattr $C$DW$111, DW_AT_name("VphaseA")
    1130                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_VphaseA")
    1131                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1132                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1133              
    1134              $C$DW$112       .dwtag  DW_TAG_member
    1135                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1136                      .dwattr $C$DW$112, DW_AT_name("VphaseB")
    1137                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_VphaseB")
    1138                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1139                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1140              
    1141              $C$DW$113       .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1143                      .dwattr $C$DW$113, DW_AT_name("VphaseC")
    1144                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_VphaseC")
    1145                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1146                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1147              
    1148              $C$DW$114       .dwtag  DW_TAG_member
    1149                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1150                      .dwattr $C$DW$114, DW_AT_name("Valpha")
    1151                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_Valpha")
    1152                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1153                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1154              
    1155              $C$DW$115       .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1157                      .dwattr $C$DW$115, DW_AT_name("Vbeta")
    1158                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_Vbeta")
    1159                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1160                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1161              
    1162              $C$DW$116       .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1164                      .dwattr $C$DW$116, DW_AT_name("temp")
    1165                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_temp")
    1166                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1167                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1168              
    1169                      .dwendtag $C$DW$T$36
    1170              
    1171              $C$DW$T$73      .dwtag  DW_TAG_typedef
    1172                      .dwattr $C$DW$T$73, DW_AT_name("PHASEVOLTAGE")
    1173                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$36)
    1174                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1175              
    1176              
    1177              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1178                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    1179              $C$DW$117       .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1181                      .dwattr $C$DW$117, DW_AT_name("ElecTheta")
    1182                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_ElecTheta")
    1183                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   23

    1184                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1185              
    1186              $C$DW$118       .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$33)
    1188                      .dwattr $C$DW$118, DW_AT_name("DirectionQep")
    1189                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_DirectionQep")
    1190                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1191                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1192              
    1193              $C$DW$119       .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1195                      .dwattr $C$DW$119, DW_AT_name("OldElecTheta")
    1196                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_OldElecTheta")
    1197                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1198                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1199              
    1200              $C$DW$120       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$120, DW_AT_name("Speed")
    1203                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_Speed")
    1204                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1205                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207              $C$DW$121       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$33)
    1209                      .dwattr $C$DW$121, DW_AT_name("BaseRpm")
    1210                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_BaseRpm")
    1211                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1212                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1213              
    1214              $C$DW$122       .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$37)
    1216                      .dwattr $C$DW$122, DW_AT_name("K1")
    1217                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_K1")
    1218                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1219                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1220              
    1221              $C$DW$123       .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1223                      .dwattr $C$DW$123, DW_AT_name("K2")
    1224                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_K2")
    1225                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1226                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1227              
    1228              $C$DW$124       .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1230                      .dwattr $C$DW$124, DW_AT_name("K3")
    1231                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_K3")
    1232                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1233                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1234              
    1235              $C$DW$125       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$38)
    1237                      .dwattr $C$DW$125, DW_AT_name("SpeedRpm")
    1238                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_SpeedRpm")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   24

    1239                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1240                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1241              
    1242              $C$DW$126       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$126, DW_AT_name("Tmp")
    1245                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_Tmp")
    1246                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1247                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1248              
    1249                      .dwendtag $C$DW$T$39
    1250              
    1251              $C$DW$T$74      .dwtag  DW_TAG_typedef
    1252                      .dwattr $C$DW$T$74, DW_AT_name("SPEED_MEAS_QEP")
    1253                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$39)
    1254                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1255              
    1256              
    1257              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1258                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    1259              $C$DW$127       .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$40)
    1261                      .dwattr $C$DW$127, DW_AT_name("ElecTheta")
    1262                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ElecTheta")
    1263                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1265              
    1266              $C$DW$128       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$40)
    1268                      .dwattr $C$DW$128, DW_AT_name("MechTheta")
    1269                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_MechTheta")
    1270                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1271                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1272              
    1273              $C$DW$129       .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$31)
    1275                      .dwattr $C$DW$129, DW_AT_name("DirectionQep")
    1276                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_DirectionQep")
    1277                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1278                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1279              
    1280              $C$DW$130       .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$31)
    1282                      .dwattr $C$DW$130, DW_AT_name("QepPeriod")
    1283                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_QepPeriod")
    1284                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1285                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1286              
    1287              $C$DW$131       .dwtag  DW_TAG_member
    1288                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$33)
    1289                      .dwattr $C$DW$131, DW_AT_name("QepCountIndex")
    1290                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_QepCountIndex")
    1291                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1292                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1293              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   25

    1294              $C$DW$132       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$38)
    1296                      .dwattr $C$DW$132, DW_AT_name("RawTheta")
    1297                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_RawTheta")
    1298                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1299                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1300              
    1301              $C$DW$133       .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$40)
    1303                      .dwattr $C$DW$133, DW_AT_name("MechScaler")
    1304                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_MechScaler")
    1305                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1306                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1307              
    1308              $C$DW$134       .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$31)
    1310                      .dwattr $C$DW$134, DW_AT_name("LineEncoder")
    1311                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_LineEncoder")
    1312                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1313                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1314              
    1315              $C$DW$135       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$31)
    1317                      .dwattr $C$DW$135, DW_AT_name("PolePairs")
    1318                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PolePairs")
    1319                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1320                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1321              
    1322              $C$DW$136       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$38)
    1324                      .dwattr $C$DW$136, DW_AT_name("CalibratedAngle")
    1325                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_CalibratedAngle")
    1326                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1327                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1328              
    1329              $C$DW$137       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$31)
    1331                      .dwattr $C$DW$137, DW_AT_name("IndexSyncFlag")
    1332                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_IndexSyncFlag")
    1333                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1334                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1335              
    1336                      .dwendtag $C$DW$T$41
    1337              
    1338              $C$DW$T$75      .dwtag  DW_TAG_typedef
    1339                      .dwattr $C$DW$T$75, DW_AT_name("QEP")
    1340                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    1341                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1342              
    1343              
    1344              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1345                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x07)
    1346              $C$DW$138       .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$42)
    1348                      .dwattr $C$DW$138, DW_AT_name("stat_reg1")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   26

    1349                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_stat_reg1")
    1350                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1352              
    1353              $C$DW$139       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$43)
    1355                      .dwattr $C$DW$139, DW_AT_name("stat_reg2")
    1356                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_stat_reg2")
    1357                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1358                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1359              
    1360              $C$DW$140       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$44)
    1362                      .dwattr $C$DW$140, DW_AT_name("cntrl_reg1")
    1363                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_cntrl_reg1")
    1364                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1365                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1366              
    1367              $C$DW$141       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$45)
    1369                      .dwattr $C$DW$141, DW_AT_name("cntrl_reg2")
    1370                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_cntrl_reg2")
    1371                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1372                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1373              
    1374              $C$DW$142       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$31)
    1376                      .dwattr $C$DW$142, DW_AT_name("readCntrl1")
    1377                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_readCntrl1")
    1378                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1379                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1380              
    1381              $C$DW$143       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$31)
    1383                      .dwattr $C$DW$143, DW_AT_name("readCntrl2")
    1384                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_readCntrl2")
    1385                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1386                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1387              
    1388              $C$DW$144       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$31)
    1390                      .dwattr $C$DW$144, DW_AT_name("DRV_fault")
    1391                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_DRV_fault")
    1392                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1393                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395                      .dwendtag $C$DW$T$46
    1396              
    1397              $C$DW$T$76      .dwtag  DW_TAG_typedef
    1398                      .dwattr $C$DW$T$76, DW_AT_name("DRV8301_Vars")
    1399                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$46)
    1400                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1401              
    1402              
    1403              $C$DW$T$58      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   27

    1404                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x15)
    1405              $C$DW$145       .dwtag  DW_TAG_member
    1406                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$31)
    1407                      .dwattr $C$DW$145, DW_AT_name("Rsvd0")
    1408                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_Rsvd0")
    1409                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1411              
    1412              $C$DW$146       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$47)
    1414                      .dwattr $C$DW$146, DW_AT_name("status1_wwd")
    1415                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_status1_wwd")
    1416                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1417                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1418              
    1419              $C$DW$147       .dwtag  DW_TAG_member
    1420                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$48)
    1421                      .dwattr $C$DW$147, DW_AT_name("status2_ov_vds")
    1422                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_status2_ov_vds")
    1423                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1424                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1425              
    1426              $C$DW$148       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$49)
    1428                      .dwattr $C$DW$148, DW_AT_name("status3_IC")
    1429                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_status3_IC")
    1430                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1431                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1432              
    1433              $C$DW$149       .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$50)
    1435                      .dwattr $C$DW$149, DW_AT_name("status4_gd_Vgs")
    1436                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    1437                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1438                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440              $C$DW$150       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$51)
    1442                      .dwattr $C$DW$150, DW_AT_name("cntrl5_hs_gd")
    1443                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    1444                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1445                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1446              
    1447              $C$DW$151       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$52)
    1449                      .dwattr $C$DW$151, DW_AT_name("cntrl6_ls_gd")
    1450                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    1451                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1452                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1453              
    1454              $C$DW$152       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$53)
    1456                      .dwattr $C$DW$152, DW_AT_name("cntrl7_gd")
    1457                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_cntrl7_gd")
    1458                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   28

    1459                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1460              
    1461              $C$DW$153       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
    1463                      .dwattr $C$DW$153, DW_AT_name("Rsvd8")
    1464                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_Rsvd8")
    1465                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1466                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1467              
    1468              $C$DW$154       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$54)
    1470                      .dwattr $C$DW$154, DW_AT_name("cntrl9_IC_ops")
    1471                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    1472                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1473                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1474              
    1475              $C$DW$155       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$55)
    1477                      .dwattr $C$DW$155, DW_AT_name("cntrlA_shunt_amp")
    1478                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    1479                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1480                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1481              
    1482              $C$DW$156       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$56)
    1484                      .dwattr $C$DW$156, DW_AT_name("cntrlB_Vreg")
    1485                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    1486                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1487                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1488              
    1489              $C$DW$157       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$57)
    1491                      .dwattr $C$DW$157, DW_AT_name("cntrlC_Vds_SNS")
    1492                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    1493                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1494                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496              $C$DW$158       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$31)
    1498                      .dwattr $C$DW$158, DW_AT_name("readCntrl5")
    1499                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_readCntrl5")
    1500                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1501                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1502              
    1503              $C$DW$159       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$31)
    1505                      .dwattr $C$DW$159, DW_AT_name("readCntrl6")
    1506                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_readCntrl6")
    1507                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1508                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1509              
    1510              $C$DW$160       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$31)
    1512                      .dwattr $C$DW$160, DW_AT_name("readCntrl7")
    1513                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_readCntrl7")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   29

    1514                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1515                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1516              
    1517              $C$DW$161       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$31)
    1519                      .dwattr $C$DW$161, DW_AT_name("readCntrl9")
    1520                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_readCntrl9")
    1521                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1522                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$162       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$31)
    1526                      .dwattr $C$DW$162, DW_AT_name("readCntrlA")
    1527                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_readCntrlA")
    1528                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1529                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1530              
    1531              $C$DW$163       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$31)
    1533                      .dwattr $C$DW$163, DW_AT_name("readCntrlB")
    1534                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_readCntrlB")
    1535                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1536                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1537              
    1538              $C$DW$164       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$31)
    1540                      .dwattr $C$DW$164, DW_AT_name("readCntrlC")
    1541                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_readCntrlC")
    1542                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1543                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1544              
    1545              $C$DW$165       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$31)
    1547                      .dwattr $C$DW$165, DW_AT_name("DRV_fault")
    1548                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_DRV_fault")
    1549                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1550                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1551              
    1552                      .dwendtag $C$DW$T$58
    1553              
    1554              $C$DW$T$77      .dwtag  DW_TAG_typedef
    1555                      .dwattr $C$DW$T$77, DW_AT_name("DRV8305_Vars")
    1556                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$58)
    1557                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1558              
    1559              
    1560              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    1561                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x150)
    1562              $C$DW$166       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$60)
    1564                      .dwattr $C$DW$166, DW_AT_name("PwmARegs")
    1565                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PwmARegs")
    1566                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1568              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   30

    1569              $C$DW$167       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$60)
    1571                      .dwattr $C$DW$167, DW_AT_name("PwmBRegs")
    1572                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PwmBRegs")
    1573                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1574                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1575              
    1576              $C$DW$168       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$60)
    1578                      .dwattr $C$DW$168, DW_AT_name("PwmCRegs")
    1579                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PwmCRegs")
    1580                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1581                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1582              
    1583              $C$DW$169       .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$62)
    1585                      .dwattr $C$DW$169, DW_AT_name("QepRegs")
    1586                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_QepRegs")
    1587                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1588                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1589              
    1590              $C$DW$170       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$64)
    1592                      .dwattr $C$DW$170, DW_AT_name("SpiRegs")
    1593                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_SpiRegs")
    1594                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1595                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1596              
    1597              $C$DW$171       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$31)
    1599                      .dwattr $C$DW$171, DW_AT_name("drvScsPin")
    1600                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_drvScsPin")
    1601                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1602                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1603              
    1604              $C$DW$172       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1606                      .dwattr $C$DW$172, DW_AT_name("offset_shntA")
    1607                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_offset_shntA")
    1608                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1609                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1610              
    1611              $C$DW$173       .dwtag  DW_TAG_member
    1612                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1613                      .dwattr $C$DW$173, DW_AT_name("offset_shntB")
    1614                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_offset_shntB")
    1615                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1616                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1617              
    1618              $C$DW$174       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1620                      .dwattr $C$DW$174, DW_AT_name("offset_shntC")
    1621                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_offset_shntC")
    1622                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1623                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   31

    1624              
    1625              $C$DW$175       .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1627                      .dwattr $C$DW$175, DW_AT_name("VdTesting")
    1628                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_VdTesting")
    1629                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1630                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1631              
    1632              $C$DW$176       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1634                      .dwattr $C$DW$176, DW_AT_name("VqTesting")
    1635                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_VqTesting")
    1636                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1637                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1638              
    1639              $C$DW$177       .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1641                      .dwattr $C$DW$177, DW_AT_name("IdRef")
    1642                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_IdRef")
    1643                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1644                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1645              
    1646              $C$DW$178       .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1648                      .dwattr $C$DW$178, DW_AT_name("IqRef")
    1649                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_IqRef")
    1650                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1651                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1652              
    1653              $C$DW$179       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1655                      .dwattr $C$DW$179, DW_AT_name("SpeedRef")
    1656                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_SpeedRef")
    1657                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1658                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1659              
    1660              $C$DW$180       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1662                      .dwattr $C$DW$180, DW_AT_name("ElecTheta")
    1663                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_ElecTheta")
    1664                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1665                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1666              
    1667              $C$DW$181       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1669                      .dwattr $C$DW$181, DW_AT_name("MechTheta")
    1670                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_MechTheta")
    1671                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1672                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1673              
    1674              $C$DW$182       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$40)
    1676                      .dwattr $C$DW$182, DW_AT_name("currentAs")
    1677                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_currentAs")
    1678                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:47 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   32

    1679                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1680              
    1681              $C$DW$183       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$40)
    1683                      .dwattr $C$DW$183, DW_AT_name("currentBs")
    1684                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_currentBs")
    1685                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1686                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1687              
    1688              $C$DW$184       .dwtag  DW_TAG_member
    1689                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$40)
    1690                      .dwattr $C$DW$184, DW_AT_name("currentCs")
    1691                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_currentCs")
    1692                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1693                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1694              
    1695              $C$DW$185       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$38)
    1697                      .dwattr $C$DW$185, DW_AT_name("alignCntr")
    1698                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_alignCntr")
    1699                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1700                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1701              
    1702              $C$DW$186       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$38)
    1704                      .dwattr $C$DW$186, DW_AT_name("alignCnt")
    1705                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_alignCnt")
    1706                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1707                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1708              
    1709              $C$DW$187       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
    1711                      .dwattr $C$DW$187, DW_AT_name("lsw")
    1712                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_lsw")
    1713                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1714                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1715              
    1716              $C$DW$188       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$31)
    1718                      .dwattr $C$DW$188, DW_AT_name("TripFlagDMC")
    1719                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_TripFlagDMC")
    1720                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1721                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1722              
    1723              $C$DW$189       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$31)
    1725                      .dwattr $C$DW$189, DW_AT_name("clearTripFlagDMC")
    1726                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_clearTripFlagDMC")
    1727                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1728                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1729              
    1730              $C$DW$190       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$31)
    1732                      .dwattr $C$DW$190, DW_AT_name("RunMotor")
