TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Sat Nov 14 12:25:45 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DRV830x_SPI.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_WritePin")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GPIO_WritePin")

     601 00000062 FE02          ADDB      SP,#2                 ; [CPU_ARAU] 
     602                      .dwcfi  cfa_offset, -8
     603                      .dwpsn  file "../DRV830x_SPI.c",line 111,column 2,is_stmt,isa 0
     604 00000063 5603          MOV       ACC,AL << #11         ; [CPU_ALU] |111| 
         00000064 0BA9 
     605                      .dwpsn  file "../DRV830x_SPI.c",line 115,column 2,is_stmt,isa 0
     606 00000065 D00A          MOVB      XAR0,#10              ; [CPU_ALU] |115| 
     607                      .dwpsn  file "../DRV830x_SPI.c",line 107,column 1,is_stmt,isa 0
     608 00000066 86A4          MOVL      XAR2,XAR4             ; [CPU_ALU] |107| 
     609                      .dwpsn  file "../DRV830x_SPI.c",line 115,column 2,is_stmt,isa 0
     610 00000067 D108          MOVB      XAR1,#8               ; [CPU_ALU] |115| 
     611                      .dwpsn  file "../DRV830x_SPI.c",line 111,column 2,is_stmt,isa 0
     612 00000068 1AA9          OR        AL,#0x8000            ; [CPU_ALU] |111| 
         00000069 8000 
     613 0000006a 9641          MOV       *-SP[1],AL            ; [CPU_ALU] |111| 
     614                      .dwpsn  file "../DRV830x_SPI.c",line 115,column 2,is_stmt,isa 0
     615 0000006b 9392          MOV       AH,*+XAR2[AR0]        ; [CPU_ALU] |115| 
     616 0000006c 8A9A          MOVL      XAR4,*+XAR2[AR1]      ; [CPU_ALU] |115| 
     617              $C$DW$49        .dwtag  DW_TAG_TI_branch
     618                      .dwattr $C$DW$49, DW_AT_low_pc(0x00)
     619                      .dwattr $C$DW$49, DW_AT_name("_SPI_Driver")
     620                      .dwattr $C$DW$49, DW_AT_TI_call
     621              
     622 0000006d 7640'         LCR       #_SPI_Driver          ; [CPU_ALU] |115| 
         0000006e 0000 
     623                      ; call occurs [#_SPI_Driver] ; [] |115| 
     624 0000006f 9642          MOV       *-SP[2],AL            ; [CPU_ALU] |115| 
     625                      .dwpsn  file "../DRV830x_SPI.c",line 116,column 2,is_stmt,isa 0
     626 00000070 0226          MOVB      ACC,#38               ; [CPU_ALU] |116| 
     627              $C$DW$50        .dwtag  DW_TAG_TI_branch
     628                      .dwattr $C$DW$50, DW_AT_low_pc(0x00)
     629                      .dwattr $C$DW$50, DW_AT_name("_F28x_usDelay")
     630                      .dwattr $C$DW$50, DW_AT_TI_call
     631              
     632 00000071 7640!         LCR       #_F28x_usDelay        ; [CPU_ALU] |116| 
         00000072 0000 
     633                      ; call occurs [#_F28x_usDelay] ; [] |116| 
     634                      .dwpsn  file "../DRV830x_SPI.c",line 117,column 2,is_stmt,isa 0
     635 00000073 D108          MOVB      XAR1,#8               ; [CPU_ALU] |117| 
     636 00000074 D00A          MOVB      XAR0,#10              ; [CPU_ALU] |117| 
     637 00000075 9A00          MOVB      AL,#0                 ; [CPU_ALU] |117| 
     638 00000076 8A9A          MOVL      XAR4,*+XAR2[AR1]      ; [CPU_ALU] |117| 
     639 00000077 9392          MOV       AH,*+XAR2[AR0]        ; [CPU_ALU] |117| 
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   13

     640              $C$DW$51        .dwtag  DW_TAG_TI_branch
     641                      .dwattr $C$DW$51, DW_AT_low_pc(0x00)
     642                      .dwattr $C$DW$51, DW_AT_name("_SPI_Driver")
     643                      .dwattr $C$DW$51, DW_AT_TI_call
     644              
     645 00000078 7640'         LCR       #_SPI_Driver          ; [CPU_ALU] |117| 
         00000079 0000 
     646                      ; call occurs [#_SPI_Driver] ; [] |117| 
     647 0000007a FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
     648                      .dwcfi  cfa_offset, -6
     649 0000007b 86BE          MOVL      XAR2,*--SP            ; [CPU_ALU] 
     650                      .dwcfi  cfa_offset, -4
     651                      .dwcfi  restore_reg, 9
     652 0000007c 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     653                      .dwcfi  cfa_offset, -2
     654                      .dwcfi  restore_reg, 7
     655              $C$DW$52        .dwtag  DW_TAG_TI_branch
     656                      .dwattr $C$DW$52, DW_AT_low_pc(0x00)
     657                      .dwattr $C$DW$52, DW_AT_TI_return
     658              
     659 0000007d 0006          LRETR     ; [CPU_ALU] 
     660                      ; return occurs ; [] 
     661                      .dwattr $C$DW$42, DW_AT_TI_end_file("../DRV830x_SPI.c")
     662                      .dwattr $C$DW$42, DW_AT_TI_end_line(0x76)
     663                      .dwattr $C$DW$42, DW_AT_TI_end_column(0x01)
     664                      .dwendentry
     665                      .dwendtag $C$DW$42
     666              
     667              ;**************************************************************
     668              ;* UNDEFINED EXTERNAL REFERENCES                              *
     669              ;**************************************************************
     670                      .global _GPIO_WritePin
     671                      .global _F28x_usDelay
     672              
     673              ;***************************************************************
     674              ;* TYPE INFORMATION                                            *
     675              ;***************************************************************
     676              
     677              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     678                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     679              $C$DW$53        .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     681                      .dwattr $C$DW$53, DW_AT_name("As")
     682                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_As")
     683                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     684                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     685              
     686              $C$DW$54        .dwtag  DW_TAG_member
     687                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     688                      .dwattr $C$DW$54, DW_AT_name("Bs")
     689                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Bs")
     690                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     691                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     692              
     693              $C$DW$55        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   14

     694                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     695                      .dwattr $C$DW$55, DW_AT_name("Cs")
     696                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_Cs")
     697                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     698                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     699              
     700              $C$DW$56        .dwtag  DW_TAG_member
     701                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     702                      .dwattr $C$DW$56, DW_AT_name("Alpha")
     703                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_Alpha")
     704                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     705                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     706              
     707              $C$DW$57        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     709                      .dwattr $C$DW$57, DW_AT_name("Beta")
     710                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_Beta")
     711                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     712                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     713              
     714                      .dwendtag $C$DW$T$20
     715              
     716              $C$DW$T$65      .dwtag  DW_TAG_typedef
     717                      .dwattr $C$DW$T$65, DW_AT_name("CLARKE")
     718                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$20)
     719                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     720              
     721              
     722              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     723                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     724              $C$DW$58        .dwtag  DW_TAG_member
     725                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     726                      .dwattr $C$DW$58, DW_AT_name("Alpha")
     727                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_Alpha")
     728                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     729                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     730              
     731              $C$DW$59        .dwtag  DW_TAG_member
     732                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     733                      .dwattr $C$DW$59, DW_AT_name("Beta")
     734                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_Beta")
     735                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     736                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     737              
     738              $C$DW$60        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     740                      .dwattr $C$DW$60, DW_AT_name("Angle")
     741                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Angle")
     742                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     743                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     744              
     745              $C$DW$61        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     747                      .dwattr $C$DW$61, DW_AT_name("Ds")
     748                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Ds")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   15

     749                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     750                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     751              
     752              $C$DW$62        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     754                      .dwattr $C$DW$62, DW_AT_name("Qs")
     755                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Qs")
     756                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     757                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     758              
     759              $C$DW$63        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$63, DW_AT_name("Sine")
     762                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_Sine")
     763                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     764                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     765              
     766              $C$DW$64        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$64, DW_AT_name("Cosine")
     769                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_Cosine")
     770                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     771                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     772              
     773                      .dwendtag $C$DW$T$21
     774              
     775              $C$DW$T$66      .dwtag  DW_TAG_typedef
     776                      .dwattr $C$DW$T$66, DW_AT_name("PARK")
     777                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
     778                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     779              
     780              
     781              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     782                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     783              $C$DW$65        .dwtag  DW_TAG_member
     784                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     785                      .dwattr $C$DW$65, DW_AT_name("Alpha")
     786                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Alpha")
     787                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     788                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     789              
     790              $C$DW$66        .dwtag  DW_TAG_member
     791                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     792                      .dwattr $C$DW$66, DW_AT_name("Beta")
     793                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Beta")
     794                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     795                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     796              
     797              $C$DW$67        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     799                      .dwattr $C$DW$67, DW_AT_name("Angle")
     800                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Angle")
     801                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     802                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     803              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   16

     804              $C$DW$68        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     806                      .dwattr $C$DW$68, DW_AT_name("Ds")
     807                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Ds")
     808                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     809                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     810              
     811              $C$DW$69        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     813                      .dwattr $C$DW$69, DW_AT_name("Qs")
     814                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Qs")
     815                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     816                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     817              
     818              $C$DW$70        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     820                      .dwattr $C$DW$70, DW_AT_name("Sine")
     821                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_Sine")
     822                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     823                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     824              
     825              $C$DW$71        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     827                      .dwattr $C$DW$71, DW_AT_name("Cosine")
     828                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_Cosine")
     829                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     830                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     831              
     832                      .dwendtag $C$DW$T$22
     833              
     834              $C$DW$T$67      .dwtag  DW_TAG_typedef
     835                      .dwattr $C$DW$T$67, DW_AT_name("IPARK")
     836                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
     837                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     838              
     839              
     840              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     841                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
     842              $C$DW$72        .dwtag  DW_TAG_member
     843                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     844                      .dwattr $C$DW$72, DW_AT_name("Ref")
     845                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_Ref")
     846                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     847                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     848              
     849              $C$DW$73        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     851                      .dwattr $C$DW$73, DW_AT_name("Fbk")
     852                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_Fbk")
     853                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     854                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     855              
     856              $C$DW$74        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     858                      .dwattr $C$DW$74, DW_AT_name("Out")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   17

     859                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_Out")
     860                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     861                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     862              
     863              $C$DW$75        .dwtag  DW_TAG_member
     864                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     865                      .dwattr $C$DW$75, DW_AT_name("Kp")
     866                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_Kp")
     867                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     868                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     869              
     870              $C$DW$76        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     872                      .dwattr $C$DW$76, DW_AT_name("Ki")
     873                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Ki")
     874                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     875                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     876              
     877              $C$DW$77        .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     879                      .dwattr $C$DW$77, DW_AT_name("Umax")
     880                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Umax")
     881                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     882                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     883              
     884              $C$DW$78        .dwtag  DW_TAG_member
     885                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     886                      .dwattr $C$DW$78, DW_AT_name("Umin")
     887                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Umin")
     888                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     889                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     890              
     891              $C$DW$79        .dwtag  DW_TAG_member
     892                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     893                      .dwattr $C$DW$79, DW_AT_name("up")
     894                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_up")
     895                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     896                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     897              
     898              $C$DW$80        .dwtag  DW_TAG_member
     899                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     900                      .dwattr $C$DW$80, DW_AT_name("ui")
     901                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_ui")
     902                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     903                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     904              
     905              $C$DW$81        .dwtag  DW_TAG_member
     906                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     907                      .dwattr $C$DW$81, DW_AT_name("v1")
     908                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_v1")
     909                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     910                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     911              
     912              $C$DW$82        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   18

     914                      .dwattr $C$DW$82, DW_AT_name("i1")
     915                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_i1")
     916                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     917                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     918              
     919              $C$DW$83        .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     921                      .dwattr $C$DW$83, DW_AT_name("w1")
     922                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_w1")
     923                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     924                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     925              
     926                      .dwendtag $C$DW$T$23
     927              
     928              $C$DW$T$68      .dwtag  DW_TAG_typedef
     929                      .dwattr $C$DW$T$68, DW_AT_name("PI_CONTROLLER")
     930                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
     931                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     932              
     933              
     934              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     935                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
     936              $C$DW$84        .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     938                      .dwattr $C$DW$84, DW_AT_name("Ref")
     939                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Ref")
     940                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     941                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     942              
     943              $C$DW$85        .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     945                      .dwattr $C$DW$85, DW_AT_name("Fbk")
     946                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Fbk")
     947                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     948                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     949              
     950              $C$DW$86        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     952                      .dwattr $C$DW$86, DW_AT_name("Out")
     953                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Out")
     954                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     955                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     956              
     957              $C$DW$87        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     959                      .dwattr $C$DW$87, DW_AT_name("c1")
     960                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_c1")
     961                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     962                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     963              
     964              $C$DW$88        .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     966                      .dwattr $C$DW$88, DW_AT_name("c2")
     967                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_c2")
     968                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   19

     969                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     970              
     971                      .dwendtag $C$DW$T$24
     972              
     973              $C$DW$T$27      .dwtag  DW_TAG_typedef
     974                      .dwattr $C$DW$T$27, DW_AT_name("PID_TERMINALS")
     975                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
     976                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     977              
     978              
     979              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     980                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
     981              $C$DW$89        .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     983                      .dwattr $C$DW$89, DW_AT_name("Kr")
     984                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_Kr")
     985                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     986                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     987              
     988              $C$DW$90        .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     990                      .dwattr $C$DW$90, DW_AT_name("Kp")
     991                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_Kp")
     992                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     993                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995              $C$DW$91        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$91, DW_AT_name("Ki")
     998                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_Ki")
     999                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1000                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1001              
    1002              $C$DW$92        .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1004                      .dwattr $C$DW$92, DW_AT_name("Kd")
    1005                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_Kd")
    1006                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1007                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1008              
    1009              $C$DW$93        .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1011                      .dwattr $C$DW$93, DW_AT_name("Km")
    1012                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_Km")
    1013                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1014                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1015              
    1016              $C$DW$94        .dwtag  DW_TAG_member
    1017                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1018                      .dwattr $C$DW$94, DW_AT_name("Umax")
    1019                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_Umax")
    1020                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1021                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1022              
    1023              $C$DW$95        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   20

    1024                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1025                      .dwattr $C$DW$95, DW_AT_name("Umin")
    1026                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_Umin")
    1027                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1028                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1029              
    1030                      .dwendtag $C$DW$T$25
    1031              
    1032              $C$DW$T$28      .dwtag  DW_TAG_typedef
    1033                      .dwattr $C$DW$T$28, DW_AT_name("PID_PARAMETERS")
    1034                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    1035                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1036              
    1037              
    1038              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1039                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    1040              $C$DW$96        .dwtag  DW_TAG_member
    1041                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1042                      .dwattr $C$DW$96, DW_AT_name("up")
    1043                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_up")
    1044                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1046              
    1047              $C$DW$97        .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1049                      .dwattr $C$DW$97, DW_AT_name("ui")
    1050                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_ui")
    1051                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1052                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1053              
    1054              $C$DW$98        .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1056                      .dwattr $C$DW$98, DW_AT_name("ud")
    1057                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_ud")
    1058                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1059                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1060              
    1061              $C$DW$99        .dwtag  DW_TAG_member
    1062                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1063                      .dwattr $C$DW$99, DW_AT_name("v1")
    1064                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_v1")
    1065                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1066                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1067              
    1068              $C$DW$100       .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1070                      .dwattr $C$DW$100, DW_AT_name("i1")
    1071                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_i1")
    1072                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1073                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1074              
    1075              $C$DW$101       .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1077                      .dwattr $C$DW$101, DW_AT_name("d1")
    1078                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_d1")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   21

    1079                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1080                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1081              
    1082              $C$DW$102       .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1084                      .dwattr $C$DW$102, DW_AT_name("d2")
    1085                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_d2")
    1086                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1087                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1088              
    1089              $C$DW$103       .dwtag  DW_TAG_member
    1090                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1091                      .dwattr $C$DW$103, DW_AT_name("w1")
    1092                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_w1")
    1093                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1094                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1095              
    1096                      .dwendtag $C$DW$T$26
    1097              
    1098              $C$DW$T$29      .dwtag  DW_TAG_typedef
    1099                      .dwattr $C$DW$T$29, DW_AT_name("PID_DATA")
    1100                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    1101                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1102              
    1103              
    1104              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1105                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
    1106              $C$DW$104       .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$27)
    1108                      .dwattr $C$DW$104, DW_AT_name("term")
    1109                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_term")
    1110                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1111                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1112              
    1113              $C$DW$105       .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$28)
    1115                      .dwattr $C$DW$105, DW_AT_name("param")
    1116                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_param")
    1117                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1118                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1119              
    1120              $C$DW$106       .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$29)
    1122                      .dwattr $C$DW$106, DW_AT_name("data")
    1123                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_data")
    1124                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1125                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1126              
    1127                      .dwendtag $C$DW$T$30
    1128              
    1129              $C$DW$T$69      .dwtag  DW_TAG_typedef
    1130                      .dwattr $C$DW$T$69, DW_AT_name("PID_CONTROLLER")
    1131                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$30)
    1132                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1133              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   22

    1134              
    1135              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1136                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
    1137              $C$DW$107       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$107, DW_AT_name("Ualpha")
    1140                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_Ualpha")
    1141                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1143              
    1144              $C$DW$108       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1146                      .dwattr $C$DW$108, DW_AT_name("Ubeta")
    1147                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_Ubeta")
    1148                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1149                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1150              
    1151              $C$DW$109       .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1153                      .dwattr $C$DW$109, DW_AT_name("Ta")
    1154                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_Ta")
    1155                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1156                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1157              
    1158              $C$DW$110       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1160                      .dwattr $C$DW$110, DW_AT_name("Tb")
    1161                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_Tb")
    1162                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1163                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1164              
    1165              $C$DW$111       .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1167                      .dwattr $C$DW$111, DW_AT_name("Tc")
    1168                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_Tc")
    1169                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1170                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1171              
    1172              $C$DW$112       .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1174                      .dwattr $C$DW$112, DW_AT_name("tmp1")
    1175                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_tmp1")
    1176                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1177                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1178              
    1179              $C$DW$113       .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1181                      .dwattr $C$DW$113, DW_AT_name("tmp2")
    1182                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_tmp2")
    1183                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1184                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1185              
    1186              $C$DW$114       .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1188                      .dwattr $C$DW$114, DW_AT_name("tmp3")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   23

    1189                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_tmp3")
    1190                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1191                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1192              
    1193              $C$DW$115       .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$31)
    1195                      .dwattr $C$DW$115, DW_AT_name("VecSector")
    1196                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_VecSector")
    1197                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1198                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1199              
    1200                      .dwendtag $C$DW$T$32
    1201              
    1202              $C$DW$T$70      .dwtag  DW_TAG_typedef
    1203                      .dwattr $C$DW$T$70, DW_AT_name("SVGEN")
    1204                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
    1205                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1206              
    1207              
    1208              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1209                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    1210              $C$DW$116       .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1212                      .dwattr $C$DW$116, DW_AT_name("TargetValue")
    1213                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_TargetValue")
    1214                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1216              
    1217              $C$DW$117       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$33)
    1219                      .dwattr $C$DW$117, DW_AT_name("RampDelayMax")
    1220                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_RampDelayMax")
    1221                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1222                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1223              
    1224              $C$DW$118       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1226                      .dwattr $C$DW$118, DW_AT_name("RampLowLimit")
    1227                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_RampLowLimit")
    1228                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1229                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1230              
    1231              $C$DW$119       .dwtag  DW_TAG_member
    1232                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1233                      .dwattr $C$DW$119, DW_AT_name("RampHighLimit")
    1234                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_RampHighLimit")
    1235                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1236                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1237              
    1238              $C$DW$120       .dwtag  DW_TAG_member
    1239                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$33)
    1240                      .dwattr $C$DW$120, DW_AT_name("RampDelayCount")
    1241                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_RampDelayCount")
    1242                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1243                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   24

    1244              
    1245              $C$DW$121       .dwtag  DW_TAG_member
    1246                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1247                      .dwattr $C$DW$121, DW_AT_name("SetpointValue")
    1248                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_SetpointValue")
    1249                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1250                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1251              
    1252              $C$DW$122       .dwtag  DW_TAG_member
    1253                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$33)
    1254                      .dwattr $C$DW$122, DW_AT_name("EqualFlag")
    1255                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_EqualFlag")
    1256                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1257                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1258              
    1259              $C$DW$123       .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1261                      .dwattr $C$DW$123, DW_AT_name("Tmp")
    1262                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_Tmp")
    1263                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1264                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1265              
    1266                      .dwendtag $C$DW$T$34
    1267              
    1268              $C$DW$T$71      .dwtag  DW_TAG_typedef
    1269                      .dwattr $C$DW$T$71, DW_AT_name("RMPCNTL")
    1270                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    1271                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1272              
    1273              
    1274              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1275                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    1276              $C$DW$124       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1278                      .dwattr $C$DW$124, DW_AT_name("Freq")
    1279                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_Freq")
    1280                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1281                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1282              
    1283              $C$DW$125       .dwtag  DW_TAG_member
    1284                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1285                      .dwattr $C$DW$125, DW_AT_name("StepAngleMax")
    1286                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_StepAngleMax")
    1287                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1288                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1289              
    1290              $C$DW$126       .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1292                      .dwattr $C$DW$126, DW_AT_name("Angle")
    1293                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_Angle")
    1294                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1295                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1296              
    1297              $C$DW$127       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   25

    1299                      .dwattr $C$DW$127, DW_AT_name("Gain")
    1300                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_Gain")
    1301                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1302                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1303              
    1304              $C$DW$128       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1306                      .dwattr $C$DW$128, DW_AT_name("Out")
    1307                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_Out")
    1308                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1309                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1310              
    1311              $C$DW$129       .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1313                      .dwattr $C$DW$129, DW_AT_name("Offset")
    1314                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_Offset")
    1315                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1316                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1317              
    1318                      .dwendtag $C$DW$T$35
    1319              
    1320              $C$DW$T$72      .dwtag  DW_TAG_typedef
    1321                      .dwattr $C$DW$T$72, DW_AT_name("RAMPGEN")
    1322                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    1323                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1324              
    1325              
    1326              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1327                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
    1328              $C$DW$130       .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1330                      .dwattr $C$DW$130, DW_AT_name("DcBusVolt")
    1331                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_DcBusVolt")
    1332                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1334              
    1335              $C$DW$131       .dwtag  DW_TAG_member
    1336                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1337                      .dwattr $C$DW$131, DW_AT_name("MfuncV1")
    1338                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_MfuncV1")
    1339                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1340                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1341              
    1342              $C$DW$132       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1344                      .dwattr $C$DW$132, DW_AT_name("MfuncV2")
    1345                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_MfuncV2")
    1346                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1347                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1348              
    1349              $C$DW$133       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1351                      .dwattr $C$DW$133, DW_AT_name("MfuncV3")
    1352                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_MfuncV3")
    1353                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   26

    1354                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1355              
    1356              $C$DW$134       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$31)
    1358                      .dwattr $C$DW$134, DW_AT_name("OutOfPhase")
    1359                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_OutOfPhase")
    1360                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1361                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1362              
    1363              $C$DW$135       .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1365                      .dwattr $C$DW$135, DW_AT_name("VphaseA")
    1366                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_VphaseA")
    1367                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1368                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1369              
    1370              $C$DW$136       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1372                      .dwattr $C$DW$136, DW_AT_name("VphaseB")
    1373                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_VphaseB")
    1374                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1375                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1376              
    1377              $C$DW$137       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1379                      .dwattr $C$DW$137, DW_AT_name("VphaseC")
    1380                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_VphaseC")
    1381                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1382                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1383              
    1384              $C$DW$138       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1386                      .dwattr $C$DW$138, DW_AT_name("Valpha")
    1387                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_Valpha")
    1388                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1389                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1390              
    1391              $C$DW$139       .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1393                      .dwattr $C$DW$139, DW_AT_name("Vbeta")
    1394                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_Vbeta")
    1395                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1396                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1397              
    1398              $C$DW$140       .dwtag  DW_TAG_member
    1399                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1400                      .dwattr $C$DW$140, DW_AT_name("temp")
    1401                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_temp")
    1402                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1403                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1404              
    1405                      .dwendtag $C$DW$T$36
    1406              
    1407              $C$DW$T$73      .dwtag  DW_TAG_typedef
    1408                      .dwattr $C$DW$T$73, DW_AT_name("PHASEVOLTAGE")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   27

    1409                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$36)
    1410                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1411              
    1412              
    1413              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1414                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    1415              $C$DW$141       .dwtag  DW_TAG_member
    1416                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1417                      .dwattr $C$DW$141, DW_AT_name("ElecTheta")
    1418                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ElecTheta")
    1419                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1420                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1421              
    1422              $C$DW$142       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$33)
    1424                      .dwattr $C$DW$142, DW_AT_name("DirectionQep")
    1425                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_DirectionQep")
    1426                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1427                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1428              
    1429              $C$DW$143       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1431                      .dwattr $C$DW$143, DW_AT_name("OldElecTheta")
    1432                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_OldElecTheta")
    1433                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1434                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1435              
    1436              $C$DW$144       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1438                      .dwattr $C$DW$144, DW_AT_name("Speed")
    1439                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_Speed")
    1440                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1441                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1442              
    1443              $C$DW$145       .dwtag  DW_TAG_member
    1444                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$33)
    1445                      .dwattr $C$DW$145, DW_AT_name("BaseRpm")
    1446                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_BaseRpm")
    1447                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1448                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1449              
    1450              $C$DW$146       .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$37)
    1452                      .dwattr $C$DW$146, DW_AT_name("K1")
    1453                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_K1")
    1454                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1455                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1456              
    1457              $C$DW$147       .dwtag  DW_TAG_member
    1458                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1459                      .dwattr $C$DW$147, DW_AT_name("K2")
    1460                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_K2")
    1461                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1462                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1463              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   28

    1464              $C$DW$148       .dwtag  DW_TAG_member
    1465                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1466                      .dwattr $C$DW$148, DW_AT_name("K3")
    1467                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_K3")
    1468                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1469                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1470              
    1471              $C$DW$149       .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$38)
    1473                      .dwattr $C$DW$149, DW_AT_name("SpeedRpm")
    1474                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_SpeedRpm")
    1475                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1476                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1477              
    1478              $C$DW$150       .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1480                      .dwattr $C$DW$150, DW_AT_name("Tmp")
    1481                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_Tmp")
    1482                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1483                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1484              
    1485                      .dwendtag $C$DW$T$39
    1486              
    1487              $C$DW$T$74      .dwtag  DW_TAG_typedef
    1488                      .dwattr $C$DW$T$74, DW_AT_name("SPEED_MEAS_QEP")
    1489                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$39)
    1490                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1491              
    1492              
    1493              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1494                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    1495              $C$DW$151       .dwtag  DW_TAG_member
    1496                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$40)
    1497                      .dwattr $C$DW$151, DW_AT_name("ElecTheta")
    1498                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ElecTheta")
    1499                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1501              
    1502              $C$DW$152       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$40)
    1504                      .dwattr $C$DW$152, DW_AT_name("MechTheta")
    1505                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_MechTheta")
    1506                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1507                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1508              
    1509              $C$DW$153       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
    1511                      .dwattr $C$DW$153, DW_AT_name("DirectionQep")
    1512                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_DirectionQep")
    1513                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1514                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1515              
    1516              $C$DW$154       .dwtag  DW_TAG_member
    1517                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$31)
    1518                      .dwattr $C$DW$154, DW_AT_name("QepPeriod")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   29

    1519                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_QepPeriod")
    1520                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1521                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1522              
    1523              $C$DW$155       .dwtag  DW_TAG_member
    1524                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$33)
    1525                      .dwattr $C$DW$155, DW_AT_name("QepCountIndex")
    1526                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_QepCountIndex")
    1527                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1528                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1529              
    1530              $C$DW$156       .dwtag  DW_TAG_member
    1531                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$38)
    1532                      .dwattr $C$DW$156, DW_AT_name("RawTheta")
    1533                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_RawTheta")
    1534                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1535                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1536              
    1537              $C$DW$157       .dwtag  DW_TAG_member
    1538                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$40)
    1539                      .dwattr $C$DW$157, DW_AT_name("MechScaler")
    1540                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_MechScaler")
    1541                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1542                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1543              
    1544              $C$DW$158       .dwtag  DW_TAG_member
    1545                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$31)
    1546                      .dwattr $C$DW$158, DW_AT_name("LineEncoder")
    1547                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_LineEncoder")
    1548                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1549                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1550              
    1551              $C$DW$159       .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$31)
    1553                      .dwattr $C$DW$159, DW_AT_name("PolePairs")
    1554                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PolePairs")
    1555                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1556                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1557              
    1558              $C$DW$160       .dwtag  DW_TAG_member
    1559                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$38)
    1560                      .dwattr $C$DW$160, DW_AT_name("CalibratedAngle")
    1561                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_CalibratedAngle")
    1562                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1563                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1564              
    1565              $C$DW$161       .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$31)
    1567                      .dwattr $C$DW$161, DW_AT_name("IndexSyncFlag")
    1568                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_IndexSyncFlag")
    1569                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1570                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1571              
    1572                      .dwendtag $C$DW$T$41
    1573              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   30

    1574              $C$DW$T$75      .dwtag  DW_TAG_typedef
    1575                      .dwattr $C$DW$T$75, DW_AT_name("QEP")
    1576                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    1577                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1578              
    1579              
    1580              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1581                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x07)
    1582              $C$DW$162       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$42)
    1584                      .dwattr $C$DW$162, DW_AT_name("stat_reg1")
    1585                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_stat_reg1")
    1586                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1587                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1588              
    1589              $C$DW$163       .dwtag  DW_TAG_member
    1590                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$43)
    1591                      .dwattr $C$DW$163, DW_AT_name("stat_reg2")
    1592                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_stat_reg2")
    1593                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1594                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1595              
    1596              $C$DW$164       .dwtag  DW_TAG_member
    1597                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$44)
    1598                      .dwattr $C$DW$164, DW_AT_name("cntrl_reg1")
    1599                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_cntrl_reg1")
    1600                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1601                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1602              
    1603              $C$DW$165       .dwtag  DW_TAG_member
    1604                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$45)
    1605                      .dwattr $C$DW$165, DW_AT_name("cntrl_reg2")
    1606                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_cntrl_reg2")
    1607                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1608                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1609              
    1610              $C$DW$166       .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$31)
    1612                      .dwattr $C$DW$166, DW_AT_name("readCntrl1")
    1613                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_readCntrl1")
    1614                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1615                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1616              
    1617              $C$DW$167       .dwtag  DW_TAG_member
    1618                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$31)
    1619                      .dwattr $C$DW$167, DW_AT_name("readCntrl2")
    1620                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_readCntrl2")
    1621                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1622                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1623              
    1624              $C$DW$168       .dwtag  DW_TAG_member
    1625                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$31)
    1626                      .dwattr $C$DW$168, DW_AT_name("DRV_fault")
    1627                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_DRV_fault")
    1628                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   31

    1629                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1630              
    1631                      .dwendtag $C$DW$T$46
    1632              
    1633              $C$DW$T$76      .dwtag  DW_TAG_typedef
    1634                      .dwattr $C$DW$T$76, DW_AT_name("DRV8301_Vars")
    1635                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$46)
    1636                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1637              
    1638              
    1639              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    1640                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x15)
    1641              $C$DW$169       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$31)
    1643                      .dwattr $C$DW$169, DW_AT_name("Rsvd0")
    1644                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_Rsvd0")
    1645                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1646                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1647              
    1648              $C$DW$170       .dwtag  DW_TAG_member
    1649                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$47)
    1650                      .dwattr $C$DW$170, DW_AT_name("status1_wwd")
    1651                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_status1_wwd")
    1652                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1653                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1654              
    1655              $C$DW$171       .dwtag  DW_TAG_member
    1656                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$48)
    1657                      .dwattr $C$DW$171, DW_AT_name("status2_ov_vds")
    1658                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_status2_ov_vds")
    1659                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1660                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1661              
    1662              $C$DW$172       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$49)
    1664                      .dwattr $C$DW$172, DW_AT_name("status3_IC")
    1665                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_status3_IC")
    1666                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1667                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1668              
    1669              $C$DW$173       .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$50)
    1671                      .dwattr $C$DW$173, DW_AT_name("status4_gd_Vgs")
    1672                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    1673                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1674                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1675              
    1676              $C$DW$174       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$51)
    1678                      .dwattr $C$DW$174, DW_AT_name("cntrl5_hs_gd")
    1679                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    1680                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1681                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1682              
    1683              $C$DW$175       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   32

    1684                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$52)
    1685                      .dwattr $C$DW$175, DW_AT_name("cntrl6_ls_gd")
    1686                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    1687                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1688                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1689              
    1690              $C$DW$176       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$53)
    1692                      .dwattr $C$DW$176, DW_AT_name("cntrl7_gd")
    1693                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_cntrl7_gd")
    1694                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1695                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1696              
    1697              $C$DW$177       .dwtag  DW_TAG_member
    1698                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$31)
    1699                      .dwattr $C$DW$177, DW_AT_name("Rsvd8")
    1700                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_Rsvd8")
    1701                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1702                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1703              
    1704              $C$DW$178       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$54)
    1706                      .dwattr $C$DW$178, DW_AT_name("cntrl9_IC_ops")
    1707                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    1708                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1709                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1710              
    1711              $C$DW$179       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$55)
    1713                      .dwattr $C$DW$179, DW_AT_name("cntrlA_shunt_amp")
    1714                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    1715                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1716                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1717              
    1718              $C$DW$180       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$56)
    1720                      .dwattr $C$DW$180, DW_AT_name("cntrlB_Vreg")
    1721                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    1722                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1723                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1724              
    1725              $C$DW$181       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$57)
    1727                      .dwattr $C$DW$181, DW_AT_name("cntrlC_Vds_SNS")
    1728                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    1729                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1730                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1731              
    1732              $C$DW$182       .dwtag  DW_TAG_member
    1733                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$31)
    1734                      .dwattr $C$DW$182, DW_AT_name("readCntrl5")
    1735                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_readCntrl5")
    1736                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1737                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1738              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   33

    1739              $C$DW$183       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$31)
    1741                      .dwattr $C$DW$183, DW_AT_name("readCntrl6")
    1742                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_readCntrl6")
    1743                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1744                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1745              
    1746              $C$DW$184       .dwtag  DW_TAG_member
    1747                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$31)
    1748                      .dwattr $C$DW$184, DW_AT_name("readCntrl7")
    1749                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_readCntrl7")
    1750                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1751                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1752              
    1753              $C$DW$185       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$31)
    1755                      .dwattr $C$DW$185, DW_AT_name("readCntrl9")
    1756                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_readCntrl9")
    1757                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1758                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1759              
    1760              $C$DW$186       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$31)
    1762                      .dwattr $C$DW$186, DW_AT_name("readCntrlA")
    1763                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_readCntrlA")
    1764                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1765                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1766              
    1767              $C$DW$187       .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
    1769                      .dwattr $C$DW$187, DW_AT_name("readCntrlB")
    1770                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_readCntrlB")
    1771                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1772                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1773              
    1774              $C$DW$188       .dwtag  DW_TAG_member
    1775                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$31)
    1776                      .dwattr $C$DW$188, DW_AT_name("readCntrlC")
    1777                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_readCntrlC")
    1778                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1779                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1780              
    1781              $C$DW$189       .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$31)
    1783                      .dwattr $C$DW$189, DW_AT_name("DRV_fault")
    1784                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_DRV_fault")
    1785                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1786                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1787              
    1788                      .dwendtag $C$DW$T$58
    1789              
    1790              $C$DW$T$77      .dwtag  DW_TAG_typedef
    1791                      .dwattr $C$DW$T$77, DW_AT_name("DRV8305_Vars")
    1792                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$58)
    1793                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   34

    1794              
    1795              
    1796              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    1797                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x150)
    1798              $C$DW$190       .dwtag  DW_TAG_member
    1799                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$60)
    1800                      .dwattr $C$DW$190, DW_AT_name("PwmARegs")
    1801                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PwmARegs")
    1802                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1803                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1804              
    1805              $C$DW$191       .dwtag  DW_TAG_member
    1806                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$60)
    1807                      .dwattr $C$DW$191, DW_AT_name("PwmBRegs")
    1808                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PwmBRegs")
    1809                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1810                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1811              
    1812              $C$DW$192       .dwtag  DW_TAG_member
    1813                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$60)
    1814                      .dwattr $C$DW$192, DW_AT_name("PwmCRegs")
    1815                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PwmCRegs")
    1816                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1817                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1818              
    1819              $C$DW$193       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$62)
    1821                      .dwattr $C$DW$193, DW_AT_name("QepRegs")
    1822                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_QepRegs")
    1823                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1824                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1825              
    1826              $C$DW$194       .dwtag  DW_TAG_member
    1827                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$64)
    1828                      .dwattr $C$DW$194, DW_AT_name("SpiRegs")
    1829                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_SpiRegs")
    1830                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1831                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1832              
    1833              $C$DW$195       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$31)
    1835                      .dwattr $C$DW$195, DW_AT_name("drvScsPin")
    1836                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_drvScsPin")
    1837                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1838                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1839              
    1840              $C$DW$196       .dwtag  DW_TAG_member
    1841                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    1842                      .dwattr $C$DW$196, DW_AT_name("offset_shntA")
    1843                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_offset_shntA")
    1844                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1845                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1846              
    1847              $C$DW$197       .dwtag  DW_TAG_member
    1848                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   35

    1849                      .dwattr $C$DW$197, DW_AT_name("offset_shntB")
    1850                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_offset_shntB")
    1851                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1852                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1853              
    1854              $C$DW$198       .dwtag  DW_TAG_member
    1855                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    1856                      .dwattr $C$DW$198, DW_AT_name("offset_shntC")
    1857                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_offset_shntC")
    1858                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1859                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1860              
    1861              $C$DW$199       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    1863                      .dwattr $C$DW$199, DW_AT_name("VdTesting")
    1864                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_VdTesting")
    1865                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1866                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1867              
    1868              $C$DW$200       .dwtag  DW_TAG_member
    1869                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    1870                      .dwattr $C$DW$200, DW_AT_name("VqTesting")
    1871                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_VqTesting")
    1872                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1873                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1874              
    1875              $C$DW$201       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    1877                      .dwattr $C$DW$201, DW_AT_name("IdRef")
    1878                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_IdRef")
    1879                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1880                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1881              
    1882              $C$DW$202       .dwtag  DW_TAG_member
    1883                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    1884                      .dwattr $C$DW$202, DW_AT_name("IqRef")
    1885                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_IqRef")
    1886                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1887                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1888              
    1889              $C$DW$203       .dwtag  DW_TAG_member
    1890                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    1891                      .dwattr $C$DW$203, DW_AT_name("SpeedRef")
    1892                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_SpeedRef")
    1893                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1894                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1895              
    1896              $C$DW$204       .dwtag  DW_TAG_member
    1897                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    1898                      .dwattr $C$DW$204, DW_AT_name("ElecTheta")
    1899                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_ElecTheta")
    1900                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1901                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1902              
    1903              $C$DW$205       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   36

    1904                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    1905                      .dwattr $C$DW$205, DW_AT_name("MechTheta")
    1906                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_MechTheta")
    1907                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1908                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1909              
    1910              $C$DW$206       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$40)
    1912                      .dwattr $C$DW$206, DW_AT_name("currentAs")
    1913                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_currentAs")
    1914                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1915                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1916              
    1917              $C$DW$207       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$40)
    1919                      .dwattr $C$DW$207, DW_AT_name("currentBs")
    1920                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_currentBs")
    1921                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1922                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1923              
    1924              $C$DW$208       .dwtag  DW_TAG_member
    1925                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$40)
    1926                      .dwattr $C$DW$208, DW_AT_name("currentCs")
    1927                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_currentCs")
    1928                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1929                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1930              
    1931              $C$DW$209       .dwtag  DW_TAG_member
    1932                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$38)
    1933                      .dwattr $C$DW$209, DW_AT_name("alignCntr")
    1934                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_alignCntr")
    1935                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1936                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1937              
    1938              $C$DW$210       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$38)
    1940                      .dwattr $C$DW$210, DW_AT_name("alignCnt")
    1941                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_alignCnt")
    1942                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1943                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1944              
    1945              $C$DW$211       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$31)
    1947                      .dwattr $C$DW$211, DW_AT_name("lsw")
    1948                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_lsw")
    1949                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1950                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1951              
    1952              $C$DW$212       .dwtag  DW_TAG_member
    1953                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$31)
    1954                      .dwattr $C$DW$212, DW_AT_name("TripFlagDMC")
    1955                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_TripFlagDMC")
    1956                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1957                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1958              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:45 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   37

    1959              $C$DW$213       .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$31)
    1961                      .dwattr $C$DW$213, DW_AT_name("clearTripFlagDMC")
    1962                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_clearTripFlagDMC")
    1963                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
