TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Sat Nov 14 12:25:42 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("InputXbarRegs")

    1457              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1458              ;***************************************************************
    1459              
    1460              _GPIO_EnableUnbondedIOPullups:
    1461              ;* AL    assigned to _pin_count
    1462              $C$DW$77        .dwtag  DW_TAG_variable
    1463                      .dwattr $C$DW$77, DW_AT_name("pin_count")
    1464                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_pin_count")
    1465                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$6)
    1466                      .dwattr $C$DW$77, DW_AT_location[DW_OP_reg0]
    1467              
    1468                      .dwcfi  cfa_offset, -2
    1469                      .dwcfi  save_reg_to_mem, 26, 0
    1470 000001bd 761F!         MOVW      DP,#_DevCfgRegs+8     ; [CPU_ARAU] 
         000001be 0000 
    1471 000001bf 2901          CLRC      SXM                   ; [CPU_ALU] 
    1472                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1473 000001c0 0608!         MOVL      ACC,@$BLOCKED(_DevCfgRegs)+8 ; [CPU_ALU] |317| 
    1474 000001c1 FF47          SFR       ACC,8                 ; [CPU_ALU] |317| 
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   29

    1475 000001c2 9007          ANDB      AL,#0x07              ; [CPU_ALU] |317| 
    1476 000001c3 5205          CMPB      AL,#5                 ; [CPU_ALU] |317| 
    1477 000001c4 6106          B         $C$L18,EQ             ; [CPU_ALU] |317| 
    1478                      ; branchcc occurs ; [] |317| 
    1479                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1480 000001c5 5206          CMPB      AL,#6                 ; [CPU_ALU] |328| 
    1481 000001c6 6006          B         $C$L19,NEQ            ; [CPU_ALU] |328| 
    1482                      ; branchcc occurs ; [] |328| 
    1483                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1484              $C$DW$78        .dwtag  DW_TAG_TI_branch
    1485                      .dwattr $C$DW$78, DW_AT_low_pc(0x00)
    1486                      .dwattr $C$DW$78, DW_AT_name("_GPIO_EnableUnbondedIOPullupsFor176Pin")
    1487                      .dwattr $C$DW$78, DW_AT_TI_call
    1488              
    1489 000001c7 7640'         LCR       #_GPIO_EnableUnbondedIOPullupsFor176Pin ; [CPU_ALU] |330| 
         000001c8 017F 
    1490                      ; call occurs [#_GPIO_EnableUnbondedIOPullupsFor176Pin] ; [] |330| 
    1491 000001c9 6F03          B         $C$L19,UNC            ; [CPU_ALU] 
    1492                      ; branch occurs ; [] 
    1493 000001ca       $C$L18:    
    1494                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1495              $C$DW$79        .dwtag  DW_TAG_TI_branch
    1496                      .dwattr $C$DW$79, DW_AT_low_pc(0x00)
    1497                      .dwattr $C$DW$79, DW_AT_name("_GPIO_EnableUnbondedIOPullupsFor100Pin")
    1498                      .dwattr $C$DW$79, DW_AT_TI_call
    1499              
    1500 000001ca 7640'         LCR       #_GPIO_EnableUnbondedIOPullupsFor100Pin ; [CPU_ALU] |326| 
         000001cb 0198 
    1501                      ; call occurs [#_GPIO_EnableUnbondedIOPullupsFor100Pin] ; [] |326| 
    1502              $C$L19:    
    1503              $C$DW$80        .dwtag  DW_TAG_TI_branch
    1504                      .dwattr $C$DW$80, DW_AT_low_pc(0x00)
    1505                      .dwattr $C$DW$80, DW_AT_TI_return
    1506              
    1507 000001cc 0006          LRETR     ; [CPU_ALU] 
    1508                      ; return occurs ; [] 
    1509                      .dwattr $C$DW$76, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/so
    1510                      .dwattr $C$DW$76, DW_AT_TI_end_line(0x151)
    1511                      .dwattr $C$DW$76, DW_AT_TI_end_column(0x01)
    1512                      .dwendentry
    1513                      .dwendtag $C$DW$76
    1514              
    1515              ;**************************************************************
    1516              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1517              ;**************************************************************
    1518                      .global _InputXbarRegs
    1519                      .global _GpioDataRegs
    1520                      .global _DevCfgRegs
    1521                      .global _GpioCtrlRegs
    1522              
    1523              ;***************************************************************
    1524              ;* TYPE INFORMATION                                            *
    1525              ;***************************************************************
    1526              
    1527              $C$DW$T$20      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   30

    1528                      .dwattr $C$DW$T$20, DW_AT_name("DC0_BITS")
    1529                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1530              $C$DW$81        .dwtag  DW_TAG_member
    1531                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1532                      .dwattr $C$DW$81, DW_AT_name("SINGLE_CORE")
    1533                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_SINGLE_CORE")
    1534                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0f)
    1535                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1536                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1537                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1538              
    1539              $C$DW$82        .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1541                      .dwattr $C$DW$82, DW_AT_name("rsvd1")
    1542                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd1")
    1543                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1544                      .dwattr $C$DW$82, DW_AT_bit_size(0x0f)
    1545                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1546                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1547              
    1548              $C$DW$83        .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1550                      .dwattr $C$DW$83, DW_AT_name("rsvd2")
    1551                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd2")
    1552                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00)
    1553                      .dwattr $C$DW$83, DW_AT_bit_size(0x10)
    1554                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1555                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1556              
    1557                      .dwendtag $C$DW$T$20
    1558              
    1559              
    1560              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1561                      .dwattr $C$DW$T$22, DW_AT_name("DC0_REG")
    1562                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1563              $C$DW$84        .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1565                      .dwattr $C$DW$84, DW_AT_name("all")
    1566                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_all")
    1567                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1568                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1569              
    1570              $C$DW$85        .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    1572                      .dwattr $C$DW$85, DW_AT_name("bit")
    1573                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_bit")
    1574                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1575                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1576              
    1577                      .dwendtag $C$DW$T$22
    1578              
    1579              
    1580              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1581                      .dwattr $C$DW$T$23, DW_AT_name("DC10_BITS")
    1582                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   31

    1583              $C$DW$86        .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1585                      .dwattr $C$DW$86, DW_AT_name("I2C_A")
    1586                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_I2C_A")
    1587                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0f)
    1588                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1589                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1590                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1591              
    1592              $C$DW$87        .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1594                      .dwattr $C$DW$87, DW_AT_name("I2C_B")
    1595                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_I2C_B")
    1596                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0e)
    1597                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1598                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1599                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1600              
    1601              $C$DW$88        .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1603                      .dwattr $C$DW$88, DW_AT_name("rsvd1")
    1604                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd1")
    1605                      .dwattr $C$DW$88, DW_AT_bit_offset(0x00)
    1606                      .dwattr $C$DW$88, DW_AT_bit_size(0x0e)
    1607                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1608                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1609              
    1610              $C$DW$89        .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1612                      .dwattr $C$DW$89, DW_AT_name("rsvd2")
    1613                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd2")
    1614                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0f)
    1615                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1616                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1617                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1618              
    1619              $C$DW$90        .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1621                      .dwattr $C$DW$90, DW_AT_name("rsvd3")
    1622                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd3")
    1623                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0e)
    1624                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1625                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1626                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1627              
    1628              $C$DW$91        .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1630                      .dwattr $C$DW$91, DW_AT_name("rsvd4")
    1631                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd4")
    1632                      .dwattr $C$DW$91, DW_AT_bit_offset(0x00)
    1633                      .dwattr $C$DW$91, DW_AT_bit_size(0x0e)
    1634                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1635                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1636              
    1637                      .dwendtag $C$DW$T$23
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   32

    1638              
    1639              
    1640              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1641                      .dwattr $C$DW$T$24, DW_AT_name("DC10_REG")
    1642                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1643              $C$DW$92        .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
    1645                      .dwattr $C$DW$92, DW_AT_name("all")
    1646                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_all")
    1647                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1649              
    1650              $C$DW$93        .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$23)
    1652                      .dwattr $C$DW$93, DW_AT_name("bit")
    1653                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_bit")
    1654                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1655                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1656              
    1657                      .dwendtag $C$DW$T$24
    1658              
    1659              
    1660              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1661                      .dwattr $C$DW$T$25, DW_AT_name("DC11_BITS")
    1662                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1663              $C$DW$94        .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1665                      .dwattr $C$DW$94, DW_AT_name("CAN_A")
    1666                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_CAN_A")
    1667                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0f)
    1668                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1669                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1670                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1671              
    1672              $C$DW$95        .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1674                      .dwattr $C$DW$95, DW_AT_name("CAN_B")
    1675                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_CAN_B")
    1676                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0e)
    1677                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1678                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1680              
    1681              $C$DW$96        .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1683                      .dwattr $C$DW$96, DW_AT_name("rsvd1")
    1684                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd1")
    1685                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0d)
    1686                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1687                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1689              
    1690              $C$DW$97        .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1692                      .dwattr $C$DW$97, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   33

    1693                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd2")
    1694                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0c)
    1695                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1696                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1698              
    1699              $C$DW$98        .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1701                      .dwattr $C$DW$98, DW_AT_name("rsvd3")
    1702                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd3")
    1703                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00)
    1704                      .dwattr $C$DW$98, DW_AT_bit_size(0x0c)
    1705                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1706                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1707              
    1708              $C$DW$99        .dwtag  DW_TAG_member
    1709                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1710                      .dwattr $C$DW$99, DW_AT_name("rsvd4")
    1711                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd4")
    1712                      .dwattr $C$DW$99, DW_AT_bit_offset(0x00)
    1713                      .dwattr $C$DW$99, DW_AT_bit_size(0x10)
    1714                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1715                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1716              
    1717                      .dwendtag $C$DW$T$25
    1718              
    1719              
    1720              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1721                      .dwattr $C$DW$T$26, DW_AT_name("DC11_REG")
    1722                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1723              $C$DW$100       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
    1725                      .dwattr $C$DW$100, DW_AT_name("all")
    1726                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_all")
    1727                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1729              
    1730              $C$DW$101       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$25)
    1732                      .dwattr $C$DW$101, DW_AT_name("bit")
    1733                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_bit")
    1734                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1736              
    1737                      .dwendtag $C$DW$T$26
    1738              
    1739              
    1740              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1741                      .dwattr $C$DW$T$27, DW_AT_name("DC12_BITS")
    1742                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1743              $C$DW$102       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$102, DW_AT_name("McBSP_A")
    1746                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_McBSP_A")
    1747                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   34

    1748                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1749                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1751              
    1752              $C$DW$103       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$103, DW_AT_name("McBSP_B")
    1755                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_McBSP_B")
    1756                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0e)
    1757                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1758                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1759                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1760              
    1761              $C$DW$104       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1763                      .dwattr $C$DW$104, DW_AT_name("rsvd1")
    1764                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd1")
    1765                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1766                      .dwattr $C$DW$104, DW_AT_bit_size(0x0e)
    1767                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1769              
    1770              $C$DW$105       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$105, DW_AT_name("USB_A")
    1773                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_USB_A")
    1774                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0e)
    1775                      .dwattr $C$DW$105, DW_AT_bit_size(0x02)
    1776                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1777                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1778              
    1779              $C$DW$106       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1781                      .dwattr $C$DW$106, DW_AT_name("rsvd2")
    1782                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd2")
    1783                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0c)
    1784                      .dwattr $C$DW$106, DW_AT_bit_size(0x02)
    1785                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1786                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1787              
    1788              $C$DW$107       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1790                      .dwattr $C$DW$107, DW_AT_name("rsvd3")
    1791                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd3")
    1792                      .dwattr $C$DW$107, DW_AT_bit_offset(0x00)
    1793                      .dwattr $C$DW$107, DW_AT_bit_size(0x0c)
    1794                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1795                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1796              
    1797                      .dwendtag $C$DW$T$27
    1798              
    1799              
    1800              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1801                      .dwattr $C$DW$T$28, DW_AT_name("DC12_REG")
    1802                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   35

    1803              $C$DW$108       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$21)
    1805                      .dwattr $C$DW$108, DW_AT_name("all")
    1806                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_all")
    1807                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1808                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1809              
    1810              $C$DW$109       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$27)
    1812                      .dwattr $C$DW$109, DW_AT_name("bit")
    1813                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_bit")
    1814                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1815                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1816              
    1817                      .dwendtag $C$DW$T$28
    1818              
    1819              
    1820              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1821                      .dwattr $C$DW$T$29, DW_AT_name("DC13_BITS")
    1822                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1823              $C$DW$110       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1825                      .dwattr $C$DW$110, DW_AT_name("uPP_A")
    1826                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_uPP_A")
    1827                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0f)
    1828                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1829                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1830                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1831              
    1832              $C$DW$111       .dwtag  DW_TAG_member
    1833                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1834                      .dwattr $C$DW$111, DW_AT_name("rsvd1")
    1835                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd1")
    1836                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0e)
    1837                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1838                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1839                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1840              
    1841              $C$DW$112       .dwtag  DW_TAG_member
    1842                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1843                      .dwattr $C$DW$112, DW_AT_name("rsvd2")
    1844                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd2")
    1845                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    1846                      .dwattr $C$DW$112, DW_AT_bit_size(0x0e)
    1847                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1848                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1849              
    1850              $C$DW$113       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1852                      .dwattr $C$DW$113, DW_AT_name("rsvd3")
    1853                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd3")
    1854                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00)
    1855                      .dwattr $C$DW$113, DW_AT_bit_size(0x10)
    1856                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1857                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   36

    1858              
    1859                      .dwendtag $C$DW$T$29
    1860              
    1861              
    1862              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1863                      .dwattr $C$DW$T$30, DW_AT_name("DC13_REG")
    1864                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1865              $C$DW$114       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$21)
    1867                      .dwattr $C$DW$114, DW_AT_name("all")
    1868                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_all")
    1869                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1870                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1871              
    1872              $C$DW$115       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$29)
    1874                      .dwattr $C$DW$115, DW_AT_name("bit")
    1875                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_bit")
    1876                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1877                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1878              
    1879                      .dwendtag $C$DW$T$30
    1880              
    1881              
    1882              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1883                      .dwattr $C$DW$T$31, DW_AT_name("DC14_BITS")
    1884                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1885              $C$DW$116       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1887                      .dwattr $C$DW$116, DW_AT_name("ADC_A")
    1888                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_ADC_A")
    1889                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0f)
    1890                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1891                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1892                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1893              
    1894              $C$DW$117       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1896                      .dwattr $C$DW$117, DW_AT_name("ADC_B")
    1897                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_ADC_B")
    1898                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0e)
    1899                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1900                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1901                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1902              
    1903              $C$DW$118       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1905                      .dwattr $C$DW$118, DW_AT_name("ADC_C")
    1906                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_ADC_C")
    1907                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0d)
    1908                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1909                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1910                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1911              
    1912              $C$DW$119       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   37

    1913                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1914                      .dwattr $C$DW$119, DW_AT_name("ADC_D")
    1915                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_ADC_D")
    1916                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0c)
    1917                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1918                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1919                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1920              
    1921              $C$DW$120       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1923                      .dwattr $C$DW$120, DW_AT_name("rsvd1")
    1924                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd1")
    1925                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    1926                      .dwattr $C$DW$120, DW_AT_bit_size(0x0c)
    1927                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1928                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1929              
    1930              $C$DW$121       .dwtag  DW_TAG_member
    1931                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1932                      .dwattr $C$DW$121, DW_AT_name("rsvd2")
    1933                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd2")
    1934                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1935                      .dwattr $C$DW$121, DW_AT_bit_size(0x10)
    1936                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1937                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1938              
    1939                      .dwendtag $C$DW$T$31
    1940              
    1941              
    1942              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1943                      .dwattr $C$DW$T$32, DW_AT_name("DC14_REG")
    1944                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1945              $C$DW$122       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    1947                      .dwattr $C$DW$122, DW_AT_name("all")
    1948                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1949                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1950                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1951              
    1952              $C$DW$123       .dwtag  DW_TAG_member
    1953                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$31)
    1954                      .dwattr $C$DW$123, DW_AT_name("bit")
    1955                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1956                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1957                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1958              
    1959                      .dwendtag $C$DW$T$32
    1960              
    1961              
    1962              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1963                      .dwattr $C$DW$T$33, DW_AT_name("DC15_BITS")
    1964                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1965              $C$DW$124       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1967                      .dwattr $C$DW$124, DW_AT_name("CMPSS1")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   38

    1968                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_CMPSS1")
    1969                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f)
    1970                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1971                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1972                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1973              
    1974              $C$DW$125       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1976                      .dwattr $C$DW$125, DW_AT_name("CMPSS2")
    1977                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_CMPSS2")
    1978                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e)
    1979                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1980                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1981                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1982              
    1983              $C$DW$126       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1985                      .dwattr $C$DW$126, DW_AT_name("CMPSS3")
    1986                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_CMPSS3")
    1987                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0d)
    1988                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1989                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1990                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1991              
    1992              $C$DW$127       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1994                      .dwattr $C$DW$127, DW_AT_name("CMPSS4")
    1995                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_CMPSS4")
    1996                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0c)
    1997                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1998                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1999                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2000              
    2001              $C$DW$128       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2003                      .dwattr $C$DW$128, DW_AT_name("CMPSS5")
    2004                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_CMPSS5")
    2005                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0b)
    2006                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2007                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2008                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2009              
    2010              $C$DW$129       .dwtag  DW_TAG_member
    2011                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2012                      .dwattr $C$DW$129, DW_AT_name("CMPSS6")
    2013                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_CMPSS6")
    2014                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0a)
    2015                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    2016                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2017                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2018              
    2019              $C$DW$130       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2021                      .dwattr $C$DW$130, DW_AT_name("CMPSS7")
    2022                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_CMPSS7")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   39

    2023                      .dwattr $C$DW$130, DW_AT_bit_offset(0x09)
    2024                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2025                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2026                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2027              
    2028              $C$DW$131       .dwtag  DW_TAG_member
    2029                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2030                      .dwattr $C$DW$131, DW_AT_name("CMPSS8")
    2031                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_CMPSS8")
    2032                      .dwattr $C$DW$131, DW_AT_bit_offset(0x08)
    2033                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2034                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2035                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2036              
    2037              $C$DW$132       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2039                      .dwattr $C$DW$132, DW_AT_name("rsvd1")
    2040                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd1")
    2041                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    2042                      .dwattr $C$DW$132, DW_AT_bit_size(0x08)
    2043                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2044                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2045              
    2046              $C$DW$133       .dwtag  DW_TAG_member
    2047                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2048                      .dwattr $C$DW$133, DW_AT_name("rsvd2")
    2049                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd2")
    2050                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00)
    2051                      .dwattr $C$DW$133, DW_AT_bit_size(0x10)
    2052                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2053                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2054              
    2055                      .dwendtag $C$DW$T$33
    2056              
    2057              
    2058              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2059                      .dwattr $C$DW$T$34, DW_AT_name("DC15_REG")
    2060                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2061              $C$DW$134       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$21)
    2063                      .dwattr $C$DW$134, DW_AT_name("all")
    2064                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_all")
    2065                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2066                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2067              
    2068              $C$DW$135       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$33)
    2070                      .dwattr $C$DW$135, DW_AT_name("bit")
    2071                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_bit")
    2072                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2073                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2074              
    2075                      .dwendtag $C$DW$T$34
    2076              
    2077              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   40

    2078              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2079                      .dwattr $C$DW$T$35, DW_AT_name("DC17_BITS")
    2080                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2081              $C$DW$136       .dwtag  DW_TAG_member
    2082                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2083                      .dwattr $C$DW$136, DW_AT_name("rsvd1")
    2084                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd1")
    2085                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0f)
    2086                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2087                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2088                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2089              
    2090              $C$DW$137       .dwtag  DW_TAG_member
    2091                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2092                      .dwattr $C$DW$137, DW_AT_name("rsvd2")
    2093                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd2")
    2094                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0e)
    2095                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2096                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2097                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2098              
    2099              $C$DW$138       .dwtag  DW_TAG_member
    2100                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2101                      .dwattr $C$DW$138, DW_AT_name("rsvd3")
    2102                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd3")
    2103                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0d)
    2104                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2105                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2106                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2107              
    2108              $C$DW$139       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2110                      .dwattr $C$DW$139, DW_AT_name("rsvd4")
    2111                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd4")
    2112                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0c)
    2113                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2114                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2115                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2116              
    2117              $C$DW$140       .dwtag  DW_TAG_member
    2118                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2119                      .dwattr $C$DW$140, DW_AT_name("rsvd5")
    2120                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_rsvd5")
    2121                      .dwattr $C$DW$140, DW_AT_bit_offset(0x00)
    2122                      .dwattr $C$DW$140, DW_AT_bit_size(0x0c)
    2123                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2124                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2125              
    2126              $C$DW$141       .dwtag  DW_TAG_member
    2127                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2128                      .dwattr $C$DW$141, DW_AT_name("DAC_A")
    2129                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_DAC_A")
    2130                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0f)
    2131                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2132                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   41

    2133                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2134              
    2135              $C$DW$142       .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2137                      .dwattr $C$DW$142, DW_AT_name("DAC_B")
    2138                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_DAC_B")
    2139                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0e)
    2140                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2141                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2142                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2143              
    2144              $C$DW$143       .dwtag  DW_TAG_member
    2145                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2146                      .dwattr $C$DW$143, DW_AT_name("DAC_C")
    2147                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_DAC_C")
    2148                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0d)
    2149                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2150                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2151                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2152              
    2153              $C$DW$144       .dwtag  DW_TAG_member
    2154                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2155                      .dwattr $C$DW$144, DW_AT_name("rsvd6")
    2156                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd6")
    2157                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0c)
    2158                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2159                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2160                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2161              
    2162              $C$DW$145       .dwtag  DW_TAG_member
    2163                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2164                      .dwattr $C$DW$145, DW_AT_name("rsvd7")
    2165                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd7")
    2166                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    2167                      .dwattr $C$DW$145, DW_AT_bit_size(0x0c)
    2168                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2169                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2170              
    2171                      .dwendtag $C$DW$T$35
    2172              
    2173              
    2174              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2175                      .dwattr $C$DW$T$36, DW_AT_name("DC17_REG")
    2176                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2177              $C$DW$146       .dwtag  DW_TAG_member
    2178                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$21)
    2179                      .dwattr $C$DW$146, DW_AT_name("all")
    2180                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_all")
    2181                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2182                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2183              
    2184              $C$DW$147       .dwtag  DW_TAG_member
    2185                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$35)
    2186                      .dwattr $C$DW$147, DW_AT_name("bit")
    2187                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   42

    2188                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2189                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2190              
    2191                      .dwendtag $C$DW$T$36
    2192              
    2193              
    2194              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2195                      .dwattr $C$DW$T$37, DW_AT_name("DC18_BITS")
    2196                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2197              $C$DW$148       .dwtag  DW_TAG_member
    2198                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2199                      .dwattr $C$DW$148, DW_AT_name("LS0_1")
    2200                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_LS0_1")
    2201                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0f)
    2202                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2203                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2204                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2205              
    2206              $C$DW$149       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2208                      .dwattr $C$DW$149, DW_AT_name("LS1_1")
    2209                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_LS1_1")
    2210                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0e)
    2211                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2212                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2213                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2214              
    2215              $C$DW$150       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2217                      .dwattr $C$DW$150, DW_AT_name("LS2_1")
    2218                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_LS2_1")
    2219                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0d)
    2220                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2221                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2222                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2223              
    2224              $C$DW$151       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2226                      .dwattr $C$DW$151, DW_AT_name("LS3_1")
    2227                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_LS3_1")
    2228                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0c)
    2229                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2230                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2231                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2232              
    2233              $C$DW$152       .dwtag  DW_TAG_member
    2234                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2235                      .dwattr $C$DW$152, DW_AT_name("LS4_1")
    2236                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_LS4_1")
    2237                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0b)
    2238                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2239                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2240                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2241              
    2242              $C$DW$153       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   43

    2243                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2244                      .dwattr $C$DW$153, DW_AT_name("LS5_1")
    2245                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_LS5_1")
    2246                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0a)
    2247                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2248                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2249                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2250              
    2251              $C$DW$154       .dwtag  DW_TAG_member
    2252                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2253                      .dwattr $C$DW$154, DW_AT_name("rsvd1")
    2254                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd1")
    2255                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    2256                      .dwattr $C$DW$154, DW_AT_bit_size(0x0a)
    2257                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2258                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2259              
    2260              $C$DW$155       .dwtag  DW_TAG_member
    2261                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2262                      .dwattr $C$DW$155, DW_AT_name("rsvd2")
    2263                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd2")
    2264                      .dwattr $C$DW$155, DW_AT_bit_offset(0x00)
    2265                      .dwattr $C$DW$155, DW_AT_bit_size(0x10)
    2266                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2267                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2268              
    2269                      .dwendtag $C$DW$T$37
    2270              
    2271              
    2272              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2273                      .dwattr $C$DW$T$38, DW_AT_name("DC18_REG")
    2274                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2275              $C$DW$156       .dwtag  DW_TAG_member
    2276                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$21)
    2277                      .dwattr $C$DW$156, DW_AT_name("all")
    2278                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_all")
    2279                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2280                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2281              
    2282              $C$DW$157       .dwtag  DW_TAG_member
    2283                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$37)
    2284                      .dwattr $C$DW$157, DW_AT_name("bit")
    2285                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_bit")
    2286                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2288              
    2289                      .dwendtag $C$DW$T$38
    2290              
    2291              
    2292              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2293                      .dwattr $C$DW$T$39, DW_AT_name("DC1_BITS")
    2294                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2295              $C$DW$158       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2297                      .dwattr $C$DW$158, DW_AT_name("CPU1_FPU_TMU")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   44

    2298                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_CPU1_FPU_TMU")
    2299                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0f)
    2300                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2301                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2302                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2303              
    2304              $C$DW$159       .dwtag  DW_TAG_member
    2305                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2306                      .dwattr $C$DW$159, DW_AT_name("rsvd1")
    2307                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd1")
    2308                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0e)
    2309                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2310                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2311                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2312              
    2313              $C$DW$160       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2315                      .dwattr $C$DW$160, DW_AT_name("CPU1_VCU")
    2316                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_CPU1_VCU")
    2317                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0d)
    2318                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2319                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2320                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2321              
    2322              $C$DW$161       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2324                      .dwattr $C$DW$161, DW_AT_name("rsvd2")
    2325                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rsvd2")
    2326                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0c)
    2327                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2328                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2329                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2330              
    2331              $C$DW$162       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2333                      .dwattr $C$DW$162, DW_AT_name("rsvd3")
    2334                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd3")
    2335                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0a)
    2336                      .dwattr $C$DW$162, DW_AT_bit_size(0x02)
    2337                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2338                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2339              
    2340              $C$DW$163       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2342                      .dwattr $C$DW$163, DW_AT_name("CPU1_CLA1")
    2343                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_CPU1_CLA1")
    2344                      .dwattr $C$DW$163, DW_AT_bit_offset(0x09)
    2345                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2346                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2347                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2348              
    2349              $C$DW$164       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2351                      .dwattr $C$DW$164, DW_AT_name("rsvd4")
    2352                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd4")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   45

    2353                      .dwattr $C$DW$164, DW_AT_bit_offset(0x08)
    2354                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2355                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2356                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2357              
    2358              $C$DW$165       .dwtag  DW_TAG_member
    2359                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2360                      .dwattr $C$DW$165, DW_AT_name("rsvd5")
    2361                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd5")
    2362                      .dwattr $C$DW$165, DW_AT_bit_offset(0x07)
    2363                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2364                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2365                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2366              
    2367              $C$DW$166       .dwtag  DW_TAG_member
    2368                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2369                      .dwattr $C$DW$166, DW_AT_name("rsvd6")
    2370                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd6")
    2371                      .dwattr $C$DW$166, DW_AT_bit_offset(0x06)
    2372                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2373                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2374                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2375              
    2376              $C$DW$167       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2378                      .dwattr $C$DW$167, DW_AT_name("rsvd7")
    2379                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd7")
    2380                      .dwattr $C$DW$167, DW_AT_bit_offset(0x00)
    2381                      .dwattr $C$DW$167, DW_AT_bit_size(0x06)
    2382                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2383                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2384              
    2385              $C$DW$168       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2387                      .dwattr $C$DW$168, DW_AT_name("rsvd8")
    2388                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd8")
    2389                      .dwattr $C$DW$168, DW_AT_bit_offset(0x00)
    2390                      .dwattr $C$DW$168, DW_AT_bit_size(0x10)
    2391                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2392                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2393              
    2394                      .dwendtag $C$DW$T$39
    2395              
    2396              
    2397              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2398                      .dwattr $C$DW$T$40, DW_AT_name("DC1_REG")
    2399                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2400              $C$DW$169       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    2402                      .dwattr $C$DW$169, DW_AT_name("all")
    2403                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_all")
    2404                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2405                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2406              
    2407              $C$DW$170       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   46

    2408                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$39)
    2409                      .dwattr $C$DW$170, DW_AT_name("bit")
    2410                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_bit")
    2411                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2412                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2413              
    2414                      .dwendtag $C$DW$T$40
    2415              
    2416              
    2417              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2418                      .dwattr $C$DW$T$41, DW_AT_name("DC20_BITS")
    2419                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2420              $C$DW$171       .dwtag  DW_TAG_member
    2421                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2422                      .dwattr $C$DW$171, DW_AT_name("GS0")
    2423                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GS0")
    2424                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0f)
    2425                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2426                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2427                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2428              
    2429              $C$DW$172       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2431                      .dwattr $C$DW$172, DW_AT_name("GS1")
    2432                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GS1")
    2433                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0e)
    2434                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2435                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2436                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2437              
    2438              $C$DW$173       .dwtag  DW_TAG_member
    2439                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2440                      .dwattr $C$DW$173, DW_AT_name("GS2")
    2441                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GS2")
    2442                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0d)
    2443                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2444                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2445                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2446              
    2447              $C$DW$174       .dwtag  DW_TAG_member
    2448                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2449                      .dwattr $C$DW$174, DW_AT_name("GS3")
    2450                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GS3")
    2451                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0c)
    2452                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2453                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2454                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2455              
    2456              $C$DW$175       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2458                      .dwattr $C$DW$175, DW_AT_name("GS4")
    2459                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GS4")
    2460                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0b)
    2461                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2462                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   47

    2463                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2464              
    2465              $C$DW$176       .dwtag  DW_TAG_member
    2466                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2467                      .dwattr $C$DW$176, DW_AT_name("GS5")
    2468                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_GS5")
    2469                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0a)
    2470                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2471                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2472                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2473              
    2474              $C$DW$177       .dwtag  DW_TAG_member
    2475                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2476                      .dwattr $C$DW$177, DW_AT_name("GS6")
    2477                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_GS6")
    2478                      .dwattr $C$DW$177, DW_AT_bit_offset(0x09)
    2479                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2480                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2481                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2482              
    2483              $C$DW$178       .dwtag  DW_TAG_member
    2484                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2485                      .dwattr $C$DW$178, DW_AT_name("GS7")
    2486                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GS7")
    2487                      .dwattr $C$DW$178, DW_AT_bit_offset(0x08)
    2488                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2489                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2490                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2491              
    2492              $C$DW$179       .dwtag  DW_TAG_member
    2493                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2494                      .dwattr $C$DW$179, DW_AT_name("GS8")
    2495                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GS8")
    2496                      .dwattr $C$DW$179, DW_AT_bit_offset(0x07)
    2497                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2498                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2499                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2500              
    2501              $C$DW$180       .dwtag  DW_TAG_member
    2502                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2503                      .dwattr $C$DW$180, DW_AT_name("GS9")
    2504                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GS9")
    2505                      .dwattr $C$DW$180, DW_AT_bit_offset(0x06)
    2506                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2507                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2508                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2509              
    2510              $C$DW$181       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2512                      .dwattr $C$DW$181, DW_AT_name("GS10")
    2513                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_GS10")
    2514                      .dwattr $C$DW$181, DW_AT_bit_offset(0x05)
    2515                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2516                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2517                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   48

    2518              
    2519              $C$DW$182       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2521                      .dwattr $C$DW$182, DW_AT_name("GS11")
    2522                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_GS11")
    2523                      .dwattr $C$DW$182, DW_AT_bit_offset(0x04)
    2524                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2525                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2526                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2527              
    2528              $C$DW$183       .dwtag  DW_TAG_member
    2529                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2530                      .dwattr $C$DW$183, DW_AT_name("GS12")
    2531                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_GS12")
    2532                      .dwattr $C$DW$183, DW_AT_bit_offset(0x03)
    2533                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2534                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2535                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2536              
    2537              $C$DW$184       .dwtag  DW_TAG_member
    2538                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2539                      .dwattr $C$DW$184, DW_AT_name("GS13")
    2540                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_GS13")
    2541                      .dwattr $C$DW$184, DW_AT_bit_offset(0x02)
    2542                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2543                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2544                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2545              
    2546              $C$DW$185       .dwtag  DW_TAG_member
    2547                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2548                      .dwattr $C$DW$185, DW_AT_name("GS14")
    2549                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GS14")
    2550                      .dwattr $C$DW$185, DW_AT_bit_offset(0x01)
    2551                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2552                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2553                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2554              
    2555              $C$DW$186       .dwtag  DW_TAG_member
    2556                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2557                      .dwattr $C$DW$186, DW_AT_name("GS15")
    2558                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_GS15")
    2559                      .dwattr $C$DW$186, DW_AT_bit_offset(0x00)
    2560                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2561                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2562                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2563              
    2564              $C$DW$187       .dwtag  DW_TAG_member
    2565                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2566                      .dwattr $C$DW$187, DW_AT_name("rsvd1")
    2567                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd1")
    2568                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    2569                      .dwattr $C$DW$187, DW_AT_bit_size(0x10)
    2570                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2571                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2572              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   49

    2573                      .dwendtag $C$DW$T$41
    2574              
    2575              
    2576              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2577                      .dwattr $C$DW$T$42, DW_AT_name("DC20_REG")
    2578                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2579              $C$DW$188       .dwtag  DW_TAG_member
    2580                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$21)
    2581                      .dwattr $C$DW$188, DW_AT_name("all")
    2582                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_all")
    2583                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2584                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2585              
    2586              $C$DW$189       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$41)
    2588                      .dwattr $C$DW$189, DW_AT_name("bit")
    2589                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_bit")
    2590                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2591                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2592              
    2593                      .dwendtag $C$DW$T$42
    2594              
    2595              
    2596              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2597                      .dwattr $C$DW$T$43, DW_AT_name("DC2_BITS")
    2598                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2599              $C$DW$190       .dwtag  DW_TAG_member
    2600                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2601                      .dwattr $C$DW$190, DW_AT_name("EMIF1")
    2602                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_EMIF1")
    2603                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0f)
    2604                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2605                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2606                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2607              
    2608              $C$DW$191       .dwtag  DW_TAG_member
    2609                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2610                      .dwattr $C$DW$191, DW_AT_name("EMIF2")
    2611                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_EMIF2")
    2612                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0e)
    2613                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2614                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2615                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2616              
    2617              $C$DW$192       .dwtag  DW_TAG_member
    2618                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2619                      .dwattr $C$DW$192, DW_AT_name("rsvd1")
    2620                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd1")
    2621                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00)
    2622                      .dwattr $C$DW$192, DW_AT_bit_size(0x0e)
    2623                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2624                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2625              
    2626              $C$DW$193       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   50

    2628                      .dwattr $C$DW$193, DW_AT_name("rsvd2")
    2629                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd2")
    2630                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00)
    2631                      .dwattr $C$DW$193, DW_AT_bit_size(0x10)
    2632                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2633                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2634              
    2635                      .dwendtag $C$DW$T$43
    2636              
    2637              
    2638              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2639                      .dwattr $C$DW$T$44, DW_AT_name("DC2_REG")
    2640                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2641              $C$DW$194       .dwtag  DW_TAG_member
    2642                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    2643                      .dwattr $C$DW$194, DW_AT_name("all")
    2644                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_all")
    2645                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2646                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2647              
    2648              $C$DW$195       .dwtag  DW_TAG_member
    2649                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$43)
    2650                      .dwattr $C$DW$195, DW_AT_name("bit")
    2651                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_bit")
    2652                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2653                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2654              
    2655                      .dwendtag $C$DW$T$44
    2656              
    2657              
    2658              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2659                      .dwattr $C$DW$T$45, DW_AT_name("DC3_BITS")
    2660                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2661              $C$DW$196       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2663                      .dwattr $C$DW$196, DW_AT_name("EPWM1")
    2664                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_EPWM1")
    2665                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0f)
    2666                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2667                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2668                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2669              
    2670              $C$DW$197       .dwtag  DW_TAG_member
    2671                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2672                      .dwattr $C$DW$197, DW_AT_name("EPWM2")
    2673                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_EPWM2")
    2674                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0e)
    2675                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2676                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2677                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2678              
    2679              $C$DW$198       .dwtag  DW_TAG_member
    2680                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2681                      .dwattr $C$DW$198, DW_AT_name("EPWM3")
    2682                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_EPWM3")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   51

    2683                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0d)
    2684                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2685                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2686                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2687              
    2688              $C$DW$199       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2690                      .dwattr $C$DW$199, DW_AT_name("EPWM4")
    2691                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_EPWM4")
    2692                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0c)
    2693                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2694                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2696              
    2697              $C$DW$200       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2699                      .dwattr $C$DW$200, DW_AT_name("EPWM5")
    2700                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_EPWM5")
    2701                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0b)
    2702                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2703                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2704                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2705              
    2706              $C$DW$201       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2708                      .dwattr $C$DW$201, DW_AT_name("EPWM6")
    2709                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_EPWM6")
    2710                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0a)
    2711                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2712                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2713                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2714              
    2715              $C$DW$202       .dwtag  DW_TAG_member
    2716                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2717                      .dwattr $C$DW$202, DW_AT_name("EPWM7")
    2718                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_EPWM7")
    2719                      .dwattr $C$DW$202, DW_AT_bit_offset(0x09)
    2720                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2721                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2722                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2723              
    2724              $C$DW$203       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2726                      .dwattr $C$DW$203, DW_AT_name("EPWM8")
    2727                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_EPWM8")
    2728                      .dwattr $C$DW$203, DW_AT_bit_offset(0x08)
    2729                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2730                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2731                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2732              
    2733              $C$DW$204       .dwtag  DW_TAG_member
    2734                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2735                      .dwattr $C$DW$204, DW_AT_name("EPWM9")
    2736                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_EPWM9")
    2737                      .dwattr $C$DW$204, DW_AT_bit_offset(0x07)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   52

    2738                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2739                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2740                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2741              
    2742              $C$DW$205       .dwtag  DW_TAG_member
    2743                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2744                      .dwattr $C$DW$205, DW_AT_name("EPWM10")
    2745                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_EPWM10")
    2746                      .dwattr $C$DW$205, DW_AT_bit_offset(0x06)
    2747                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2748                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2749                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2750              
    2751              $C$DW$206       .dwtag  DW_TAG_member
    2752                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2753                      .dwattr $C$DW$206, DW_AT_name("EPWM11")
    2754                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_EPWM11")
    2755                      .dwattr $C$DW$206, DW_AT_bit_offset(0x05)
    2756                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2757                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2758                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2759              
    2760              $C$DW$207       .dwtag  DW_TAG_member
    2761                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2762                      .dwattr $C$DW$207, DW_AT_name("EPWM12")
    2763                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_EPWM12")
    2764                      .dwattr $C$DW$207, DW_AT_bit_offset(0x04)
    2765                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2766                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2767                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2768              
    2769              $C$DW$208       .dwtag  DW_TAG_member
    2770                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2771                      .dwattr $C$DW$208, DW_AT_name("rsvd1")
    2772                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_rsvd1")
    2773                      .dwattr $C$DW$208, DW_AT_bit_offset(0x03)
    2774                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2775                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2776                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2777              
    2778              $C$DW$209       .dwtag  DW_TAG_member
    2779                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2780                      .dwattr $C$DW$209, DW_AT_name("rsvd2")
    2781                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_rsvd2")
    2782                      .dwattr $C$DW$209, DW_AT_bit_offset(0x02)
    2783                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2784                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2785                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2786              
    2787              $C$DW$210       .dwtag  DW_TAG_member
    2788                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2789                      .dwattr $C$DW$210, DW_AT_name("rsvd3")
    2790                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd3")
    2791                      .dwattr $C$DW$210, DW_AT_bit_offset(0x01)
    2792                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   53

    2793                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2794                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2795              
    2796              $C$DW$211       .dwtag  DW_TAG_member
    2797                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2798                      .dwattr $C$DW$211, DW_AT_name("rsvd4")
    2799                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd4")
    2800                      .dwattr $C$DW$211, DW_AT_bit_offset(0x00)
    2801                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2802                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2803                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2804              
    2805              $C$DW$212       .dwtag  DW_TAG_member
    2806                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2807                      .dwattr $C$DW$212, DW_AT_name("rsvd5")
    2808                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd5")
    2809                      .dwattr $C$DW$212, DW_AT_bit_offset(0x00)
    2810                      .dwattr $C$DW$212, DW_AT_bit_size(0x10)
    2811                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2812                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2813              
    2814                      .dwendtag $C$DW$T$45
    2815              
    2816              
    2817              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2818                      .dwattr $C$DW$T$46, DW_AT_name("DC3_REG")
    2819                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2820              $C$DW$213       .dwtag  DW_TAG_member
    2821                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$21)
    2822                      .dwattr $C$DW$213, DW_AT_name("all")
    2823                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_all")
    2824                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2825                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2826              
    2827              $C$DW$214       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$45)
    2829                      .dwattr $C$DW$214, DW_AT_name("bit")
    2830                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_bit")
