TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Sat Nov 14 12:25:44 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_EnableUnbondedIOPullups")

         000002b6 0000 
    2015 000002b7 1901          SUBB      ACC,#1                ; [CPU_ALU] |563| 
    2016 000002b8 1E10!         MOVL      @$BLOCKED(_DcsmZ1Regs)+16,ACC ; [CPU_ALU] |563| 
    2017                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2018 000002b9 0200          MOVB      ACC,#0                ; [CPU_ALU] |564| 
    2019 000002ba 1901          SUBB      ACC,#1                ; [CPU_ALU] |564| 
    2020 000002bb 1E12!         MOVL      @$BLOCKED(_DcsmZ1Regs)+18,ACC ; [CPU_ALU] |564| 
    2021                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2022 000002bc 0200          MOVB      ACC,#0                ; [CPU_ALU] |565| 
    2023 000002bd 1901          SUBB      ACC,#1                ; [CPU_ALU] |565| 
    2024 000002be 1E14!         MOVL      @$BLOCKED(_DcsmZ1Regs)+20,ACC ; [CPU_ALU] |565| 
    2025                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2026 000002bf 0200          MOVB      ACC,#0                ; [CPU_ALU] |566| 
    2027 000002c0 1901          SUBB      ACC,#1                ; [CPU_ALU] |566| 
    2028 000002c1 1E16!         MOVL      @$BLOCKED(_DcsmZ1Regs)+22,ACC ; [CPU_ALU] |566| 
    2029                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2030 000002c2 0200          MOVB      ACC,#0                ; [CPU_ALU] |568| 
    2031 000002c3 761F!         MOVW      DP,#_DcsmZ2Regs+16    ; [CPU_ARAU] 
         000002c4 0000 
    2032 000002c5 1901          SUBB      ACC,#1                ; [CPU_ALU] |568| 
    2033 000002c6 1E10!         MOVL      @$BLOCKED(_DcsmZ2Regs)+16,ACC ; [CPU_ALU] |568| 
    2034                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2035 000002c7 0200          MOVB      ACC,#0                ; [CPU_ALU] |569| 
    2036 000002c8 1901          SUBB      ACC,#1                ; [CPU_ALU] |569| 
    2037 000002c9 1E12!         MOVL      @$BLOCKED(_DcsmZ2Regs)+18,ACC ; [CPU_ALU] |569| 
    2038                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2039 000002ca 0200          MOVB      ACC,#0                ; [CPU_ALU] |570| 
    2040 000002cb 1901          SUBB      ACC,#1                ; [CPU_ALU] |570| 
    2041 000002cc 1E14!         MOVL      @$BLOCKED(_DcsmZ2Regs)+20,ACC ; [CPU_ALU] |570| 
    2042                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2043 000002cd 0200          MOVB      ACC,#0                ; [CPU_ALU] |571| 
    2044 000002ce 1901          SUBB      ACC,#1                ; [CPU_ALU] |571| 
    2045 000002cf 1E16!         MOVL      @$BLOCKED(_DcsmZ2Regs)+22,ACC ; [CPU_ALU] |571| 
    2046 000002d0 761A   EDIS
    2047 000002d1 FF69          SPM       #0                    ; [CPU_ALU] 
    2048                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2049 000002d2 9A00          MOVB      AL,#0                 ; [CPU_ALU] |591| 
    2050              $C$DW$82        .dwtag  DW_TAG_TI_branch
    2051                      .dwattr $C$DW$82, DW_AT_low_pc(0x00)
    2052                      .dwattr $C$DW$82, DW_AT_TI_return
    2053              
    2054 000002d3 0006          LRETR     ; [CPU_ALU] 
    2055                      ; return occurs ; [] 
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   42

    2056                      .dwattr $C$DW$81, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/so
    2057                      .dwattr $C$DW$81, DW_AT_TI_end_line(0x251)
    2058                      .dwattr $C$DW$81, DW_AT_TI_end_column(0x01)
    2059                      .dwendentry
    2060                      .dwendtag $C$DW$81
    2061              
    2062              ;**************************************************************
    2063              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2064              ;**************************************************************
    2065                      .global _GPIO_EnableUnbondedIOPullups
    2066                      .global _F28x_usDelay
    2067                      .global _DcsmZ1Regs
    2068                      .global _DcsmZ2Regs
    2069                      .global _Flash0EccRegs
    2070                      .global _Flash1EccRegs
    2071                      .global _WdRegs
    2072                      .global _ClkCfgRegs
    2073                      .global _AnalogSubsysRegs
    2074                      .global _CpuSysRegs
    2075                      .global _Flash0CtrlRegs
    2076                      .global _Flash1CtrlRegs
    2077              
    2078              ;***************************************************************
    2079              ;* TYPE INFORMATION                                            *
    2080              ;***************************************************************
    2081              
    2082              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2083                      .dwattr $C$DW$T$25, DW_AT_name("ANALOG_SUBSYS_REGS")
    2084                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
    2085              $C$DW$83        .dwtag  DW_TAG_member
    2086                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    2087                      .dwattr $C$DW$83, DW_AT_name("rsvd1")
    2088                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd1")
    2089                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2090                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    2091              
    2092              $C$DW$84        .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$112)
    2094                      .dwattr $C$DW$84, DW_AT_name("INTOSC1TRIM")
    2095                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    2096                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2097                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    2098              
    2099              $C$DW$85        .dwtag  DW_TAG_member
    2100                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$114)
    2101                      .dwattr $C$DW$85, DW_AT_name("INTOSC2TRIM")
    2102                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    2103                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2104                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    2105              
    2106              $C$DW$86        .dwtag  DW_TAG_member
    2107                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    2108                      .dwattr $C$DW$86, DW_AT_name("rsvd2")
    2109                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_rsvd2")
    2110                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   43

    2111                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    2112              
    2113              $C$DW$87        .dwtag  DW_TAG_member
    2114                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$176)
    2115                      .dwattr $C$DW$87, DW_AT_name("TSNSCTL")
    2116                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_TSNSCTL")
    2117                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2118                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    2119              
    2120              $C$DW$88        .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$22)
    2122                      .dwattr $C$DW$88, DW_AT_name("rsvd3")
    2123                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd3")
    2124                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2125                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2126              
    2127              $C$DW$89        .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$118)
    2129                      .dwattr $C$DW$89, DW_AT_name("LOCK")
    2130                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_LOCK")
    2131                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2132                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2133              
    2134              $C$DW$90        .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$23)
    2136                      .dwattr $C$DW$90, DW_AT_name("rsvd4")
    2137                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd4")
    2138                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2139                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2140              
    2141              $C$DW$91        .dwtag  DW_TAG_member
    2142                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$28)
    2143                      .dwattr $C$DW$91, DW_AT_name("ANAREFTRIMA")
    2144                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ANAREFTRIMA")
    2145                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2146                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2147              
    2148              $C$DW$92        .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$30)
    2150                      .dwattr $C$DW$92, DW_AT_name("ANAREFTRIMB")
    2151                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_ANAREFTRIMB")
    2152                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2153                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2154              
    2155              $C$DW$93        .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$32)
    2157                      .dwattr $C$DW$93, DW_AT_name("ANAREFTRIMC")
    2158                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_ANAREFTRIMC")
    2159                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2160                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2161              
    2162              $C$DW$94        .dwtag  DW_TAG_member
    2163                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$34)
    2164                      .dwattr $C$DW$94, DW_AT_name("ANAREFTRIMD")
    2165                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_ANAREFTRIMD")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   44

    2166                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2167                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2168              
    2169              $C$DW$95        .dwtag  DW_TAG_member
    2170                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$24)
    2171                      .dwattr $C$DW$95, DW_AT_name("rsvd5")
    2172                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd5")
    2173                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2174                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2175              
    2176                      .dwendtag $C$DW$T$25
    2177              
    2178              $C$DW$96        .dwtag  DW_TAG_TI_far_type
    2179                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$25)
    2180              
    2181              $C$DW$T$224     .dwtag  DW_TAG_volatile_type
    2182                      .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$96)
    2183              
    2184              
    2185              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2186                      .dwattr $C$DW$T$26, DW_AT_name("ANAREFTRIMA_BITS")
    2187                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2188              $C$DW$97        .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    2190                      .dwattr $C$DW$97, DW_AT_name("BGVALTRIM")
    2191                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_BGVALTRIM")
    2192                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0a)
    2193                      .dwattr $C$DW$97, DW_AT_bit_size(0x06)
    2194                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2195                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2196              
    2197              $C$DW$98        .dwtag  DW_TAG_member
    2198                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    2199                      .dwattr $C$DW$98, DW_AT_name("BGSLOPETRIM")
    2200                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2201                      .dwattr $C$DW$98, DW_AT_bit_offset(0x05)
    2202                      .dwattr $C$DW$98, DW_AT_bit_size(0x05)
    2203                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2204                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2205              
    2206              $C$DW$99        .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    2208                      .dwattr $C$DW$99, DW_AT_name("IREFTRIM")
    2209                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_IREFTRIM")
    2210                      .dwattr $C$DW$99, DW_AT_bit_offset(0x00)
    2211                      .dwattr $C$DW$99, DW_AT_bit_size(0x05)
    2212                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2213                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2214              
    2215              $C$DW$100       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    2217                      .dwattr $C$DW$100, DW_AT_name("rsvd1")
    2218                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd1")
    2219                      .dwattr $C$DW$100, DW_AT_bit_offset(0x08)
    2220                      .dwattr $C$DW$100, DW_AT_bit_size(0x08)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   45

    2221                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2222                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2223              
    2224              $C$DW$101       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2226                      .dwattr $C$DW$101, DW_AT_name("rsvd2")
    2227                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd2")
    2228                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    2229                      .dwattr $C$DW$101, DW_AT_bit_size(0x08)
    2230                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2231                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2232              
    2233                      .dwendtag $C$DW$T$26
    2234              
    2235              
    2236              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2237                      .dwattr $C$DW$T$28, DW_AT_name("ANAREFTRIMA_REG")
    2238                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2239              $C$DW$102       .dwtag  DW_TAG_member
    2240                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$27)
    2241                      .dwattr $C$DW$102, DW_AT_name("all")
    2242                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    2243                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2244                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2245              
    2246              $C$DW$103       .dwtag  DW_TAG_member
    2247                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$26)
    2248                      .dwattr $C$DW$103, DW_AT_name("bit")
    2249                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    2250                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2251                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2252              
    2253                      .dwendtag $C$DW$T$28
    2254              
    2255              
    2256              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2257                      .dwattr $C$DW$T$29, DW_AT_name("ANAREFTRIMB_BITS")
    2258                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2259              $C$DW$104       .dwtag  DW_TAG_member
    2260                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2261                      .dwattr $C$DW$104, DW_AT_name("BGVALTRIM")
    2262                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_BGVALTRIM")
    2263                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0a)
    2264                      .dwattr $C$DW$104, DW_AT_bit_size(0x06)
    2265                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2266                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2267              
    2268              $C$DW$105       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2270                      .dwattr $C$DW$105, DW_AT_name("BGSLOPETRIM")
    2271                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2272                      .dwattr $C$DW$105, DW_AT_bit_offset(0x05)
    2273                      .dwattr $C$DW$105, DW_AT_bit_size(0x05)
    2274                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2275                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   46

    2276              
    2277              $C$DW$106       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    2279                      .dwattr $C$DW$106, DW_AT_name("IREFTRIM")
    2280                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_IREFTRIM")
    2281                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00)
    2282                      .dwattr $C$DW$106, DW_AT_bit_size(0x05)
    2283                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2284                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2285              
    2286              $C$DW$107       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    2288                      .dwattr $C$DW$107, DW_AT_name("rsvd1")
    2289                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd1")
    2290                      .dwattr $C$DW$107, DW_AT_bit_offset(0x08)
    2291                      .dwattr $C$DW$107, DW_AT_bit_size(0x08)
    2292                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2293                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2294              
    2295              $C$DW$108       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2297                      .dwattr $C$DW$108, DW_AT_name("rsvd2")
    2298                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_rsvd2")
    2299                      .dwattr $C$DW$108, DW_AT_bit_offset(0x00)
    2300                      .dwattr $C$DW$108, DW_AT_bit_size(0x08)
    2301                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2302                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2303              
    2304                      .dwendtag $C$DW$T$29
    2305              
    2306              
    2307              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2308                      .dwattr $C$DW$T$30, DW_AT_name("ANAREFTRIMB_REG")
    2309                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2310              $C$DW$109       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$27)
    2312                      .dwattr $C$DW$109, DW_AT_name("all")
    2313                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_all")
    2314                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2315                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2316              
    2317              $C$DW$110       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$29)
    2319                      .dwattr $C$DW$110, DW_AT_name("bit")
    2320                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_bit")
    2321                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2322                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2323              
    2324                      .dwendtag $C$DW$T$30
    2325              
    2326              
    2327              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2328                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFTRIMC_BITS")
    2329                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2330              $C$DW$111       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   47

    2331                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2332                      .dwattr $C$DW$111, DW_AT_name("BGVALTRIM")
    2333                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_BGVALTRIM")
    2334                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a)
    2335                      .dwattr $C$DW$111, DW_AT_bit_size(0x06)
    2336                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2337                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2338              
    2339              $C$DW$112       .dwtag  DW_TAG_member
    2340                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2341                      .dwattr $C$DW$112, DW_AT_name("BGSLOPETRIM")
    2342                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2343                      .dwattr $C$DW$112, DW_AT_bit_offset(0x05)
    2344                      .dwattr $C$DW$112, DW_AT_bit_size(0x05)
    2345                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2346                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2347              
    2348              $C$DW$113       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2350                      .dwattr $C$DW$113, DW_AT_name("IREFTRIM")
    2351                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_IREFTRIM")
    2352                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00)
    2353                      .dwattr $C$DW$113, DW_AT_bit_size(0x05)
    2354                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2355                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2356              
    2357              $C$DW$114       .dwtag  DW_TAG_member
    2358                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2359                      .dwattr $C$DW$114, DW_AT_name("rsvd1")
    2360                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd1")
    2361                      .dwattr $C$DW$114, DW_AT_bit_offset(0x08)
    2362                      .dwattr $C$DW$114, DW_AT_bit_size(0x08)
    2363                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2364                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2365              
    2366              $C$DW$115       .dwtag  DW_TAG_member
    2367                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2368                      .dwattr $C$DW$115, DW_AT_name("rsvd2")
    2369                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd2")
    2370                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
    2371                      .dwattr $C$DW$115, DW_AT_bit_size(0x08)
    2372                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2373                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2374              
    2375                      .dwendtag $C$DW$T$31
    2376              
    2377              
    2378              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2379                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFTRIMC_REG")
    2380                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2381              $C$DW$116       .dwtag  DW_TAG_member
    2382                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$27)
    2383                      .dwattr $C$DW$116, DW_AT_name("all")
    2384                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_all")
    2385                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   48

    2386                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2387              
    2388              $C$DW$117       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$31)
    2390                      .dwattr $C$DW$117, DW_AT_name("bit")
    2391                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_bit")
    2392                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2393                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2394              
    2395                      .dwendtag $C$DW$T$32
    2396              
    2397              
    2398              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2399                      .dwattr $C$DW$T$33, DW_AT_name("ANAREFTRIMD_BITS")
    2400                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2401              $C$DW$118       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2403                      .dwattr $C$DW$118, DW_AT_name("BGVALTRIM")
    2404                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_BGVALTRIM")
    2405                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0a)
    2406                      .dwattr $C$DW$118, DW_AT_bit_size(0x06)
    2407                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2409              
    2410              $C$DW$119       .dwtag  DW_TAG_member
    2411                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2412                      .dwattr $C$DW$119, DW_AT_name("BGSLOPETRIM")
    2413                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2414                      .dwattr $C$DW$119, DW_AT_bit_offset(0x05)
    2415                      .dwattr $C$DW$119, DW_AT_bit_size(0x05)
    2416                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2418              
    2419              $C$DW$120       .dwtag  DW_TAG_member
    2420                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2421                      .dwattr $C$DW$120, DW_AT_name("IREFTRIM")
    2422                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_IREFTRIM")
    2423                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    2424                      .dwattr $C$DW$120, DW_AT_bit_size(0x05)
    2425                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2426                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2427              
    2428              $C$DW$121       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2430                      .dwattr $C$DW$121, DW_AT_name("rsvd1")
    2431                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd1")
    2432                      .dwattr $C$DW$121, DW_AT_bit_offset(0x08)
    2433                      .dwattr $C$DW$121, DW_AT_bit_size(0x08)
    2434                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2435                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2436              
    2437              $C$DW$122       .dwtag  DW_TAG_member
    2438                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2439                      .dwattr $C$DW$122, DW_AT_name("rsvd2")
    2440                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   49

    2441                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00)
    2442                      .dwattr $C$DW$122, DW_AT_bit_size(0x08)
    2443                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2444                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2445              
    2446                      .dwendtag $C$DW$T$33
    2447              
    2448              
    2449              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2450                      .dwattr $C$DW$T$34, DW_AT_name("ANAREFTRIMD_REG")
    2451                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2452              $C$DW$123       .dwtag  DW_TAG_member
    2453                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$27)
    2454                      .dwattr $C$DW$123, DW_AT_name("all")
    2455                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_all")
    2456                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2457                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2458              
    2459              $C$DW$124       .dwtag  DW_TAG_member
    2460                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$33)
    2461                      .dwattr $C$DW$124, DW_AT_name("bit")
    2462                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bit")
    2463                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2464                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2465              
    2466                      .dwendtag $C$DW$T$34
    2467              
    2468              
    2469              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2470                      .dwattr $C$DW$T$35, DW_AT_name("AUXCLKDIVSEL_BITS")
    2471                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2472              $C$DW$125       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2474                      .dwattr $C$DW$125, DW_AT_name("AUXPLLDIV")
    2475                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_AUXPLLDIV")
    2476                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e)
    2477                      .dwattr $C$DW$125, DW_AT_bit_size(0x02)
    2478                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2479                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2480              
    2481              $C$DW$126       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2483                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
    2484                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
    2485                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00)
    2486                      .dwattr $C$DW$126, DW_AT_bit_size(0x0e)
    2487                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2488                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2489              
    2490              $C$DW$127       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2492                      .dwattr $C$DW$127, DW_AT_name("rsvd2")
    2493                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd2")
    2494                      .dwattr $C$DW$127, DW_AT_bit_offset(0x00)
    2495                      .dwattr $C$DW$127, DW_AT_bit_size(0x10)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   50

    2496                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2497                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2498              
    2499                      .dwendtag $C$DW$T$35
    2500              
    2501              
    2502              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2503                      .dwattr $C$DW$T$36, DW_AT_name("AUXCLKDIVSEL_REG")
    2504                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2505              $C$DW$128       .dwtag  DW_TAG_member
    2506                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$27)
    2507                      .dwattr $C$DW$128, DW_AT_name("all")
    2508                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_all")
    2509                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2510                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2511              
    2512              $C$DW$129       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$35)
    2514                      .dwattr $C$DW$129, DW_AT_name("bit")
    2515                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_bit")
    2516                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2517                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2518              
    2519                      .dwendtag $C$DW$T$36
    2520              
    2521              
    2522              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2523                      .dwattr $C$DW$T$37, DW_AT_name("AUXPLLCTL1_BITS")
    2524                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2525              $C$DW$130       .dwtag  DW_TAG_member
    2526                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2527                      .dwattr $C$DW$130, DW_AT_name("PLLEN")
    2528                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_PLLEN")
    2529                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0f)
    2530                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2531                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2532                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2533              
    2534              $C$DW$131       .dwtag  DW_TAG_member
    2535                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2536                      .dwattr $C$DW$131, DW_AT_name("PLLCLKEN")
    2537                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PLLCLKEN")
    2538                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0e)
    2539                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2540                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2541                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2542              
    2543              $C$DW$132       .dwtag  DW_TAG_member
    2544                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2545                      .dwattr $C$DW$132, DW_AT_name("rsvd1")
    2546                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd1")
    2547                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    2548                      .dwattr $C$DW$132, DW_AT_bit_size(0x0e)
    2549                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2550                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   51

    2551              
    2552              $C$DW$133       .dwtag  DW_TAG_member
    2553                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2554                      .dwattr $C$DW$133, DW_AT_name("rsvd2")
    2555                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd2")
    2556                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00)
    2557                      .dwattr $C$DW$133, DW_AT_bit_size(0x10)
    2558                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2559                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2560              
    2561                      .dwendtag $C$DW$T$37
    2562              
    2563              
    2564              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2565                      .dwattr $C$DW$T$38, DW_AT_name("AUXPLLCTL1_REG")
    2566                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2567              $C$DW$134       .dwtag  DW_TAG_member
    2568                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$27)
    2569                      .dwattr $C$DW$134, DW_AT_name("all")
    2570                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_all")
    2571                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2572                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2573              
    2574              $C$DW$135       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$37)
    2576                      .dwattr $C$DW$135, DW_AT_name("bit")
    2577                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_bit")
    2578                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2579                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2580              
    2581                      .dwendtag $C$DW$T$38
    2582              
    2583              
    2584              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2585                      .dwattr $C$DW$T$39, DW_AT_name("AUXPLLMULT_BITS")
    2586                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2587              $C$DW$136       .dwtag  DW_TAG_member
    2588                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2589                      .dwattr $C$DW$136, DW_AT_name("IMULT")
    2590                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_IMULT")
    2591                      .dwattr $C$DW$136, DW_AT_bit_offset(0x09)
    2592                      .dwattr $C$DW$136, DW_AT_bit_size(0x07)
    2593                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2594                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2595              
    2596              $C$DW$137       .dwtag  DW_TAG_member
    2597                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2598                      .dwattr $C$DW$137, DW_AT_name("rsvd1")
    2599                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd1")
    2600                      .dwattr $C$DW$137, DW_AT_bit_offset(0x08)
    2601                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2602                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2603                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2604              
    2605              $C$DW$138       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   52

    2606                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2607                      .dwattr $C$DW$138, DW_AT_name("FMULT")
    2608                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_FMULT")
    2609                      .dwattr $C$DW$138, DW_AT_bit_offset(0x06)
    2610                      .dwattr $C$DW$138, DW_AT_bit_size(0x02)
    2611                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2612                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2613              
    2614              $C$DW$139       .dwtag  DW_TAG_member
    2615                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2616                      .dwattr $C$DW$139, DW_AT_name("rsvd2")
    2617                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd2")
    2618                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    2619                      .dwattr $C$DW$139, DW_AT_bit_size(0x06)
    2620                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2621                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2622              
    2623              $C$DW$140       .dwtag  DW_TAG_member
    2624                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2625                      .dwattr $C$DW$140, DW_AT_name("rsvd3")
    2626                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_rsvd3")
    2627                      .dwattr $C$DW$140, DW_AT_bit_offset(0x00)
    2628                      .dwattr $C$DW$140, DW_AT_bit_size(0x10)
    2629                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2630                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2631              
    2632                      .dwendtag $C$DW$T$39
    2633              
    2634              
    2635              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2636                      .dwattr $C$DW$T$40, DW_AT_name("AUXPLLMULT_REG")
    2637                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2638              $C$DW$141       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$27)
    2640                      .dwattr $C$DW$141, DW_AT_name("all")
    2641                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_all")
    2642                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2643                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2644              
    2645              $C$DW$142       .dwtag  DW_TAG_member
    2646                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$39)
    2647                      .dwattr $C$DW$142, DW_AT_name("bit")
    2648                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_bit")
    2649                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2650                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2651              
    2652                      .dwendtag $C$DW$T$40
    2653              
    2654              
    2655              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2656                      .dwattr $C$DW$T$41, DW_AT_name("AUXPLLSTS_BITS")
    2657                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2658              $C$DW$143       .dwtag  DW_TAG_member
    2659                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2660                      .dwattr $C$DW$143, DW_AT_name("LOCKS")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   53

    2661                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_LOCKS")
    2662                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0f)
    2663                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2664                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2665                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2666              
    2667              $C$DW$144       .dwtag  DW_TAG_member
    2668                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2669                      .dwattr $C$DW$144, DW_AT_name("SLIPS")
    2670                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_SLIPS")
    2671                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0e)
    2672                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2673                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2674                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2675              
    2676              $C$DW$145       .dwtag  DW_TAG_member
    2677                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2678                      .dwattr $C$DW$145, DW_AT_name("rsvd1")
    2679                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd1")
    2680                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    2681                      .dwattr $C$DW$145, DW_AT_bit_size(0x0e)
    2682                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2683                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2684              
    2685              $C$DW$146       .dwtag  DW_TAG_member
    2686                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2687                      .dwattr $C$DW$146, DW_AT_name("rsvd2")
    2688                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd2")
    2689                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    2690                      .dwattr $C$DW$146, DW_AT_bit_size(0x10)
    2691                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2692                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2693              
    2694                      .dwendtag $C$DW$T$41
    2695              
    2696              
    2697              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2698                      .dwattr $C$DW$T$42, DW_AT_name("AUXPLLSTS_REG")
    2699                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2700              $C$DW$147       .dwtag  DW_TAG_member
    2701                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    2702                      .dwattr $C$DW$147, DW_AT_name("all")
    2703                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_all")
    2704                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2705                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2706              
    2707              $C$DW$148       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$41)
    2709                      .dwattr $C$DW$148, DW_AT_name("bit")
    2710                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_bit")
    2711                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2712                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2713              
    2714                      .dwendtag $C$DW$T$42
    2715              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   54

    2716              
    2717              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2718                      .dwattr $C$DW$T$43, DW_AT_name("CLKCFGLOCK1_BITS")
    2719                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2720              $C$DW$149       .dwtag  DW_TAG_member
    2721                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2722                      .dwattr $C$DW$149, DW_AT_name("CLKSRCCTL1")
    2723                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    2724                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0f)
    2725                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2726                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2727                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2728              
    2729              $C$DW$150       .dwtag  DW_TAG_member
    2730                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2731                      .dwattr $C$DW$150, DW_AT_name("CLKSRCCTL2")
    2732                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    2733                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0e)
    2734                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2735                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2736                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2737              
    2738              $C$DW$151       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2740                      .dwattr $C$DW$151, DW_AT_name("CLKSRCCTL3")
    2741                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    2742                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0d)
    2743                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2744                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2745                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2746              
    2747              $C$DW$152       .dwtag  DW_TAG_member
    2748                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2749                      .dwattr $C$DW$152, DW_AT_name("SYSPLLCTL1")
    2750                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    2751                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0c)
    2752                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2753                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2754                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2755              
    2756              $C$DW$153       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2758                      .dwattr $C$DW$153, DW_AT_name("SYSPLLCTL2")
    2759                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    2760                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0b)
    2761                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2762                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2763                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2764              
    2765              $C$DW$154       .dwtag  DW_TAG_member
    2766                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2767                      .dwattr $C$DW$154, DW_AT_name("SYSPLLCTL3")
    2768                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    2769                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0a)
    2770                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   55

    2771                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2772                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2773              
    2774              $C$DW$155       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2776                      .dwattr $C$DW$155, DW_AT_name("SYSPLLMULT")
    2777                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_SYSPLLMULT")
    2778                      .dwattr $C$DW$155, DW_AT_bit_offset(0x09)
    2779                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2780                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2781                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2782              
    2783              $C$DW$156       .dwtag  DW_TAG_member
    2784                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2785                      .dwattr $C$DW$156, DW_AT_name("AUXPLLCTL1")
    2786                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    2787                      .dwattr $C$DW$156, DW_AT_bit_offset(0x08)
    2788                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2789                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2790                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2791              
    2792              $C$DW$157       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2794                      .dwattr $C$DW$157, DW_AT_name("rsvd1")
    2795                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd1")
    2796                      .dwattr $C$DW$157, DW_AT_bit_offset(0x07)
    2797                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2798                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2799                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2800              
    2801              $C$DW$158       .dwtag  DW_TAG_member
    2802                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2803                      .dwattr $C$DW$158, DW_AT_name("rsvd2")
    2804                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd2")
    2805                      .dwattr $C$DW$158, DW_AT_bit_offset(0x06)
    2806                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2807                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2808                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2809              
    2810              $C$DW$159       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2812                      .dwattr $C$DW$159, DW_AT_name("AUXPLLMULT")
    2813                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_AUXPLLMULT")
    2814                      .dwattr $C$DW$159, DW_AT_bit_offset(0x05)
    2815                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2816                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2817                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2818              
    2819              $C$DW$160       .dwtag  DW_TAG_member
    2820                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2821                      .dwattr $C$DW$160, DW_AT_name("SYSCLKDIVSEL")
    2822                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    2823                      .dwattr $C$DW$160, DW_AT_bit_offset(0x04)
    2824                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2825                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   56

    2826                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2827              
    2828              $C$DW$161       .dwtag  DW_TAG_member
    2829                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2830                      .dwattr $C$DW$161, DW_AT_name("AUXCLKDIVSEL")
    2831                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    2832                      .dwattr $C$DW$161, DW_AT_bit_offset(0x03)
    2833                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2834                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2835                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2836              
    2837              $C$DW$162       .dwtag  DW_TAG_member
    2838                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2839                      .dwattr $C$DW$162, DW_AT_name("PERCLKDIVSEL")
    2840                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    2841                      .dwattr $C$DW$162, DW_AT_bit_offset(0x02)
    2842                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2843                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2844                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2845              
    2846              $C$DW$163       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2848                      .dwattr $C$DW$163, DW_AT_name("rsvd3")
    2849                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd3")
    2850                      .dwattr $C$DW$163, DW_AT_bit_offset(0x01)
    2851                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2852                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2853                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2854              
    2855              $C$DW$164       .dwtag  DW_TAG_member
    2856                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2857                      .dwattr $C$DW$164, DW_AT_name("LOSPCP")
    2858                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_LOSPCP")
    2859                      .dwattr $C$DW$164, DW_AT_bit_offset(0x00)
    2860                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2861                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2862                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2863              
    2864              $C$DW$165       .dwtag  DW_TAG_member
    2865                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2866                      .dwattr $C$DW$165, DW_AT_name("rsvd4")
    2867                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd4")
    2868                      .dwattr $C$DW$165, DW_AT_bit_offset(0x00)
    2869                      .dwattr $C$DW$165, DW_AT_bit_size(0x10)
    2870                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2871                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2872              
    2873                      .dwendtag $C$DW$T$43
    2874              
    2875              
    2876              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2877                      .dwattr $C$DW$T$44, DW_AT_name("CLKCFGLOCK1_REG")
    2878                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2879              $C$DW$166       .dwtag  DW_TAG_member
    2880                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   57

    2881                      .dwattr $C$DW$166, DW_AT_name("all")
    2882                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_all")
    2883                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2884                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2885              
    2886              $C$DW$167       .dwtag  DW_TAG_member
    2887                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$43)
    2888                      .dwattr $C$DW$167, DW_AT_name("bit")
    2889                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_bit")
    2890                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2891                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2892              
    2893                      .dwendtag $C$DW$T$44
    2894              
    2895              
    2896              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2897                      .dwattr $C$DW$T$45, DW_AT_name("CLKSRCCTL1_BITS")
    2898                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2899              $C$DW$168       .dwtag  DW_TAG_member
    2900                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2901                      .dwattr $C$DW$168, DW_AT_name("OSCCLKSRCSEL")
    2902                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    2903                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0e)
    2904                      .dwattr $C$DW$168, DW_AT_bit_size(0x02)
    2905                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2906                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2907              
    2908              $C$DW$169       .dwtag  DW_TAG_member
    2909                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2910                      .dwattr $C$DW$169, DW_AT_name("rsvd1")
    2911                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd1")
    2912                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0d)
    2913                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2914                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2915                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2916              
    2917              $C$DW$170       .dwtag  DW_TAG_member
    2918                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2919                      .dwattr $C$DW$170, DW_AT_name("INTOSC2OFF")
    2920                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_INTOSC2OFF")
    2921                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0c)
    2922                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2923                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2924                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2925              
    2926              $C$DW$171       .dwtag  DW_TAG_member
    2927                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2928                      .dwattr $C$DW$171, DW_AT_name("XTALOFF")
    2929                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_XTALOFF")
    2930                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0b)
    2931                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2932                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2933                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2934              
    2935              $C$DW$172       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   58

    2936                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2937                      .dwattr $C$DW$172, DW_AT_name("WDHALTI")
    2938                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_WDHALTI")
    2939                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0a)
    2940                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2941                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2942                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2943              
    2944              $C$DW$173       .dwtag  DW_TAG_member
    2945                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2946                      .dwattr $C$DW$173, DW_AT_name("rsvd2")
    2947                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd2")
    2948                      .dwattr $C$DW$173, DW_AT_bit_offset(0x00)
    2949                      .dwattr $C$DW$173, DW_AT_bit_size(0x0a)
    2950                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2951                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2952              
    2953              $C$DW$174       .dwtag  DW_TAG_member
    2954                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2955                      .dwattr $C$DW$174, DW_AT_name("rsvd3")
    2956                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd3")
    2957                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00)
    2958                      .dwattr $C$DW$174, DW_AT_bit_size(0x10)
    2959                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2960                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2961              
    2962                      .dwendtag $C$DW$T$45
    2963              
    2964              
    2965              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2966                      .dwattr $C$DW$T$46, DW_AT_name("CLKSRCCTL1_REG")
    2967                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2968              $C$DW$175       .dwtag  DW_TAG_member
    2969                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$27)
    2970                      .dwattr $C$DW$175, DW_AT_name("all")
    2971                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_all")
    2972                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2973                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2974              
    2975              $C$DW$176       .dwtag  DW_TAG_member
    2976                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$45)
    2977                      .dwattr $C$DW$176, DW_AT_name("bit")
    2978                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_bit")
    2979                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2980                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2981              
    2982                      .dwendtag $C$DW$T$46
    2983              
    2984              
    2985              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2986                      .dwattr $C$DW$T$47, DW_AT_name("CLKSRCCTL2_BITS")
    2987                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2988              $C$DW$177       .dwtag  DW_TAG_member
    2989                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2990                      .dwattr $C$DW$177, DW_AT_name("AUXOSCCLKSRCSEL")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   59

    2991                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    2992                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0e)
    2993                      .dwattr $C$DW$177, DW_AT_bit_size(0x02)
    2994                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2995                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2996              
    2997              $C$DW$178       .dwtag  DW_TAG_member
    2998                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2999                      .dwattr $C$DW$178, DW_AT_name("CANABCLKSEL")
    3000                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_CANABCLKSEL")
    3001                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0c)
    3002                      .dwattr $C$DW$178, DW_AT_bit_size(0x02)
    3003                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3004                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3005              
    3006              $C$DW$179       .dwtag  DW_TAG_member
    3007                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    3008                      .dwattr $C$DW$179, DW_AT_name("CANBBCLKSEL")
    3009                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    3010                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0a)
    3011                      .dwattr $C$DW$179, DW_AT_bit_size(0x02)
    3012                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3013                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3014              
    3015              $C$DW$180       .dwtag  DW_TAG_member
    3016                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    3017                      .dwattr $C$DW$180, DW_AT_name("rsvd1")
    3018                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd1")
    3019                      .dwattr $C$DW$180, DW_AT_bit_offset(0x08)
    3020                      .dwattr $C$DW$180, DW_AT_bit_size(0x02)
    3021                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3022                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3023              
    3024              $C$DW$181       .dwtag  DW_TAG_member
    3025                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    3026                      .dwattr $C$DW$181, DW_AT_name("rsvd2")
    3027                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd2")
    3028                      .dwattr $C$DW$181, DW_AT_bit_offset(0x06)
    3029                      .dwattr $C$DW$181, DW_AT_bit_size(0x02)
    3030                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3031                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3032              
    3033              $C$DW$182       .dwtag  DW_TAG_member
    3034                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3035                      .dwattr $C$DW$182, DW_AT_name("rsvd3")
    3036                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd3")
    3037                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    3038                      .dwattr $C$DW$182, DW_AT_bit_size(0x06)
    3039                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3040                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3041              
    3042              $C$DW$183       .dwtag  DW_TAG_member
    3043                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3044                      .dwattr $C$DW$183, DW_AT_name("rsvd4")
    3045                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd4")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   60

    3046                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00)
    3047                      .dwattr $C$DW$183, DW_AT_bit_size(0x10)
    3048                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3049                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3050              
    3051                      .dwendtag $C$DW$T$47
    3052              
    3053              
    3054              $C$DW$T$48      .dwtag  DW_TAG_union_type
    3055                      .dwattr $C$DW$T$48, DW_AT_name("CLKSRCCTL2_REG")
    3056                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3057              $C$DW$184       .dwtag  DW_TAG_member
    3058                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$27)
    3059                      .dwattr $C$DW$184, DW_AT_name("all")
    3060                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_all")
    3061                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3062                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3063              
    3064              $C$DW$185       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$47)
    3066                      .dwattr $C$DW$185, DW_AT_name("bit")
    3067                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_bit")
    3068                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3069                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3070              
    3071                      .dwendtag $C$DW$T$48
    3072              
    3073              
    3074              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3075                      .dwattr $C$DW$T$49, DW_AT_name("CLKSRCCTL3_BITS")
    3076                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    3077              $C$DW$186       .dwtag  DW_TAG_member
    3078                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    3079                      .dwattr $C$DW$186, DW_AT_name("XCLKOUTSEL")
    3080                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    3081                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0d)
    3082                      .dwattr $C$DW$186, DW_AT_bit_size(0x03)
    3083                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3084                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3085              
    3086              $C$DW$187       .dwtag  DW_TAG_member
    3087                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    3088                      .dwattr $C$DW$187, DW_AT_name("rsvd1")
    3089                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd1")
    3090                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    3091                      .dwattr $C$DW$187, DW_AT_bit_size(0x0d)
    3092                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3093                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3094              
    3095              $C$DW$188       .dwtag  DW_TAG_member
    3096                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    3097                      .dwattr $C$DW$188, DW_AT_name("rsvd2")
    3098                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd2")
    3099                      .dwattr $C$DW$188, DW_AT_bit_offset(0x00)
    3100                      .dwattr $C$DW$188, DW_AT_bit_size(0x10)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   61

    3101                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3102                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3103              
    3104                      .dwendtag $C$DW$T$49
    3105              
    3106              
    3107              $C$DW$T$50      .dwtag  DW_TAG_union_type
    3108                      .dwattr $C$DW$T$50, DW_AT_name("CLKSRCCTL3_REG")
    3109                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    3110              $C$DW$189       .dwtag  DW_TAG_member
    3111                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    3112                      .dwattr $C$DW$189, DW_AT_name("all")
    3113                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_all")
    3114                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3115                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3116              
    3117              $C$DW$190       .dwtag  DW_TAG_member
    3118                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$49)
    3119                      .dwattr $C$DW$190, DW_AT_name("bit")
    3120                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_bit")
    3121                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3122                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3123              
    3124                      .dwendtag $C$DW$T$50
    3125              
    3126              
    3127              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3128                      .dwattr $C$DW$T$52, DW_AT_name("CLK_CFG_REGS")
    3129                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x32)
    3130              $C$DW$191       .dwtag  DW_TAG_member
    3131                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$21)
    3132                      .dwattr $C$DW$191, DW_AT_name("rsvd1")
    3133                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_rsvd1")
    3134                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3135                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3136              
    3137              $C$DW$192       .dwtag  DW_TAG_member
    3138                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$44)
    3139                      .dwattr $C$DW$192, DW_AT_name("CLKCFGLOCK1")
    3140                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    3141                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3142                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3143              
    3144              $C$DW$193       .dwtag  DW_TAG_member
    3145                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$51)
    3146                      .dwattr $C$DW$193, DW_AT_name("rsvd2")
    3147                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd2")
    3148                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3149                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3150              
    3151              $C$DW$194       .dwtag  DW_TAG_member
    3152                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$46)
    3153                      .dwattr $C$DW$194, DW_AT_name("CLKSRCCTL1")
    3154                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3155                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   62

    3156                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3157              
    3158              $C$DW$195       .dwtag  DW_TAG_member
    3159                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$48)
    3160                      .dwattr $C$DW$195, DW_AT_name("CLKSRCCTL2")
    3161                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3162                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3163                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3164              
    3165              $C$DW$196       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$50)
    3167                      .dwattr $C$DW$196, DW_AT_name("CLKSRCCTL3")
    3168                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3169                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3170                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3171              
    3172              $C$DW$197       .dwtag  DW_TAG_member
    3173                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$168)
    3174                      .dwattr $C$DW$197, DW_AT_name("SYSPLLCTL1")
    3175                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3176                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3177                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3178              
    3179              $C$DW$198       .dwtag  DW_TAG_member
    3180                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$51)
    3181                      .dwattr $C$DW$198, DW_AT_name("rsvd3")
    3182                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_rsvd3")
    3183                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3184                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3185              
    3186              $C$DW$199       .dwtag  DW_TAG_member
    3187                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$170)
    3188                      .dwattr $C$DW$199, DW_AT_name("SYSPLLMULT")
    3189                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3190                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3191                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3192              
    3193              $C$DW$200       .dwtag  DW_TAG_member
    3194                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$172)
    3195                      .dwattr $C$DW$200, DW_AT_name("SYSPLLSTS")
    3196                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_SYSPLLSTS")
    3197                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3198                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3199              
    3200              $C$DW$201       .dwtag  DW_TAG_member
    3201                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$38)
    3202                      .dwattr $C$DW$201, DW_AT_name("AUXPLLCTL1")
    3203                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3204                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3205                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3206              
    3207              $C$DW$202       .dwtag  DW_TAG_member
    3208                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$51)
    3209                      .dwattr $C$DW$202, DW_AT_name("rsvd4")
    3210                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rsvd4")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   63

    3211                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3212                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3213              
    3214              $C$DW$203       .dwtag  DW_TAG_member
    3215                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$40)
    3216                      .dwattr $C$DW$203, DW_AT_name("AUXPLLMULT")
    3217                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3218                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3219                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3220              
    3221              $C$DW$204       .dwtag  DW_TAG_member
    3222                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$42)
    3223                      .dwattr $C$DW$204, DW_AT_name("AUXPLLSTS")
    3224                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_AUXPLLSTS")
    3225                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3226                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3227              
    3228              $C$DW$205       .dwtag  DW_TAG_member
    3229                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$166)
    3230                      .dwattr $C$DW$205, DW_AT_name("SYSCLKDIVSEL")
    3231                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3232                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3233                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3234              
    3235              $C$DW$206       .dwtag  DW_TAG_member
    3236                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$36)
    3237                      .dwattr $C$DW$206, DW_AT_name("AUXCLKDIVSEL")
    3238                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3239                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3240                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3241              
    3242              $C$DW$207       .dwtag  DW_TAG_member
    3243                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$156)
    3244                      .dwattr $C$DW$207, DW_AT_name("PERCLKDIVSEL")
    3245                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3246                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3247                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3248              
    3249              $C$DW$208       .dwtag  DW_TAG_member
    3250                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$191)
    3251                      .dwattr $C$DW$208, DW_AT_name("XCLKOUTDIVSEL")
    3252                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    3253                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3254                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3255              
    3256              $C$DW$209       .dwtag  DW_TAG_member
    3257                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$21)
    3258                      .dwattr $C$DW$209, DW_AT_name("rsvd5")
    3259                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_rsvd5")
    3260                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3261                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3262              
    3263              $C$DW$210       .dwtag  DW_TAG_member
    3264                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$120)
    3265                      .dwattr $C$DW$210, DW_AT_name("LOSPCP")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   64

    3266                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_LOSPCP")
    3267                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3268                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3269              
    3270              $C$DW$211       .dwtag  DW_TAG_member
    3271                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$124)
    3272                      .dwattr $C$DW$211, DW_AT_name("MCDCR")
    3273                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_MCDCR")
    3274                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3275                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3276              
    3277              $C$DW$212       .dwtag  DW_TAG_member
    3278                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$189)
    3279                      .dwattr $C$DW$212, DW_AT_name("X1CNT")
    3280                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_X1CNT")
    3281                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3282                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3283              
    3284                      .dwendtag $C$DW$T$52
    3285              
    3286              $C$DW$213       .dwtag  DW_TAG_TI_far_type
    3287                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$52)
    3288              
    3289              $C$DW$T$230     .dwtag  DW_TAG_volatile_type
    3290                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$213)
    3291              
    3292              
    3293              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3294                      .dwattr $C$DW$T$53, DW_AT_name("CPUSYSLOCK1_BITS")
    3295                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
    3296              $C$DW$214       .dwtag  DW_TAG_member
    3297                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    3298                      .dwattr $C$DW$214, DW_AT_name("HIBBOOTMODE")
    3299                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    3300                      .dwattr $C$DW$214, DW_AT_bit_offset(0x0f)
    3301                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    3302                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3303                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3304              
    3305              $C$DW$215       .dwtag  DW_TAG_member
    3306                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    3307                      .dwattr $C$DW$215, DW_AT_name("IORESTOREADDR")
    3308                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_IORESTOREADDR")
    3309                      .dwattr $C$DW$215, DW_AT_bit_offset(0x0e)
    3310                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    3311                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3312                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3313              
    3314              $C$DW$216       .dwtag  DW_TAG_member
    3315                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3316                      .dwattr $C$DW$216, DW_AT_name("PIEVERRADDR")
    3317                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_PIEVERRADDR")
    3318                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0d)
    3319                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    3320                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   65

    3321                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3322              
    3323              $C$DW$217       .dwtag  DW_TAG_member
    3324                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    3325                      .dwattr $C$DW$217, DW_AT_name("PCLKCR0")
    3326                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_PCLKCR0")
    3327                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0c)
    3328                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    3329                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3330                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3331              
    3332              $C$DW$218       .dwtag  DW_TAG_member
    3333                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    3334                      .dwattr $C$DW$218, DW_AT_name("PCLKCR1")
    3335                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_PCLKCR1")
    3336                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0b)
    3337                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    3338                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3339                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3340              
    3341              $C$DW$219       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3343                      .dwattr $C$DW$219, DW_AT_name("PCLKCR2")
    3344                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_PCLKCR2")
    3345                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0a)
    3346                      .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    3347                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3348                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3349              
    3350              $C$DW$220       .dwtag  DW_TAG_member
    3351                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3352                      .dwattr $C$DW$220, DW_AT_name("PCLKCR3")
    3353                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_PCLKCR3")
    3354                      .dwattr $C$DW$220, DW_AT_bit_offset(0x09)
    3355                      .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    3356                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3357                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3358              
    3359              $C$DW$221       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    3361                      .dwattr $C$DW$221, DW_AT_name("PCLKCR4")
    3362                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_PCLKCR4")
    3363                      .dwattr $C$DW$221, DW_AT_bit_offset(0x08)
    3364                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    3365                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3366                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3367              
    3368              $C$DW$222       .dwtag  DW_TAG_member
    3369                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    3370                      .dwattr $C$DW$222, DW_AT_name("PCLKCR5")
    3371                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_PCLKCR5")
    3372                      .dwattr $C$DW$222, DW_AT_bit_offset(0x07)
    3373                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    3374                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3375                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 12:25:44 2020

