TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Sat Nov 14 13:32:32 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../MonoMtrServo.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    4345 00000308 761F!         MOVW      DP,#_PieCtrlRegs+1    ; [CPU_ARAU] 
         00000309 0000 
    4346                      .dwpsn  file "../MonoMtrServo.c",line 1814,column 2,is_stmt,isa 0
    4347 0000030a 56BF!         MOVB      @$BLOCKED(_PieCtrlRegs)+1,#1,UNC ; [CPU_ALU] |1814| 
         0000030b 0101 
    4348 0000030c FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
    4349                      .dwcfi  cfa_offset, -16
    4350 0000030d E562          RESTORE   ; [CPU_FPU] 
    4351 0000030e FFF1          POP       RB                    ; [CPU_FPU] 
    4352                      .dwcfi  cfa_offset, -14
    4353                      .dwcfi  restore_reg, 74
    4354 0000030f C5BE          MOVL      XAR7,*--SP            ; [CPU_ALU] 
    4355                      .dwcfi  cfa_offset, -12
    4356                      .dwcfi  restore_reg, 18
    4357 00000310 C4BE          MOVL      XAR6,*--SP            ; [CPU_ALU] 
    4358                      .dwcfi  cfa_offset, -10
    4359                      .dwcfi  restore_reg, 16
    4360 00000311 83BE          MOVL      XAR5,*--SP            ; [CPU_ALU] 
    4361                      .dwcfi  cfa_offset, -8
    4362                      .dwcfi  restore_reg, 14
    4363 00000312 8ABE          MOVL      XAR4,*--SP            ; [CPU_ALU] 
    4364                      .dwcfi  cfa_offset, -6
    4365                      .dwcfi  restore_reg, 12
    4366 00000313 87BE          MOVL      XT,*--SP              ; [CPU_ALU] 
    4367                      .dwcfi  cfa_offset, -4
    4368                      .dwcfi  restore_reg, 22
    4369                      .dwcfi  restore_reg, 21
    4370 00000314 0003          POP       AR1H:AR0H             ; [CPU_ALU] 
    4371                      .dwcfi  cfa_offset, -2
    4372                      .dwcfi  restore_reg, 5
    4373                      .dwcfi  restore_reg, 7
    4374 00000315 7617          NASP      ; [CPU_ALU] 
    4375              $C$DW$199       .dwtag  DW_TAG_TI_branch
    4376                      .dwattr $C$DW$199, DW_AT_low_pc(0x00)
    4377                      .dwattr $C$DW$199, DW_AT_TI_return
    4378              
    4379 00000316 7602          IRET      ; [CPU_ALU] 
    4380                      ; return occurs ; [] 
    4381                      .dwattr $C$DW$195, DW_AT_TI_end_file("../MonoMtrServo.c")
    4382                      .dwattr $C$DW$195, DW_AT_TI_end_line(0x718)
    4383                      .dwattr $C$DW$195, DW_AT_TI_end_column(0x01)
    4384                      .dwendentry
    4385                      .dwendtag $C$DW$195
    4386              
    4387              ;**************************************************************
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE   97

    4388              ;* UNDEFINED EXTERNAL REFERENCES                              *
    4389              ;**************************************************************
    4390                      .global _GPIO_SetupPinOptions
    4391                      .global _GPIO_SetupPinMux
    4392                      .global _InitSysCtrl1
    4393                      .global _InitPieCtrl
    4394                      .global _InitPieVectTable
    4395                      .global _PWM_1ch_UpDwnCnt_CNF_noDB
    4396                      .global _InitMotor1EPwmGpio
    4397                      .global _ConfigureADC
    4398                      .global _InitMotor1EQepGpio
    4399                      .global _InitMotor1SpiGpio
    4400                      .global _InitSpiRegs_DRV830x
    4401                      .global _InitDRV8305Regs
    4402                      .global _InitMotor1_DRV_Gpio
    4403                      .global _GPIO_WritePin
    4404                      .global _F28x_usDelay
    4405                      .global _InitDRV8305
    4406                      .global _DLOG_4CH_F_init
    4407                      .global _DRV8305_diagnostics
    4408                      .global _DLOG_4CH_F_FUNC
    4409                      .global _DRV8305_SPI_Write
    4410                      .global _floor
    4411                      .global _CpuTimer0Regs
    4412                      .global _CpuTimer1Regs
    4413                      .global _CpuTimer2Regs
    4414                      .global _SpiaRegs
    4415                      .global _AdcaResultRegs
    4416                      .global _AdcbResultRegs
    4417                      .global _PieCtrlRegs
    4418                      .global _InputXbarRegs
    4419                      .global _EQep1Regs
    4420                      .global _EQep3Regs
    4421                      .global _GpioDataRegs
    4422                      .global _EPwmXbarRegs
    4423                      .global _AdcaRegs
    4424                      .global _AdcbRegs
    4425                      .global _CpuSysRegs
    4426                      .global _EPwm1Regs
    4427                      .global _EPwm7Regs
    4428                      .global _EPwm8Regs
    4429                      .global _EPwm9Regs
    4430                      .global _PieVectTable
    4431              
    4432              ;***************************************************************
    4433              ;* TYPE INFORMATION                                            *
    4434              ;***************************************************************
    4435              
    4436              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4437                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
    4438              $C$DW$200       .dwtag  DW_TAG_member
    4439                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    4440                      .dwattr $C$DW$200, DW_AT_name("As")
    4441                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_As")
    4442                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE   98

    4443                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    4444              
    4445              $C$DW$201       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    4447                      .dwattr $C$DW$201, DW_AT_name("Bs")
    4448                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_Bs")
    4449                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4450                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    4451              
    4452              $C$DW$202       .dwtag  DW_TAG_member
    4453                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    4454                      .dwattr $C$DW$202, DW_AT_name("Cs")
    4455                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_Cs")
    4456                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4457                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    4458              
    4459              $C$DW$203       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    4461                      .dwattr $C$DW$203, DW_AT_name("Alpha")
    4462                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_Alpha")
    4463                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4464                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    4465              
    4466              $C$DW$204       .dwtag  DW_TAG_member
    4467                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    4468                      .dwattr $C$DW$204, DW_AT_name("Beta")
    4469                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_Beta")
    4470                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4471                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    4472              
    4473                      .dwendtag $C$DW$T$20
    4474              
    4475              $C$DW$T$65      .dwtag  DW_TAG_typedef
    4476                      .dwattr $C$DW$T$65, DW_AT_name("CLARKE")
    4477                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$20)
    4478                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4479              
    4480              
    4481              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4482                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
    4483              $C$DW$205       .dwtag  DW_TAG_member
    4484                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    4485                      .dwattr $C$DW$205, DW_AT_name("Alpha")
    4486                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_Alpha")
    4487                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4488                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    4489              
    4490              $C$DW$206       .dwtag  DW_TAG_member
    4491                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    4492                      .dwattr $C$DW$206, DW_AT_name("Beta")
    4493                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_Beta")
    4494                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4495                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    4496              
    4497              $C$DW$207       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE   99

    4498                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    4499                      .dwattr $C$DW$207, DW_AT_name("Angle")
    4500                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_Angle")
    4501                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4502                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    4503              
    4504              $C$DW$208       .dwtag  DW_TAG_member
    4505                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    4506                      .dwattr $C$DW$208, DW_AT_name("Ds")
    4507                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_Ds")
    4508                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4509                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    4510              
    4511              $C$DW$209       .dwtag  DW_TAG_member
    4512                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    4513                      .dwattr $C$DW$209, DW_AT_name("Qs")
    4514                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_Qs")
    4515                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4516                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    4517              
    4518              $C$DW$210       .dwtag  DW_TAG_member
    4519                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    4520                      .dwattr $C$DW$210, DW_AT_name("Sine")
    4521                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_Sine")
    4522                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4523                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    4524              
    4525              $C$DW$211       .dwtag  DW_TAG_member
    4526                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    4527                      .dwattr $C$DW$211, DW_AT_name("Cosine")
    4528                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_Cosine")
    4529                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4530                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    4531              
    4532                      .dwendtag $C$DW$T$21
    4533              
    4534              $C$DW$T$66      .dwtag  DW_TAG_typedef
    4535                      .dwattr $C$DW$T$66, DW_AT_name("PARK")
    4536                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
    4537                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4538              
    4539              
    4540              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4541                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
    4542              $C$DW$212       .dwtag  DW_TAG_member
    4543                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    4544                      .dwattr $C$DW$212, DW_AT_name("Alpha")
    4545                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_Alpha")
    4546                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4547                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    4548              
    4549              $C$DW$213       .dwtag  DW_TAG_member
    4550                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    4551                      .dwattr $C$DW$213, DW_AT_name("Beta")
    4552                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_Beta")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  100

    4553                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4554                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4555              
    4556              $C$DW$214       .dwtag  DW_TAG_member
    4557                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    4558                      .dwattr $C$DW$214, DW_AT_name("Angle")
    4559                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_Angle")
    4560                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4561                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4562              
    4563              $C$DW$215       .dwtag  DW_TAG_member
    4564                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    4565                      .dwattr $C$DW$215, DW_AT_name("Ds")
    4566                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_Ds")
    4567                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4568                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    4569              
    4570              $C$DW$216       .dwtag  DW_TAG_member
    4571                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    4572                      .dwattr $C$DW$216, DW_AT_name("Qs")
    4573                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_Qs")
    4574                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4575                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4576              
    4577              $C$DW$217       .dwtag  DW_TAG_member
    4578                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    4579                      .dwattr $C$DW$217, DW_AT_name("Sine")
    4580                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_Sine")
    4581                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4582                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4583              
    4584              $C$DW$218       .dwtag  DW_TAG_member
    4585                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    4586                      .dwattr $C$DW$218, DW_AT_name("Cosine")
    4587                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_Cosine")
    4588                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4589                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4590              
    4591                      .dwendtag $C$DW$T$22
    4592              
    4593              $C$DW$T$67      .dwtag  DW_TAG_typedef
    4594                      .dwattr $C$DW$T$67, DW_AT_name("IPARK")
    4595                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
    4596                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4597              
    4598              
    4599              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4600                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
    4601              $C$DW$219       .dwtag  DW_TAG_member
    4602                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    4603                      .dwattr $C$DW$219, DW_AT_name("Ref")
    4604                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_Ref")
    4605                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4606                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4607              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  101

    4608              $C$DW$220       .dwtag  DW_TAG_member
    4609                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    4610                      .dwattr $C$DW$220, DW_AT_name("Fbk")
    4611                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_Fbk")
    4612                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4613                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4614              
    4615              $C$DW$221       .dwtag  DW_TAG_member
    4616                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    4617                      .dwattr $C$DW$221, DW_AT_name("Out")
    4618                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_Out")
    4619                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4620                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4621              
    4622              $C$DW$222       .dwtag  DW_TAG_member
    4623                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    4624                      .dwattr $C$DW$222, DW_AT_name("Kp")
    4625                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_Kp")
    4626                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4627                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4628              
    4629              $C$DW$223       .dwtag  DW_TAG_member
    4630                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    4631                      .dwattr $C$DW$223, DW_AT_name("Ki")
    4632                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_Ki")
    4633                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4634                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4635              
    4636              $C$DW$224       .dwtag  DW_TAG_member
    4637                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    4638                      .dwattr $C$DW$224, DW_AT_name("Umax")
    4639                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_Umax")
    4640                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4641                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4642              
    4643              $C$DW$225       .dwtag  DW_TAG_member
    4644                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    4645                      .dwattr $C$DW$225, DW_AT_name("Umin")
    4646                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_Umin")
    4647                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4648                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4649              
    4650              $C$DW$226       .dwtag  DW_TAG_member
    4651                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    4652                      .dwattr $C$DW$226, DW_AT_name("up")
    4653                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_up")
    4654                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4655                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4656              
    4657              $C$DW$227       .dwtag  DW_TAG_member
    4658                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    4659                      .dwattr $C$DW$227, DW_AT_name("ui")
    4660                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_ui")
    4661                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4662                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  102

    4663              
    4664              $C$DW$228       .dwtag  DW_TAG_member
    4665                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    4666                      .dwattr $C$DW$228, DW_AT_name("v1")
    4667                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_v1")
    4668                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4669                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4670              
    4671              $C$DW$229       .dwtag  DW_TAG_member
    4672                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    4673                      .dwattr $C$DW$229, DW_AT_name("i1")
    4674                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_i1")
    4675                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4676                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4677              
    4678              $C$DW$230       .dwtag  DW_TAG_member
    4679                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    4680                      .dwattr $C$DW$230, DW_AT_name("w1")
    4681                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_w1")
    4682                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4683                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4684              
    4685                      .dwendtag $C$DW$T$23
    4686              
    4687              $C$DW$T$68      .dwtag  DW_TAG_typedef
    4688                      .dwattr $C$DW$T$68, DW_AT_name("PI_CONTROLLER")
    4689                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
    4690                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4691              
    4692              
    4693              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4694                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
    4695              $C$DW$231       .dwtag  DW_TAG_member
    4696                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    4697                      .dwattr $C$DW$231, DW_AT_name("Ref")
    4698                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_Ref")
    4699                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4700                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4701              
    4702              $C$DW$232       .dwtag  DW_TAG_member
    4703                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    4704                      .dwattr $C$DW$232, DW_AT_name("Fbk")
    4705                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_Fbk")
    4706                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4707                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4708              
    4709              $C$DW$233       .dwtag  DW_TAG_member
    4710                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    4711                      .dwattr $C$DW$233, DW_AT_name("Out")
    4712                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_Out")
    4713                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4714                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4715              
    4716              $C$DW$234       .dwtag  DW_TAG_member
    4717                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  103

    4718                      .dwattr $C$DW$234, DW_AT_name("c1")
    4719                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_c1")
    4720                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4721                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4722              
    4723              $C$DW$235       .dwtag  DW_TAG_member
    4724                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    4725                      .dwattr $C$DW$235, DW_AT_name("c2")
    4726                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_c2")
    4727                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4728                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4729              
    4730                      .dwendtag $C$DW$T$24
    4731              
    4732              $C$DW$T$27      .dwtag  DW_TAG_typedef
    4733                      .dwattr $C$DW$T$27, DW_AT_name("PID_TERMINALS")
    4734                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    4735                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4736              
    4737              
    4738              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4739                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    4740              $C$DW$236       .dwtag  DW_TAG_member
    4741                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    4742                      .dwattr $C$DW$236, DW_AT_name("Kr")
    4743                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_Kr")
    4744                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4745                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4746              
    4747              $C$DW$237       .dwtag  DW_TAG_member
    4748                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    4749                      .dwattr $C$DW$237, DW_AT_name("Kp")
    4750                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_Kp")
    4751                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4752                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4753              
    4754              $C$DW$238       .dwtag  DW_TAG_member
    4755                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    4756                      .dwattr $C$DW$238, DW_AT_name("Ki")
    4757                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_Ki")
    4758                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4759                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4760              
    4761              $C$DW$239       .dwtag  DW_TAG_member
    4762                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    4763                      .dwattr $C$DW$239, DW_AT_name("Kd")
    4764                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_Kd")
    4765                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4766                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4767              
    4768              $C$DW$240       .dwtag  DW_TAG_member
    4769                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    4770                      .dwattr $C$DW$240, DW_AT_name("Km")
    4771                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_Km")
    4772                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  104

    4773                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4774              
    4775              $C$DW$241       .dwtag  DW_TAG_member
    4776                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    4777                      .dwattr $C$DW$241, DW_AT_name("Umax")
    4778                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_Umax")
    4779                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4780                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4781              
    4782              $C$DW$242       .dwtag  DW_TAG_member
    4783                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    4784                      .dwattr $C$DW$242, DW_AT_name("Umin")
    4785                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_Umin")
    4786                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4787                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4788              
    4789                      .dwendtag $C$DW$T$25
    4790              
    4791              $C$DW$T$28      .dwtag  DW_TAG_typedef
    4792                      .dwattr $C$DW$T$28, DW_AT_name("PID_PARAMETERS")
    4793                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    4794                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    4795              
    4796              
    4797              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4798                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    4799              $C$DW$243       .dwtag  DW_TAG_member
    4800                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    4801                      .dwattr $C$DW$243, DW_AT_name("up")
    4802                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_up")
    4803                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4804                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4805              
    4806              $C$DW$244       .dwtag  DW_TAG_member
    4807                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    4808                      .dwattr $C$DW$244, DW_AT_name("ui")
    4809                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_ui")
    4810                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4811                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4812              
    4813              $C$DW$245       .dwtag  DW_TAG_member
    4814                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    4815                      .dwattr $C$DW$245, DW_AT_name("ud")
    4816                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_ud")
    4817                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4818                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4819              
    4820              $C$DW$246       .dwtag  DW_TAG_member
    4821                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    4822                      .dwattr $C$DW$246, DW_AT_name("v1")
    4823                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_v1")
    4824                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4825                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4826              
    4827              $C$DW$247       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  105

    4828                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    4829                      .dwattr $C$DW$247, DW_AT_name("i1")
    4830                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_i1")
    4831                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4832                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4833              
    4834              $C$DW$248       .dwtag  DW_TAG_member
    4835                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    4836                      .dwattr $C$DW$248, DW_AT_name("d1")
    4837                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_d1")
    4838                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4839                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4840              
    4841              $C$DW$249       .dwtag  DW_TAG_member
    4842                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    4843                      .dwattr $C$DW$249, DW_AT_name("d2")
    4844                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_d2")
    4845                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4846                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4847              
    4848              $C$DW$250       .dwtag  DW_TAG_member
    4849                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    4850                      .dwattr $C$DW$250, DW_AT_name("w1")
    4851                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_w1")
    4852                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4853                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4854              
    4855                      .dwendtag $C$DW$T$26
    4856              
    4857              $C$DW$T$29      .dwtag  DW_TAG_typedef
    4858                      .dwattr $C$DW$T$29, DW_AT_name("PID_DATA")
    4859                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    4860                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4861              
    4862              
    4863              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4864                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
    4865              $C$DW$251       .dwtag  DW_TAG_member
    4866                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$27)
    4867                      .dwattr $C$DW$251, DW_AT_name("term")
    4868                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_term")
    4869                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4870                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4871              
    4872              $C$DW$252       .dwtag  DW_TAG_member
    4873                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$28)
    4874                      .dwattr $C$DW$252, DW_AT_name("param")
    4875                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_param")
    4876                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4877                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4878              
    4879              $C$DW$253       .dwtag  DW_TAG_member
    4880                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$29)
    4881                      .dwattr $C$DW$253, DW_AT_name("data")
    4882                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_data")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  106

    4883                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4884                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4885              
    4886                      .dwendtag $C$DW$T$30
    4887              
    4888              $C$DW$T$69      .dwtag  DW_TAG_typedef
    4889                      .dwattr $C$DW$T$69, DW_AT_name("PID_CONTROLLER")
    4890                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$30)
    4891                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4892              
    4893              
    4894              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4895                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
    4896              $C$DW$254       .dwtag  DW_TAG_member
    4897                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    4898                      .dwattr $C$DW$254, DW_AT_name("Ualpha")
    4899                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_Ualpha")
    4900                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4901                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4902              
    4903              $C$DW$255       .dwtag  DW_TAG_member
    4904                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    4905                      .dwattr $C$DW$255, DW_AT_name("Ubeta")
    4906                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_Ubeta")
    4907                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4908                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4909              
    4910              $C$DW$256       .dwtag  DW_TAG_member
    4911                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    4912                      .dwattr $C$DW$256, DW_AT_name("Ta")
    4913                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_Ta")
    4914                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4915                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4916              
    4917              $C$DW$257       .dwtag  DW_TAG_member
    4918                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    4919                      .dwattr $C$DW$257, DW_AT_name("Tb")
    4920                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_Tb")
    4921                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4922                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4923              
    4924              $C$DW$258       .dwtag  DW_TAG_member
    4925                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    4926                      .dwattr $C$DW$258, DW_AT_name("Tc")
    4927                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_Tc")
    4928                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4929                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4930              
    4931              $C$DW$259       .dwtag  DW_TAG_member
    4932                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    4933                      .dwattr $C$DW$259, DW_AT_name("tmp1")
    4934                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_tmp1")
    4935                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4936                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4937              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  107

    4938              $C$DW$260       .dwtag  DW_TAG_member
    4939                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    4940                      .dwattr $C$DW$260, DW_AT_name("tmp2")
    4941                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_tmp2")
    4942                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4943                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4944              
    4945              $C$DW$261       .dwtag  DW_TAG_member
    4946                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    4947                      .dwattr $C$DW$261, DW_AT_name("tmp3")
    4948                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_tmp3")
    4949                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4950                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4951              
    4952              $C$DW$262       .dwtag  DW_TAG_member
    4953                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$31)
    4954                      .dwattr $C$DW$262, DW_AT_name("VecSector")
    4955                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_VecSector")
    4956                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4957                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4958              
    4959                      .dwendtag $C$DW$T$32
    4960              
    4961              $C$DW$T$70      .dwtag  DW_TAG_typedef
    4962                      .dwattr $C$DW$T$70, DW_AT_name("SVGEN")
    4963                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
    4964                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4965              
    4966              
    4967              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4968                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    4969              $C$DW$263       .dwtag  DW_TAG_member
    4970                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    4971                      .dwattr $C$DW$263, DW_AT_name("TargetValue")
    4972                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_TargetValue")
    4973                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4974                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4975              
    4976              $C$DW$264       .dwtag  DW_TAG_member
    4977                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$33)
    4978                      .dwattr $C$DW$264, DW_AT_name("RampDelayMax")
    4979                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_RampDelayMax")
    4980                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4981                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4982              
    4983              $C$DW$265       .dwtag  DW_TAG_member
    4984                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    4985                      .dwattr $C$DW$265, DW_AT_name("RampLowLimit")
    4986                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_RampLowLimit")
    4987                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4988                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4989              
    4990              $C$DW$266       .dwtag  DW_TAG_member
    4991                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    4992                      .dwattr $C$DW$266, DW_AT_name("RampHighLimit")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  108

    4993                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_RampHighLimit")
    4994                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4995                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4996              
    4997              $C$DW$267       .dwtag  DW_TAG_member
    4998                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$33)
    4999                      .dwattr $C$DW$267, DW_AT_name("RampDelayCount")
    5000                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_RampDelayCount")
    5001                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5002                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5003              
    5004              $C$DW$268       .dwtag  DW_TAG_member
    5005                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    5006                      .dwattr $C$DW$268, DW_AT_name("SetpointValue")
    5007                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_SetpointValue")
    5008                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5009                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    5010              
    5011              $C$DW$269       .dwtag  DW_TAG_member
    5012                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$33)
    5013                      .dwattr $C$DW$269, DW_AT_name("EqualFlag")
    5014                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_EqualFlag")
    5015                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5016                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5017              
    5018              $C$DW$270       .dwtag  DW_TAG_member
    5019                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    5020                      .dwattr $C$DW$270, DW_AT_name("Tmp")
    5021                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_Tmp")
    5022                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5023                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5024              
    5025                      .dwendtag $C$DW$T$34
    5026              
    5027              $C$DW$T$71      .dwtag  DW_TAG_typedef
    5028                      .dwattr $C$DW$T$71, DW_AT_name("RMPCNTL")
    5029                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    5030                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    5031              
    5032              
    5033              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5034                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    5035              $C$DW$271       .dwtag  DW_TAG_member
    5036                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    5037                      .dwattr $C$DW$271, DW_AT_name("Freq")
    5038                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_Freq")
    5039                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5040                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5041              
    5042              $C$DW$272       .dwtag  DW_TAG_member
    5043                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    5044                      .dwattr $C$DW$272, DW_AT_name("StepAngleMax")
    5045                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_StepAngleMax")
    5046                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5047                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  109

    5048              
    5049              $C$DW$273       .dwtag  DW_TAG_member
    5050                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    5051                      .dwattr $C$DW$273, DW_AT_name("Angle")
    5052                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_Angle")
    5053                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5054                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5055              
    5056              $C$DW$274       .dwtag  DW_TAG_member
    5057                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    5058                      .dwattr $C$DW$274, DW_AT_name("Gain")
    5059                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_Gain")
    5060                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5061                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5062              
    5063              $C$DW$275       .dwtag  DW_TAG_member
    5064                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    5065                      .dwattr $C$DW$275, DW_AT_name("Out")
    5066                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_Out")
    5067                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5068                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5069              
    5070              $C$DW$276       .dwtag  DW_TAG_member
    5071                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    5072                      .dwattr $C$DW$276, DW_AT_name("Offset")
    5073                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_Offset")
    5074                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5075                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    5076              
    5077                      .dwendtag $C$DW$T$35
    5078              
    5079              $C$DW$T$72      .dwtag  DW_TAG_typedef
    5080                      .dwattr $C$DW$T$72, DW_AT_name("RAMPGEN")
    5081                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    5082                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    5083              
    5084              
    5085              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5086                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
    5087              $C$DW$277       .dwtag  DW_TAG_member
    5088                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    5089                      .dwattr $C$DW$277, DW_AT_name("DcBusVolt")
    5090                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_DcBusVolt")
    5091                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5092                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    5093              
    5094              $C$DW$278       .dwtag  DW_TAG_member
    5095                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    5096                      .dwattr $C$DW$278, DW_AT_name("MfuncV1")
    5097                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_MfuncV1")
    5098                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5099                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5100              
    5101              $C$DW$279       .dwtag  DW_TAG_member
    5102                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  110

    5103                      .dwattr $C$DW$279, DW_AT_name("MfuncV2")
    5104                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_MfuncV2")
    5105                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5106                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5107              
    5108              $C$DW$280       .dwtag  DW_TAG_member
    5109                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    5110                      .dwattr $C$DW$280, DW_AT_name("MfuncV3")
    5111                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_MfuncV3")
    5112                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5113                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5114              
    5115              $C$DW$281       .dwtag  DW_TAG_member
    5116                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$31)
    5117                      .dwattr $C$DW$281, DW_AT_name("OutOfPhase")
    5118                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_OutOfPhase")
    5119                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5120                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5121              
    5122              $C$DW$282       .dwtag  DW_TAG_member
    5123                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    5124                      .dwattr $C$DW$282, DW_AT_name("VphaseA")
    5125                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_VphaseA")
    5126                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5127                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5128              
    5129              $C$DW$283       .dwtag  DW_TAG_member
    5130                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    5131                      .dwattr $C$DW$283, DW_AT_name("VphaseB")
    5132                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_VphaseB")
    5133                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5134                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5135              
    5136              $C$DW$284       .dwtag  DW_TAG_member
    5137                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    5138                      .dwattr $C$DW$284, DW_AT_name("VphaseC")
    5139                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_VphaseC")
    5140                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5141                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5142              
    5143              $C$DW$285       .dwtag  DW_TAG_member
    5144                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
    5145                      .dwattr $C$DW$285, DW_AT_name("Valpha")
    5146                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_Valpha")
    5147                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5148                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5149              
    5150              $C$DW$286       .dwtag  DW_TAG_member
    5151                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    5152                      .dwattr $C$DW$286, DW_AT_name("Vbeta")
    5153                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_Vbeta")
    5154                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5155                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5156              
    5157              $C$DW$287       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  111

    5158                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    5159                      .dwattr $C$DW$287, DW_AT_name("temp")
    5160                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_temp")
    5161                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5162                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5163              
    5164                      .dwendtag $C$DW$T$36
    5165              
    5166              $C$DW$T$73      .dwtag  DW_TAG_typedef
    5167                      .dwattr $C$DW$T$73, DW_AT_name("PHASEVOLTAGE")
    5168                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$36)
    5169                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    5170              
    5171              
    5172              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5173                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    5174              $C$DW$288       .dwtag  DW_TAG_member
    5175                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    5176                      .dwattr $C$DW$288, DW_AT_name("ElecTheta")
    5177                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_ElecTheta")
    5178                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5179                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    5180              
    5181              $C$DW$289       .dwtag  DW_TAG_member
    5182                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$33)
    5183                      .dwattr $C$DW$289, DW_AT_name("DirectionQep")
    5184                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_DirectionQep")
    5185                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5186                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    5187              
    5188              $C$DW$290       .dwtag  DW_TAG_member
    5189                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    5190                      .dwattr $C$DW$290, DW_AT_name("OldElecTheta")
    5191                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_OldElecTheta")
    5192                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5193                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    5194              
    5195              $C$DW$291       .dwtag  DW_TAG_member
    5196                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    5197                      .dwattr $C$DW$291, DW_AT_name("Speed")
    5198                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_Speed")
    5199                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5200                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5201              
    5202              $C$DW$292       .dwtag  DW_TAG_member
    5203                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$33)
    5204                      .dwattr $C$DW$292, DW_AT_name("BaseRpm")
    5205                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_BaseRpm")
    5206                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5207                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5208              
    5209              $C$DW$293       .dwtag  DW_TAG_member
    5210                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$37)
    5211                      .dwattr $C$DW$293, DW_AT_name("K1")
    5212                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_K1")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  112

    5213                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5214                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5215              
    5216              $C$DW$294       .dwtag  DW_TAG_member
    5217                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    5218                      .dwattr $C$DW$294, DW_AT_name("K2")
    5219                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_K2")
    5220                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5221                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    5222              
    5223              $C$DW$295       .dwtag  DW_TAG_member
    5224                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    5225                      .dwattr $C$DW$295, DW_AT_name("K3")
    5226                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_K3")
    5227                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5228                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    5229              
    5230              $C$DW$296       .dwtag  DW_TAG_member
    5231                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$38)
    5232                      .dwattr $C$DW$296, DW_AT_name("SpeedRpm")
    5233                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_SpeedRpm")
    5234                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5235                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    5236              
    5237              $C$DW$297       .dwtag  DW_TAG_member
    5238                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    5239                      .dwattr $C$DW$297, DW_AT_name("Tmp")
    5240                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_Tmp")
    5241                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5242                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    5243              
    5244                      .dwendtag $C$DW$T$39
    5245              
    5246              $C$DW$T$74      .dwtag  DW_TAG_typedef
    5247                      .dwattr $C$DW$T$74, DW_AT_name("SPEED_MEAS_QEP")
    5248                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$39)
    5249                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    5250              
    5251              
    5252              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5253                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    5254              $C$DW$298       .dwtag  DW_TAG_member
    5255                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$40)
    5256                      .dwattr $C$DW$298, DW_AT_name("ElecTheta")
    5257                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_ElecTheta")
    5258                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5259                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    5260              
    5261              $C$DW$299       .dwtag  DW_TAG_member
    5262                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$40)
    5263                      .dwattr $C$DW$299, DW_AT_name("MechTheta")
    5264                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_MechTheta")
    5265                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5266                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    5267              
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  113

    5268              $C$DW$300       .dwtag  DW_TAG_member
    5269                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$31)
    5270                      .dwattr $C$DW$300, DW_AT_name("DirectionQep")
    5271                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_DirectionQep")
    5272                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5273                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    5274              
    5275              $C$DW$301       .dwtag  DW_TAG_member
    5276                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$31)
    5277                      .dwattr $C$DW$301, DW_AT_name("QepPeriod")
    5278                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_QepPeriod")
    5279                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5280                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    5281              
    5282              $C$DW$302       .dwtag  DW_TAG_member
    5283                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$33)
    5284                      .dwattr $C$DW$302, DW_AT_name("QepCountIndex")
    5285                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_QepCountIndex")
    5286                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5287                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    5288              
    5289              $C$DW$303       .dwtag  DW_TAG_member
    5290                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$38)
    5291                      .dwattr $C$DW$303, DW_AT_name("RawTheta")
    5292                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_RawTheta")
    5293                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5294                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5295              
    5296              $C$DW$304       .dwtag  DW_TAG_member
    5297                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$40)
    5298                      .dwattr $C$DW$304, DW_AT_name("MechScaler")
    5299                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_MechScaler")
    5300                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5301                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5302              
    5303              $C$DW$305       .dwtag  DW_TAG_member
    5304                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$31)
    5305                      .dwattr $C$DW$305, DW_AT_name("LineEncoder")
    5306                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_LineEncoder")
    5307                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5308                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5309              
    5310              $C$DW$306       .dwtag  DW_TAG_member
    5311                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$31)
    5312                      .dwattr $C$DW$306, DW_AT_name("PolePairs")
    5313                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_PolePairs")
    5314                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5315                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    5316              
    5317              $C$DW$307       .dwtag  DW_TAG_member
    5318                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$38)
    5319                      .dwattr $C$DW$307, DW_AT_name("CalibratedAngle")
    5320                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_CalibratedAngle")
    5321                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5322                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  114

    5323              
    5324              $C$DW$308       .dwtag  DW_TAG_member
    5325                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$31)
    5326                      .dwattr $C$DW$308, DW_AT_name("IndexSyncFlag")
    5327                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_IndexSyncFlag")
    5328                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5329                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    5330              
    5331                      .dwendtag $C$DW$T$41
    5332              
    5333              $C$DW$T$75      .dwtag  DW_TAG_typedef
    5334                      .dwattr $C$DW$T$75, DW_AT_name("QEP")
    5335                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    5336                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    5337              
    5338              
    5339              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    5340                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x07)
    5341              $C$DW$309       .dwtag  DW_TAG_member
    5342                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$42)
    5343                      .dwattr $C$DW$309, DW_AT_name("stat_reg1")
    5344                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_stat_reg1")
    5345                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5346                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    5347              
    5348              $C$DW$310       .dwtag  DW_TAG_member
    5349                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$43)
    5350                      .dwattr $C$DW$310, DW_AT_name("stat_reg2")
    5351                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_stat_reg2")
    5352                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5353                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    5354              
    5355              $C$DW$311       .dwtag  DW_TAG_member
    5356                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$44)
    5357                      .dwattr $C$DW$311, DW_AT_name("cntrl_reg1")
    5358                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_cntrl_reg1")
    5359                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5360                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    5361              
    5362              $C$DW$312       .dwtag  DW_TAG_member
    5363                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$45)
    5364                      .dwattr $C$DW$312, DW_AT_name("cntrl_reg2")
    5365                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_cntrl_reg2")
    5366                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5367                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5368              
    5369              $C$DW$313       .dwtag  DW_TAG_member
    5370                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$31)
    5371                      .dwattr $C$DW$313, DW_AT_name("readCntrl1")
    5372                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_readCntrl1")
    5373                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5374                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    5375              
    5376              $C$DW$314       .dwtag  DW_TAG_member
    5377                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  115

    5378                      .dwattr $C$DW$314, DW_AT_name("readCntrl2")
    5379                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_readCntrl2")
    5380                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5381                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    5382              
    5383              $C$DW$315       .dwtag  DW_TAG_member
    5384                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$31)
    5385                      .dwattr $C$DW$315, DW_AT_name("DRV_fault")
    5386                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_DRV_fault")
    5387                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5388                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5389              
    5390                      .dwendtag $C$DW$T$46
    5391              
    5392              $C$DW$T$76      .dwtag  DW_TAG_typedef
    5393                      .dwattr $C$DW$T$76, DW_AT_name("DRV8301_Vars")
    5394                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$46)
    5395                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    5396              
    5397              
    5398              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    5399                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x15)
    5400              $C$DW$316       .dwtag  DW_TAG_member
    5401                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$31)
    5402                      .dwattr $C$DW$316, DW_AT_name("Rsvd0")
    5403                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_Rsvd0")
    5404                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5405                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5406              
    5407              $C$DW$317       .dwtag  DW_TAG_member
    5408                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$47)
    5409                      .dwattr $C$DW$317, DW_AT_name("status1_wwd")
    5410                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_status1_wwd")
    5411                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5412                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5413              
    5414              $C$DW$318       .dwtag  DW_TAG_member
    5415                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$48)
    5416                      .dwattr $C$DW$318, DW_AT_name("status2_ov_vds")
    5417                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_status2_ov_vds")
    5418                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5419                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5420              
    5421              $C$DW$319       .dwtag  DW_TAG_member
    5422                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$49)
    5423                      .dwattr $C$DW$319, DW_AT_name("status3_IC")
    5424                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_status3_IC")
    5425                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5426                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5427              
    5428              $C$DW$320       .dwtag  DW_TAG_member
    5429                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$50)
    5430                      .dwattr $C$DW$320, DW_AT_name("status4_gd_Vgs")
    5431                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    5432                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  116

    5433                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5434              
    5435              $C$DW$321       .dwtag  DW_TAG_member
    5436                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$51)
    5437                      .dwattr $C$DW$321, DW_AT_name("cntrl5_hs_gd")
    5438                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    5439                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5440                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5441              
    5442              $C$DW$322       .dwtag  DW_TAG_member
    5443                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$52)
    5444                      .dwattr $C$DW$322, DW_AT_name("cntrl6_ls_gd")
    5445                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    5446                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5447                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5448              
    5449              $C$DW$323       .dwtag  DW_TAG_member
    5450                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$53)
    5451                      .dwattr $C$DW$323, DW_AT_name("cntrl7_gd")
    5452                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_cntrl7_gd")
    5453                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5454                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5455              
    5456              $C$DW$324       .dwtag  DW_TAG_member
    5457                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$31)
    5458                      .dwattr $C$DW$324, DW_AT_name("Rsvd8")
    5459                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_Rsvd8")
    5460                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5461                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5462              
    5463              $C$DW$325       .dwtag  DW_TAG_member
    5464                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$54)
    5465                      .dwattr $C$DW$325, DW_AT_name("cntrl9_IC_ops")
    5466                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    5467                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5468                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5469              
    5470              $C$DW$326       .dwtag  DW_TAG_member
    5471                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$55)
    5472                      .dwattr $C$DW$326, DW_AT_name("cntrlA_shunt_amp")
    5473                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    5474                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5475                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5476              
    5477              $C$DW$327       .dwtag  DW_TAG_member
    5478                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$56)
    5479                      .dwattr $C$DW$327, DW_AT_name("cntrlB_Vreg")
    5480                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    5481                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5482                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5483              
    5484              $C$DW$328       .dwtag  DW_TAG_member
    5485                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$57)
    5486                      .dwattr $C$DW$328, DW_AT_name("cntrlC_Vds_SNS")
    5487                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  117

    5488                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5489                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5490              
    5491              $C$DW$329       .dwtag  DW_TAG_member
    5492                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$31)
    5493                      .dwattr $C$DW$329, DW_AT_name("readCntrl5")
    5494                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_readCntrl5")
    5495                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5496                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5497              
    5498              $C$DW$330       .dwtag  DW_TAG_member
    5499                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$31)
    5500                      .dwattr $C$DW$330, DW_AT_name("readCntrl6")
    5501                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_readCntrl6")
    5502                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5503                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5504              
    5505              $C$DW$331       .dwtag  DW_TAG_member
    5506                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$31)
    5507                      .dwattr $C$DW$331, DW_AT_name("readCntrl7")
    5508                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_readCntrl7")
    5509                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5510                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5511              
    5512              $C$DW$332       .dwtag  DW_TAG_member
    5513                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$31)
    5514                      .dwattr $C$DW$332, DW_AT_name("readCntrl9")
    5515                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_readCntrl9")
    5516                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5517                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5518              
    5519              $C$DW$333       .dwtag  DW_TAG_member
    5520                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$31)
    5521                      .dwattr $C$DW$333, DW_AT_name("readCntrlA")
    5522                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_readCntrlA")
    5523                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5524                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5525              
    5526              $C$DW$334       .dwtag  DW_TAG_member
    5527                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$31)
    5528                      .dwattr $C$DW$334, DW_AT_name("readCntrlB")
    5529                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_readCntrlB")
    5530                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5531                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5532              
    5533              $C$DW$335       .dwtag  DW_TAG_member
    5534                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$31)
    5535                      .dwattr $C$DW$335, DW_AT_name("readCntrlC")
    5536                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_readCntrlC")
    5537                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    5538                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    5539              
    5540              $C$DW$336       .dwtag  DW_TAG_member
    5541                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$31)
    5542                      .dwattr $C$DW$336, DW_AT_name("DRV_fault")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  118

    5543                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_DRV_fault")
    5544                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5545                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5546              
    5547                      .dwendtag $C$DW$T$58
    5548              
    5549              $C$DW$T$77      .dwtag  DW_TAG_typedef
    5550                      .dwattr $C$DW$T$77, DW_AT_name("DRV8305_Vars")
    5551                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$58)
    5552                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    5553              
    5554              
    5555              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    5556                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x150)
    5557              $C$DW$337       .dwtag  DW_TAG_member
    5558                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$60)
    5559                      .dwattr $C$DW$337, DW_AT_name("PwmARegs")
    5560                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_PwmARegs")
    5561                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5562                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    5563              
    5564              $C$DW$338       .dwtag  DW_TAG_member
    5565                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$60)
    5566                      .dwattr $C$DW$338, DW_AT_name("PwmBRegs")
    5567                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_PwmBRegs")
    5568                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5569                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5570              
    5571              $C$DW$339       .dwtag  DW_TAG_member
    5572                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$60)
    5573                      .dwattr $C$DW$339, DW_AT_name("PwmCRegs")
    5574                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_PwmCRegs")
    5575                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5576                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    5577              
    5578              $C$DW$340       .dwtag  DW_TAG_member
    5579                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$62)
    5580                      .dwattr $C$DW$340, DW_AT_name("QepRegs")
    5581                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_QepRegs")
    5582                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5583                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    5584              
    5585              $C$DW$341       .dwtag  DW_TAG_member
    5586                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$64)
    5587                      .dwattr $C$DW$341, DW_AT_name("SpiRegs")
    5588                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_SpiRegs")
    5589                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5590                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5591              
    5592              $C$DW$342       .dwtag  DW_TAG_member
    5593                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$31)
    5594                      .dwattr $C$DW$342, DW_AT_name("drvScsPin")
    5595                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_drvScsPin")
    5596                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5597                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  119

    5598              
    5599              $C$DW$343       .dwtag  DW_TAG_member
    5600                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    5601                      .dwattr $C$DW$343, DW_AT_name("offset_shntA")
    5602                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_offset_shntA")
    5603                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5604                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    5605              
    5606              $C$DW$344       .dwtag  DW_TAG_member
    5607                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
    5608                      .dwattr $C$DW$344, DW_AT_name("offset_shntB")
    5609                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_offset_shntB")
    5610                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5611                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    5612              
    5613              $C$DW$345       .dwtag  DW_TAG_member
    5614                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    5615                      .dwattr $C$DW$345, DW_AT_name("offset_shntC")
    5616                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_offset_shntC")
    5617                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5618                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    5619              
    5620              $C$DW$346       .dwtag  DW_TAG_member
    5621                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    5622                      .dwattr $C$DW$346, DW_AT_name("VdTesting")
    5623                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_VdTesting")
    5624                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5625                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    5626              
    5627              $C$DW$347       .dwtag  DW_TAG_member
    5628                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    5629                      .dwattr $C$DW$347, DW_AT_name("VqTesting")
    5630                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_VqTesting")
    5631                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5632                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    5633              
    5634              $C$DW$348       .dwtag  DW_TAG_member
    5635                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    5636                      .dwattr $C$DW$348, DW_AT_name("IdRef")
    5637                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_IdRef")
    5638                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5639                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    5640              
    5641              $C$DW$349       .dwtag  DW_TAG_member
    5642                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    5643                      .dwattr $C$DW$349, DW_AT_name("IqRef")
    5644                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_IqRef")
    5645                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5646                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    5647              
    5648              $C$DW$350       .dwtag  DW_TAG_member
    5649                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    5650                      .dwattr $C$DW$350, DW_AT_name("SpeedRef")
    5651                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_SpeedRef")
    5652                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  120

    5653                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    5654              
    5655              $C$DW$351       .dwtag  DW_TAG_member
    5656                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
    5657                      .dwattr $C$DW$351, DW_AT_name("ElecTheta")
    5658                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_ElecTheta")
    5659                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5660                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    5661              
    5662              $C$DW$352       .dwtag  DW_TAG_member
    5663                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
    5664                      .dwattr $C$DW$352, DW_AT_name("MechTheta")
    5665                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_MechTheta")
    5666                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5667                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    5668              
    5669              $C$DW$353       .dwtag  DW_TAG_member
    5670                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$40)
    5671                      .dwattr $C$DW$353, DW_AT_name("currentAs")
    5672                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_currentAs")
    5673                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5674                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    5675              
    5676              $C$DW$354       .dwtag  DW_TAG_member
    5677                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$40)
    5678                      .dwattr $C$DW$354, DW_AT_name("currentBs")
    5679                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_currentBs")
    5680                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5681                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    5682              
    5683              $C$DW$355       .dwtag  DW_TAG_member
    5684                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$40)
    5685                      .dwattr $C$DW$355, DW_AT_name("currentCs")
    5686                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_currentCs")
    5687                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5688                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    5689              
    5690              $C$DW$356       .dwtag  DW_TAG_member
    5691                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$38)
    5692                      .dwattr $C$DW$356, DW_AT_name("alignCntr")
    5693                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_alignCntr")
    5694                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    5695                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    5696              
    5697              $C$DW$357       .dwtag  DW_TAG_member
    5698                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$38)
    5699                      .dwattr $C$DW$357, DW_AT_name("alignCnt")
    5700                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_alignCnt")
    5701                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5702                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    5703              
    5704              $C$DW$358       .dwtag  DW_TAG_member
    5705                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$31)
    5706                      .dwattr $C$DW$358, DW_AT_name("lsw")
    5707                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_lsw")
TMS320C2000 Assembler PC v20.2.1 Sat Nov 14 13:32:33 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  121

    5708                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    5709                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    5710              
    5711              $C$DW$359       .dwtag  DW_TAG_member
    5712                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$31)
    5713                      .dwattr $C$DW$359, DW_AT_name("TripFlagDMC")
    5714                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_TripFlagDMC")
    5715                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    5716                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    5717              
    5718              $C$DW$360       .dwtag  DW_TAG_member
    5719                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$31)
    5720                      .dwattr $C$DW$360, DW_AT_name("clearTripFlagDMC")
