;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
;* Date/Time created: Sat Nov 14 13:32:32 2020                 *
;***************************************************************
	.compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --quiet --silicon_errata_fpu1_workaround=off --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 --tmu_support=tmu0 --vcu_support=vcu2 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../MonoMtrServo.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_WS\MonoMtrServo_377s\F2837x_RAM")
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_EnableFlag+0,32
	.bits		0,16
			; _EnableFlag @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_BackTicker+0,32
	.bits		0,16
			; _BackTicker @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_LedCnt+0,32
	.bits		0x1f4,16
			; _LedCnt @ 0


	.dwpsn	file "../MonoMtrServo.c",line 1263,column 2,is_stmt,isa 0
        MOVIZ     R0H,#17692            ; [CPU_FPU] |1263| 
        MOVIZ     R1H,#17692            ; [CPU_FPU] |1263| 
        MOVB      ACC,#107              ; [CPU_ALU] |1263| 
        MOVXI     R0H,#16384            ; [CPU_FPU] |1263| 
        MOVXI     R1H,#16384            ; [CPU_FPU] |1263| 
	.dwpsn	file "../MonoMtrServo.c",line 1262,column 2,is_stmt,isa 0
        MOV16     *+XAR4[0],R2H         ; [CPU_FPU] |1262| 
	.dwpsn	file "../MonoMtrServo.c",line 1263,column 2,is_stmt,isa 0
        MOV32     R2H,@$BLOCKED(_motor1)+210 ; [CPU_FPU] |1263| 
        MOVW      DP,#_motor1+4         ; [CPU_ARAU] 
        MPYF32    R0H,R0H,R2H           ; [CPU_FPU] |1263| 
        ADDL      ACC,@$BLOCKED(_motor1)+4 ; [CPU_ALU] |1263| 
        ADDF32    R0H,R0H,R1H           ; [CPU_FPU] |1263| 
        MOVL      XAR4,ACC              ; [CPU_ALU] |1263| 
        F32TOUI16 R0H,R0H               ; [CPU_FPU] |1263| 
        MOVW      DP,#_motor1+244       ; [CPU_ARAU] 
        MOV16     *+XAR4[0],R0H         ; [CPU_FPU] |1263| 
	.dwpsn	file "../MonoMtrServo.c",line 1268,column 2,is_stmt,isa 0
        MOVL      P,@$BLOCKED(_motor1)+244 ; [CPU_ALU] |1268| 
        MOVW      DP,#_motor1+270       ; [CPU_ARAU] 
	.dwpsn	file "../MonoMtrServo.c",line 1269,column 2,is_stmt,isa 0
        MOVL      XAR7,@$BLOCKED(_motor1)+270 ; [CPU_ALU] |1269| 
        MOVW      DP,#_motor1+52        ; [CPU_ARAU] 
	.dwpsn	file "../MonoMtrServo.c",line 1810,column 2,is_stmt,isa 0
        MOVL      XAR4,#_dlog_4ch1      ; [CPU_ARAU] |1810| 
	.dwpsn	file "../MonoMtrServo.c",line 1270,column 2,is_stmt,isa 0
        MOVL      XAR6,@$BLOCKED(_motor1)+52 ; [CPU_ALU] |1270| 
	.dwpsn	file "../MonoMtrServo.c",line 1271,column 2,is_stmt,isa 0
        MOVL      ACC,@$BLOCKED(_motor1)+54 ; [CPU_ALU] |1271| 
        MOVW      DP,#_DlogCh1          ; [CPU_ARAU] 
	.dwpsn	file "../MonoMtrServo.c",line 1268,column 2,is_stmt,isa 0
        MOVL      @_DlogCh1,P           ; [CPU_ALU] |1268| 
	.dwpsn	file "../MonoMtrServo.c",line 1271,column 2,is_stmt,isa 0
        MOVL      @_DlogCh4,ACC         ; [CPU_ALU] |1271| 
	.dwpsn	file "../MonoMtrServo.c",line 1269,column 2,is_stmt,isa 0
        MOVL      @_DlogCh2,XAR7        ; [CPU_ALU] |1269| 
	.dwpsn	file "../MonoMtrServo.c",line 1270,column 2,is_stmt,isa 0
        MOVL      @_DlogCh3,XAR6        ; [CPU_ALU] |1270| 
	.dwpsn	file "../MonoMtrServo.c",line 1810,column 2,is_stmt,isa 0
$C$DW$198	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$198, DW_AT_low_pc(0x00)
	.dwattr $C$DW$198, DW_AT_name("_DLOG_4CH_F_FUNC")
	.dwattr $C$DW$198, DW_AT_TI_call

        LCR       #_DLOG_4CH_F_FUNC     ; [CPU_ALU] |1810| 
        ; call occurs [#_DLOG_4CH_F_FUNC] ; [] |1810| 
        MOVW      DP,#_AdcbRegs+4       ; [CPU_ARAU] 
	.dwpsn	file "../MonoMtrServo.c",line 1813,column 2,is_stmt,isa 0
        OR        @$BLOCKED(_AdcbRegs)+4,#0x0001 ; [CPU_ALU] |1813| 
        MOVW      DP,#_PieCtrlRegs+1    ; [CPU_ARAU] 
	.dwpsn	file "../MonoMtrServo.c",line 1814,column 2,is_stmt,isa 0
        MOVB      @$BLOCKED(_PieCtrlRegs)+1,#1,UNC ; [CPU_ALU] |1814| 
        SUBB      SP,#2                 ; [CPU_ARAU] 
	.dwcfi	cfa_offset, -16
        RESTORE   ; [CPU_FPU] 
        POP       RB                    ; [CPU_FPU] 
	.dwcfi	cfa_offset, -14
	.dwcfi	restore_reg, 74
        MOVL      XAR7,*--SP            ; [CPU_ALU] 
	.dwcfi	cfa_offset, -12
	.dwcfi	restore_reg, 18
        MOVL      XAR6,*--SP            ; [CPU_ALU] 
	.dwcfi	cfa_offset, -10
	.dwcfi	restore_reg, 16
        MOVL      XAR5,*--SP            ; [CPU_ALU] 
	.dwcfi	cfa_offset, -8
	.dwcfi	restore_reg, 14
        MOVL      XAR4,*--SP            ; [CPU_ALU] 
	.dwcfi	cfa_offset, -6
	.dwcfi	restore_reg, 12
        MOVL      XT,*--SP              ; [CPU_ALU] 
	.dwcfi	cfa_offset, -4
	.dwcfi	restore_reg, 22
	.dwcfi	restore_reg, 21
        POP       AR1H:AR0H             ; [CPU_ALU] 
	.dwcfi	cfa_offset, -2
	.dwcfi	restore_reg, 5
	.dwcfi	restore_reg, 7
        NASP      ; [CPU_ALU] 
$C$DW$199	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$199, DW_AT_low_pc(0x00)
	.dwattr $C$DW$199, DW_AT_TI_return

        IRET      ; [CPU_ALU] 
        ; return occurs ; [] 
	.dwattr $C$DW$195, DW_AT_TI_end_file("../MonoMtrServo.c")
	.dwattr $C$DW$195, DW_AT_TI_end_line(0x718)
	.dwattr $C$DW$195, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$195

;**************************************************************
;* UNDEFINED EXTERNAL REFERENCES                              *
;**************************************************************
	.global	_GPIO_SetupPinOptions
	.global	_GPIO_SetupPinMux
	.global	_InitSysCtrl1
	.global	_InitPieCtrl
	.global	_InitPieVectTable
	.global	_PWM_1ch_UpDwnCnt_CNF_noDB
	.global	_InitMotor1EPwmGpio
	.global	_ConfigureADC
	.global	_InitMotor1EQepGpio
	.global	_InitMotor1SpiGpio
	.global	_InitSpiRegs_DRV830x
	.global	_InitDRV8305Regs
	.global	_InitMotor1_DRV_Gpio
	.global	_GPIO_WritePin
	.global	_F28x_usDelay
	.global	_InitDRV8305
	.global	_DLOG_4CH_F_init
	.global	_DRV8305_diagnostics
	.global	_DLOG_4CH_F_FUNC
	.global	_DRV8305_SPI_Write
	.global	_floor
	.global	_CpuTimer0Regs
	.global	_CpuTimer1Regs
	.global	_CpuTimer2Regs
	.global	_SpiaRegs
	.global	_AdcaResultRegs
	.global	_AdcbResultRegs
	.global	_PieCtrlRegs
	.global	_InputXbarRegs
	.global	_EQep1Regs
	.global	_EQep3Regs
	.global	_GpioDataRegs
	.global	_EPwmXbarRegs
	.global	_AdcaRegs
	.global	_AdcbRegs
	.global	_CpuSysRegs
	.global	_EPwm1Regs
	.global	_EPwm7Regs
	.global	_EPwm8Regs
	.global	_EPwm9Regs
	.global	_PieVectTable

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$200, DW_AT_name("As")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("_As")
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$201, DW_AT_name("Bs")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("_Bs")
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$202, DW_AT_name("Cs")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("_Cs")
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$203, DW_AT_name("Alpha")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("_Alpha")
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$204, DW_AT_name("Beta")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("_Beta")
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$20

$C$DW$T$65	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$65, DW_AT_name("CLARKE")
	.dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)


$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$205, DW_AT_name("Alpha")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("_Alpha")
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$206, DW_AT_name("Beta")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("_Beta")
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$207, DW_AT_name("Angle")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("_Angle")
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$208, DW_AT_name("Ds")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("_Ds")
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$209, DW_AT_name("Qs")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("_Qs")
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$210, DW_AT_name("Sine")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("_Sine")
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$211, DW_AT_name("Cosine")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("_Cosine")
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$21

$C$DW$T$66	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$66, DW_AT_name("PARK")
	.dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)


$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$212, DW_AT_name("Alpha")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("_Alpha")
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$213, DW_AT_name("Beta")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("_Beta")
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$214, DW_AT_name("Angle")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("_Angle")
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$215, DW_AT_name("Ds")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("_Ds")
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$216, DW_AT_name("Qs")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("_Qs")
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$217, DW_AT_name("Sine")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("_Sine")
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$218, DW_AT_name("Cosine")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("_Cosine")
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$22

$C$DW$T$67	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$67, DW_AT_name("IPARK")
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)


$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$219, DW_AT_name("Ref")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("_Ref")
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$220, DW_AT_name("Fbk")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("_Fbk")
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$221, DW_AT_name("Out")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("_Out")
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$222, DW_AT_name("Kp")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("_Kp")
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$223, DW_AT_name("Ki")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("_Ki")
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$224, DW_AT_name("Umax")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("_Umax")
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$225, DW_AT_name("Umin")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("_Umin")
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$226, DW_AT_name("up")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("_up")
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$227, DW_AT_name("ui")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("_ui")
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$228, DW_AT_name("v1")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("_v1")
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$229, DW_AT_name("i1")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("_i1")
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$230, DW_AT_name("w1")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("_w1")
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$23

$C$DW$T$68	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$68, DW_AT_name("PI_CONTROLLER")
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$231, DW_AT_name("Ref")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("_Ref")
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$232, DW_AT_name("Fbk")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("_Fbk")
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$233, DW_AT_name("Out")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("_Out")
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$234, DW_AT_name("c1")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("_c1")
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$235, DW_AT_name("c2")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("_c2")
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$24

$C$DW$T$27	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$27, DW_AT_name("PID_TERMINALS")
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$236, DW_AT_name("Kr")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("_Kr")
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$237, DW_AT_name("Kp")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("_Kp")
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$238, DW_AT_name("Ki")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("_Ki")
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$239, DW_AT_name("Kd")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("_Kd")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$240, DW_AT_name("Km")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("_Km")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$241, DW_AT_name("Umax")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("_Umax")
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$242, DW_AT_name("Umin")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("_Umin")
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$25

$C$DW$T$28	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$28, DW_AT_name("PID_PARAMETERS")
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$243, DW_AT_name("up")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("_up")
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$244, DW_AT_name("ui")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("_ui")
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$245, DW_AT_name("ud")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("_ud")
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$246, DW_AT_name("v1")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("_v1")
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$247, DW_AT_name("i1")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("_i1")
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$248, DW_AT_name("d1")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("_d1")
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$249, DW_AT_name("d2")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("_d2")
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$250, DW_AT_name("w1")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("_w1")
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$26

$C$DW$T$29	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$29, DW_AT_name("PID_DATA")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$251, DW_AT_name("term")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("_term")
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$252, DW_AT_name("param")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("_param")
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$253, DW_AT_name("data")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("_data")
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$30

$C$DW$T$69	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$69, DW_AT_name("PID_CONTROLLER")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$254, DW_AT_name("Ualpha")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("_Ualpha")
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$255, DW_AT_name("Ubeta")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("_Ubeta")
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$256, DW_AT_name("Ta")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("_Ta")
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$257, DW_AT_name("Tb")
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("_Tb")
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$258, DW_AT_name("Tc")
	.dwattr $C$DW$258, DW_AT_TI_symbol_name("_Tc")
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$259, DW_AT_name("tmp1")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("_tmp1")
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$260	.dwtag  DW_TAG_member
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$260, DW_AT_name("tmp2")
	.dwattr $C$DW$260, DW_AT_TI_symbol_name("_tmp2")
	.dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$261, DW_AT_name("tmp3")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("_tmp3")
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$262, DW_AT_name("VecSector")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("_VecSector")
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$32

$C$DW$T$70	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$70, DW_AT_name("SVGEN")
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)


$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$263, DW_AT_name("TargetValue")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("_TargetValue")
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$264, DW_AT_name("RampDelayMax")
	.dwattr $C$DW$264, DW_AT_TI_symbol_name("_RampDelayMax")
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$265, DW_AT_name("RampLowLimit")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("_RampLowLimit")
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$266, DW_AT_name("RampHighLimit")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("_RampHighLimit")
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$267, DW_AT_name("RampDelayCount")
	.dwattr $C$DW$267, DW_AT_TI_symbol_name("_RampDelayCount")
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$268, DW_AT_name("SetpointValue")
	.dwattr $C$DW$268, DW_AT_TI_symbol_name("_SetpointValue")
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$269, DW_AT_name("EqualFlag")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("_EqualFlag")
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$270, DW_AT_name("Tmp")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("_Tmp")
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$34

$C$DW$T$71	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$71, DW_AT_name("RMPCNTL")
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)


$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$271, DW_AT_name("Freq")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("_Freq")
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$272, DW_AT_name("StepAngleMax")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("_StepAngleMax")
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$273, DW_AT_name("Angle")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("_Angle")
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$274, DW_AT_name("Gain")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("_Gain")
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$275, DW_AT_name("Out")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("_Out")
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$276, DW_AT_name("Offset")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("_Offset")
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$35

$C$DW$T$72	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$72, DW_AT_name("RAMPGEN")
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)


$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$277, DW_AT_name("DcBusVolt")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("_DcBusVolt")
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$278, DW_AT_name("MfuncV1")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("_MfuncV1")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$279, DW_AT_name("MfuncV2")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("_MfuncV2")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$280, DW_AT_name("MfuncV3")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("_MfuncV3")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$281, DW_AT_name("OutOfPhase")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("_OutOfPhase")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$282, DW_AT_name("VphaseA")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("_VphaseA")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$283, DW_AT_name("VphaseB")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("_VphaseB")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$284, DW_AT_name("VphaseC")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("_VphaseC")
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$285, DW_AT_name("Valpha")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("_Valpha")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$286, DW_AT_name("Vbeta")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("_Vbeta")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$287, DW_AT_name("temp")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("_temp")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$36

$C$DW$T$73	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$73, DW_AT_name("PHASEVOLTAGE")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)


$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$288, DW_AT_name("ElecTheta")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("_ElecTheta")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$289, DW_AT_name("DirectionQep")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("_DirectionQep")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$290, DW_AT_name("OldElecTheta")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("_OldElecTheta")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$291, DW_AT_name("Speed")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("_Speed")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$292, DW_AT_name("BaseRpm")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("_BaseRpm")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$293, DW_AT_name("K1")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("_K1")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$294, DW_AT_name("K2")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("_K2")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$295, DW_AT_name("K3")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("_K3")
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$296, DW_AT_name("SpeedRpm")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("_SpeedRpm")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$297, DW_AT_name("Tmp")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("_Tmp")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$39

$C$DW$T$74	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$74, DW_AT_name("SPEED_MEAS_QEP")
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$298, DW_AT_name("ElecTheta")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("_ElecTheta")
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$299, DW_AT_name("MechTheta")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("_MechTheta")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$300, DW_AT_name("DirectionQep")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("_DirectionQep")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$301, DW_AT_name("QepPeriod")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("_QepPeriod")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$302, DW_AT_name("QepCountIndex")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("_QepCountIndex")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$303, DW_AT_name("RawTheta")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("_RawTheta")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$304, DW_AT_name("MechScaler")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("_MechScaler")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$305, DW_AT_name("LineEncoder")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("_LineEncoder")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$306, DW_AT_name("PolePairs")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("_PolePairs")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$307, DW_AT_name("CalibratedAngle")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("_CalibratedAngle")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$308, DW_AT_name("IndexSyncFlag")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("_IndexSyncFlag")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$41

$C$DW$T$75	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$75, DW_AT_name("QEP")
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x07)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$309, DW_AT_name("stat_reg1")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("_stat_reg1")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$310, DW_AT_name("stat_reg2")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("_stat_reg2")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$311, DW_AT_name("cntrl_reg1")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("_cntrl_reg1")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$312, DW_AT_name("cntrl_reg2")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("_cntrl_reg2")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$313, DW_AT_name("readCntrl1")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("_readCntrl1")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$314, DW_AT_name("readCntrl2")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("_readCntrl2")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$315, DW_AT_name("DRV_fault")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("_DRV_fault")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$46

$C$DW$T$76	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$76, DW_AT_name("DRV8301_Vars")
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)


$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x15)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$316, DW_AT_name("Rsvd0")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("_Rsvd0")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$317, DW_AT_name("status1_wwd")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("_status1_wwd")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$318, DW_AT_name("status2_ov_vds")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("_status2_ov_vds")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$319, DW_AT_name("status3_IC")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_status3_IC")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$320, DW_AT_name("status4_gd_Vgs")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_status4_gd_Vgs")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$321, DW_AT_name("cntrl5_hs_gd")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$322, DW_AT_name("cntrl6_ls_gd")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$323, DW_AT_name("cntrl7_gd")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_cntrl7_gd")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$324, DW_AT_name("Rsvd8")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_Rsvd8")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$325, DW_AT_name("cntrl9_IC_ops")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$326, DW_AT_name("cntrlA_shunt_amp")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$327, DW_AT_name("cntrlB_Vreg")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_cntrlB_Vreg")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$328, DW_AT_name("cntrlC_Vds_SNS")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$329, DW_AT_name("readCntrl5")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_readCntrl5")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$330, DW_AT_name("readCntrl6")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_readCntrl6")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$331, DW_AT_name("readCntrl7")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_readCntrl7")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$332, DW_AT_name("readCntrl9")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_readCntrl9")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$333, DW_AT_name("readCntrlA")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("_readCntrlA")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$334, DW_AT_name("readCntrlB")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_readCntrlB")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$335, DW_AT_name("readCntrlC")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_readCntrlC")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$336, DW_AT_name("DRV_fault")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_DRV_fault")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$58

$C$DW$T$77	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$77, DW_AT_name("DRV8305_Vars")
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)


$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x150)
$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$337, DW_AT_name("PwmARegs")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_PwmARegs")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$338, DW_AT_name("PwmBRegs")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("_PwmBRegs")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$339, DW_AT_name("PwmCRegs")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_PwmCRegs")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$340, DW_AT_name("QepRegs")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("_QepRegs")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$341, DW_AT_name("SpiRegs")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("_SpiRegs")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$342, DW_AT_name("drvScsPin")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_drvScsPin")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$343, DW_AT_name("offset_shntA")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("_offset_shntA")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$344, DW_AT_name("offset_shntB")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("_offset_shntB")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$345, DW_AT_name("offset_shntC")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("_offset_shntC")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$346, DW_AT_name("VdTesting")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("_VdTesting")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$347, DW_AT_name("VqTesting")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("_VqTesting")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$348, DW_AT_name("IdRef")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("_IdRef")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$349, DW_AT_name("IqRef")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("_IqRef")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$350, DW_AT_name("SpeedRef")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("_SpeedRef")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$351, DW_AT_name("ElecTheta")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("_ElecTheta")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$352, DW_AT_name("MechTheta")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("_MechTheta")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$353, DW_AT_name("currentAs")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_currentAs")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$354, DW_AT_name("currentBs")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("_currentBs")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$355, DW_AT_name("currentCs")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("_currentCs")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$356, DW_AT_name("alignCntr")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("_alignCntr")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$357, DW_AT_name("alignCnt")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("_alignCnt")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$358, DW_AT_name("lsw")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("_lsw")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$359, DW_AT_name("TripFlagDMC")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("_TripFlagDMC")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$360, DW_AT_name("clearTripFlagDMC")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("_clearTripFlagDMC")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$361, DW_AT_name("RunMotor")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("_RunMotor")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$362, DW_AT_name("SpeedLoopPrescaler")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("_SpeedLoopPrescaler")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$363, DW_AT_name("SpeedLoopCount")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_SpeedLoopCount")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$364, DW_AT_name("PosSenseReverse")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("_PosSenseReverse")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$365, DW_AT_name("newCmdDRV")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("_newCmdDRV")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$366, DW_AT_name("T")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_T")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$367, DW_AT_name("clarke")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("_clarke")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$368, DW_AT_name("park")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("_park")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$369, DW_AT_name("ipark")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("_ipark")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$370, DW_AT_name("pi_pos")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("_pi_pos")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$371, DW_AT_name("pid_spd")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("_pid_spd")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$372, DW_AT_name("pi_id")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("_pi_id")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$373, DW_AT_name("pi_iq")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("_pi_iq")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$374, DW_AT_name("svgen")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("_svgen")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$375, DW_AT_name("rc")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("_rc")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$376, DW_AT_name("rg")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_rg")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$377, DW_AT_name("volt")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("_volt")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$378, DW_AT_name("speed")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_speed")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$379, DW_AT_name("qep")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("_qep")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x122]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$380, DW_AT_name("drv8301")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("_drv8301")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$381, DW_AT_name("drv8305")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("_drv8305")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x13b]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$78

$C$DW$T$635	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$635, DW_AT_name("MOTOR_VARS")
	.dwattr $C$DW$T$635, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$635, DW_AT_language(DW_LANG_C)

$C$DW$T$636	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$636, DW_AT_type(*$C$DW$T$635)
	.dwattr $C$DW$T$636, DW_AT_address_class(0x20)


$C$DW$T$81	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$81, DW_AT_byte_size(0x1a)
$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$382, DW_AT_name("input_ptr1")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("_input_ptr1")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$383, DW_AT_name("input_ptr2")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("_input_ptr2")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$384, DW_AT_name("input_ptr3")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_input_ptr3")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$385, DW_AT_name("input_ptr4")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_input_ptr4")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$386, DW_AT_name("output_ptr1")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_output_ptr1")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$387, DW_AT_name("output_ptr2")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_output_ptr2")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$388, DW_AT_name("output_ptr3")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("_output_ptr3")
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$389, DW_AT_name("output_ptr4")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("_output_ptr4")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$390, DW_AT_name("prev_value")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("_prev_value")
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$391, DW_AT_name("trig_value")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("_trig_value")
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$392, DW_AT_name("status")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("_status")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$393, DW_AT_name("pre_scalar")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("_pre_scalar")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$394, DW_AT_name("skip_count")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("_skip_count")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$395, DW_AT_name("size")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("_size")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$396, DW_AT_name("count")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_count")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$81

$C$DW$T$638	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$638, DW_AT_name("DLOG_4CH_F")
	.dwattr $C$DW$T$638, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$T$638, DW_AT_language(DW_LANG_C)

$C$DW$T$639	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$639, DW_AT_type(*$C$DW$T$638)
	.dwattr $C$DW$T$639, DW_AT_address_class(0x20)


$C$DW$T$82	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$397, DW_AT_name("all")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$286)
	.dwattr $C$DW$398, DW_AT_name("bit")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$82

$C$DW$T$42	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$42, DW_AT_name("DRV8301_STATUS_REG_1")
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)


$C$DW$T$83	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$83, DW_AT_byte_size(0x01)
$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$399, DW_AT_name("all")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$287)
	.dwattr $C$DW$400, DW_AT_name("bit")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$83

$C$DW$T$43	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$43, DW_AT_name("DRV8301_STATUS_REG_2")
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)


$C$DW$T$84	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$84, DW_AT_byte_size(0x01)
$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$401, DW_AT_name("all")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$284)
	.dwattr $C$DW$402, DW_AT_name("bit")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$84

$C$DW$T$44	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$44, DW_AT_name("DRV8301_CONTROL_REG_1")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)


$C$DW$T$85	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$403, DW_AT_name("all")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$285)
	.dwattr $C$DW$404, DW_AT_name("bit")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$85

$C$DW$T$45	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$45, DW_AT_name("DRV8301_CONTROL_REG_2")
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)


$C$DW$T$86	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$86, DW_AT_byte_size(0x01)
$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$405, DW_AT_name("all")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$406, DW_AT_name("bit")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$86

$C$DW$T$47	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$47, DW_AT_name("DRV8305_WWD_REG")
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)


$C$DW$T$87	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$87, DW_AT_byte_size(0x01)
$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$407, DW_AT_name("all")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$294)
	.dwattr $C$DW$408, DW_AT_name("bit")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$87

$C$DW$T$48	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$48, DW_AT_name("DRV8305_OV_VDS_FAULTS_REG")
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)


$C$DW$T$88	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$88, DW_AT_byte_size(0x01)
$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$409, DW_AT_name("all")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$291)
	.dwattr $C$DW$410, DW_AT_name("bit")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$88

$C$DW$T$49	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$49, DW_AT_name("DRV8305_IC_FAULTS_REG")
	.dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)


$C$DW$T$89	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$89, DW_AT_byte_size(0x01)
$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$411, DW_AT_name("all")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$412, DW_AT_name("bit")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$89

$C$DW$T$50	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$50, DW_AT_name("DRV8305_GD_VGS_FAULTS_REG")
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)


$C$DW$T$90	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$90, DW_AT_byte_size(0x01)
$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$413, DW_AT_name("all")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$290)
	.dwattr $C$DW$414, DW_AT_name("bit")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$90

$C$DW$T$51	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$51, DW_AT_name("DRV8305_HS_GATE_DRIVER_CNTRL_REG")
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)


$C$DW$T$91	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$91, DW_AT_byte_size(0x01)
$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$415, DW_AT_name("all")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$293)
	.dwattr $C$DW$416, DW_AT_name("bit")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$91

$C$DW$T$52	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$52, DW_AT_name("DRV8305_LS_GATE_DRIVER_CNTRL_REG")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)


$C$DW$T$92	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$92, DW_AT_byte_size(0x01)
$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$417, DW_AT_name("all")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$288)
	.dwattr $C$DW$418, DW_AT_name("bit")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$92

$C$DW$T$53	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$53, DW_AT_name("DRV8305_GD_CNTRL_REG")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)


$C$DW$T$93	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$93, DW_AT_byte_size(0x01)
$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$419, DW_AT_name("all")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$292)
	.dwattr $C$DW$420, DW_AT_name("bit")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$93

$C$DW$T$54	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$54, DW_AT_name("DRV8305_IC_OPS_REG")
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)


$C$DW$T$94	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$94, DW_AT_byte_size(0x01)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$421, DW_AT_name("all")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$295)
	.dwattr $C$DW$422, DW_AT_name("bit")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$94

$C$DW$T$55	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$55, DW_AT_name("DRV8305_SHUNT_AMP_CNTRL_REG")
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)


$C$DW$T$95	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$95, DW_AT_byte_size(0x01)
$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$423, DW_AT_name("all")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$297)
	.dwattr $C$DW$424, DW_AT_name("bit")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$95

$C$DW$T$56	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$56, DW_AT_name("DRV8305_VREG_CNTRL_REG")
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)


$C$DW$T$96	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$425, DW_AT_name("all")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$296)
	.dwattr $C$DW$426, DW_AT_name("bit")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$96

$C$DW$T$57	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$57, DW_AT_name("DRV8305_VDS_SNS_CNTRL_REG")
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)


$C$DW$T$97	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$97, DW_AT_name("ADCBURSTCTL_BITS")
	.dwattr $C$DW$T$97, DW_AT_byte_size(0x01)
$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$427, DW_AT_name("BURSTTRIGSEL")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
	.dwattr $C$DW$427, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$427, DW_AT_bit_size(0x06)
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$428, DW_AT_name("rsvd1")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$428, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$428, DW_AT_bit_size(0x02)
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$429, DW_AT_name("BURSTSIZE")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_BURSTSIZE")
	.dwattr $C$DW$429, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$429, DW_AT_bit_size(0x04)
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$430, DW_AT_name("rsvd2")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$430, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$430, DW_AT_bit_size(0x03)
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$431, DW_AT_name("BURSTEN")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_BURSTEN")
	.dwattr $C$DW$431, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$431, DW_AT_bit_size(0x01)
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$97


$C$DW$T$98	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$98, DW_AT_name("ADCBURSTCTL_REG")
	.dwattr $C$DW$T$98, DW_AT_byte_size(0x01)
$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$432, DW_AT_name("all")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$433, DW_AT_name("bit")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$98


$C$DW$T$99	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$99, DW_AT_name("ADCCOUNTER_BITS")
	.dwattr $C$DW$T$99, DW_AT_byte_size(0x01)
$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$434, DW_AT_name("FREECOUNT")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_FREECOUNT")
	.dwattr $C$DW$434, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$434, DW_AT_bit_size(0x0c)
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$435, DW_AT_name("rsvd1")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$435, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$435, DW_AT_bit_size(0x04)
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$99


$C$DW$T$100	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$100, DW_AT_name("ADCCOUNTER_REG")
	.dwattr $C$DW$T$100, DW_AT_byte_size(0x01)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$436, DW_AT_name("all")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$437, DW_AT_name("bit")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$100


$C$DW$T$101	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$101, DW_AT_name("ADCCTL1_BITS")
	.dwattr $C$DW$T$101, DW_AT_byte_size(0x01)
$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$438, DW_AT_name("rsvd1")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$438, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$438, DW_AT_bit_size(0x02)
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$439, DW_AT_name("INTPULSEPOS")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_INTPULSEPOS")
	.dwattr $C$DW$439, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$439, DW_AT_bit_size(0x01)
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$440, DW_AT_name("rsvd2")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$440, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$440, DW_AT_bit_size(0x04)
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$441, DW_AT_name("ADCPWDNZ")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("_ADCPWDNZ")
	.dwattr $C$DW$441, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$441, DW_AT_bit_size(0x01)
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$442, DW_AT_name("ADCBSYCHN")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("_ADCBSYCHN")
	.dwattr $C$DW$442, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$442, DW_AT_bit_size(0x04)
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$443, DW_AT_name("rsvd3")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$443, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$443, DW_AT_bit_size(0x01)
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$444, DW_AT_name("ADCBSY")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_ADCBSY")
	.dwattr $C$DW$444, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$444, DW_AT_bit_size(0x01)
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$445, DW_AT_name("rsvd4")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_rsvd4")
	.dwattr $C$DW$445, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$445, DW_AT_bit_size(0x02)
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$101


$C$DW$T$102	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$102, DW_AT_name("ADCCTL1_REG")
	.dwattr $C$DW$T$102, DW_AT_byte_size(0x01)
$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$446, DW_AT_name("all")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$447, DW_AT_name("bit")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$102


$C$DW$T$103	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$103, DW_AT_name("ADCCTL2_BITS")
	.dwattr $C$DW$T$103, DW_AT_byte_size(0x01)
$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$448, DW_AT_name("PRESCALE")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_PRESCALE")
	.dwattr $C$DW$448, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$448, DW_AT_bit_size(0x04)
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$449, DW_AT_name("rsvd1")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$449, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$449, DW_AT_bit_size(0x02)
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$450, DW_AT_name("RESOLUTION")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_RESOLUTION")
	.dwattr $C$DW$450, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$450, DW_AT_bit_size(0x01)
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$451, DW_AT_name("SIGNALMODE")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_SIGNALMODE")
	.dwattr $C$DW$451, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$451, DW_AT_bit_size(0x01)
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$452, DW_AT_name("rsvd2")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$452, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$452, DW_AT_bit_size(0x05)
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$453, DW_AT_name("rsvd3")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$453, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$453, DW_AT_bit_size(0x03)
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$103


$C$DW$T$104	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$104, DW_AT_name("ADCCTL2_REG")
	.dwattr $C$DW$T$104, DW_AT_byte_size(0x01)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$454, DW_AT_name("all")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$455, DW_AT_name("bit")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$104


$C$DW$T$105	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$105, DW_AT_name("ADCEVTCLR_BITS")
	.dwattr $C$DW$T$105, DW_AT_byte_size(0x01)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$456, DW_AT_name("PPB1TRIPHI")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_PPB1TRIPHI")
	.dwattr $C$DW$456, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$456, DW_AT_bit_size(0x01)
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$457, DW_AT_name("PPB1TRIPLO")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_PPB1TRIPLO")
	.dwattr $C$DW$457, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$457, DW_AT_bit_size(0x01)
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$458, DW_AT_name("PPB1ZERO")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_PPB1ZERO")
	.dwattr $C$DW$458, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$458, DW_AT_bit_size(0x01)
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$459, DW_AT_name("rsvd1")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$459, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$459, DW_AT_bit_size(0x01)
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$460, DW_AT_name("PPB2TRIPHI")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_PPB2TRIPHI")
	.dwattr $C$DW$460, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$460, DW_AT_bit_size(0x01)
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$461, DW_AT_name("PPB2TRIPLO")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_PPB2TRIPLO")
	.dwattr $C$DW$461, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$461, DW_AT_bit_size(0x01)
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$462, DW_AT_name("PPB2ZERO")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_PPB2ZERO")
	.dwattr $C$DW$462, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$462, DW_AT_bit_size(0x01)
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$463, DW_AT_name("rsvd2")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$463, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$463, DW_AT_bit_size(0x01)
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$464, DW_AT_name("PPB3TRIPHI")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_PPB3TRIPHI")
	.dwattr $C$DW$464, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$464, DW_AT_bit_size(0x01)
