TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:56 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/config.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_SetupPinOptions")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GPIO_SetupPinOptions")

    1745 0000021e 761F!         MOVW      DP,#_AdcaRegs         ; [CPU_ARAU] 
         0000021f 0000 
    1746                      .dwpsn  file "../sources/config.c",line 323,column 2,is_stmt,isa 0
    1747 00000220 8F00          MOVL      XAR4,#39998           ; [CPU_ARAU] |323| 
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   35

         00000221 9C3E 
    1748                      .dwpsn  file "../sources/config.c",line 313,column 2,is_stmt,isa 0
    1749 00000222 1A00!         OR        @$BLOCKED(_AdcaRegs),#0x0004 ; [CPU_ALU] |313| 
         00000223 0004 
    1750 00000224 761F!         MOVW      DP,#_AdcbRegs         ; [CPU_ARAU] 
         00000225 0000 
    1751                      .dwpsn  file "../sources/config.c",line 314,column 2,is_stmt,isa 0
    1752 00000226 1A00!         OR        @$BLOCKED(_AdcbRegs),#0x0004 ; [CPU_ALU] |314| 
         00000227 0004 
    1753                      .dwpsn  file "../sources/config.c",line 323,column 2,is_stmt,isa 0
    1754 00000228 A8A9          MOVL      ACC,XAR4              ; [CPU_ALU] |323| 
    1755 00000229 761F!         MOVW      DP,#_AdccRegs         ; [CPU_ARAU] 
         0000022a 0000 
    1756                      .dwpsn  file "../sources/config.c",line 315,column 2,is_stmt,isa 0
    1757 0000022b 1A00!         OR        @$BLOCKED(_AdccRegs),#0x0004 ; [CPU_ALU] |315| 
         0000022c 0004 
    1758 0000022d 761F!         MOVW      DP,#_AdcaRegs         ; [CPU_ARAU] 
         0000022e 0000 
    1759                      .dwpsn  file "../sources/config.c",line 318,column 2,is_stmt,isa 0
    1760 0000022f 1A00!         OR        @$BLOCKED(_AdcaRegs),#0x0080 ; [CPU_ALU] |318| 
         00000230 0080 
    1761 00000231 761F!         MOVW      DP,#_AdcbRegs         ; [CPU_ARAU] 
         00000232 0000 
    1762                      .dwpsn  file "../sources/config.c",line 319,column 2,is_stmt,isa 0
    1763 00000233 1A00!         OR        @$BLOCKED(_AdcbRegs),#0x0080 ; [CPU_ALU] |319| 
         00000234 0080 
    1764 00000235 761F!         MOVW      DP,#_AdccRegs         ; [CPU_ARAU] 
         00000236 0000 
    1765                      .dwpsn  file "../sources/config.c",line 320,column 2,is_stmt,isa 0
    1766 00000237 1A00!         OR        @$BLOCKED(_AdccRegs),#0x0080 ; [CPU_ALU] |320| 
         00000238 0080 
    1767                      .dwpsn  file "../sources/config.c",line 323,column 2,is_stmt,isa 0
    1768              $C$DW$131       .dwtag  DW_TAG_TI_branch
    1769                      .dwattr $C$DW$131, DW_AT_low_pc(0x00)
    1770                      .dwattr $C$DW$131, DW_AT_name("_F28x_usDelay")
    1771                      .dwattr $C$DW$131, DW_AT_TI_call
    1772              
    1773 00000239 7640!         LCR       #_F28x_usDelay        ; [CPU_ALU] |323| 
         0000023a 0000 
    1774                      ; call occurs [#_F28x_usDelay] ; [] |323| 
    1775 0000023b 761A   EDIS
    1776 0000023c FF69          SPM       #0                    ; [CPU_ALU] 
    1777              $C$DW$132       .dwtag  DW_TAG_TI_branch
    1778                      .dwattr $C$DW$132, DW_AT_low_pc(0x00)
    1779                      .dwattr $C$DW$132, DW_AT_TI_return
    1780              
    1781 0000023d 0006          LRETR     ; [CPU_ALU] 
    1782                      ; return occurs ; [] 
    1783                      .dwattr $C$DW$127, DW_AT_TI_end_file("../sources/config.c")
    1784                      .dwattr $C$DW$127, DW_AT_TI_end_line(0x146)
    1785                      .dwattr $C$DW$127, DW_AT_TI_end_column(0x01)
    1786                      .dwendentry
    1787                      .dwendtag $C$DW$127
    1788              
    1789              ;**************************************************************
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   36

    1790              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1791              ;**************************************************************
    1792                      .global _GPIO_SetupPinOptions
    1793                      .global _GPIO_SetupPinMux
    1794                      .global _GPIO_WritePin
    1795                      .global _DisableDog
    1796                      .global _GPIO_EnableUnbondedIOPullups
    1797                      .global _InitSysPll
    1798                      .global _InitPeripheralClocks
    1799                      .global _AdcSetMode
    1800                      .global _F28x_usDelay
    1801                      .global _AnalogSubsysRegs
    1802                      .global _AdcaRegs
    1803                      .global _AdcbRegs
    1804                      .global _AdccRegs
    1805                      .global _CpuSysRegs
    1806              
    1807              ;***************************************************************
    1808              ;* TYPE INFORMATION                                            *
    1809              ;***************************************************************
    1810              
    1811              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1812                      .dwattr $C$DW$T$20, DW_AT_name("ADCBURSTCTL_BITS")
    1813                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1814              $C$DW$133       .dwtag  DW_TAG_member
    1815                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1816                      .dwattr $C$DW$133, DW_AT_name("BURSTTRIGSEL")
    1817                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
    1818                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0a)
    1819                      .dwattr $C$DW$133, DW_AT_bit_size(0x06)
    1820                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1821                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1822              
    1823              $C$DW$134       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1825                      .dwattr $C$DW$134, DW_AT_name("rsvd1")
    1826                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd1")
    1827                      .dwattr $C$DW$134, DW_AT_bit_offset(0x08)
    1828                      .dwattr $C$DW$134, DW_AT_bit_size(0x02)
    1829                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1830                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1831              
    1832              $C$DW$135       .dwtag  DW_TAG_member
    1833                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1834                      .dwattr $C$DW$135, DW_AT_name("BURSTSIZE")
    1835                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_BURSTSIZE")
    1836                      .dwattr $C$DW$135, DW_AT_bit_offset(0x04)
    1837                      .dwattr $C$DW$135, DW_AT_bit_size(0x04)
    1838                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1839                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1840              
    1841              $C$DW$136       .dwtag  DW_TAG_member
    1842                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1843                      .dwattr $C$DW$136, DW_AT_name("rsvd2")
    1844                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   37

    1845                      .dwattr $C$DW$136, DW_AT_bit_offset(0x01)
    1846                      .dwattr $C$DW$136, DW_AT_bit_size(0x03)
    1847                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1848                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1849              
    1850              $C$DW$137       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1852                      .dwattr $C$DW$137, DW_AT_name("BURSTEN")
    1853                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_BURSTEN")
    1854                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    1855                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1856                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1857                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1858              
    1859                      .dwendtag $C$DW$T$20
    1860              
    1861              
    1862              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1863                      .dwattr $C$DW$T$21, DW_AT_name("ADCBURSTCTL_REG")
    1864                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1865              $C$DW$138       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1867                      .dwattr $C$DW$138, DW_AT_name("all")
    1868                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    1869                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1870                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1871              
    1872              $C$DW$139       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1874                      .dwattr $C$DW$139, DW_AT_name("bit")
    1875                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    1876                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1877                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1878              
    1879                      .dwendtag $C$DW$T$21
    1880              
    1881              
    1882              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1883                      .dwattr $C$DW$T$22, DW_AT_name("ADCCOUNTER_BITS")
    1884                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1885              $C$DW$140       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1887                      .dwattr $C$DW$140, DW_AT_name("FREECOUNT")
    1888                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_FREECOUNT")
    1889                      .dwattr $C$DW$140, DW_AT_bit_offset(0x04)
    1890                      .dwattr $C$DW$140, DW_AT_bit_size(0x0c)
    1891                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1892                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1893              
    1894              $C$DW$141       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1896                      .dwattr $C$DW$141, DW_AT_name("rsvd1")
    1897                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd1")
    1898                      .dwattr $C$DW$141, DW_AT_bit_offset(0x00)
    1899                      .dwattr $C$DW$141, DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   38

    1900                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1901                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1902              
    1903                      .dwendtag $C$DW$T$22
    1904              
    1905              
    1906              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1907                      .dwattr $C$DW$T$23, DW_AT_name("ADCCOUNTER_REG")
    1908                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1909              $C$DW$142       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1911                      .dwattr $C$DW$142, DW_AT_name("all")
    1912                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_all")
    1913                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1914                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1915              
    1916              $C$DW$143       .dwtag  DW_TAG_member
    1917                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$22)
    1918                      .dwattr $C$DW$143, DW_AT_name("bit")
    1919                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_bit")
    1920                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1921                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1922              
    1923                      .dwendtag $C$DW$T$23
    1924              
    1925              
    1926              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1927                      .dwattr $C$DW$T$24, DW_AT_name("ADCCTL1_BITS")
    1928                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1929              $C$DW$144       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1931                      .dwattr $C$DW$144, DW_AT_name("rsvd1")
    1932                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd1")
    1933                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0e)
    1934                      .dwattr $C$DW$144, DW_AT_bit_size(0x02)
    1935                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1936                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1937              
    1938              $C$DW$145       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1940                      .dwattr $C$DW$145, DW_AT_name("INTPULSEPOS")
    1941                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_INTPULSEPOS")
    1942                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0d)
    1943                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1944                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1946              
    1947              $C$DW$146       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1949                      .dwattr $C$DW$146, DW_AT_name("rsvd2")
    1950                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd2")
    1951                      .dwattr $C$DW$146, DW_AT_bit_offset(0x09)
    1952                      .dwattr $C$DW$146, DW_AT_bit_size(0x04)
    1953                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   39

    1955              
    1956              $C$DW$147       .dwtag  DW_TAG_member
    1957                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1958                      .dwattr $C$DW$147, DW_AT_name("ADCPWDNZ")
    1959                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCPWDNZ")
    1960                      .dwattr $C$DW$147, DW_AT_bit_offset(0x08)
    1961                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1962                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1963                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1964              
    1965              $C$DW$148       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1967                      .dwattr $C$DW$148, DW_AT_name("ADCBSYCHN")
    1968                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCBSYCHN")
    1969                      .dwattr $C$DW$148, DW_AT_bit_offset(0x04)
    1970                      .dwattr $C$DW$148, DW_AT_bit_size(0x04)
    1971                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1972                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1973              
    1974              $C$DW$149       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1976                      .dwattr $C$DW$149, DW_AT_name("rsvd3")
    1977                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd3")
    1978                      .dwattr $C$DW$149, DW_AT_bit_offset(0x03)
    1979                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1980                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1981                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1982              
    1983              $C$DW$150       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1985                      .dwattr $C$DW$150, DW_AT_name("ADCBSY")
    1986                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ADCBSY")
    1987                      .dwattr $C$DW$150, DW_AT_bit_offset(0x02)
    1988                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1989                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1990                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1991              
    1992              $C$DW$151       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1994                      .dwattr $C$DW$151, DW_AT_name("rsvd4")
    1995                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd4")
    1996                      .dwattr $C$DW$151, DW_AT_bit_offset(0x00)
    1997                      .dwattr $C$DW$151, DW_AT_bit_size(0x02)
    1998                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1999                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2000              
    2001                      .dwendtag $C$DW$T$24
    2002              
    2003              
    2004              $C$DW$T$25      .dwtag  DW_TAG_union_type
    2005                      .dwattr $C$DW$T$25, DW_AT_name("ADCCTL1_REG")
    2006                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    2007              $C$DW$152       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2009                      .dwattr $C$DW$152, DW_AT_name("all")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   40

    2010                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_all")
    2011                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2012                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2013              
    2014              $C$DW$153       .dwtag  DW_TAG_member
    2015                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$24)
    2016                      .dwattr $C$DW$153, DW_AT_name("bit")
    2017                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_bit")
    2018                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2020              
    2021                      .dwendtag $C$DW$T$25
    2022              
    2023              
    2024              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2025                      .dwattr $C$DW$T$26, DW_AT_name("ADCCTL2_BITS")
    2026                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    2027              $C$DW$154       .dwtag  DW_TAG_member
    2028                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2029                      .dwattr $C$DW$154, DW_AT_name("PRESCALE")
    2030                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PRESCALE")
    2031                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0c)
    2032                      .dwattr $C$DW$154, DW_AT_bit_size(0x04)
    2033                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2034                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2035              
    2036              $C$DW$155       .dwtag  DW_TAG_member
    2037                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2038                      .dwattr $C$DW$155, DW_AT_name("rsvd1")
    2039                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd1")
    2040                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0a)
    2041                      .dwattr $C$DW$155, DW_AT_bit_size(0x02)
    2042                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2043                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2044              
    2045              $C$DW$156       .dwtag  DW_TAG_member
    2046                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2047                      .dwattr $C$DW$156, DW_AT_name("RESOLUTION")
    2048                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_RESOLUTION")
    2049                      .dwattr $C$DW$156, DW_AT_bit_offset(0x09)
    2050                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2051                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2052                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2053              
    2054              $C$DW$157       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2056                      .dwattr $C$DW$157, DW_AT_name("SIGNALMODE")
    2057                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_SIGNALMODE")
    2058                      .dwattr $C$DW$157, DW_AT_bit_offset(0x08)
    2059                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2060                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2061                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2062              
    2063              $C$DW$158       .dwtag  DW_TAG_member
    2064                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   41

    2065                      .dwattr $C$DW$158, DW_AT_name("rsvd2")
    2066                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd2")
    2067                      .dwattr $C$DW$158, DW_AT_bit_offset(0x03)
    2068                      .dwattr $C$DW$158, DW_AT_bit_size(0x05)
    2069                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2070                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2071              
    2072              $C$DW$159       .dwtag  DW_TAG_member
    2073                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2074                      .dwattr $C$DW$159, DW_AT_name("rsvd3")
    2075                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd3")
    2076                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00)
    2077                      .dwattr $C$DW$159, DW_AT_bit_size(0x03)
    2078                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2079                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2080              
    2081                      .dwendtag $C$DW$T$26
    2082              
    2083              
    2084              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2085                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL2_REG")
    2086                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2087              $C$DW$160       .dwtag  DW_TAG_member
    2088                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2089                      .dwattr $C$DW$160, DW_AT_name("all")
    2090                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_all")
    2091                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2092                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2093              
    2094              $C$DW$161       .dwtag  DW_TAG_member
    2095                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$26)
    2096                      .dwattr $C$DW$161, DW_AT_name("bit")
    2097                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_bit")
    2098                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2100              
    2101                      .dwendtag $C$DW$T$27
    2102              
    2103              
    2104              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2105                      .dwattr $C$DW$T$28, DW_AT_name("ADCEVTCLR_BITS")
    2106                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2107              $C$DW$162       .dwtag  DW_TAG_member
    2108                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2109                      .dwattr $C$DW$162, DW_AT_name("PPB1TRIPHI")
    2110                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2111                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0f)
    2112                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2113                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2114                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2115              
    2116              $C$DW$163       .dwtag  DW_TAG_member
    2117                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2118                      .dwattr $C$DW$163, DW_AT_name("PPB1TRIPLO")
    2119                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PPB1TRIPLO")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   42

    2120                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0e)
    2121                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2122                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2123                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2124              
    2125              $C$DW$164       .dwtag  DW_TAG_member
    2126                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2127                      .dwattr $C$DW$164, DW_AT_name("PPB1ZERO")
    2128                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PPB1ZERO")
    2129                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0d)
    2130                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2131                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2133              
    2134              $C$DW$165       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2136                      .dwattr $C$DW$165, DW_AT_name("rsvd1")
    2137                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd1")
    2138                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0c)
    2139                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2140                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2141                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2142              
    2143              $C$DW$166       .dwtag  DW_TAG_member
    2144                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2145                      .dwattr $C$DW$166, DW_AT_name("PPB2TRIPHI")
    2146                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2147                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0b)
    2148                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2149                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2150                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2151              
    2152              $C$DW$167       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2154                      .dwattr $C$DW$167, DW_AT_name("PPB2TRIPLO")
    2155                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2156                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0a)
    2157                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2158                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2159                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2160              
    2161              $C$DW$168       .dwtag  DW_TAG_member
    2162                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2163                      .dwattr $C$DW$168, DW_AT_name("PPB2ZERO")
    2164                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PPB2ZERO")
    2165                      .dwattr $C$DW$168, DW_AT_bit_offset(0x09)
    2166                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2167                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2168                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2169              
    2170              $C$DW$169       .dwtag  DW_TAG_member
    2171                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2172                      .dwattr $C$DW$169, DW_AT_name("rsvd2")
    2173                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd2")
    2174                      .dwattr $C$DW$169, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   43

    2175                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2176                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2177                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2178              
    2179              $C$DW$170       .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2181                      .dwattr $C$DW$170, DW_AT_name("PPB3TRIPHI")
    2182                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2183                      .dwattr $C$DW$170, DW_AT_bit_offset(0x07)
    2184                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2185                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2186                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2187              
    2188              $C$DW$171       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2190                      .dwattr $C$DW$171, DW_AT_name("PPB3TRIPLO")
    2191                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2192                      .dwattr $C$DW$171, DW_AT_bit_offset(0x06)
    2193                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2194                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2195                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2196              
    2197              $C$DW$172       .dwtag  DW_TAG_member
    2198                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2199                      .dwattr $C$DW$172, DW_AT_name("PPB3ZERO")
    2200                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PPB3ZERO")
    2201                      .dwattr $C$DW$172, DW_AT_bit_offset(0x05)
    2202                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2203                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2204                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2205              
    2206              $C$DW$173       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2208                      .dwattr $C$DW$173, DW_AT_name("rsvd3")
    2209                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd3")
    2210                      .dwattr $C$DW$173, DW_AT_bit_offset(0x04)
    2211                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2212                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2213                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2214              
    2215              $C$DW$174       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2217                      .dwattr $C$DW$174, DW_AT_name("PPB4TRIPHI")
    2218                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2219                      .dwattr $C$DW$174, DW_AT_bit_offset(0x03)
    2220                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2221                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2222                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2223              
    2224              $C$DW$175       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2226                      .dwattr $C$DW$175, DW_AT_name("PPB4TRIPLO")
    2227                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2228                      .dwattr $C$DW$175, DW_AT_bit_offset(0x02)
    2229                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   44

    2230                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2231                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2232              
    2233              $C$DW$176       .dwtag  DW_TAG_member
    2234                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2235                      .dwattr $C$DW$176, DW_AT_name("PPB4ZERO")
    2236                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PPB4ZERO")
    2237                      .dwattr $C$DW$176, DW_AT_bit_offset(0x01)
    2238                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2239                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2240                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2241              
    2242              $C$DW$177       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2244                      .dwattr $C$DW$177, DW_AT_name("rsvd4")
    2245                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd4")
    2246                      .dwattr $C$DW$177, DW_AT_bit_offset(0x00)
    2247                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2248                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2249                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2250              
    2251                      .dwendtag $C$DW$T$28
    2252              
    2253              
    2254              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2255                      .dwattr $C$DW$T$29, DW_AT_name("ADCEVTCLR_REG")
    2256                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2257              $C$DW$178       .dwtag  DW_TAG_member
    2258                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2259                      .dwattr $C$DW$178, DW_AT_name("all")
    2260                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_all")
    2261                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2262                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2263              
    2264              $C$DW$179       .dwtag  DW_TAG_member
    2265                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$28)
    2266                      .dwattr $C$DW$179, DW_AT_name("bit")
    2267                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_bit")
    2268                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2269                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2270              
    2271                      .dwendtag $C$DW$T$29
    2272              
    2273              
    2274              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2275                      .dwattr $C$DW$T$30, DW_AT_name("ADCEVTINTSEL_BITS")
    2276                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2277              $C$DW$180       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2279                      .dwattr $C$DW$180, DW_AT_name("PPB1TRIPHI")
    2280                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2281                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0f)
    2282                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2283                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2284                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   45

    2285              
    2286              $C$DW$181       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2288                      .dwattr $C$DW$181, DW_AT_name("PPB1TRIPLO")
    2289                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2290                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0e)
    2291                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2292                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2293                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2294              
    2295              $C$DW$182       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2297                      .dwattr $C$DW$182, DW_AT_name("PPB1ZERO")
    2298                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PPB1ZERO")
    2299                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0d)
    2300                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2301                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2302                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2303              
    2304              $C$DW$183       .dwtag  DW_TAG_member
    2305                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2306                      .dwattr $C$DW$183, DW_AT_name("rsvd1")
    2307                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd1")
    2308                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0c)
    2309                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2310                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2311                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2312              
    2313              $C$DW$184       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2315                      .dwattr $C$DW$184, DW_AT_name("PPB2TRIPHI")
    2316                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2317                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0b)
    2318                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2319                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2320                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2321              
    2322              $C$DW$185       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2324                      .dwattr $C$DW$185, DW_AT_name("PPB2TRIPLO")
    2325                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2326                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0a)
    2327                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2328                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2329                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2330              
    2331              $C$DW$186       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2333                      .dwattr $C$DW$186, DW_AT_name("PPB2ZERO")
    2334                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_PPB2ZERO")
    2335                      .dwattr $C$DW$186, DW_AT_bit_offset(0x09)
    2336                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2337                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2338                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2339              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   46

    2340              $C$DW$187       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2342                      .dwattr $C$DW$187, DW_AT_name("rsvd2")
    2343                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd2")
    2344                      .dwattr $C$DW$187, DW_AT_bit_offset(0x08)
    2345                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2346                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2347                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2348              
    2349              $C$DW$188       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2351                      .dwattr $C$DW$188, DW_AT_name("PPB3TRIPHI")
    2352                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2353                      .dwattr $C$DW$188, DW_AT_bit_offset(0x07)
    2354                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2355                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2356                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2357              
    2358              $C$DW$189       .dwtag  DW_TAG_member
    2359                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2360                      .dwattr $C$DW$189, DW_AT_name("PPB3TRIPLO")
    2361                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2362                      .dwattr $C$DW$189, DW_AT_bit_offset(0x06)
    2363                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2364                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2365                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2366              
    2367              $C$DW$190       .dwtag  DW_TAG_member
    2368                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2369                      .dwattr $C$DW$190, DW_AT_name("PPB3ZERO")
    2370                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PPB3ZERO")
    2371                      .dwattr $C$DW$190, DW_AT_bit_offset(0x05)
    2372                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2373                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2374                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2375              
    2376              $C$DW$191       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2378                      .dwattr $C$DW$191, DW_AT_name("rsvd3")
    2379                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_rsvd3")
    2380                      .dwattr $C$DW$191, DW_AT_bit_offset(0x04)
    2381                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2382                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2383                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2384              
    2385              $C$DW$192       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2387                      .dwattr $C$DW$192, DW_AT_name("PPB4TRIPHI")
    2388                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2389                      .dwattr $C$DW$192, DW_AT_bit_offset(0x03)
    2390                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2391                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2392                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2393              
    2394              $C$DW$193       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   47

    2395                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2396                      .dwattr $C$DW$193, DW_AT_name("PPB4TRIPLO")
    2397                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2398                      .dwattr $C$DW$193, DW_AT_bit_offset(0x02)
    2399                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2400                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2401                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2402              
    2403              $C$DW$194       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2405                      .dwattr $C$DW$194, DW_AT_name("PPB4ZERO")
    2406                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_PPB4ZERO")
    2407                      .dwattr $C$DW$194, DW_AT_bit_offset(0x01)
    2408                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2409                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2410                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2411              
    2412              $C$DW$195       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2414                      .dwattr $C$DW$195, DW_AT_name("rsvd4")
    2415                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd4")
    2416                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00)
    2417                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2418                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2419                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2420              
    2421                      .dwendtag $C$DW$T$30
    2422              
    2423              
    2424              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2425                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTINTSEL_REG")
    2426                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2427              $C$DW$196       .dwtag  DW_TAG_member
    2428                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2429                      .dwattr $C$DW$196, DW_AT_name("all")
    2430                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_all")
    2431                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2432                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2433              
    2434              $C$DW$197       .dwtag  DW_TAG_member
    2435                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$30)
    2436                      .dwattr $C$DW$197, DW_AT_name("bit")
    2437                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_bit")
    2438                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2439                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2440              
    2441                      .dwendtag $C$DW$T$31
    2442              
    2443              
    2444              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2445                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTSEL_BITS")
    2446                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2447              $C$DW$198       .dwtag  DW_TAG_member
    2448                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2449                      .dwattr $C$DW$198, DW_AT_name("PPB1TRIPHI")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   48

    2450                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2451                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0f)
    2452                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2453                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2454                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2455              
    2456              $C$DW$199       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2458                      .dwattr $C$DW$199, DW_AT_name("PPB1TRIPLO")
    2459                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2460                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0e)
    2461                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2462                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2463                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2464              
    2465              $C$DW$200       .dwtag  DW_TAG_member
    2466                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2467                      .dwattr $C$DW$200, DW_AT_name("PPB1ZERO")
    2468                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_PPB1ZERO")
    2469                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0d)
    2470                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2471                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2472                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2473              
    2474              $C$DW$201       .dwtag  DW_TAG_member
    2475                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2476                      .dwattr $C$DW$201, DW_AT_name("rsvd1")
    2477                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd1")
    2478                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0c)
    2479                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2480                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2481                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2482              
    2483              $C$DW$202       .dwtag  DW_TAG_member
    2484                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2485                      .dwattr $C$DW$202, DW_AT_name("PPB2TRIPHI")
    2486                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2487                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0b)
    2488                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2489                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2490                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2491              
    2492              $C$DW$203       .dwtag  DW_TAG_member
    2493                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2494                      .dwattr $C$DW$203, DW_AT_name("PPB2TRIPLO")
    2495                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2496                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0a)
    2497                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2498                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2499                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2500              
    2501              $C$DW$204       .dwtag  DW_TAG_member
    2502                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2503                      .dwattr $C$DW$204, DW_AT_name("PPB2ZERO")
    2504                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_PPB2ZERO")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   49

    2505                      .dwattr $C$DW$204, DW_AT_bit_offset(0x09)
    2506                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2507                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2508                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2509              
    2510              $C$DW$205       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2512                      .dwattr $C$DW$205, DW_AT_name("rsvd2")
    2513                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd2")
    2514                      .dwattr $C$DW$205, DW_AT_bit_offset(0x08)
    2515                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2516                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2517                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2518              
    2519              $C$DW$206       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2521                      .dwattr $C$DW$206, DW_AT_name("PPB3TRIPHI")
    2522                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2523                      .dwattr $C$DW$206, DW_AT_bit_offset(0x07)
    2524                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2525                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2526                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2527              
    2528              $C$DW$207       .dwtag  DW_TAG_member
    2529                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2530                      .dwattr $C$DW$207, DW_AT_name("PPB3TRIPLO")
    2531                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2532                      .dwattr $C$DW$207, DW_AT_bit_offset(0x06)
    2533                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2534                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2535                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2536              
    2537              $C$DW$208       .dwtag  DW_TAG_member
    2538                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2539                      .dwattr $C$DW$208, DW_AT_name("PPB3ZERO")
    2540                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_PPB3ZERO")
    2541                      .dwattr $C$DW$208, DW_AT_bit_offset(0x05)
    2542                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2543                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2544                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2545              
    2546              $C$DW$209       .dwtag  DW_TAG_member
    2547                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2548                      .dwattr $C$DW$209, DW_AT_name("rsvd3")
    2549                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_rsvd3")
    2550                      .dwattr $C$DW$209, DW_AT_bit_offset(0x04)
    2551                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2552                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2553                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2554              
    2555              $C$DW$210       .dwtag  DW_TAG_member
    2556                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2557                      .dwattr $C$DW$210, DW_AT_name("PPB4TRIPHI")
    2558                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2559                      .dwattr $C$DW$210, DW_AT_bit_offset(0x03)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   50

    2560                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2561                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2562                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2563              
    2564              $C$DW$211       .dwtag  DW_TAG_member
    2565                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2566                      .dwattr $C$DW$211, DW_AT_name("PPB4TRIPLO")
    2567                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2568                      .dwattr $C$DW$211, DW_AT_bit_offset(0x02)
    2569                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2570                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2571                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2572              
    2573              $C$DW$212       .dwtag  DW_TAG_member
    2574                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2575                      .dwattr $C$DW$212, DW_AT_name("PPB4ZERO")
    2576                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_PPB4ZERO")
    2577                      .dwattr $C$DW$212, DW_AT_bit_offset(0x01)
    2578                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    2579                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2580                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2581              
    2582              $C$DW$213       .dwtag  DW_TAG_member
    2583                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2584                      .dwattr $C$DW$213, DW_AT_name("rsvd4")
    2585                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_rsvd4")
    2586                      .dwattr $C$DW$213, DW_AT_bit_offset(0x00)
    2587                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2588                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2589                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2590              
    2591                      .dwendtag $C$DW$T$32
    2592              
    2593              
    2594              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2595                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTSEL_REG")
    2596                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2597              $C$DW$214       .dwtag  DW_TAG_member
    2598                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2599                      .dwattr $C$DW$214, DW_AT_name("all")
    2600                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_all")
    2601                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2602                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2603              
    2604              $C$DW$215       .dwtag  DW_TAG_member
    2605                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$32)
    2606                      .dwattr $C$DW$215, DW_AT_name("bit")
    2607                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_bit")
    2608                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2609                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2610              
    2611                      .dwendtag $C$DW$T$33
    2612              
    2613              
    2614              $C$DW$T$34      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   51

    2615                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTSTAT_BITS")
    2616                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2617              $C$DW$216       .dwtag  DW_TAG_member
    2618                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2619                      .dwattr $C$DW$216, DW_AT_name("PPB1TRIPHI")
    2620                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2621                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0f)
    2622                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    2623                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2624                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2625              
    2626              $C$DW$217       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2628                      .dwattr $C$DW$217, DW_AT_name("PPB1TRIPLO")
    2629                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2630                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0e)
    2631                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    2632                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2633                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2634              
    2635              $C$DW$218       .dwtag  DW_TAG_member
    2636                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2637                      .dwattr $C$DW$218, DW_AT_name("PPB1ZERO")
    2638                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_PPB1ZERO")
    2639                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0d)
    2640                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    2641                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2642                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2643              
    2644              $C$DW$219       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2646                      .dwattr $C$DW$219, DW_AT_name("rsvd1")
    2647                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_rsvd1")
    2648                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0c)
    2649                      .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    2650                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2651                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2652              
    2653              $C$DW$220       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2655                      .dwattr $C$DW$220, DW_AT_name("PPB2TRIPHI")
    2656                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2657                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0b)
    2658                      .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    2659                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2660                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2661              
    2662              $C$DW$221       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2664                      .dwattr $C$DW$221, DW_AT_name("PPB2TRIPLO")
    2665                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2666                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0a)
    2667                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    2668                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2669                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   52

    2670              
    2671              $C$DW$222       .dwtag  DW_TAG_member
    2672                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2673                      .dwattr $C$DW$222, DW_AT_name("PPB2ZERO")
    2674                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_PPB2ZERO")
    2675                      .dwattr $C$DW$222, DW_AT_bit_offset(0x09)
    2676                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    2677                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2678                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2679              
    2680              $C$DW$223       .dwtag  DW_TAG_member
    2681                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2682                      .dwattr $C$DW$223, DW_AT_name("rsvd2")
    2683                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd2")
    2684                      .dwattr $C$DW$223, DW_AT_bit_offset(0x08)
    2685                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    2686                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2687                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2688              
    2689              $C$DW$224       .dwtag  DW_TAG_member
    2690                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2691                      .dwattr $C$DW$224, DW_AT_name("PPB3TRIPHI")
    2692                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2693                      .dwattr $C$DW$224, DW_AT_bit_offset(0x07)
    2694                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    2695                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2696                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2697              
    2698              $C$DW$225       .dwtag  DW_TAG_member
    2699                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2700                      .dwattr $C$DW$225, DW_AT_name("PPB3TRIPLO")
    2701                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2702                      .dwattr $C$DW$225, DW_AT_bit_offset(0x06)
    2703                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    2704                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2705                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2706              
    2707              $C$DW$226       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2709                      .dwattr $C$DW$226, DW_AT_name("PPB3ZERO")
    2710                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_PPB3ZERO")
    2711                      .dwattr $C$DW$226, DW_AT_bit_offset(0x05)
    2712                      .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    2713                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2714                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2715              
    2716              $C$DW$227       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    2718                      .dwattr $C$DW$227, DW_AT_name("rsvd3")
    2719                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_rsvd3")
    2720                      .dwattr $C$DW$227, DW_AT_bit_offset(0x04)
    2721                      .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    2722                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2723                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2724              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   53

    2725              $C$DW$228       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2727                      .dwattr $C$DW$228, DW_AT_name("PPB4TRIPHI")
    2728                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2729                      .dwattr $C$DW$228, DW_AT_bit_offset(0x03)
    2730                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    2731                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2732                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2733              
    2734              $C$DW$229       .dwtag  DW_TAG_member
    2735                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2736                      .dwattr $C$DW$229, DW_AT_name("PPB4TRIPLO")
    2737                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2738                      .dwattr $C$DW$229, DW_AT_bit_offset(0x02)
    2739                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    2740                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2741                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2742              
    2743              $C$DW$230       .dwtag  DW_TAG_member
    2744                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    2745                      .dwattr $C$DW$230, DW_AT_name("PPB4ZERO")
    2746                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_PPB4ZERO")
    2747                      .dwattr $C$DW$230, DW_AT_bit_offset(0x01)
    2748                      .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    2749                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2750                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2751              
    2752              $C$DW$231       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2754                      .dwattr $C$DW$231, DW_AT_name("rsvd4")
    2755                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_rsvd4")
    2756                      .dwattr $C$DW$231, DW_AT_bit_offset(0x00)
    2757                      .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    2758                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2759                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2760              
    2761                      .dwendtag $C$DW$T$34
    2762              
    2763              
    2764              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2765                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSTAT_REG")
    2766                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2767              $C$DW$232       .dwtag  DW_TAG_member
    2768                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    2769                      .dwattr $C$DW$232, DW_AT_name("all")
    2770                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_all")
    2771                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2772                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2773              
    2774              $C$DW$233       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$34)
    2776                      .dwattr $C$DW$233, DW_AT_name("bit")
    2777                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_bit")
    2778                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2779                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   54

    2780              
    2781                      .dwendtag $C$DW$T$35
    2782              
    2783              
    2784              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2785                      .dwattr $C$DW$T$36, DW_AT_name("ADCINTFLGCLR_BITS")
    2786                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2787              $C$DW$234       .dwtag  DW_TAG_member
    2788                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    2789                      .dwattr $C$DW$234, DW_AT_name("ADCINT1")
    2790                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_ADCINT1")
    2791                      .dwattr $C$DW$234, DW_AT_bit_offset(0x0f)
    2792                      .dwattr $C$DW$234, DW_AT_bit_size(0x01)
    2793                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2794                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2795              
    2796              $C$DW$235       .dwtag  DW_TAG_member
    2797                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    2798                      .dwattr $C$DW$235, DW_AT_name("ADCINT2")
    2799                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_ADCINT2")
    2800                      .dwattr $C$DW$235, DW_AT_bit_offset(0x0e)
    2801                      .dwattr $C$DW$235, DW_AT_bit_size(0x01)
    2802                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2803                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2804              
    2805              $C$DW$236       .dwtag  DW_TAG_member
    2806                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    2807                      .dwattr $C$DW$236, DW_AT_name("ADCINT3")
    2808                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_ADCINT3")
    2809                      .dwattr $C$DW$236, DW_AT_bit_offset(0x0d)
    2810                      .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    2811                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2812                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2813              
    2814              $C$DW$237       .dwtag  DW_TAG_member
    2815                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    2816                      .dwattr $C$DW$237, DW_AT_name("ADCINT4")
    2817                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_ADCINT4")
    2818                      .dwattr $C$DW$237, DW_AT_bit_offset(0x0c)
    2819                      .dwattr $C$DW$237, DW_AT_bit_size(0x01)
    2820                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2821                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2822              
    2823              $C$DW$238       .dwtag  DW_TAG_member
    2824                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    2825                      .dwattr $C$DW$238, DW_AT_name("rsvd1")
    2826                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_rsvd1")
    2827                      .dwattr $C$DW$238, DW_AT_bit_offset(0x00)
    2828                      .dwattr $C$DW$238, DW_AT_bit_size(0x0c)
    2829                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2830                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2831              
    2832                      .dwendtag $C$DW$T$36
    2833              
    2834              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   55

    2835              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2836                      .dwattr $C$DW$T$37, DW_AT_name("ADCINTFLGCLR_REG")
    2837                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2838              $C$DW$239       .dwtag  DW_TAG_member
    2839                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    2840                      .dwattr $C$DW$239, DW_AT_name("all")
    2841                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_all")
    2842                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2843                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2844              
    2845              $C$DW$240       .dwtag  DW_TAG_member
    2846                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$36)
    2847                      .dwattr $C$DW$240, DW_AT_name("bit")
    2848                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_bit")
    2849                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2850                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2851              
    2852                      .dwendtag $C$DW$T$37
    2853              
    2854              
    2855              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2856                      .dwattr $C$DW$T$38, DW_AT_name("ADCINTFLG_BITS")
    2857                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2858              $C$DW$241       .dwtag  DW_TAG_member
    2859                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    2860                      .dwattr $C$DW$241, DW_AT_name("ADCINT1")
    2861                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_ADCINT1")
    2862                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0f)
    2863                      .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    2864                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2865                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2866              
    2867              $C$DW$242       .dwtag  DW_TAG_member
    2868                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    2869                      .dwattr $C$DW$242, DW_AT_name("ADCINT2")
    2870                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_ADCINT2")
    2871                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0e)
    2872                      .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    2873                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2874                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2875              
    2876              $C$DW$243       .dwtag  DW_TAG_member
    2877                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2878                      .dwattr $C$DW$243, DW_AT_name("ADCINT3")
    2879                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_ADCINT3")
    2880                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0d)
    2881                      .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    2882                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2883                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2884              
    2885              $C$DW$244       .dwtag  DW_TAG_member
    2886                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2887                      .dwattr $C$DW$244, DW_AT_name("ADCINT4")
    2888                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_ADCINT4")
    2889                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   56

    2890                      .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    2891                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2892                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2893              
    2894              $C$DW$245       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2896                      .dwattr $C$DW$245, DW_AT_name("rsvd1")
    2897                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_rsvd1")
    2898                      .dwattr $C$DW$245, DW_AT_bit_offset(0x00)
    2899                      .dwattr $C$DW$245, DW_AT_bit_size(0x0c)
    2900                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2901                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2902              
    2903                      .dwendtag $C$DW$T$38
    2904              
    2905              
    2906              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2907                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLG_REG")
    2908                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2909              $C$DW$246       .dwtag  DW_TAG_member
    2910                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    2911                      .dwattr $C$DW$246, DW_AT_name("all")
    2912                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_all")
    2913                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2914                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2915              
    2916              $C$DW$247       .dwtag  DW_TAG_member
    2917                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$38)
    2918                      .dwattr $C$DW$247, DW_AT_name("bit")
    2919                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_bit")
    2920                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2921                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2922              
    2923                      .dwendtag $C$DW$T$39
    2924              
    2925              
    2926              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2927                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTOVFCLR_BITS")
    2928                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2929              $C$DW$248       .dwtag  DW_TAG_member
    2930                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    2931                      .dwattr $C$DW$248, DW_AT_name("ADCINT1")
    2932                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_ADCINT1")
    2933                      .dwattr $C$DW$248, DW_AT_bit_offset(0x0f)
    2934                      .dwattr $C$DW$248, DW_AT_bit_size(0x01)
    2935                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2936                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2937              
    2938              $C$DW$249       .dwtag  DW_TAG_member
    2939                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    2940                      .dwattr $C$DW$249, DW_AT_name("ADCINT2")
    2941                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_ADCINT2")
    2942                      .dwattr $C$DW$249, DW_AT_bit_offset(0x0e)
    2943                      .dwattr $C$DW$249, DW_AT_bit_size(0x01)
    2944                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   57

    2945                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2946              
    2947              $C$DW$250       .dwtag  DW_TAG_member
    2948                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    2949                      .dwattr $C$DW$250, DW_AT_name("ADCINT3")
    2950                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_ADCINT3")
    2951                      .dwattr $C$DW$250, DW_AT_bit_offset(0x0d)
    2952                      .dwattr $C$DW$250, DW_AT_bit_size(0x01)
    2953                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2954                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2955              
    2956              $C$DW$251       .dwtag  DW_TAG_member
    2957                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    2958                      .dwattr $C$DW$251, DW_AT_name("ADCINT4")
    2959                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_ADCINT4")
    2960                      .dwattr $C$DW$251, DW_AT_bit_offset(0x0c)
    2961                      .dwattr $C$DW$251, DW_AT_bit_size(0x01)
    2962                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2963                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2964              
    2965              $C$DW$252       .dwtag  DW_TAG_member
    2966                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    2967                      .dwattr $C$DW$252, DW_AT_name("rsvd1")
    2968                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_rsvd1")
    2969                      .dwattr $C$DW$252, DW_AT_bit_offset(0x00)
    2970                      .dwattr $C$DW$252, DW_AT_bit_size(0x0c)
    2971                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2972                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2973              
    2974                      .dwendtag $C$DW$T$40
    2975              
    2976              
    2977              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2978                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTOVFCLR_REG")
    2979                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2980              $C$DW$253       .dwtag  DW_TAG_member
    2981                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    2982                      .dwattr $C$DW$253, DW_AT_name("all")
    2983                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_all")
    2984                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2985                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2986              
    2987              $C$DW$254       .dwtag  DW_TAG_member
    2988                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$40)
    2989                      .dwattr $C$DW$254, DW_AT_name("bit")
    2990                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_bit")
    2991                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2992                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2993              
    2994                      .dwendtag $C$DW$T$41
    2995              
    2996              
    2997              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2998                      .dwattr $C$DW$T$42, DW_AT_name("ADCINTOVF_BITS")
    2999                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   58

    3000              $C$DW$255       .dwtag  DW_TAG_member
    3001                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    3002                      .dwattr $C$DW$255, DW_AT_name("ADCINT1")
    3003                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_ADCINT1")
    3004                      .dwattr $C$DW$255, DW_AT_bit_offset(0x0f)
    3005                      .dwattr $C$DW$255, DW_AT_bit_size(0x01)
    3006                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3007                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3008              
    3009              $C$DW$256       .dwtag  DW_TAG_member
    3010                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    3011                      .dwattr $C$DW$256, DW_AT_name("ADCINT2")
    3012                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_ADCINT2")
    3013                      .dwattr $C$DW$256, DW_AT_bit_offset(0x0e)
    3014                      .dwattr $C$DW$256, DW_AT_bit_size(0x01)
    3015                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3016                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3017              
    3018              $C$DW$257       .dwtag  DW_TAG_member
    3019                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    3020                      .dwattr $C$DW$257, DW_AT_name("ADCINT3")
    3021                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_ADCINT3")
    3022                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0d)
    3023                      .dwattr $C$DW$257, DW_AT_bit_size(0x01)
    3024                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3025                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3026              
    3027              $C$DW$258       .dwtag  DW_TAG_member
    3028                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    3029                      .dwattr $C$DW$258, DW_AT_name("ADCINT4")
    3030                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_ADCINT4")
    3031                      .dwattr $C$DW$258, DW_AT_bit_offset(0x0c)
    3032                      .dwattr $C$DW$258, DW_AT_bit_size(0x01)
    3033                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3034                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3035              
    3036              $C$DW$259       .dwtag  DW_TAG_member
    3037                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    3038                      .dwattr $C$DW$259, DW_AT_name("rsvd1")
    3039                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_rsvd1")
    3040                      .dwattr $C$DW$259, DW_AT_bit_offset(0x00)
    3041                      .dwattr $C$DW$259, DW_AT_bit_size(0x0c)
    3042                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3043                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3044              
    3045                      .dwendtag $C$DW$T$42
    3046              
    3047              
    3048              $C$DW$T$43      .dwtag  DW_TAG_union_type
    3049                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTOVF_REG")
    3050                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    3051              $C$DW$260       .dwtag  DW_TAG_member
    3052                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    3053                      .dwattr $C$DW$260, DW_AT_name("all")
    3054                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   59

    3055                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3056                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3057              
    3058              $C$DW$261       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$42)
    3060                      .dwattr $C$DW$261, DW_AT_name("bit")
    3061                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_bit")
    3062                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3063                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3064              
    3065                      .dwendtag $C$DW$T$43
    3066              
    3067              
    3068              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3069                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTSEL1N2_BITS")
    3070                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    3071              $C$DW$262       .dwtag  DW_TAG_member
    3072                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    3073                      .dwattr $C$DW$262, DW_AT_name("INT1SEL")
    3074                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_INT1SEL")
    3075                      .dwattr $C$DW$262, DW_AT_bit_offset(0x0c)
    3076                      .dwattr $C$DW$262, DW_AT_bit_size(0x04)
    3077                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3078                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3079              
    3080              $C$DW$263       .dwtag  DW_TAG_member
    3081                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    3082                      .dwattr $C$DW$263, DW_AT_name("rsvd1")
    3083                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_rsvd1")
    3084                      .dwattr $C$DW$263, DW_AT_bit_offset(0x0b)
    3085                      .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    3086                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3087                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3088              
    3089              $C$DW$264       .dwtag  DW_TAG_member
    3090                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    3091                      .dwattr $C$DW$264, DW_AT_name("INT1E")
    3092                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_INT1E")
    3093                      .dwattr $C$DW$264, DW_AT_bit_offset(0x0a)
    3094                      .dwattr $C$DW$264, DW_AT_bit_size(0x01)
    3095                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3096                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3097              
    3098              $C$DW$265       .dwtag  DW_TAG_member
    3099                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    3100                      .dwattr $C$DW$265, DW_AT_name("INT1CONT")
    3101                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_INT1CONT")
