TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:51 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/DLOG_4CH_F.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              ;       C:\ti\ccs1011\ccs\tools\compiler\ti-cgt-c2000_20.2.1.LTS\bin\opt2000.exe C:\\Users\\admin\\AppData\\L

Copyright (c) 1996-2018 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    6

     270                      .dwpsn  file "../sources/DLOG_4CH_F.c",line 63,column 4,is_stmt,isa 0
     271 00000062 9294          MOV       AL,*+XAR4[AR0]        ; [CPU_ALU] |63| 
     272 00000063 D017          MOVB      XAR0,#23              ; [CPU_ALU] |63| 
     273 00000064 9C01          ADDB      AL,#1                 ; [CPU_ALU] |63| 
     274 00000065 5494          CMP       AL,*+XAR4[AR0]        ; [CPU_ALU] |63| 
     275 00000066 56B0          MOVB      XAR0,#24,NEQ          ; [CPU_ALU] 
         00000067 18A0 
     276 00000068 562A          MOV       *+XAR4[AR0],AL,NEQ    ; [CPU_ALU] 
         00000069 0094 
     277 0000006a 601E          B         $C$L3,NEQ             ; [CPU_ALU] 
     278                      ; branchcc occurs ; [] 
     279                      .dwpsn  file "../sources/DLOG_4CH_F.c",line 65,column 5,is_stmt,isa 0
     280 0000006b D118          MOVB      XAR1,#24              ; [CPU_ALU] |65| 
     281                      .dwpsn  file "../sources/DLOG_4CH_F.c",line 66,column 5,is_stmt,isa 0
     282 0000006c D014          MOVB      XAR0,#20              ; [CPU_ALU] |66| 
     283                      .dwpsn  file "../sources/DLOG_4CH_F.c",line 65,column 5,is_stmt,isa 0
     284 0000006d 2B9C          MOV       *+XAR4[AR1],#0        ; [CPU_ALU] |65| 
     285                      .dwpsn  file "../sources/DLOG_4CH_F.c",line 66,column 5,is_stmt,isa 0
     286 0000006e 56BF          MOVB      *+XAR4[AR0],#1,UNC    ; [CPU_ALU] |66| 
         0000006f 0194 
     287 00000070 6F18          B         $C$L3,UNC             ; [CPU_ALU] |66| 
     288                      ; branch occurs ; [] |66| 
     289 00000071       $C$L1:    
     290 00000071 D016          MOVB      XAR0,#22              ; [CPU_ALU] 
     291 00000072 9694          MOV       *+XAR4[AR0],AL        ; [CPU_ALU] 
     292 00000073 6F15          B         $C$L3,UNC             ; [CPU_ALU] 
     293                      ; branch occurs ; [] 
     294 00000074       $C$L2:    
     295                      .dwpsn  file "../sources/DLOG_4CH_F.c",line 47,column 3,is_stmt,isa 0
     296 00000074 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_ALU] |47| 
     297 00000075 D012          MOVB      XAR0,#18              ; [CPU_ALU] |47| 
     298 00000076 E2AF          MOV32     R0H,*+XAR4[AR0]       ; [CPU_FPU] |47| 
         00000077 0094 
     299 00000078 E2AF          MOV32     R1H,*+XAR5[0]         ; [CPU_FPU] |47| 
         00000079 01C5 
     300 0000007a E694          CMPF32    R1H,R0H               ; [CPU_FPU] |47| 
         0000007b 0001 
     301 0000007c AD14          MOVST0    ZF, NF                ; [CPU_FPU] |47| 
     302 0000007d 650B          B         $C$L3,LEQ             ; [CPU_ALU] |47| 
     303                      ; branchcc occurs ; [] |47| 
     304 0000007e D010          MOVB      XAR0,#16              ; [CPU_ALU] |47| 
     305 0000007f E2AF          MOV32     R1H,*+XAR4[AR0]       ; [CPU_FPU] |47| 
         00000080 0194 
     306 00000081 E694          CMPF32    R1H,R0H               ; [CPU_FPU] |47| 
         00000082 0001 
     307 00000083 AD14          MOVST0    ZF, NF                ; [CPU_FPU] |47| 
     308                      .dwpsn  file "../sources/DLOG_4CH_F.c",line 50,column 4,is_stmt,isa 0
     309 00000084 56B4          MOVB      XAR0,#20,LT           ; [CPU_ALU] |50| 
         00000085 14A0 
     310 00000086 56B4          MOVB      *+XAR4[AR0],#2,LT     ; [CPU_ALU] |50| 
         00000087 0294 
     311 00000088       $C$L3:    
     312                      .dwpsn  file "../sources/DLOG_4CH_F.c",line 71,column 2,is_stmt,isa 0
     313 00000088 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_ALU] |71| 
     314 00000089 D010          MOVB      XAR0,#16              ; [CPU_ALU] |71| 
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    7

     315 0000008a 06C5          MOVL      ACC,*+XAR5[0]         ; [CPU_ALU] |71| 
     316 0000008b FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
     317                      .dwcfi  cfa_offset, -4
     318 0000008c 1E94          MOVL      *+XAR4[AR0],ACC       ; [CPU_ALU] |71| 
     319 0000008d 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     320                      .dwcfi  cfa_offset, -2
     321                      .dwcfi  restore_reg, 7
     322              $C$DW$8 .dwtag  DW_TAG_TI_branch
     323                      .dwattr $C$DW$8, DW_AT_low_pc(0x00)
     324                      .dwattr $C$DW$8, DW_AT_TI_return
     325              
     326 0000008e 0006          LRETR     ; [CPU_ALU] 
     327                      ; return occurs ; [] 
     328                      .dwattr $C$DW$5, DW_AT_TI_end_file("../sources/DLOG_4CH_F.c")
     329                      .dwattr $C$DW$5, DW_AT_TI_end_line(0x48)
     330                      .dwattr $C$DW$5, DW_AT_TI_end_column(0x01)
     331                      .dwendentry
     332                      .dwendtag $C$DW$5
     333              
     334              
     335              ;***************************************************************
     336              ;* TYPE INFORMATION                                            *
     337              ;***************************************************************
     338              
     339              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     340                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x1a)
     341              $C$DW$9 .dwtag  DW_TAG_member
     342                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$20)
     343                      .dwattr $C$DW$9, DW_AT_name("input_ptr1")
     344                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_input_ptr1")
     345                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     346                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     347              
     348              $C$DW$10        .dwtag  DW_TAG_member
     349                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$20)
     350                      .dwattr $C$DW$10, DW_AT_name("input_ptr2")
     351                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_input_ptr2")
     352                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     353                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     354              
     355              $C$DW$11        .dwtag  DW_TAG_member
     356                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$20)
     357                      .dwattr $C$DW$11, DW_AT_name("input_ptr3")
     358                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_input_ptr3")
     359                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     360                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     361              
     362              $C$DW$12        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$20)
     364                      .dwattr $C$DW$12, DW_AT_name("input_ptr4")
     365                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_input_ptr4")
     366                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     367                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     368              
     369              $C$DW$13        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    8

     370                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$20)
     371                      .dwattr $C$DW$13, DW_AT_name("output_ptr1")
     372                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_output_ptr1")
     373                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     374                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     375              
     376              $C$DW$14        .dwtag  DW_TAG_member
     377                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
     378                      .dwattr $C$DW$14, DW_AT_name("output_ptr2")
     379                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_output_ptr2")
     380                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     381                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     382              
     383              $C$DW$15        .dwtag  DW_TAG_member
     384                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
     385                      .dwattr $C$DW$15, DW_AT_name("output_ptr3")
     386                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_output_ptr3")
     387                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     388                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     389              
     390              $C$DW$16        .dwtag  DW_TAG_member
     391                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
     392                      .dwattr $C$DW$16, DW_AT_name("output_ptr4")
     393                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_output_ptr4")
     394                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     395                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     396              
     397              $C$DW$17        .dwtag  DW_TAG_member
     398                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     399                      .dwattr $C$DW$17, DW_AT_name("prev_value")
     400                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_prev_value")
     401                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     402                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     403              
     404              $C$DW$18        .dwtag  DW_TAG_member
     405                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     406                      .dwattr $C$DW$18, DW_AT_name("trig_value")
     407                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_trig_value")
     408                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     409                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     410              
     411              $C$DW$19        .dwtag  DW_TAG_member
     412                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$21)
     413                      .dwattr $C$DW$19, DW_AT_name("status")
     414                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_status")
     415                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     416                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     417              
     418              $C$DW$20        .dwtag  DW_TAG_member
     419                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$21)
     420                      .dwattr $C$DW$20, DW_AT_name("pre_scalar")
     421                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_pre_scalar")
     422                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     423                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     424              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    9

     425              $C$DW$21        .dwtag  DW_TAG_member
     426                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$21)
     427                      .dwattr $C$DW$21, DW_AT_name("skip_count")
     428                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_skip_count")
     429                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     430                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     431              
     432              $C$DW$22        .dwtag  DW_TAG_member
     433                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$21)
     434                      .dwattr $C$DW$22, DW_AT_name("size")
     435                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_size")
     436                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     437                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     438              
     439              $C$DW$23        .dwtag  DW_TAG_member
     440                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$21)
     441                      .dwattr $C$DW$23, DW_AT_name("count")
     442                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_count")
     443                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     444                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     445              
     446                      .dwendtag $C$DW$T$22
     447              
     448              $C$DW$T$23      .dwtag  DW_TAG_typedef
     449                      .dwattr $C$DW$T$23, DW_AT_name("DLOG_4CH_F")
     450                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     451                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     452              
     453              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     454                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     455                      .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
     456              
     457              $C$DW$24        .dwtag  DW_TAG_TI_far_type
     458                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$24)
     459              
     460              $C$DW$T$25      .dwtag  DW_TAG_const_type
     461                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$24)
     462              
     463              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     464                      .dwattr $C$DW$T$2, DW_AT_name("void")
     465              
     466              $C$DW$T$4       .dwtag  DW_TAG_base_type
     467                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     468                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     469                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     470              
     471              $C$DW$T$5       .dwtag  DW_TAG_base_type
     472                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     473                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     474                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     475              
     476              $C$DW$T$6       .dwtag  DW_TAG_base_type
     477                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     478                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     479                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE   10

     480              
     481              $C$DW$T$7       .dwtag  DW_TAG_base_type
     482                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     483                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     484                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     485              
     486              $C$DW$T$8       .dwtag  DW_TAG_base_type
     487                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     488                      .dwattr $C$DW$T$8, DW_AT_name("short")
     489                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     490              
     491              $C$DW$T$9       .dwtag  DW_TAG_base_type
     492                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     493                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     494                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     495              
     496              $C$DW$T$10      .dwtag  DW_TAG_base_type
     497                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     498                      .dwattr $C$DW$T$10, DW_AT_name("int")
     499                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     500              
     501              $C$DW$T$21      .dwtag  DW_TAG_typedef
     502                      .dwattr $C$DW$T$21, DW_AT_name("int16")
     503                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$10)
     504                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     505              
