TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:52 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/DmcProtection.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    1545                      .dwpsn  file "../sources/DmcProtection.c",line 234,column 5,is_stmt,isa 0
    1546 000002d7 CCC5          AND       AL,*+XAR5[0],#0xfffc  ; [CPU_FPU] |234| 
         000002d8 FFFC 
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   33

    1547 000002d9 5001          ORB       AL,#0x01              ; [CPU_ALU] |234| 
    1548 000002da 96C5          MOV       *+XAR5[0],AL          ; [CPU_FPU] |234| 
    1549                      .dwpsn  file "../sources/DmcProtection.c",line 237,column 5,is_stmt,isa 0
    1550 000002db 1AC4          OR        *+XAR4[0],#0x0400     ; [CPU_ALU] |237| 
         000002dc 0400 
    1551                      .dwpsn  file "../sources/DmcProtection.c",line 238,column 5,is_stmt,isa 0
    1552 000002dd 1A20!         OR        @$BLOCKED(_EPwmXbarRegs)+32,#0x0010 ; [CPU_ALU] |238| 
         000002de 0010 
    1553                      .dwpsn  file "../sources/DmcProtection.c",line 239,column 5,is_stmt,isa 0
    1554 000002df 1A20!         OR        @$BLOCKED(_EPwmXbarRegs)+32,#0x0001 ; [CPU_ALU] |239| 
         000002e0 0001 
    1555 000002e1 761A   EDIS
    1556 000002e2 761F!         MOVW      DP,#_motor1           ; [CPU_ARAU] 
         000002e3 0000 
    1557 000002e4 FF69          SPM       #0                    ; [CPU_ALU] 
    1558                      .dwpsn  file "../sources/DmcProtection.c",line 242,column 5,is_stmt,isa 0
    1559 000002e5 9A03          MOVB      AL,#3                 ; [CPU_ALU] |242| 
    1560 000002e6 8A00!         MOVL      XAR4,@$BLOCKED(_motor1) ; [CPU_ALU] |242| 
    1561              $C$DW$68        .dwtag  DW_TAG_TI_branch
    1562                      .dwattr $C$DW$68, DW_AT_low_pc(0x00)
    1563                      .dwattr $C$DW$68, DW_AT_name("_PwmTripConfig")
    1564                      .dwattr $C$DW$68, DW_AT_TI_call
    1565              
    1566 000002e7 7640'         LCR       #_PwmTripConfig       ; [CPU_ALU] |242| 
         000002e8 007E 
    1567                      ; call occurs [#_PwmTripConfig] ; [] |242| 
    1568                      .dwpsn  file "../sources/DmcProtection.c",line 243,column 5,is_stmt,isa 0
    1569 000002e9 9A03          MOVB      AL,#3                 ; [CPU_ALU] |243| 
    1570 000002ea 8A02!         MOVL      XAR4,@$BLOCKED(_motor1)+2 ; [CPU_ALU] |243| 
    1571              $C$DW$69        .dwtag  DW_TAG_TI_branch
    1572                      .dwattr $C$DW$69, DW_AT_low_pc(0x00)
    1573                      .dwattr $C$DW$69, DW_AT_name("_PwmTripConfig")
    1574                      .dwattr $C$DW$69, DW_AT_TI_call
    1575              
    1576 000002eb 7640'         LCR       #_PwmTripConfig       ; [CPU_ALU] |243| 
         000002ec 007E 
    1577                      ; call occurs [#_PwmTripConfig] ; [] |243| 
    1578                      .dwpsn  file "../sources/DmcProtection.c",line 244,column 5,is_stmt,isa 0
    1579 000002ed 9A03          MOVB      AL,#3                 ; [CPU_ALU] |244| 
    1580 000002ee 8A04!         MOVL      XAR4,@$BLOCKED(_motor1)+4 ; [CPU_ALU] |244| 
    1581              $C$DW$70        .dwtag  DW_TAG_TI_branch
    1582                      .dwattr $C$DW$70, DW_AT_low_pc(0x00)
    1583                      .dwattr $C$DW$70, DW_AT_name("_PwmTripConfig")
    1584                      .dwattr $C$DW$70, DW_AT_TI_call
    1585              
    1586 000002ef 7640'         LCR       #_PwmTripConfig       ; [CPU_ALU] |244| 
         000002f0 007E 
    1587                      ; call occurs [#_PwmTripConfig] ; [] |244| 
    1588 000002f1 E2AF          MOV32     R4H,*--SP             ; [CPU_FPU] 
         000002f2 04BE 
    1589                      .dwcfi  cfa_offset, -2
    1590                      .dwcfi  restore_reg, 59
    1591              $C$DW$71        .dwtag  DW_TAG_TI_branch
    1592                      .dwattr $C$DW$71, DW_AT_low_pc(0x00)
    1593                      .dwattr $C$DW$71, DW_AT_TI_return
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   34

    1594              
    1595 000002f3 0006          LRETR     ; [CPU_ALU] 
    1596                      ; return occurs ; [] 
    1597                      .dwattr $C$DW$64, DW_AT_TI_end_file("../sources/DmcProtection.c")
    1598                      .dwattr $C$DW$64, DW_AT_TI_end_line(0xf7)
    1599                      .dwattr $C$DW$64, DW_AT_TI_end_column(0x01)
    1600                      .dwendentry
    1601                      .dwendtag $C$DW$64
    1602              
    1603              ;**************************************************************
    1604              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1605              ;**************************************************************
    1606                      .global _GPIO_WritePin
    1607                      .global _F28x_usDelay
    1608                      .global _EPwmXbarRegs
    1609                      .global _motor1
    1610                      .global _motor2
    1611              
    1612              ;***************************************************************
    1613              ;* TYPE INFORMATION                                            *
    1614              ;***************************************************************
    1615              
    1616              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1617                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
    1618              $C$DW$72        .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1620                      .dwattr $C$DW$72, DW_AT_name("As")
    1621                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_As")
    1622                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1623                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1624              
    1625              $C$DW$73        .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1627                      .dwattr $C$DW$73, DW_AT_name("Bs")
    1628                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_Bs")
    1629                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1630                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1631              
    1632              $C$DW$74        .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1634                      .dwattr $C$DW$74, DW_AT_name("Cs")
    1635                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_Cs")
    1636                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1637                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1638              
    1639              $C$DW$75        .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1641                      .dwattr $C$DW$75, DW_AT_name("Alpha")
    1642                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_Alpha")
    1643                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1644                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1645              
    1646              $C$DW$76        .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1648                      .dwattr $C$DW$76, DW_AT_name("Beta")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   35

    1649                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Beta")
    1650                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1651                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1652              
    1653                      .dwendtag $C$DW$T$20
    1654              
    1655              $C$DW$T$77      .dwtag  DW_TAG_typedef
    1656                      .dwattr $C$DW$T$77, DW_AT_name("CLARKE")
    1657                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$20)
    1658                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1659              
    1660              
    1661              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1662                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
    1663              $C$DW$77        .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1665                      .dwattr $C$DW$77, DW_AT_name("Alpha")
    1666                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Alpha")
    1667                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1668                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1669              
    1670              $C$DW$78        .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1672                      .dwattr $C$DW$78, DW_AT_name("Beta")
    1673                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Beta")
    1674                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1675                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1676              
    1677              $C$DW$79        .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1679                      .dwattr $C$DW$79, DW_AT_name("Angle")
    1680                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_Angle")
    1681                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1682                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1683              
    1684              $C$DW$80        .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1686                      .dwattr $C$DW$80, DW_AT_name("Ds")
    1687                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_Ds")
    1688                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1689                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1690              
    1691              $C$DW$81        .dwtag  DW_TAG_member
    1692                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1693                      .dwattr $C$DW$81, DW_AT_name("Qs")
    1694                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_Qs")
    1695                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1696                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1697              
    1698              $C$DW$82        .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1700                      .dwattr $C$DW$82, DW_AT_name("Sine")
    1701                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Sine")
    1702                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1703                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   36

    1704              
    1705              $C$DW$83        .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1707                      .dwattr $C$DW$83, DW_AT_name("Cosine")
    1708                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Cosine")
    1709                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1710                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1711              
    1712                      .dwendtag $C$DW$T$21
    1713              
    1714              $C$DW$T$78      .dwtag  DW_TAG_typedef
    1715                      .dwattr $C$DW$T$78, DW_AT_name("PARK")
    1716                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$21)
    1717                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1718              
    1719              
    1720              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1721                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
    1722              $C$DW$84        .dwtag  DW_TAG_member
    1723                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1724                      .dwattr $C$DW$84, DW_AT_name("Alpha")
    1725                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Alpha")
    1726                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1727                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1728              
    1729              $C$DW$85        .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1731                      .dwattr $C$DW$85, DW_AT_name("Beta")
    1732                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Beta")
    1733                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1734                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1735              
    1736              $C$DW$86        .dwtag  DW_TAG_member
    1737                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1738                      .dwattr $C$DW$86, DW_AT_name("Angle")
    1739                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Angle")
    1740                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1741                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1742              
    1743              $C$DW$87        .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$87, DW_AT_name("Ds")
    1746                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_Ds")
    1747                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1748                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1749              
    1750              $C$DW$88        .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1752                      .dwattr $C$DW$88, DW_AT_name("Qs")
    1753                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_Qs")
    1754                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1755                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1756              
    1757              $C$DW$89        .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   37

    1759                      .dwattr $C$DW$89, DW_AT_name("Sine")
    1760                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_Sine")
    1761                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1762                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1763              
    1764              $C$DW$90        .dwtag  DW_TAG_member
    1765                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1766                      .dwattr $C$DW$90, DW_AT_name("Cosine")
    1767                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_Cosine")
    1768                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1769                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1770              
    1771                      .dwendtag $C$DW$T$22
    1772              
    1773              $C$DW$T$79      .dwtag  DW_TAG_typedef
    1774                      .dwattr $C$DW$T$79, DW_AT_name("IPARK")
    1775                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$22)
    1776                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1777              
    1778              
    1779              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1780                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    1781              $C$DW$91        .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1783                      .dwattr $C$DW$91, DW_AT_name("Ref")
    1784                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_Ref")
    1785                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1786                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1787              
    1788              $C$DW$92        .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1790                      .dwattr $C$DW$92, DW_AT_name("Fdb")
    1791                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_Fdb")
    1792                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1793                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1794              
    1795              $C$DW$93        .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1797                      .dwattr $C$DW$93, DW_AT_name("Err")
    1798                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_Err")
    1799                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1800                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1801              
    1802              $C$DW$94        .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1804                      .dwattr $C$DW$94, DW_AT_name("Kp")
    1805                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_Kp")
    1806                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1807                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1808              
    1809              $C$DW$95        .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1811                      .dwattr $C$DW$95, DW_AT_name("Up")
    1812                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_Up")
    1813                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   38

    1814                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1815              
    1816              $C$DW$96        .dwtag  DW_TAG_member
    1817                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1818                      .dwattr $C$DW$96, DW_AT_name("Ui")
    1819                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_Ui")
    1820                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1821                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1822              
    1823              $C$DW$97        .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1825                      .dwattr $C$DW$97, DW_AT_name("Ud")
    1826                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_Ud")
    1827                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1828                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1829              
    1830              $C$DW$98        .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1832                      .dwattr $C$DW$98, DW_AT_name("OutPreSat")
    1833                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_OutPreSat")
    1834                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1835                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1836              
    1837              $C$DW$99        .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1839                      .dwattr $C$DW$99, DW_AT_name("OutMax")
    1840                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_OutMax")
    1841                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1842                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1843              
    1844              $C$DW$100       .dwtag  DW_TAG_member
    1845                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1846                      .dwattr $C$DW$100, DW_AT_name("OutMin")
    1847                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_OutMin")
    1848                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1849                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1850              
    1851              $C$DW$101       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1853                      .dwattr $C$DW$101, DW_AT_name("Out")
    1854                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_Out")
    1855                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1856                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1857              
    1858              $C$DW$102       .dwtag  DW_TAG_member
    1859                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1860                      .dwattr $C$DW$102, DW_AT_name("SatErr")
    1861                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_SatErr")
    1862                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1863                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1864              
    1865              $C$DW$103       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1867                      .dwattr $C$DW$103, DW_AT_name("Ki")
    1868                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_Ki")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   39

    1869                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1870                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1871              
    1872              $C$DW$104       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1874                      .dwattr $C$DW$104, DW_AT_name("Kc")
    1875                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_Kc")
    1876                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1877                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1878              
    1879              $C$DW$105       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1881                      .dwattr $C$DW$105, DW_AT_name("Kd")
    1882                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_Kd")
    1883                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1884                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1885              
    1886              $C$DW$106       .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1888                      .dwattr $C$DW$106, DW_AT_name("Up1")
    1889                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_Up1")
    1890                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1891                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1892              
    1893                      .dwendtag $C$DW$T$23
    1894              
    1895              $C$DW$T$80      .dwtag  DW_TAG_typedef
    1896                      .dwattr $C$DW$T$80, DW_AT_name("PIDREG3")
    1897                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$23)
    1898                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1899              
    1900              
    1901              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1902                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x18)
    1903              $C$DW$107       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1905                      .dwattr $C$DW$107, DW_AT_name("Ref")
    1906                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_Ref")
    1907                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1908                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1909              
    1910              $C$DW$108       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1912                      .dwattr $C$DW$108, DW_AT_name("Fbk")
    1913                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_Fbk")
    1914                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1915                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1916              
    1917              $C$DW$109       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1919                      .dwattr $C$DW$109, DW_AT_name("Out")
    1920                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_Out")
    1921                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1922                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1923              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   40

    1924              $C$DW$110       .dwtag  DW_TAG_member
    1925                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1926                      .dwattr $C$DW$110, DW_AT_name("Kp")
    1927                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_Kp")
    1928                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1929                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1930              
    1931              $C$DW$111       .dwtag  DW_TAG_member
    1932                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1933                      .dwattr $C$DW$111, DW_AT_name("Ki")
    1934                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_Ki")
    1935                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1936                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1937              
    1938              $C$DW$112       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1940                      .dwattr $C$DW$112, DW_AT_name("Umax")
    1941                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_Umax")
    1942                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1943                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1944              
    1945              $C$DW$113       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1947                      .dwattr $C$DW$113, DW_AT_name("Umin")
    1948                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_Umin")
    1949                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1950                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1951              
    1952              $C$DW$114       .dwtag  DW_TAG_member
    1953                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1954                      .dwattr $C$DW$114, DW_AT_name("up")
    1955                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_up")
    1956                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1957                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1958              
    1959              $C$DW$115       .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1961                      .dwattr $C$DW$115, DW_AT_name("ui")
    1962                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_ui")
    1963                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1964                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1965              
    1966              $C$DW$116       .dwtag  DW_TAG_member
    1967                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1968                      .dwattr $C$DW$116, DW_AT_name("v1")
    1969                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_v1")
    1970                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1971                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1972              
    1973              $C$DW$117       .dwtag  DW_TAG_member
    1974                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1975                      .dwattr $C$DW$117, DW_AT_name("i1")
    1976                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_i1")
    1977                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1978                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   41

    1979              
    1980              $C$DW$118       .dwtag  DW_TAG_member
    1981                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1982                      .dwattr $C$DW$118, DW_AT_name("w1")
    1983                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_w1")
    1984                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1985                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1986              
    1987                      .dwendtag $C$DW$T$24
    1988              
    1989              $C$DW$T$81      .dwtag  DW_TAG_typedef
    1990                      .dwattr $C$DW$T$81, DW_AT_name("PI_CONTROLLER")
    1991                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$24)
    1992                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1993              
    1994              
    1995              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1996                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
    1997              $C$DW$119       .dwtag  DW_TAG_member
    1998                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1999                      .dwattr $C$DW$119, DW_AT_name("Ref")
    2000                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_Ref")
    2001                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2002                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2003              
    2004              $C$DW$120       .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2006                      .dwattr $C$DW$120, DW_AT_name("Fbk")
    2007                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_Fbk")
    2008                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2009                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2010              
    2011              $C$DW$121       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2013                      .dwattr $C$DW$121, DW_AT_name("Out")
    2014                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_Out")
    2015                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2016                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2017              
    2018              $C$DW$122       .dwtag  DW_TAG_member
    2019                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2020                      .dwattr $C$DW$122, DW_AT_name("c1")
    2021                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_c1")
    2022                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2023                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2024              
    2025              $C$DW$123       .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2027                      .dwattr $C$DW$123, DW_AT_name("c2")
    2028                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_c2")
    2029                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2030                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2031              
    2032                      .dwendtag $C$DW$T$25
    2033              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   42

    2034              $C$DW$T$28      .dwtag  DW_TAG_typedef
    2035                      .dwattr $C$DW$T$28, DW_AT_name("PID_TERMINALS")
    2036                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    2037                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2038              
    2039              
    2040              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2041                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0e)
    2042              $C$DW$124       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2044                      .dwattr $C$DW$124, DW_AT_name("Kr")
    2045                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_Kr")
    2046                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2047                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2048              
    2049              $C$DW$125       .dwtag  DW_TAG_member
    2050                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2051                      .dwattr $C$DW$125, DW_AT_name("Kp")
    2052                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_Kp")
    2053                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2054                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2055              
    2056              $C$DW$126       .dwtag  DW_TAG_member
    2057                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2058                      .dwattr $C$DW$126, DW_AT_name("Ki")
    2059                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_Ki")
    2060                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2061                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2062              
    2063              $C$DW$127       .dwtag  DW_TAG_member
    2064                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2065                      .dwattr $C$DW$127, DW_AT_name("Kd")
    2066                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_Kd")
    2067                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2068                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2069              
    2070              $C$DW$128       .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2072                      .dwattr $C$DW$128, DW_AT_name("Km")
    2073                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_Km")
    2074                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2075                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2076              
    2077              $C$DW$129       .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2079                      .dwattr $C$DW$129, DW_AT_name("Umax")
    2080                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_Umax")
    2081                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2082                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2083              
    2084              $C$DW$130       .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2086                      .dwattr $C$DW$130, DW_AT_name("Umin")
    2087                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_Umin")
    2088                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   43

    2089                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2090              
    2091                      .dwendtag $C$DW$T$26
    2092              
    2093              $C$DW$T$29      .dwtag  DW_TAG_typedef
    2094                      .dwattr $C$DW$T$29, DW_AT_name("PID_PARAMETERS")
    2095                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    2096                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2097              
    2098              
    2099              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2100                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
    2101              $C$DW$131       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2103                      .dwattr $C$DW$131, DW_AT_name("up")
    2104                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_up")
    2105                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2106                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2107              
    2108              $C$DW$132       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2110                      .dwattr $C$DW$132, DW_AT_name("ui")
    2111                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ui")
    2112                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2113                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2114              
    2115              $C$DW$133       .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2117                      .dwattr $C$DW$133, DW_AT_name("ud")
    2118                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ud")
    2119                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2120                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2121              
    2122              $C$DW$134       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2124                      .dwattr $C$DW$134, DW_AT_name("v1")
    2125                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_v1")
    2126                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2127                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2128              
    2129              $C$DW$135       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2131                      .dwattr $C$DW$135, DW_AT_name("i1")
    2132                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_i1")
    2133                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2134                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2135              
    2136              $C$DW$136       .dwtag  DW_TAG_member
    2137                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2138                      .dwattr $C$DW$136, DW_AT_name("d1")
    2139                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_d1")
    2140                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2141                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2142              
    2143              $C$DW$137       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   44

    2144                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2145                      .dwattr $C$DW$137, DW_AT_name("d2")
    2146                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_d2")
    2147                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2148                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2149              
    2150              $C$DW$138       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2152                      .dwattr $C$DW$138, DW_AT_name("w1")
    2153                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_w1")
    2154                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2155                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2156              
    2157                      .dwendtag $C$DW$T$27
    2158              
    2159              $C$DW$T$30      .dwtag  DW_TAG_typedef
    2160                      .dwattr $C$DW$T$30, DW_AT_name("PID_DATA")
    2161                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
    2162                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2163              
    2164              
    2165              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2166                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x28)
    2167              $C$DW$139       .dwtag  DW_TAG_member
    2168                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$28)
    2169                      .dwattr $C$DW$139, DW_AT_name("term")
    2170                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_term")
    2171                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2172                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2173              
    2174              $C$DW$140       .dwtag  DW_TAG_member
    2175                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$29)
    2176                      .dwattr $C$DW$140, DW_AT_name("param")
    2177                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_param")
    2178                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2179                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2180              
    2181              $C$DW$141       .dwtag  DW_TAG_member
    2182                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$30)
    2183                      .dwattr $C$DW$141, DW_AT_name("data")
    2184                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_data")
    2185                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2186                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2187              
    2188                      .dwendtag $C$DW$T$31
    2189              
    2190              $C$DW$T$82      .dwtag  DW_TAG_typedef
    2191                      .dwattr $C$DW$T$82, DW_AT_name("PID_CONTROLLER")
    2192                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$31)
    2193                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2194              
    2195              
    2196              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2197                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x22)
    2198              $C$DW$142       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   45

    2199                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$32)
    2200                      .dwattr $C$DW$142, DW_AT_name("Ref")
    2201                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_Ref")
    2202                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2203                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2204              
    2205              $C$DW$143       .dwtag  DW_TAG_member
    2206                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$32)
    2207                      .dwattr $C$DW$143, DW_AT_name("Fbk")
    2208                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_Fbk")
    2209                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2210                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2211              
    2212              $C$DW$144       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$32)
    2214                      .dwattr $C$DW$144, DW_AT_name("Err")
    2215                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_Err")
    2216                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2217                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2218              
    2219              $C$DW$145       .dwtag  DW_TAG_member
    2220                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$32)
    2221                      .dwattr $C$DW$145, DW_AT_name("xErr")
    2222                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_xErr")
    2223                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2224                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2225              
    2226              $C$DW$146       .dwtag  DW_TAG_member
    2227                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$32)
    2228                      .dwattr $C$DW$146, DW_AT_name("Out")
    2229                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_Out")
    2230                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2231                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2232              
    2233              $C$DW$147       .dwtag  DW_TAG_member
    2234                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$32)
    2235                      .dwattr $C$DW$147, DW_AT_name("CarryOver")
    2236                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_CarryOver")
    2237                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2238                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2239              
    2240              $C$DW$148       .dwtag  DW_TAG_member
    2241                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$32)
    2242                      .dwattr $C$DW$148, DW_AT_name("Kp")
    2243                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_Kp")
    2244                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2245                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2246              
    2247              $C$DW$149       .dwtag  DW_TAG_member
    2248                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$32)
    2249                      .dwattr $C$DW$149, DW_AT_name("Ki")
    2250                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_Ki")
    2251                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2252                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2253              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   46

    2254              $C$DW$150       .dwtag  DW_TAG_member
    2255                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$32)
    2256                      .dwattr $C$DW$150, DW_AT_name("Kerr")
    2257                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_Kerr")
    2258                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2259                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2260              
    2261              $C$DW$151       .dwtag  DW_TAG_member
    2262                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$32)
    2263                      .dwattr $C$DW$151, DW_AT_name("Kxerr")
    2264                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Kxerr")
    2265                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2266                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2267              
    2268              $C$DW$152       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$32)
    2270                      .dwattr $C$DW$152, DW_AT_name("KerrOld")
    2271                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_KerrOld")
    2272                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2273                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2274              
    2275              $C$DW$153       .dwtag  DW_TAG_member
    2276                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$32)
    2277                      .dwattr $C$DW$153, DW_AT_name("cosWTs")
    2278                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_cosWTs")
    2279                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2280                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2281              
    2282              $C$DW$154       .dwtag  DW_TAG_member
    2283                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$32)
    2284                      .dwattr $C$DW$154, DW_AT_name("sinWTs")
    2285                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_sinWTs")
    2286                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2287                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2288              
    2289              $C$DW$155       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$32)
    2291                      .dwattr $C$DW$155, DW_AT_name("expVal")
    2292                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_expVal")
    2293                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2294                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2295              
    2296              $C$DW$156       .dwtag  DW_TAG_member
    2297                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$32)
    2298                      .dwattr $C$DW$156, DW_AT_name("kDirect")
    2299                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_kDirect")
    2300                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2301                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2302              
    2303              $C$DW$157       .dwtag  DW_TAG_member
    2304                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$32)
    2305                      .dwattr $C$DW$157, DW_AT_name("Umax")
    2306                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_Umax")
    2307                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2308                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   47

    2309              
    2310              $C$DW$158       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$32)
    2312                      .dwattr $C$DW$158, DW_AT_name("Umin")
    2313                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_Umin")
    2314                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2315                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2316              
    2317                      .dwendtag $C$DW$T$33
    2318              
    2319              $C$DW$T$83      .dwtag  DW_TAG_typedef
    2320                      .dwattr $C$DW$T$83, DW_AT_name("CURRENT_CONTROLLER")
    2321                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
    2322                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2323              
    2324              
    2325              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2326                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x12)
    2327              $C$DW$159       .dwtag  DW_TAG_member
    2328                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2329                      .dwattr $C$DW$159, DW_AT_name("Ualpha")
    2330                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_Ualpha")
    2331                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2332                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2333              
    2334              $C$DW$160       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2336                      .dwattr $C$DW$160, DW_AT_name("Ubeta")
    2337                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_Ubeta")
    2338                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2339                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2340              
    2341              $C$DW$161       .dwtag  DW_TAG_member
    2342                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2343                      .dwattr $C$DW$161, DW_AT_name("Ta")
    2344                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_Ta")
    2345                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2346                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2347              
    2348              $C$DW$162       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2350                      .dwattr $C$DW$162, DW_AT_name("Tb")
    2351                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_Tb")
    2352                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2353                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2354              
    2355              $C$DW$163       .dwtag  DW_TAG_member
    2356                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2357                      .dwattr $C$DW$163, DW_AT_name("Tc")
    2358                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_Tc")
    2359                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2360                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2361              
    2362              $C$DW$164       .dwtag  DW_TAG_member
    2363                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   48

    2364                      .dwattr $C$DW$164, DW_AT_name("tmp1")
    2365                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_tmp1")
    2366                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2367                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2368              
    2369              $C$DW$165       .dwtag  DW_TAG_member
    2370                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2371                      .dwattr $C$DW$165, DW_AT_name("tmp2")
    2372                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_tmp2")
    2373                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2374                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2375              
    2376              $C$DW$166       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2378                      .dwattr $C$DW$166, DW_AT_name("tmp3")
    2379                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_tmp3")
    2380                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2381                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2382              
    2383              $C$DW$167       .dwtag  DW_TAG_member
    2384                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$34)
    2385                      .dwattr $C$DW$167, DW_AT_name("VecSector")
    2386                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_VecSector")
    2387                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2388                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2389              
    2390                      .dwendtag $C$DW$T$35
    2391              
    2392              $C$DW$T$85      .dwtag  DW_TAG_typedef
    2393                      .dwattr $C$DW$T$85, DW_AT_name("SVGEN")
    2394                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$35)
    2395                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    2396              
    2397              
    2398              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2399                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    2400              $C$DW$168       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2402                      .dwattr $C$DW$168, DW_AT_name("TargetValue")
    2403                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_TargetValue")
    2404                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2405                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2406              
    2407              $C$DW$169       .dwtag  DW_TAG_member
    2408                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$36)
    2409                      .dwattr $C$DW$169, DW_AT_name("RampDelayMax")
    2410                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_RampDelayMax")
    2411                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2412                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2413              
    2414              $C$DW$170       .dwtag  DW_TAG_member
    2415                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2416                      .dwattr $C$DW$170, DW_AT_name("RampLowLimit")
    2417                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_RampLowLimit")
    2418                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   49

    2419                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2420              
    2421              $C$DW$171       .dwtag  DW_TAG_member
    2422                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2423                      .dwattr $C$DW$171, DW_AT_name("RampHighLimit")
    2424                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RampHighLimit")
    2425                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2426                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2427              
    2428              $C$DW$172       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$36)
    2430                      .dwattr $C$DW$172, DW_AT_name("RampDelayCount")
    2431                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_RampDelayCount")
    2432                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2433                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2434              
    2435              $C$DW$173       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2437                      .dwattr $C$DW$173, DW_AT_name("SetpointValue")
    2438                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_SetpointValue")
    2439                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2440                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2441              
    2442              $C$DW$174       .dwtag  DW_TAG_member
    2443                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$36)
    2444                      .dwattr $C$DW$174, DW_AT_name("EqualFlag")
    2445                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_EqualFlag")
    2446                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2447                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2448              
    2449              $C$DW$175       .dwtag  DW_TAG_member
    2450                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2451                      .dwattr $C$DW$175, DW_AT_name("Tmp")
    2452                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_Tmp")
    2453                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2454                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2455              
    2456                      .dwendtag $C$DW$T$37
    2457              
    2458              $C$DW$T$86      .dwtag  DW_TAG_typedef
    2459                      .dwattr $C$DW$T$86, DW_AT_name("RMPCNTL")
    2460                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$37)
    2461                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2462              
    2463              
    2464              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2465                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
    2466              $C$DW$176       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2468                      .dwattr $C$DW$176, DW_AT_name("Freq")
    2469                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_Freq")
    2470                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2471                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2472              
    2473              $C$DW$177       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   50

    2474                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2475                      .dwattr $C$DW$177, DW_AT_name("StepAngleMax")
    2476                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_StepAngleMax")
    2477                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2478                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2479              
    2480              $C$DW$178       .dwtag  DW_TAG_member
    2481                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2482                      .dwattr $C$DW$178, DW_AT_name("Angle")
    2483                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_Angle")
    2484                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2485                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2486              
    2487              $C$DW$179       .dwtag  DW_TAG_member
    2488                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2489                      .dwattr $C$DW$179, DW_AT_name("Gain")
    2490                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_Gain")
    2491                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2492                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2493              
    2494              $C$DW$180       .dwtag  DW_TAG_member
    2495                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2496                      .dwattr $C$DW$180, DW_AT_name("Out")
    2497                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_Out")
    2498                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2499                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2500              
    2501              $C$DW$181       .dwtag  DW_TAG_member
    2502                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2503                      .dwattr $C$DW$181, DW_AT_name("Offset")
    2504                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_Offset")
    2505                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2506                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2507              
    2508                      .dwendtag $C$DW$T$38
    2509              
    2510              $C$DW$T$87      .dwtag  DW_TAG_typedef
    2511                      .dwattr $C$DW$T$87, DW_AT_name("RAMPGEN")
    2512                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$38)
    2513                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2514              
    2515              
    2516              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2517                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x16)
    2518              $C$DW$182       .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2520                      .dwattr $C$DW$182, DW_AT_name("DcBusVolt")
    2521                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_DcBusVolt")
    2522                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2523                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2524              
    2525              $C$DW$183       .dwtag  DW_TAG_member
    2526                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2527                      .dwattr $C$DW$183, DW_AT_name("MfuncV1")
    2528                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_MfuncV1")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   51

    2529                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2530                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2531              
    2532              $C$DW$184       .dwtag  DW_TAG_member
    2533                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2534                      .dwattr $C$DW$184, DW_AT_name("MfuncV2")
    2535                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_MfuncV2")
    2536                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2537                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2538              
    2539              $C$DW$185       .dwtag  DW_TAG_member
    2540                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2541                      .dwattr $C$DW$185, DW_AT_name("MfuncV3")
    2542                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_MfuncV3")
    2543                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2544                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2545              
    2546              $C$DW$186       .dwtag  DW_TAG_member
    2547                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$34)
    2548                      .dwattr $C$DW$186, DW_AT_name("OutOfPhase")
    2549                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_OutOfPhase")
    2550                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2551                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2552              
    2553              $C$DW$187       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2555                      .dwattr $C$DW$187, DW_AT_name("VphaseA")
    2556                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_VphaseA")
    2557                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2558                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2559              
    2560              $C$DW$188       .dwtag  DW_TAG_member
    2561                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2562                      .dwattr $C$DW$188, DW_AT_name("VphaseB")
    2563                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_VphaseB")
    2564                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2565                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2566              
    2567              $C$DW$189       .dwtag  DW_TAG_member
    2568                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2569                      .dwattr $C$DW$189, DW_AT_name("VphaseC")
    2570                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_VphaseC")
    2571                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2572                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2573              
    2574              $C$DW$190       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2576                      .dwattr $C$DW$190, DW_AT_name("Valpha")
    2577                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_Valpha")
    2578                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2579                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2580              
    2581              $C$DW$191       .dwtag  DW_TAG_member
    2582                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2583                      .dwattr $C$DW$191, DW_AT_name("Vbeta")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   52

    2584                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_Vbeta")
    2585                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2586                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2587              
    2588              $C$DW$192       .dwtag  DW_TAG_member
    2589                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2590                      .dwattr $C$DW$192, DW_AT_name("temp")
    2591                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_temp")
    2592                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2593                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2594              
    2595                      .dwendtag $C$DW$T$39
    2596              
    2597              $C$DW$T$88      .dwtag  DW_TAG_typedef
    2598                      .dwattr $C$DW$T$88, DW_AT_name("PHASEVOLTAGE")
    2599                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$39)
    2600                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2601              
    2602              
    2603              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2604                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x14)
    2605              $C$DW$193       .dwtag  DW_TAG_member
    2606                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2607                      .dwattr $C$DW$193, DW_AT_name("ElecTheta")
    2608                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_ElecTheta")
    2609                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2610                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2611              
    2612              $C$DW$194       .dwtag  DW_TAG_member
    2613                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$36)
    2614                      .dwattr $C$DW$194, DW_AT_name("DirectionQep")
    2615                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_DirectionQep")
    2616                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2617                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2618              
    2619              $C$DW$195       .dwtag  DW_TAG_member
    2620                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2621                      .dwattr $C$DW$195, DW_AT_name("OldElecTheta")
    2622                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_OldElecTheta")
    2623                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2624                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2625              
    2626              $C$DW$196       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2628                      .dwattr $C$DW$196, DW_AT_name("Speed")
    2629                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_Speed")
    2630                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2631                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2632              
    2633              $C$DW$197       .dwtag  DW_TAG_member
    2634                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$36)
    2635                      .dwattr $C$DW$197, DW_AT_name("BaseRpm")
    2636                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_BaseRpm")
    2637                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2638                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   53

    2639              
    2640              $C$DW$198       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$40)
    2642                      .dwattr $C$DW$198, DW_AT_name("K1")
    2643                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_K1")
    2644                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2645                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2646              
    2647              $C$DW$199       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2649                      .dwattr $C$DW$199, DW_AT_name("K2")
    2650                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_K2")
    2651                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2652                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2653              
    2654              $C$DW$200       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2656                      .dwattr $C$DW$200, DW_AT_name("K3")
    2657                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_K3")
    2658                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2659                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2660              
    2661              $C$DW$201       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$41)
    2663                      .dwattr $C$DW$201, DW_AT_name("SpeedRpm")
    2664                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_SpeedRpm")
    2665                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2666                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2667              
    2668              $C$DW$202       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2670                      .dwattr $C$DW$202, DW_AT_name("Tmp")
    2671                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_Tmp")
    2672                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2673                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2674              
    2675                      .dwendtag $C$DW$T$42
    2676              
    2677              $C$DW$T$89      .dwtag  DW_TAG_typedef
    2678                      .dwattr $C$DW$T$89, DW_AT_name("SPEED_MEAS_QEP")
    2679                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$42)
    2680                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2681              
    2682              
    2683              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2684                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x12)
    2685              $C$DW$203       .dwtag  DW_TAG_member
    2686                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$32)
    2687                      .dwattr $C$DW$203, DW_AT_name("ElecTheta")
    2688                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_ElecTheta")
    2689                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2690                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2691              
    2692              $C$DW$204       .dwtag  DW_TAG_member
    2693                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   54

    2694                      .dwattr $C$DW$204, DW_AT_name("MechTheta")
    2695                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_MechTheta")
    2696                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2697                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2698              
    2699              $C$DW$205       .dwtag  DW_TAG_member
    2700                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$34)
    2701                      .dwattr $C$DW$205, DW_AT_name("DirectionQep")
    2702                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_DirectionQep")
    2703                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2704                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2705              
    2706              $C$DW$206       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$34)
    2708                      .dwattr $C$DW$206, DW_AT_name("QepPeriod")
    2709                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_QepPeriod")
    2710                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2711                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2712              
    2713              $C$DW$207       .dwtag  DW_TAG_member
    2714                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$36)
    2715                      .dwattr $C$DW$207, DW_AT_name("QepCountIndex")
    2716                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_QepCountIndex")
    2717                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2718                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2719              
    2720              $C$DW$208       .dwtag  DW_TAG_member
    2721                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$41)
    2722                      .dwattr $C$DW$208, DW_AT_name("RawTheta")
    2723                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_RawTheta")
    2724                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2725                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2726              
    2727              $C$DW$209       .dwtag  DW_TAG_member
    2728                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$32)
    2729                      .dwattr $C$DW$209, DW_AT_name("MechScaler")
    2730                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_MechScaler")
    2731                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2732                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2733              
    2734              $C$DW$210       .dwtag  DW_TAG_member
    2735                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$34)
    2736                      .dwattr $C$DW$210, DW_AT_name("LineEncoder")
    2737                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_LineEncoder")
    2738                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2739                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2740              
    2741              $C$DW$211       .dwtag  DW_TAG_member
    2742                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$34)
    2743                      .dwattr $C$DW$211, DW_AT_name("PolePairs")
    2744                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_PolePairs")
    2745                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2746                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2747              
    2748              $C$DW$212       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   55

    2749                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$41)
    2750                      .dwattr $C$DW$212, DW_AT_name("CalibratedAngle")
    2751                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_CalibratedAngle")
    2752                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2753                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2754              
    2755              $C$DW$213       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$34)
    2757                      .dwattr $C$DW$213, DW_AT_name("IndexSyncFlag")
    2758                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_IndexSyncFlag")
    2759                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2760                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2761              
    2762                      .dwendtag $C$DW$T$43
    2763              
    2764              $C$DW$T$90      .dwtag  DW_TAG_typedef
    2765                      .dwattr $C$DW$T$90, DW_AT_name("QEP")
    2766                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$43)
    2767                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2768              
    2769              
    2770              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2771                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x07)
    2772              $C$DW$214       .dwtag  DW_TAG_member
    2773                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$44)
    2774                      .dwattr $C$DW$214, DW_AT_name("stat_reg1")
    2775                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_stat_reg1")
    2776                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2777                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2778              
    2779              $C$DW$215       .dwtag  DW_TAG_member
    2780                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$45)
    2781                      .dwattr $C$DW$215, DW_AT_name("stat_reg2")
    2782                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_stat_reg2")
    2783                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2784                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2785              
    2786              $C$DW$216       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$46)
    2788                      .dwattr $C$DW$216, DW_AT_name("cntrl_reg1")
    2789                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_cntrl_reg1")
    2790                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2791                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2792              
    2793              $C$DW$217       .dwtag  DW_TAG_member
    2794                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$47)
    2795                      .dwattr $C$DW$217, DW_AT_name("cntrl_reg2")
    2796                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_cntrl_reg2")
    2797                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2798                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2799              
    2800              $C$DW$218       .dwtag  DW_TAG_member
    2801                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$34)
    2802                      .dwattr $C$DW$218, DW_AT_name("readCntrl1")
    2803                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_readCntrl1")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   56

    2804                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2805                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2806              
    2807              $C$DW$219       .dwtag  DW_TAG_member
    2808                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$34)
    2809                      .dwattr $C$DW$219, DW_AT_name("readCntrl2")
    2810                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_readCntrl2")
    2811                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2812                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2813              
    2814              $C$DW$220       .dwtag  DW_TAG_member
    2815                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$34)
    2816                      .dwattr $C$DW$220, DW_AT_name("DRV_fault")
    2817                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_DRV_fault")
    2818                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2819                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2820              
    2821                      .dwendtag $C$DW$T$48
    2822              
    2823              $C$DW$T$91      .dwtag  DW_TAG_typedef
    2824                      .dwattr $C$DW$T$91, DW_AT_name("DRV8301_Vars")
    2825                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$48)
    2826                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2827              
    2828              
    2829              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    2830                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x15)
    2831              $C$DW$221       .dwtag  DW_TAG_member
    2832                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$34)
    2833                      .dwattr $C$DW$221, DW_AT_name("Rsvd0")
    2834                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_Rsvd0")
    2835                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2836                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2837              
    2838              $C$DW$222       .dwtag  DW_TAG_member
    2839                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$49)
    2840                      .dwattr $C$DW$222, DW_AT_name("status1_wwd")
    2841                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_status1_wwd")
    2842                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2843                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2844              
    2845              $C$DW$223       .dwtag  DW_TAG_member
    2846                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$50)
    2847                      .dwattr $C$DW$223, DW_AT_name("status2_ov_vds")
    2848                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_status2_ov_vds")
    2849                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2850                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2851              
    2852              $C$DW$224       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$51)
    2854                      .dwattr $C$DW$224, DW_AT_name("status3_IC")
    2855                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_status3_IC")
    2856                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2857                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2858              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:53 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DmcProtection.asm                                                    PAGE   57

    2859              $C$DW$225       .dwtag  DW_TAG_member
    2860                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$52)
    2861                      .dwattr $C$DW$225, DW_AT_name("status4_gd_Vgs")
    2862                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    2863                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2864                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2865              
    2866              $C$DW$226       .dwtag  DW_TAG_member
    2867                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$53)
    2868                      .dwattr $C$DW$226, DW_AT_name("cntrl5_hs_gd")
    2869                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    2870                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2871                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2872              
    2873              $C$DW$227       .dwtag  DW_TAG_member
    2874                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$54)
    2875                      .dwattr $C$DW$227, DW_AT_name("cntrl6_ls_gd")
    2876                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    2877                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2878                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2879              
    2880              $C$DW$228       .dwtag  DW_TAG_member
    2881                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$55)
    2882                      .dwattr $C$DW$228, DW_AT_name("cntrl7_gd")
    2883                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_cntrl7_gd")
    2884                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2885                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2886              
    2887              $C$DW$229       .dwtag  DW_TAG_member
    2888                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$34)
    2889                      .dwattr $C$DW$229, DW_AT_name("Rsvd8")
    2890                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_Rsvd8")
    2891                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2892                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2893              
    2894              $C$DW$230       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$56)
    2896                      .dwattr $C$DW$230, DW_AT_name("cntrl9_IC_ops")
    2897                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    2898                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2899                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2900              
    2901              $C$DW$231       .dwtag  DW_TAG_member
    2902                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$57)
    2903                      .dwattr $C$DW$231, DW_AT_name("cntrlA_shunt_amp")
    2904                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    2905                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2906                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2907              
    2908              $C$DW$232       .dwtag  DW_TAG_member
    2909                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$58)
    2910                      .dwattr $C$DW$232, DW_AT_name("cntrlB_Vreg")
    2911                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    2912                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
