TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:56 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/drv8301.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DRV8301_SPI_Write")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DRV8301_SPI_Write")

     392              ;***************************************************************
     393              ;* FNAME: _DRV8301_diagnostics          FR SIZE:   2           *
     394              ;*                                                             *
     395              ;* FUNCTION ENVIRONMENT                                        *
     396              ;*                                                             *
     397              ;* FUNCTION PROPERTIES                                         *
     398              ;*                            0 Parameter,  0 Auto,  2 SOE     *
     399              ;***************************************************************
     400              
     401              _DRV8301_diagnostics:
     402              ;* AR1   assigned to _motor
     403              $C$DW$26        .dwtag  DW_TAG_variable
     404                      .dwattr $C$DW$26, DW_AT_name("motor")
     405                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_motor")
     406                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$340)
     407                      .dwattr $C$DW$26, DW_AT_location[DW_OP_reg6]
     408              
     409                      .dwcfi  cfa_offset, -2
     410                      .dwcfi  save_reg_to_mem, 26, 0
     411 00000072 B2BD          MOVL      *SP++,XAR1            ; [CPU_ALU] 
     412                      .dwcfi  save_reg_to_mem, 7, 2
     413                      .dwcfi  cfa_offset, -4
     414                      .dwpsn  file "../sources/drv8301.c",line 131,column 2,is_stmt,isa 0
     415 00000073 9A00          MOVB      AL,#0                 ; [CPU_ALU] |131| 
     416                      .dwpsn  file "../sources/drv8301.c",line 129,column 1,is_stmt,isa 0
     417 00000074 8BA4          MOVL      XAR1,XAR4             ; [CPU_ALU] |129| 
     418                      .dwpsn  file "../sources/drv8301.c",line 131,column 2,is_stmt,isa 0
     419              $C$DW$27        .dwtag  DW_TAG_TI_branch
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    9

     420                      .dwattr $C$DW$27, DW_AT_low_pc(0x00)
     421                      .dwattr $C$DW$27, DW_AT_name("_DRV8301_SPI_Read")
     422                      .dwattr $C$DW$27, DW_AT_TI_call
     423              
     424 00000075 7640!         LCR       #_DRV8301_SPI_Read    ; [CPU_ALU] |131| 
         00000076 0000 
     425                      ; call occurs [#_DRV8301_SPI_Read] ; [] |131| 
     426 00000077 8D00          MOVL      XAR0,#372             ; [CPU_ALU] |131| 
         00000078 0174 
     427 00000079 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |131| 
     428                      .dwpsn  file "../sources/drv8301.c",line 134,column 2,is_stmt,isa 0
     429 0000007a 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |134| 
     430 0000007b 9A01          MOVB      AL,#1                 ; [CPU_ALU] |134| 
     431              $C$DW$28        .dwtag  DW_TAG_TI_branch
     432                      .dwattr $C$DW$28, DW_AT_low_pc(0x00)
     433                      .dwattr $C$DW$28, DW_AT_name("_DRV8301_SPI_Read")
     434                      .dwattr $C$DW$28, DW_AT_TI_call
     435              
     436 0000007c 7640!         LCR       #_DRV8301_SPI_Read    ; [CPU_ALU] |134| 
         0000007d 0000 
     437                      ; call occurs [#_DRV8301_SPI_Read] ; [] |134| 
     438 0000007e 8D00          MOVL      XAR0,#373             ; [CPU_ALU] |134| 
         0000007f 0175 
     439 00000080 9080          ANDB      AL,#128               ; [CPU_ALU] |134| 
     440 00000081 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |134| 
     441 00000082 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     442                      .dwcfi  cfa_offset, -2
     443                      .dwcfi  restore_reg, 7
     444              $C$DW$29        .dwtag  DW_TAG_TI_branch
     445                      .dwattr $C$DW$29, DW_AT_low_pc(0x00)
     446                      .dwattr $C$DW$29, DW_AT_TI_return
     447              
     448 00000083 0006          LRETR     ; [CPU_ALU] 
     449                      ; return occurs ; [] 
     450                      .dwattr $C$DW$24, DW_AT_TI_end_file("../sources/drv8301.c")
     451                      .dwattr $C$DW$24, DW_AT_TI_end_line(0x93)
     452                      .dwattr $C$DW$24, DW_AT_TI_end_column(0x01)
     453                      .dwendentry
     454                      .dwendtag $C$DW$24
     455              
     456              ;**************************************************************
     457              ;* UNDEFINED EXTERNAL REFERENCES                              *
     458              ;**************************************************************
     459                      .global _DRV8301_SPI_Write
     460                      .global _DRV8301_SPI_Read
     461              
     462              ;***************************************************************
     463              ;* TYPE INFORMATION                                            *
     464              ;***************************************************************
     465              
     466              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     467                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     468              $C$DW$30        .dwtag  DW_TAG_member
     469                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     470                      .dwattr $C$DW$30, DW_AT_name("As")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   10

     471                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_As")
     472                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     473                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     474              
     475              $C$DW$31        .dwtag  DW_TAG_member
     476                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     477                      .dwattr $C$DW$31, DW_AT_name("Bs")
     478                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_Bs")
     479                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     480                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     481              
     482              $C$DW$32        .dwtag  DW_TAG_member
     483                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     484                      .dwattr $C$DW$32, DW_AT_name("Cs")
     485                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_Cs")
     486                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     487                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     488              
     489              $C$DW$33        .dwtag  DW_TAG_member
     490                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     491                      .dwattr $C$DW$33, DW_AT_name("Alpha")
     492                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_Alpha")
     493                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     494                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     495              
     496              $C$DW$34        .dwtag  DW_TAG_member
     497                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     498                      .dwattr $C$DW$34, DW_AT_name("Beta")
     499                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_Beta")
     500                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     501                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     502              
     503                      .dwendtag $C$DW$T$20
     504              
     505              $C$DW$T$77      .dwtag  DW_TAG_typedef
     506                      .dwattr $C$DW$T$77, DW_AT_name("CLARKE")
     507                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$20)
     508                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
     509              
     510              
     511              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     512                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     513              $C$DW$35        .dwtag  DW_TAG_member
     514                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     515                      .dwattr $C$DW$35, DW_AT_name("Alpha")
     516                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_Alpha")
     517                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     518                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     519              
     520              $C$DW$36        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     522                      .dwattr $C$DW$36, DW_AT_name("Beta")
     523                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_Beta")
     524                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     525                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   11

     526              
     527              $C$DW$37        .dwtag  DW_TAG_member
     528                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     529                      .dwattr $C$DW$37, DW_AT_name("Angle")
     530                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_Angle")
     531                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     532                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     533              
     534              $C$DW$38        .dwtag  DW_TAG_member
     535                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     536                      .dwattr $C$DW$38, DW_AT_name("Ds")
     537                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_Ds")
     538                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     539                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     540              
     541              $C$DW$39        .dwtag  DW_TAG_member
     542                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     543                      .dwattr $C$DW$39, DW_AT_name("Qs")
     544                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_Qs")
     545                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     546                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     547              
     548              $C$DW$40        .dwtag  DW_TAG_member
     549                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     550                      .dwattr $C$DW$40, DW_AT_name("Sine")
     551                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_Sine")
     552                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     553                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     554              
     555              $C$DW$41        .dwtag  DW_TAG_member
     556                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     557                      .dwattr $C$DW$41, DW_AT_name("Cosine")
     558                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_Cosine")
     559                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     560                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     561              
     562                      .dwendtag $C$DW$T$21
     563              
     564              $C$DW$T$78      .dwtag  DW_TAG_typedef
     565                      .dwattr $C$DW$T$78, DW_AT_name("PARK")
     566                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$21)
     567                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
     568              
     569              
     570              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     571                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     572              $C$DW$42        .dwtag  DW_TAG_member
     573                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     574                      .dwattr $C$DW$42, DW_AT_name("Alpha")
     575                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_Alpha")
     576                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     577                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     578              
     579              $C$DW$43        .dwtag  DW_TAG_member
     580                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   12

     581                      .dwattr $C$DW$43, DW_AT_name("Beta")
     582                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_Beta")
     583                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     584                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     585              
     586              $C$DW$44        .dwtag  DW_TAG_member
     587                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     588                      .dwattr $C$DW$44, DW_AT_name("Angle")
     589                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_Angle")
     590                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     591                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     592              
     593              $C$DW$45        .dwtag  DW_TAG_member
     594                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     595                      .dwattr $C$DW$45, DW_AT_name("Ds")
     596                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_Ds")
     597                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     598                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     599              
     600              $C$DW$46        .dwtag  DW_TAG_member
     601                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     602                      .dwattr $C$DW$46, DW_AT_name("Qs")
     603                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_Qs")
     604                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     605                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     606              
     607              $C$DW$47        .dwtag  DW_TAG_member
     608                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     609                      .dwattr $C$DW$47, DW_AT_name("Sine")
     610                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_Sine")
     611                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     612                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     613              
     614              $C$DW$48        .dwtag  DW_TAG_member
     615                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     616                      .dwattr $C$DW$48, DW_AT_name("Cosine")
     617                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_Cosine")
     618                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     619                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     620              
     621                      .dwendtag $C$DW$T$22
     622              
     623              $C$DW$T$79      .dwtag  DW_TAG_typedef
     624                      .dwattr $C$DW$T$79, DW_AT_name("IPARK")
     625                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$22)
     626                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
     627              
     628              
     629              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     630                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
     631              $C$DW$49        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     633                      .dwattr $C$DW$49, DW_AT_name("Ref")
     634                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_Ref")
     635                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   13

     636                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     637              
     638              $C$DW$50        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     640                      .dwattr $C$DW$50, DW_AT_name("Fdb")
     641                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_Fdb")
     642                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     643                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     644              
     645              $C$DW$51        .dwtag  DW_TAG_member
     646                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     647                      .dwattr $C$DW$51, DW_AT_name("Err")
     648                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_Err")
     649                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     650                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     651              
     652              $C$DW$52        .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     654                      .dwattr $C$DW$52, DW_AT_name("Kp")
     655                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_Kp")
     656                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     657                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     658              
     659              $C$DW$53        .dwtag  DW_TAG_member
     660                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     661                      .dwattr $C$DW$53, DW_AT_name("Up")
     662                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_Up")
     663                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     664                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     665              
     666              $C$DW$54        .dwtag  DW_TAG_member
     667                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     668                      .dwattr $C$DW$54, DW_AT_name("Ui")
     669                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Ui")
     670                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     671                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     672              
     673              $C$DW$55        .dwtag  DW_TAG_member
     674                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     675                      .dwattr $C$DW$55, DW_AT_name("Ud")
     676                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_Ud")
     677                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     678                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     679              
     680              $C$DW$56        .dwtag  DW_TAG_member
     681                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     682                      .dwattr $C$DW$56, DW_AT_name("OutPreSat")
     683                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_OutPreSat")
     684                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     685                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     686              
     687              $C$DW$57        .dwtag  DW_TAG_member
     688                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     689                      .dwattr $C$DW$57, DW_AT_name("OutMax")
     690                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_OutMax")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   14

     691                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     692                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     693              
     694              $C$DW$58        .dwtag  DW_TAG_member
     695                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     696                      .dwattr $C$DW$58, DW_AT_name("OutMin")
     697                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_OutMin")
     698                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     699                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     700              
     701              $C$DW$59        .dwtag  DW_TAG_member
     702                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     703                      .dwattr $C$DW$59, DW_AT_name("Out")
     704                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_Out")
     705                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     706                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     707              
     708              $C$DW$60        .dwtag  DW_TAG_member
     709                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     710                      .dwattr $C$DW$60, DW_AT_name("SatErr")
     711                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_SatErr")
     712                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     713                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     714              
     715              $C$DW$61        .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     717                      .dwattr $C$DW$61, DW_AT_name("Ki")
     718                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Ki")
     719                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     720                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     721              
     722              $C$DW$62        .dwtag  DW_TAG_member
     723                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     724                      .dwattr $C$DW$62, DW_AT_name("Kc")
     725                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Kc")
     726                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     727                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     728              
     729              $C$DW$63        .dwtag  DW_TAG_member
     730                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     731                      .dwattr $C$DW$63, DW_AT_name("Kd")
     732                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_Kd")
     733                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     734                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     735              
     736              $C$DW$64        .dwtag  DW_TAG_member
     737                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     738                      .dwattr $C$DW$64, DW_AT_name("Up1")
     739                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_Up1")
     740                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     741                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     742              
     743                      .dwendtag $C$DW$T$23
     744              
     745              $C$DW$T$80      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   15

     746                      .dwattr $C$DW$T$80, DW_AT_name("PIDREG3")
     747                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$23)
     748                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
     749              
     750              
     751              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     752                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x18)
     753              $C$DW$65        .dwtag  DW_TAG_member
     754                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     755                      .dwattr $C$DW$65, DW_AT_name("Ref")
     756                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Ref")
     757                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     758                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     759              
     760              $C$DW$66        .dwtag  DW_TAG_member
     761                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     762                      .dwattr $C$DW$66, DW_AT_name("Fbk")
     763                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Fbk")
     764                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     765                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     766              
     767              $C$DW$67        .dwtag  DW_TAG_member
     768                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     769                      .dwattr $C$DW$67, DW_AT_name("Out")
     770                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Out")
     771                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     772                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     773              
     774              $C$DW$68        .dwtag  DW_TAG_member
     775                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     776                      .dwattr $C$DW$68, DW_AT_name("Kp")
     777                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Kp")
     778                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     779                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     780              
     781              $C$DW$69        .dwtag  DW_TAG_member
     782                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     783                      .dwattr $C$DW$69, DW_AT_name("Ki")
     784                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Ki")
     785                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     786                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     787              
     788              $C$DW$70        .dwtag  DW_TAG_member
     789                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     790                      .dwattr $C$DW$70, DW_AT_name("Umax")
     791                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_Umax")
     792                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     793                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     794              
     795              $C$DW$71        .dwtag  DW_TAG_member
     796                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     797                      .dwattr $C$DW$71, DW_AT_name("Umin")
     798                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_Umin")
     799                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     800                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   16

     801              
     802              $C$DW$72        .dwtag  DW_TAG_member
     803                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     804                      .dwattr $C$DW$72, DW_AT_name("up")
     805                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_up")
     806                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     807                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     808              
     809              $C$DW$73        .dwtag  DW_TAG_member
     810                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     811                      .dwattr $C$DW$73, DW_AT_name("ui")
     812                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_ui")
     813                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     814                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     815              
     816              $C$DW$74        .dwtag  DW_TAG_member
     817                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     818                      .dwattr $C$DW$74, DW_AT_name("v1")
     819                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_v1")
     820                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     821                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     822              
     823              $C$DW$75        .dwtag  DW_TAG_member
     824                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     825                      .dwattr $C$DW$75, DW_AT_name("i1")
     826                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_i1")
     827                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     828                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     829              
     830              $C$DW$76        .dwtag  DW_TAG_member
     831                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     832                      .dwattr $C$DW$76, DW_AT_name("w1")
     833                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_w1")
     834                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     835                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     836              
     837                      .dwendtag $C$DW$T$24
     838              
     839              $C$DW$T$81      .dwtag  DW_TAG_typedef
     840                      .dwattr $C$DW$T$81, DW_AT_name("PI_CONTROLLER")
     841                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$24)
     842                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
     843              
     844              
     845              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     846                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
     847              $C$DW$77        .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     849                      .dwattr $C$DW$77, DW_AT_name("Ref")
     850                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Ref")
     851                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     852                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     853              
     854              $C$DW$78        .dwtag  DW_TAG_member
     855                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   17

     856                      .dwattr $C$DW$78, DW_AT_name("Fbk")
     857                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Fbk")
     858                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     859                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     860              
     861              $C$DW$79        .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     863                      .dwattr $C$DW$79, DW_AT_name("Out")
     864                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_Out")
     865                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     866                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     867              
     868              $C$DW$80        .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     870                      .dwattr $C$DW$80, DW_AT_name("c1")
     871                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_c1")
     872                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     873                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     874              
     875              $C$DW$81        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     877                      .dwattr $C$DW$81, DW_AT_name("c2")
     878                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_c2")
     879                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     880                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     881              
     882                      .dwendtag $C$DW$T$25
     883              
     884              $C$DW$T$28      .dwtag  DW_TAG_typedef
     885                      .dwattr $C$DW$T$28, DW_AT_name("PID_TERMINALS")
     886                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
     887                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     888              
     889              
     890              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     891                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0e)
     892              $C$DW$82        .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     894                      .dwattr $C$DW$82, DW_AT_name("Kr")
     895                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Kr")
     896                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     897                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     898              
     899              $C$DW$83        .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     901                      .dwattr $C$DW$83, DW_AT_name("Kp")
     902                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Kp")
     903                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     904                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     905              
     906              $C$DW$84        .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     908                      .dwattr $C$DW$84, DW_AT_name("Ki")
     909                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Ki")
     910                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   18

     911                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     912              
     913              $C$DW$85        .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     915                      .dwattr $C$DW$85, DW_AT_name("Kd")
     916                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Kd")
     917                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     918                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     919              
     920              $C$DW$86        .dwtag  DW_TAG_member
     921                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     922                      .dwattr $C$DW$86, DW_AT_name("Km")
     923                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Km")
     924                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     925                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     926              
     927              $C$DW$87        .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     929                      .dwattr $C$DW$87, DW_AT_name("Umax")
     930                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_Umax")
     931                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     932                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     933              
     934              $C$DW$88        .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     936                      .dwattr $C$DW$88, DW_AT_name("Umin")
     937                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_Umin")
     938                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     939                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     940              
     941                      .dwendtag $C$DW$T$26
     942              
     943              $C$DW$T$29      .dwtag  DW_TAG_typedef
     944                      .dwattr $C$DW$T$29, DW_AT_name("PID_PARAMETERS")
     945                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
     946                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     947              
     948              
     949              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     950                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
     951              $C$DW$89        .dwtag  DW_TAG_member
     952                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     953                      .dwattr $C$DW$89, DW_AT_name("up")
     954                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_up")
     955                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     956                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     957              
     958              $C$DW$90        .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     960                      .dwattr $C$DW$90, DW_AT_name("ui")
     961                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_ui")
     962                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     963                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     964              
     965              $C$DW$91        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   19

     966                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     967                      .dwattr $C$DW$91, DW_AT_name("ud")
     968                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ud")
     969                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     970                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     971              
     972              $C$DW$92        .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     974                      .dwattr $C$DW$92, DW_AT_name("v1")
     975                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_v1")
     976                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     977                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     978              
     979              $C$DW$93        .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     981                      .dwattr $C$DW$93, DW_AT_name("i1")
     982                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_i1")
     983                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     984                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     985              
     986              $C$DW$94        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     988                      .dwattr $C$DW$94, DW_AT_name("d1")
     989                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_d1")
     990                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     991                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     992              
     993              $C$DW$95        .dwtag  DW_TAG_member
     994                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     995                      .dwattr $C$DW$95, DW_AT_name("d2")
     996                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_d2")
     997                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     998                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     999              
    1000              $C$DW$96        .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1002                      .dwattr $C$DW$96, DW_AT_name("w1")
    1003                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_w1")
    1004                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1005                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1006              
    1007                      .dwendtag $C$DW$T$27
    1008              
    1009              $C$DW$T$30      .dwtag  DW_TAG_typedef
    1010                      .dwattr $C$DW$T$30, DW_AT_name("PID_DATA")
    1011                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
    1012                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1013              
    1014              
    1015              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1016                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x28)
    1017              $C$DW$97        .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$28)
    1019                      .dwattr $C$DW$97, DW_AT_name("term")
    1020                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_term")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   20

    1021                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1022                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1023              
    1024              $C$DW$98        .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$29)
    1026                      .dwattr $C$DW$98, DW_AT_name("param")
    1027                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_param")
    1028                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1029                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1030              
    1031              $C$DW$99        .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$30)
    1033                      .dwattr $C$DW$99, DW_AT_name("data")
    1034                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_data")
    1035                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1036                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1037              
    1038                      .dwendtag $C$DW$T$31
    1039              
    1040              $C$DW$T$82      .dwtag  DW_TAG_typedef
    1041                      .dwattr $C$DW$T$82, DW_AT_name("PID_CONTROLLER")
    1042                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$31)
    1043                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1044              
    1045              
    1046              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1047                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x22)
    1048              $C$DW$100       .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$32)
    1050                      .dwattr $C$DW$100, DW_AT_name("Ref")
    1051                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_Ref")
    1052                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1054              
    1055              $C$DW$101       .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$32)
    1057                      .dwattr $C$DW$101, DW_AT_name("Fbk")
    1058                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_Fbk")
    1059                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1060                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1061              
    1062              $C$DW$102       .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$32)
    1064                      .dwattr $C$DW$102, DW_AT_name("Err")
    1065                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_Err")
    1066                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1067                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1068              
    1069              $C$DW$103       .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$32)
    1071                      .dwattr $C$DW$103, DW_AT_name("xErr")
    1072                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_xErr")
    1073                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1074                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1075              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   21

    1076              $C$DW$104       .dwtag  DW_TAG_member
    1077                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$32)
    1078                      .dwattr $C$DW$104, DW_AT_name("Out")
    1079                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_Out")
    1080                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1081                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1082              
    1083              $C$DW$105       .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$32)
    1085                      .dwattr $C$DW$105, DW_AT_name("CarryOver")
    1086                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_CarryOver")
    1087                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1088                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1089              
    1090              $C$DW$106       .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$32)
    1092                      .dwattr $C$DW$106, DW_AT_name("Kp")
    1093                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_Kp")
    1094                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1095                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1096              
    1097              $C$DW$107       .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$32)
    1099                      .dwattr $C$DW$107, DW_AT_name("Ki")
    1100                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_Ki")
    1101                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1102                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1103              
    1104              $C$DW$108       .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$32)
    1106                      .dwattr $C$DW$108, DW_AT_name("Kerr")
    1107                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_Kerr")
    1108                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1109                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1110              
    1111              $C$DW$109       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$32)
    1113                      .dwattr $C$DW$109, DW_AT_name("Kxerr")
    1114                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_Kxerr")
    1115                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1116                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1117              
    1118              $C$DW$110       .dwtag  DW_TAG_member
    1119                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$32)
    1120                      .dwattr $C$DW$110, DW_AT_name("KerrOld")
    1121                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_KerrOld")
    1122                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1123                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1124              
    1125              $C$DW$111       .dwtag  DW_TAG_member
    1126                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$32)
    1127                      .dwattr $C$DW$111, DW_AT_name("cosWTs")
    1128                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_cosWTs")
    1129                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1130                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   22

    1131              
    1132              $C$DW$112       .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$32)
    1134                      .dwattr $C$DW$112, DW_AT_name("sinWTs")
    1135                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_sinWTs")
    1136                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1137                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1138              
    1139              $C$DW$113       .dwtag  DW_TAG_member
    1140                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$32)
    1141                      .dwattr $C$DW$113, DW_AT_name("expVal")
    1142                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_expVal")
    1143                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1144                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1145              
    1146              $C$DW$114       .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$32)
    1148                      .dwattr $C$DW$114, DW_AT_name("kDirect")
    1149                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_kDirect")
    1150                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1151                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1152              
    1153              $C$DW$115       .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$32)
    1155                      .dwattr $C$DW$115, DW_AT_name("Umax")
    1156                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_Umax")
    1157                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1158                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1159              
    1160              $C$DW$116       .dwtag  DW_TAG_member
    1161                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$32)
    1162                      .dwattr $C$DW$116, DW_AT_name("Umin")
    1163                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_Umin")
    1164                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1165                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1166              
    1167                      .dwendtag $C$DW$T$33
    1168              
    1169              $C$DW$T$83      .dwtag  DW_TAG_typedef
    1170                      .dwattr $C$DW$T$83, DW_AT_name("CURRENT_CONTROLLER")
    1171                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
    1172                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1173              
    1174              
    1175              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1176                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x12)
    1177              $C$DW$117       .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1179                      .dwattr $C$DW$117, DW_AT_name("Ualpha")
    1180                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_Ualpha")
    1181                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1182                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1183              
    1184              $C$DW$118       .dwtag  DW_TAG_member
    1185                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   23

    1186                      .dwattr $C$DW$118, DW_AT_name("Ubeta")
    1187                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_Ubeta")
    1188                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1189                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1190              
    1191              $C$DW$119       .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1193                      .dwattr $C$DW$119, DW_AT_name("Ta")
    1194                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_Ta")
    1195                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1196                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1197              
    1198              $C$DW$120       .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1200                      .dwattr $C$DW$120, DW_AT_name("Tb")
    1201                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_Tb")
    1202                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1203                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1204              
    1205              $C$DW$121       .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1207                      .dwattr $C$DW$121, DW_AT_name("Tc")
    1208                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_Tc")
    1209                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1210                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1211              
    1212              $C$DW$122       .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1214                      .dwattr $C$DW$122, DW_AT_name("tmp1")
    1215                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_tmp1")
    1216                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1217                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1218              
    1219              $C$DW$123       .dwtag  DW_TAG_member
    1220                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1221                      .dwattr $C$DW$123, DW_AT_name("tmp2")
    1222                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_tmp2")
    1223                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1224                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1225              
    1226              $C$DW$124       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1228                      .dwattr $C$DW$124, DW_AT_name("tmp3")
    1229                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_tmp3")
    1230                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1231                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1232              
    1233              $C$DW$125       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$34)
    1235                      .dwattr $C$DW$125, DW_AT_name("VecSector")
    1236                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_VecSector")
    1237                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1238                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1239              
    1240                      .dwendtag $C$DW$T$35
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   24

    1241              
    1242              $C$DW$T$85      .dwtag  DW_TAG_typedef
    1243                      .dwattr $C$DW$T$85, DW_AT_name("SVGEN")
    1244                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$35)
    1245                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1246              
    1247              
    1248              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1249                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    1250              $C$DW$126       .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1252                      .dwattr $C$DW$126, DW_AT_name("TargetValue")
    1253                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_TargetValue")
    1254                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1256              
    1257              $C$DW$127       .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$36)
    1259                      .dwattr $C$DW$127, DW_AT_name("RampDelayMax")
    1260                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_RampDelayMax")
    1261                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1262                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1263              
    1264              $C$DW$128       .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1266                      .dwattr $C$DW$128, DW_AT_name("RampLowLimit")
    1267                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_RampLowLimit")
    1268                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1269                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1270              
    1271              $C$DW$129       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$129, DW_AT_name("RampHighLimit")
    1274                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_RampHighLimit")
    1275                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1276                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1277              
    1278              $C$DW$130       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$36)
    1280                      .dwattr $C$DW$130, DW_AT_name("RampDelayCount")
    1281                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_RampDelayCount")
    1282                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1283                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1284              
    1285              $C$DW$131       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$131, DW_AT_name("SetpointValue")
    1288                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_SetpointValue")
    1289                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1290                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1291              
    1292              $C$DW$132       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$36)
    1294                      .dwattr $C$DW$132, DW_AT_name("EqualFlag")
    1295                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_EqualFlag")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   25

    1296                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1297                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1298              
    1299              $C$DW$133       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$133, DW_AT_name("Tmp")
    1302                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_Tmp")
    1303                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1304                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1305              
    1306                      .dwendtag $C$DW$T$37
    1307              
    1308              $C$DW$T$86      .dwtag  DW_TAG_typedef
    1309                      .dwattr $C$DW$T$86, DW_AT_name("RMPCNTL")
    1310                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$37)
    1311                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1312              
    1313              
    1314              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1315                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
    1316              $C$DW$134       .dwtag  DW_TAG_member
    1317                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1318                      .dwattr $C$DW$134, DW_AT_name("Freq")
    1319                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_Freq")
    1320                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1321                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1322              
    1323              $C$DW$135       .dwtag  DW_TAG_member
    1324                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1325                      .dwattr $C$DW$135, DW_AT_name("StepAngleMax")
    1326                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_StepAngleMax")
    1327                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1328                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1329              
    1330              $C$DW$136       .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1332                      .dwattr $C$DW$136, DW_AT_name("Angle")
    1333                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_Angle")
    1334                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1335                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1336              
    1337              $C$DW$137       .dwtag  DW_TAG_member
    1338                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1339                      .dwattr $C$DW$137, DW_AT_name("Gain")
    1340                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_Gain")
    1341                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1342                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1343              
    1344              $C$DW$138       .dwtag  DW_TAG_member
    1345                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1346                      .dwattr $C$DW$138, DW_AT_name("Out")
    1347                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_Out")
    1348                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1349                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1350              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   26

    1351              $C$DW$139       .dwtag  DW_TAG_member
    1352                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1353                      .dwattr $C$DW$139, DW_AT_name("Offset")
    1354                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_Offset")
    1355                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1356                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1357              
    1358                      .dwendtag $C$DW$T$38
    1359              
    1360              $C$DW$T$87      .dwtag  DW_TAG_typedef
    1361                      .dwattr $C$DW$T$87, DW_AT_name("RAMPGEN")
    1362                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$38)
    1363                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1364              
    1365              
    1366              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1367                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x16)
    1368              $C$DW$140       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1370                      .dwattr $C$DW$140, DW_AT_name("DcBusVolt")
    1371                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_DcBusVolt")
    1372                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1374              
    1375              $C$DW$141       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1377                      .dwattr $C$DW$141, DW_AT_name("MfuncV1")
    1378                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_MfuncV1")
    1379                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1380                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1381              
    1382              $C$DW$142       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1384                      .dwattr $C$DW$142, DW_AT_name("MfuncV2")
    1385                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_MfuncV2")
    1386                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1387                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1388              
    1389              $C$DW$143       .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1391                      .dwattr $C$DW$143, DW_AT_name("MfuncV3")
    1392                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_MfuncV3")
    1393                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1394                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1395              
    1396              $C$DW$144       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$34)
    1398                      .dwattr $C$DW$144, DW_AT_name("OutOfPhase")
    1399                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_OutOfPhase")
    1400                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1401                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1402              
    1403              $C$DW$145       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1405                      .dwattr $C$DW$145, DW_AT_name("VphaseA")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   27

    1406                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_VphaseA")
    1407                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1408                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1409              
    1410              $C$DW$146       .dwtag  DW_TAG_member
    1411                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1412                      .dwattr $C$DW$146, DW_AT_name("VphaseB")
    1413                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_VphaseB")
    1414                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1415                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1416              
    1417              $C$DW$147       .dwtag  DW_TAG_member
    1418                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1419                      .dwattr $C$DW$147, DW_AT_name("VphaseC")
    1420                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_VphaseC")
    1421                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1422                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1423              
    1424              $C$DW$148       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1426                      .dwattr $C$DW$148, DW_AT_name("Valpha")
    1427                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_Valpha")
    1428                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1429                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1430              
    1431              $C$DW$149       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1433                      .dwattr $C$DW$149, DW_AT_name("Vbeta")
    1434                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_Vbeta")
    1435                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1436                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1437              
    1438              $C$DW$150       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1440                      .dwattr $C$DW$150, DW_AT_name("temp")
    1441                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_temp")
    1442                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1443                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1444              
    1445                      .dwendtag $C$DW$T$39
    1446              
    1447              $C$DW$T$88      .dwtag  DW_TAG_typedef
    1448                      .dwattr $C$DW$T$88, DW_AT_name("PHASEVOLTAGE")
    1449                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$39)
    1450                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1451              
    1452              
    1453              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1454                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x14)
    1455              $C$DW$151       .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1457                      .dwattr $C$DW$151, DW_AT_name("ElecTheta")
    1458                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ElecTheta")
    1459                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1460                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   28

    1461              
    1462              $C$DW$152       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$36)
    1464                      .dwattr $C$DW$152, DW_AT_name("DirectionQep")
    1465                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_DirectionQep")
    1466                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1467                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1468              
    1469              $C$DW$153       .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1471                      .dwattr $C$DW$153, DW_AT_name("OldElecTheta")
    1472                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_OldElecTheta")
    1473                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1474                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1475              
    1476              $C$DW$154       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1478                      .dwattr $C$DW$154, DW_AT_name("Speed")
    1479                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_Speed")
    1480                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1481                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1482              
    1483              $C$DW$155       .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$36)
    1485                      .dwattr $C$DW$155, DW_AT_name("BaseRpm")
    1486                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_BaseRpm")
    1487                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1488                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1489              
    1490              $C$DW$156       .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$40)
    1492                      .dwattr $C$DW$156, DW_AT_name("K1")
    1493                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_K1")
    1494                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1495                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1496              
    1497              $C$DW$157       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1499                      .dwattr $C$DW$157, DW_AT_name("K2")
    1500                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_K2")
    1501                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1502                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1503              
    1504              $C$DW$158       .dwtag  DW_TAG_member
    1505                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1506                      .dwattr $C$DW$158, DW_AT_name("K3")
    1507                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_K3")
    1508                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1509                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1510              
    1511              $C$DW$159       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$41)
    1513                      .dwattr $C$DW$159, DW_AT_name("SpeedRpm")
    1514                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_SpeedRpm")
    1515                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   29

    1516                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1517              
    1518              $C$DW$160       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1520                      .dwattr $C$DW$160, DW_AT_name("Tmp")
    1521                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_Tmp")
    1522                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1523                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1524              
    1525                      .dwendtag $C$DW$T$42
    1526              
    1527              $C$DW$T$89      .dwtag  DW_TAG_typedef
    1528                      .dwattr $C$DW$T$89, DW_AT_name("SPEED_MEAS_QEP")
    1529                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$42)
    1530                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1531              
    1532              
    1533              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1534                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x12)
    1535              $C$DW$161       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$32)
    1537                      .dwattr $C$DW$161, DW_AT_name("ElecTheta")
    1538                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_ElecTheta")
    1539                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1541              
    1542              $C$DW$162       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$32)
    1544                      .dwattr $C$DW$162, DW_AT_name("MechTheta")
    1545                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_MechTheta")
    1546                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1547                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1548              
    1549              $C$DW$163       .dwtag  DW_TAG_member
    1550                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$34)
    1551                      .dwattr $C$DW$163, DW_AT_name("DirectionQep")
    1552                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_DirectionQep")
    1553                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1554                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1555              
    1556              $C$DW$164       .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$34)
    1558                      .dwattr $C$DW$164, DW_AT_name("QepPeriod")
    1559                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_QepPeriod")
    1560                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1561                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1562              
    1563              $C$DW$165       .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$36)
    1565                      .dwattr $C$DW$165, DW_AT_name("QepCountIndex")
    1566                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_QepCountIndex")
    1567                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1568                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1569              
    1570              $C$DW$166       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   30

    1571                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$41)
    1572                      .dwattr $C$DW$166, DW_AT_name("RawTheta")
    1573                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_RawTheta")
    1574                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1575                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1576              
    1577              $C$DW$167       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$32)
    1579                      .dwattr $C$DW$167, DW_AT_name("MechScaler")
    1580                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_MechScaler")
    1581                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1582                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1583              
    1584              $C$DW$168       .dwtag  DW_TAG_member
    1585                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$34)
    1586                      .dwattr $C$DW$168, DW_AT_name("LineEncoder")
    1587                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_LineEncoder")
    1588                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1589                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591              $C$DW$169       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$34)
    1593                      .dwattr $C$DW$169, DW_AT_name("PolePairs")
    1594                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PolePairs")
    1595                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1596                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1597              
    1598              $C$DW$170       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$41)
    1600                      .dwattr $C$DW$170, DW_AT_name("CalibratedAngle")
    1601                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_CalibratedAngle")
    1602                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1603                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1604              
    1605              $C$DW$171       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$34)
    1607                      .dwattr $C$DW$171, DW_AT_name("IndexSyncFlag")
    1608                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_IndexSyncFlag")
    1609                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1610                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1611              
    1612                      .dwendtag $C$DW$T$43
    1613              
    1614              $C$DW$T$90      .dwtag  DW_TAG_typedef
    1615                      .dwattr $C$DW$T$90, DW_AT_name("QEP")
    1616                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$43)
    1617                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1618              
    1619              
    1620              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1621                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x07)
    1622              $C$DW$172       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$44)
    1624                      .dwattr $C$DW$172, DW_AT_name("stat_reg1")
    1625                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_stat_reg1")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   31

    1626                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1627                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1628              
    1629              $C$DW$173       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$45)
    1631                      .dwattr $C$DW$173, DW_AT_name("stat_reg2")
    1632                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_stat_reg2")
    1633                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1634                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1635              
    1636              $C$DW$174       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$46)
    1638                      .dwattr $C$DW$174, DW_AT_name("cntrl_reg1")
    1639                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_cntrl_reg1")
    1640                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1641                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1642              
    1643              $C$DW$175       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$47)
    1645                      .dwattr $C$DW$175, DW_AT_name("cntrl_reg2")
    1646                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_cntrl_reg2")
    1647                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1648                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1649              
    1650              $C$DW$176       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$34)
    1652                      .dwattr $C$DW$176, DW_AT_name("readCntrl1")
    1653                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_readCntrl1")
    1654                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1655                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1656              
    1657              $C$DW$177       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$34)
    1659                      .dwattr $C$DW$177, DW_AT_name("readCntrl2")
    1660                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_readCntrl2")
    1661                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1662                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1663              
    1664              $C$DW$178       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$34)
    1666                      .dwattr $C$DW$178, DW_AT_name("DRV_fault")
    1667                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_DRV_fault")
    1668                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1669                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1670              
    1671                      .dwendtag $C$DW$T$48
    1672              
    1673              $C$DW$T$91      .dwtag  DW_TAG_typedef
    1674                      .dwattr $C$DW$T$91, DW_AT_name("DRV8301_Vars")
    1675                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$48)
    1676                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    1677              
    1678              
    1679              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    1680                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x15)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   32

    1681              $C$DW$179       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$34)
    1683                      .dwattr $C$DW$179, DW_AT_name("Rsvd0")
    1684                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_Rsvd0")
    1685                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1686                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1687              
    1688              $C$DW$180       .dwtag  DW_TAG_member
    1689                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$49)
    1690                      .dwattr $C$DW$180, DW_AT_name("status1_wwd")
    1691                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_status1_wwd")
    1692                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1693                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1694              
    1695              $C$DW$181       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$50)
    1697                      .dwattr $C$DW$181, DW_AT_name("status2_ov_vds")
    1698                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_status2_ov_vds")
    1699                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1700                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1701              
    1702              $C$DW$182       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$51)
    1704                      .dwattr $C$DW$182, DW_AT_name("status3_IC")
    1705                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_status3_IC")
    1706                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1707                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1708              
    1709              $C$DW$183       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$52)
    1711                      .dwattr $C$DW$183, DW_AT_name("status4_gd_Vgs")
    1712                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    1713                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1714                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1715              
    1716              $C$DW$184       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$53)
    1718                      .dwattr $C$DW$184, DW_AT_name("cntrl5_hs_gd")
    1719                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    1720                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1721                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1722              
    1723              $C$DW$185       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$54)
    1725                      .dwattr $C$DW$185, DW_AT_name("cntrl6_ls_gd")
    1726                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    1727                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1728                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1729              
    1730              $C$DW$186       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$55)
    1732                      .dwattr $C$DW$186, DW_AT_name("cntrl7_gd")
    1733                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_cntrl7_gd")
    1734                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1735                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:56 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   33

    1736              
    1737              $C$DW$187       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$34)
    1739                      .dwattr $C$DW$187, DW_AT_name("Rsvd8")
    1740                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_Rsvd8")
    1741                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1742                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1743              
    1744              $C$DW$188       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$56)
    1746                      .dwattr $C$DW$188, DW_AT_name("cntrl9_IC_ops")
    1747                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    1748                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1749                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1750              
    1751              $C$DW$189       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$57)
    1753                      .dwattr $C$DW$189, DW_AT_name("cntrlA_shunt_amp")
    1754                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    1755                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1756                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1757              
    1758              $C$DW$190       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$58)
    1760                      .dwattr $C$DW$190, DW_AT_name("cntrlB_Vreg")
    1761                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    1762                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1763                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1764              
    1765              $C$DW$191       .dwtag  DW_TAG_member
