TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:52 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/DRV830x_SPI.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("F28x_usDelay")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_F28x_usDelay")

     558 00000045 AABD          MOVL      *SP++,XAR2            ; [CPU_ALU] 
     559                      .dwcfi  save_reg_to_mem, 9, 4
     560                      .dwcfi  cfa_offset, -6
     561 00000046 FE02          ADDB      SP,#2                 ; [CPU_ARAU] 
     562                      .dwcfi  cfa_offset, -8
     563 00000047 86A4          MOVL      XAR2,XAR4             ; [CPU_ALU] |103| 
     564                      .dwpsn  file "../sources/DRV830x_SPI.c",line 26,column 1,is_stmt,isa 0
     565 00000048 D108          MOVB      XAR1,#8               ; [CPU_ALU] |26| 
     566 00000049 8A9A          MOVL      XAR4,*+XAR2[AR1]      ; [CPU_ALU] |26| 
     567                      .dwpsn  file "../sources/DRV830x_SPI.c",line 27,column 2,is_stmt,isa 0
     568 0000004a 5603          MOV       ACC,AL << #11         ; [CPU_ALU] |27| 
         0000004b 0BA9 
     569 0000004c D008          MOVB      XAR0,#8               ; [CPU_ALU] |27| 
     570 0000004d 1AA9          OR        AL,#0x8000            ; [CPU_ALU] |27| 
         0000004e 8000 
     571 0000004f 9694          MOV       *+XAR4[AR0],AL        ; [CPU_ALU] |27| 
     572 00000050       $C$L5:    
     573                      .dwpsn  file "../sources/DRV830x_SPI.c",line 28,column 8,is_stmt,isa 0
     574 00000050 46D4          TBIT      *+XAR4[2],#6          ; [CPU_ALU] |28| 
     575 00000051 6CFF          B         $C$L5,NTC             ; [CPU_ALU] |28| 
     576                      ; branchcc occurs ; [] |28| 
     577                      .dwpsn  file "../sources/DRV830x_SPI.c",line 29,column 2,is_stmt,isa 0
     578 00000052 92FC          MOV       AL,*+XAR4[7]          ; [CPU_ALU] |29| 
     579                      .dwpsn  file "../sources/DRV830x_SPI.c",line 111,column 2,is_stmt,isa 0
     580 00000053 9641          MOV       *-SP[1],AL            ; [CPU_ALU] |111| 
     581                      .dwpsn  file "../sources/DRV830x_SPI.c",line 112,column 2,is_stmt,isa 0
     582 00000054 0226          MOVB      ACC,#38               ; [CPU_ALU] |112| 
     583              $C$DW$46        .dwtag  DW_TAG_TI_branch
     584                      .dwattr $C$DW$46, DW_AT_low_pc(0x00)
     585                      .dwattr $C$DW$46, DW_AT_name("_F28x_usDelay")
     586                      .dwattr $C$DW$46, DW_AT_TI_call
     587              
     588 00000055 7640!         LCR       #_F28x_usDelay        ; [CPU_ALU] |112| 
         00000056 0000 
     589                      ; call occurs [#_F28x_usDelay] ; [] |112| 
     590                      .dwpsn  file "../sources/DRV830x_SPI.c",line 26,column 1,is_stmt,isa 0
     591 00000057 D108          MOVB      XAR1,#8               ; [CPU_ALU] |26| 
     592 00000058 8A9A          MOVL      XAR4,*+XAR2[AR1]      ; [CPU_ALU] |26| 
     593                      .dwpsn  file "../sources/DRV830x_SPI.c",line 27,column 2,is_stmt,isa 0
     594 00000059 D008          MOVB      XAR0,#8               ; [CPU_ALU] |27| 
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   12

     595 0000005a 2B94          MOV       *+XAR4[AR0],#0        ; [CPU_ALU] |27| 
     596 0000005b       $C$L6:    
     597                      .dwpsn  file "../sources/DRV830x_SPI.c",line 28,column 8,is_stmt,isa 0
     598 0000005b 46D4          TBIT      *+XAR4[2],#6          ; [CPU_ALU] |28| 
     599 0000005c 6CFF          B         $C$L6,NTC             ; [CPU_ALU] |28| 
     600                      ; branchcc occurs ; [] |28| 
     601                      .dwpsn  file "../sources/DRV830x_SPI.c",line 29,column 2,is_stmt,isa 0
     602 0000005d 92FC          MOV       AL,*+XAR4[7]          ; [CPU_ALU] |29| 
     603 0000005e FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
     604                      .dwcfi  cfa_offset, -6
     605 0000005f 86BE          MOVL      XAR2,*--SP            ; [CPU_ALU] 
     606                      .dwcfi  cfa_offset, -4
     607                      .dwcfi  restore_reg, 9
     608 00000060 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     609                      .dwcfi  cfa_offset, -2
     610                      .dwcfi  restore_reg, 7
     611              $C$DW$47        .dwtag  DW_TAG_TI_branch
     612                      .dwattr $C$DW$47, DW_AT_low_pc(0x00)
     613                      .dwattr $C$DW$47, DW_AT_TI_return
     614              
     615 00000061 0006          LRETR     ; [CPU_ALU] 
     616                      ; return occurs ; [] 
     617                      .dwattr $C$DW$36, DW_AT_TI_end_file("../sources/DRV830x_SPI.c")
     618                      .dwattr $C$DW$36, DW_AT_TI_end_line(0x72)
     619                      .dwattr $C$DW$36, DW_AT_TI_end_column(0x01)
     620                      .dwendentry
     621                      .dwendtag $C$DW$36
     622              
     623              ;**************************************************************
     624              ;* UNDEFINED EXTERNAL REFERENCES                              *
     625              ;**************************************************************
     626                      .global _F28x_usDelay
     627              
     628              ;***************************************************************
     629              ;* TYPE INFORMATION                                            *
     630              ;***************************************************************
     631              
     632              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     633                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     634              $C$DW$48        .dwtag  DW_TAG_member
     635                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     636                      .dwattr $C$DW$48, DW_AT_name("As")
     637                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_As")
     638                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     639                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     640              
     641              $C$DW$49        .dwtag  DW_TAG_member
     642                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     643                      .dwattr $C$DW$49, DW_AT_name("Bs")
     644                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_Bs")
     645                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     646                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     647              
     648              $C$DW$50        .dwtag  DW_TAG_member
     649                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   13

     650                      .dwattr $C$DW$50, DW_AT_name("Cs")
     651                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_Cs")
     652                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     653                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     654              
     655              $C$DW$51        .dwtag  DW_TAG_member
     656                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     657                      .dwattr $C$DW$51, DW_AT_name("Alpha")
     658                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_Alpha")
     659                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     660                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     661              
     662              $C$DW$52        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     664                      .dwattr $C$DW$52, DW_AT_name("Beta")
     665                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_Beta")
     666                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     667                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     668              
     669                      .dwendtag $C$DW$T$20
     670              
     671              $C$DW$T$77      .dwtag  DW_TAG_typedef
     672                      .dwattr $C$DW$T$77, DW_AT_name("CLARKE")
     673                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$20)
     674                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
     675              
     676              
     677              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     678                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     679              $C$DW$53        .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     681                      .dwattr $C$DW$53, DW_AT_name("Alpha")
     682                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_Alpha")
     683                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     684                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     685              
     686              $C$DW$54        .dwtag  DW_TAG_member
     687                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     688                      .dwattr $C$DW$54, DW_AT_name("Beta")
     689                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Beta")
     690                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     691                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     692              
     693              $C$DW$55        .dwtag  DW_TAG_member
     694                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     695                      .dwattr $C$DW$55, DW_AT_name("Angle")
     696                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_Angle")
     697                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     698                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     699              
     700              $C$DW$56        .dwtag  DW_TAG_member
     701                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     702                      .dwattr $C$DW$56, DW_AT_name("Ds")
     703                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_Ds")
     704                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   14

     705                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     706              
     707              $C$DW$57        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     709                      .dwattr $C$DW$57, DW_AT_name("Qs")
     710                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_Qs")
     711                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     712                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     713              
     714              $C$DW$58        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     716                      .dwattr $C$DW$58, DW_AT_name("Sine")
     717                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_Sine")
     718                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     719                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     720              
     721              $C$DW$59        .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     723                      .dwattr $C$DW$59, DW_AT_name("Cosine")
     724                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_Cosine")
     725                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     726                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     727              
     728                      .dwendtag $C$DW$T$21
     729              
     730              $C$DW$T$78      .dwtag  DW_TAG_typedef
     731                      .dwattr $C$DW$T$78, DW_AT_name("PARK")
     732                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$21)
     733                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
     734              
     735              
     736              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     737                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     738              $C$DW$60        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     740                      .dwattr $C$DW$60, DW_AT_name("Alpha")
     741                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Alpha")
     742                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     743                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     744              
     745              $C$DW$61        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     747                      .dwattr $C$DW$61, DW_AT_name("Beta")
     748                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Beta")
     749                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     750                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     751              
     752              $C$DW$62        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     754                      .dwattr $C$DW$62, DW_AT_name("Angle")
     755                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Angle")
     756                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     757                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     758              
     759              $C$DW$63        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   15

     760                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$63, DW_AT_name("Ds")
     762                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_Ds")
     763                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     764                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     765              
     766              $C$DW$64        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$64, DW_AT_name("Qs")
     769                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_Qs")
     770                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     771                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     772              
     773              $C$DW$65        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     775                      .dwattr $C$DW$65, DW_AT_name("Sine")
     776                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Sine")
     777                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     778                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     779              
     780              $C$DW$66        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     782                      .dwattr $C$DW$66, DW_AT_name("Cosine")
     783                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Cosine")
     784                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     785                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     786              
     787                      .dwendtag $C$DW$T$22
     788              
     789              $C$DW$T$79      .dwtag  DW_TAG_typedef
     790                      .dwattr $C$DW$T$79, DW_AT_name("IPARK")
     791                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$22)
     792                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
     793              
     794              
     795              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     796                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
     797              $C$DW$67        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     799                      .dwattr $C$DW$67, DW_AT_name("Ref")
     800                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Ref")
     801                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     803              
     804              $C$DW$68        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     806                      .dwattr $C$DW$68, DW_AT_name("Fdb")
     807                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Fdb")
     808                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     809                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     810              
     811              $C$DW$69        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     813                      .dwattr $C$DW$69, DW_AT_name("Err")
     814                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Err")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   16

     815                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     816                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     817              
     818              $C$DW$70        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     820                      .dwattr $C$DW$70, DW_AT_name("Kp")
     821                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_Kp")
     822                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     823                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     824              
     825              $C$DW$71        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     827                      .dwattr $C$DW$71, DW_AT_name("Up")
     828                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_Up")
     829                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     830                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     831              
     832              $C$DW$72        .dwtag  DW_TAG_member
     833                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     834                      .dwattr $C$DW$72, DW_AT_name("Ui")
     835                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_Ui")
     836                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     837                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     838              
     839              $C$DW$73        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     841                      .dwattr $C$DW$73, DW_AT_name("Ud")
     842                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_Ud")
     843                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     844                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     845              
     846              $C$DW$74        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$74, DW_AT_name("OutPreSat")
     849                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_OutPreSat")
     850                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     851                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     852              
     853              $C$DW$75        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     855                      .dwattr $C$DW$75, DW_AT_name("OutMax")
     856                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_OutMax")
     857                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     858                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     859              
     860              $C$DW$76        .dwtag  DW_TAG_member
     861                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     862                      .dwattr $C$DW$76, DW_AT_name("OutMin")
     863                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_OutMin")
     864                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     865                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     866              
     867              $C$DW$77        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     869                      .dwattr $C$DW$77, DW_AT_name("Out")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   17

     870                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Out")
     871                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     872                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     873              
     874              $C$DW$78        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     876                      .dwattr $C$DW$78, DW_AT_name("SatErr")
     877                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_SatErr")
     878                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     879                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     880              
     881              $C$DW$79        .dwtag  DW_TAG_member
     882                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     883                      .dwattr $C$DW$79, DW_AT_name("Ki")
     884                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_Ki")
     885                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     886                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     887              
     888              $C$DW$80        .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     890                      .dwattr $C$DW$80, DW_AT_name("Kc")
     891                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_Kc")
     892                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     893                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     894              
     895              $C$DW$81        .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     897                      .dwattr $C$DW$81, DW_AT_name("Kd")
     898                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_Kd")
     899                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     900                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     901              
     902              $C$DW$82        .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     904                      .dwattr $C$DW$82, DW_AT_name("Up1")
     905                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Up1")
     906                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     907                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     908              
     909                      .dwendtag $C$DW$T$23
     910              
     911              $C$DW$T$80      .dwtag  DW_TAG_typedef
     912                      .dwattr $C$DW$T$80, DW_AT_name("PIDREG3")
     913                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$23)
     914                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
     915              
     916              
     917              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     918                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x18)
     919              $C$DW$83        .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     921                      .dwattr $C$DW$83, DW_AT_name("Ref")
     922                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Ref")
     923                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     924                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   18

     925              
     926              $C$DW$84        .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     928                      .dwattr $C$DW$84, DW_AT_name("Fbk")
     929                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Fbk")
     930                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     931                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     932              
     933              $C$DW$85        .dwtag  DW_TAG_member
     934                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     935                      .dwattr $C$DW$85, DW_AT_name("Out")
     936                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Out")
     937                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     938                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     939              
     940              $C$DW$86        .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     942                      .dwattr $C$DW$86, DW_AT_name("Kp")
     943                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Kp")
     944                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     945                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     946              
     947              $C$DW$87        .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     949                      .dwattr $C$DW$87, DW_AT_name("Ki")
     950                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_Ki")
     951                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     952                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     953              
     954              $C$DW$88        .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     956                      .dwattr $C$DW$88, DW_AT_name("Umax")
     957                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_Umax")
     958                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     959                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     960              
     961              $C$DW$89        .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     963                      .dwattr $C$DW$89, DW_AT_name("Umin")
     964                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_Umin")
     965                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     966                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     967              
     968              $C$DW$90        .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$90, DW_AT_name("up")
     971                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_up")
     972                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     973                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     974              
     975              $C$DW$91        .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     977                      .dwattr $C$DW$91, DW_AT_name("ui")
     978                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ui")
     979                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   19

     980                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     981              
     982              $C$DW$92        .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     984                      .dwattr $C$DW$92, DW_AT_name("v1")
     985                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_v1")
     986                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     987                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     988              
     989              $C$DW$93        .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     991                      .dwattr $C$DW$93, DW_AT_name("i1")
     992                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_i1")
     993                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     994                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     995              
     996              $C$DW$94        .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     998                      .dwattr $C$DW$94, DW_AT_name("w1")
     999                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_w1")
    1000                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1001                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1002              
    1003                      .dwendtag $C$DW$T$24
    1004              
    1005              $C$DW$T$81      .dwtag  DW_TAG_typedef
    1006                      .dwattr $C$DW$T$81, DW_AT_name("PI_CONTROLLER")
    1007                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$24)
    1008                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1009              
    1010              
    1011              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1012                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
    1013              $C$DW$95        .dwtag  DW_TAG_member
    1014                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1015                      .dwattr $C$DW$95, DW_AT_name("Ref")
    1016                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_Ref")
    1017                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1018                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1019              
    1020              $C$DW$96        .dwtag  DW_TAG_member
    1021                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1022                      .dwattr $C$DW$96, DW_AT_name("Fbk")
    1023                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_Fbk")
    1024                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1025                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1026              
    1027              $C$DW$97        .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1029                      .dwattr $C$DW$97, DW_AT_name("Out")
    1030                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_Out")
    1031                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1032                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1033              
    1034              $C$DW$98        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   20

    1035                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1036                      .dwattr $C$DW$98, DW_AT_name("c1")
    1037                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_c1")
    1038                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1039                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1040              
    1041              $C$DW$99        .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1043                      .dwattr $C$DW$99, DW_AT_name("c2")
    1044                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_c2")
    1045                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1046                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1047              
    1048                      .dwendtag $C$DW$T$25
    1049              
    1050              $C$DW$T$28      .dwtag  DW_TAG_typedef
    1051                      .dwattr $C$DW$T$28, DW_AT_name("PID_TERMINALS")
    1052                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    1053                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1054              
    1055              
    1056              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1057                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0e)
    1058              $C$DW$100       .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1060                      .dwattr $C$DW$100, DW_AT_name("Kr")
    1061                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_Kr")
    1062                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1064              
    1065              $C$DW$101       .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1067                      .dwattr $C$DW$101, DW_AT_name("Kp")
    1068                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_Kp")
    1069                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1070                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1071              
    1072              $C$DW$102       .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1074                      .dwattr $C$DW$102, DW_AT_name("Ki")
    1075                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_Ki")
    1076                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1077                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1078              
    1079              $C$DW$103       .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1081                      .dwattr $C$DW$103, DW_AT_name("Kd")
    1082                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_Kd")
    1083                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1084                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1085              
    1086              $C$DW$104       .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1088                      .dwattr $C$DW$104, DW_AT_name("Km")
    1089                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_Km")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   21

    1090                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1091                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1092              
    1093              $C$DW$105       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1095                      .dwattr $C$DW$105, DW_AT_name("Umax")
    1096                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_Umax")
    1097                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1098                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1099              
    1100              $C$DW$106       .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$106, DW_AT_name("Umin")
    1103                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_Umin")
    1104                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1105                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1106              
    1107                      .dwendtag $C$DW$T$26
    1108              
    1109              $C$DW$T$29      .dwtag  DW_TAG_typedef
    1110                      .dwattr $C$DW$T$29, DW_AT_name("PID_PARAMETERS")
    1111                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    1112                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1113              
    1114              
    1115              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1116                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
    1117              $C$DW$107       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1119                      .dwattr $C$DW$107, DW_AT_name("up")
    1120                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_up")
    1121                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1123              
    1124              $C$DW$108       .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1126                      .dwattr $C$DW$108, DW_AT_name("ui")
    1127                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_ui")
    1128                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1129                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1130              
    1131              $C$DW$109       .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1133                      .dwattr $C$DW$109, DW_AT_name("ud")
    1134                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_ud")
    1135                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1136                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1137              
    1138              $C$DW$110       .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1140                      .dwattr $C$DW$110, DW_AT_name("v1")
    1141                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_v1")
    1142                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1143                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1144              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   22

    1145              $C$DW$111       .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1147                      .dwattr $C$DW$111, DW_AT_name("i1")
    1148                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_i1")
    1149                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1150                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1151              
    1152              $C$DW$112       .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1154                      .dwattr $C$DW$112, DW_AT_name("d1")
    1155                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_d1")
    1156                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1157                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1158              
    1159              $C$DW$113       .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1161                      .dwattr $C$DW$113, DW_AT_name("d2")
    1162                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_d2")
    1163                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1164                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1165              
    1166              $C$DW$114       .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1168                      .dwattr $C$DW$114, DW_AT_name("w1")
    1169                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_w1")
    1170                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1171                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1172              
    1173                      .dwendtag $C$DW$T$27
    1174              
    1175              $C$DW$T$30      .dwtag  DW_TAG_typedef
    1176                      .dwattr $C$DW$T$30, DW_AT_name("PID_DATA")
    1177                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
    1178                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1179              
    1180              
    1181              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1182                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x28)
    1183              $C$DW$115       .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$28)
    1185                      .dwattr $C$DW$115, DW_AT_name("term")
    1186                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_term")
    1187                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1188                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1189              
    1190              $C$DW$116       .dwtag  DW_TAG_member
    1191                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$29)
    1192                      .dwattr $C$DW$116, DW_AT_name("param")
    1193                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_param")
    1194                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1195                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1196              
    1197              $C$DW$117       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$30)
    1199                      .dwattr $C$DW$117, DW_AT_name("data")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   23

    1200                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_data")
    1201                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1202                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1203              
    1204                      .dwendtag $C$DW$T$31
    1205              
    1206              $C$DW$T$82      .dwtag  DW_TAG_typedef
    1207                      .dwattr $C$DW$T$82, DW_AT_name("PID_CONTROLLER")
    1208                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$31)
    1209                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1210              
    1211              
    1212              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1213                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x22)
    1214              $C$DW$118       .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$32)
    1216                      .dwattr $C$DW$118, DW_AT_name("Ref")
    1217                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_Ref")
    1218                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1219                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1220              
    1221              $C$DW$119       .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$32)
    1223                      .dwattr $C$DW$119, DW_AT_name("Fbk")
    1224                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_Fbk")
    1225                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1226                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1227              
    1228              $C$DW$120       .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$32)
    1230                      .dwattr $C$DW$120, DW_AT_name("Err")
    1231                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_Err")
    1232                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1233                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1234              
    1235              $C$DW$121       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$32)
    1237                      .dwattr $C$DW$121, DW_AT_name("xErr")
    1238                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_xErr")
    1239                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1240                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1241              
    1242              $C$DW$122       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$32)
    1244                      .dwattr $C$DW$122, DW_AT_name("Out")
    1245                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_Out")
    1246                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1247                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1248              
    1249              $C$DW$123       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$32)
    1251                      .dwattr $C$DW$123, DW_AT_name("CarryOver")
    1252                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_CarryOver")
    1253                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1254                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   24

    1255              
    1256              $C$DW$124       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$32)
    1258                      .dwattr $C$DW$124, DW_AT_name("Kp")
    1259                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_Kp")
    1260                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1261                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1262              
    1263              $C$DW$125       .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$32)
    1265                      .dwattr $C$DW$125, DW_AT_name("Ki")
    1266                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_Ki")
    1267                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1268                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1269              
    1270              $C$DW$126       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$32)
    1272                      .dwattr $C$DW$126, DW_AT_name("Kerr")
    1273                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_Kerr")
    1274                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1275                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1276              
    1277              $C$DW$127       .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$32)
    1279                      .dwattr $C$DW$127, DW_AT_name("Kxerr")
    1280                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_Kxerr")
    1281                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1282                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1283              
    1284              $C$DW$128       .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$32)
    1286                      .dwattr $C$DW$128, DW_AT_name("KerrOld")
    1287                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_KerrOld")
    1288                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1289                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1290              
    1291              $C$DW$129       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$32)
    1293                      .dwattr $C$DW$129, DW_AT_name("cosWTs")
    1294                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_cosWTs")
    1295                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1296                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1297              
    1298              $C$DW$130       .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$32)
    1300                      .dwattr $C$DW$130, DW_AT_name("sinWTs")
    1301                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_sinWTs")
    1302                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1303                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1304              
    1305              $C$DW$131       .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$32)
    1307                      .dwattr $C$DW$131, DW_AT_name("expVal")
    1308                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_expVal")
    1309                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   25

    1310                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1311              
    1312              $C$DW$132       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$32)
    1314                      .dwattr $C$DW$132, DW_AT_name("kDirect")
    1315                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_kDirect")
    1316                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1317                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1318              
    1319              $C$DW$133       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$32)
    1321                      .dwattr $C$DW$133, DW_AT_name("Umax")
    1322                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_Umax")
    1323                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1324                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1325              
    1326              $C$DW$134       .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$32)
    1328                      .dwattr $C$DW$134, DW_AT_name("Umin")
    1329                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_Umin")
    1330                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1331                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1332              
    1333                      .dwendtag $C$DW$T$33
    1334              
    1335              $C$DW$T$83      .dwtag  DW_TAG_typedef
    1336                      .dwattr $C$DW$T$83, DW_AT_name("CURRENT_CONTROLLER")
    1337                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
    1338                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1339              
    1340              
    1341              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1342                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x12)
    1343              $C$DW$135       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1345                      .dwattr $C$DW$135, DW_AT_name("Ualpha")
    1346                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_Ualpha")
    1347                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1349              
    1350              $C$DW$136       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1352                      .dwattr $C$DW$136, DW_AT_name("Ubeta")
    1353                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_Ubeta")
    1354                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1355                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1356              
    1357              $C$DW$137       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1359                      .dwattr $C$DW$137, DW_AT_name("Ta")
    1360                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_Ta")
    1361                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1362                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1363              
    1364              $C$DW$138       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   26

    1365                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1366                      .dwattr $C$DW$138, DW_AT_name("Tb")
    1367                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_Tb")
    1368                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1369                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1370              
    1371              $C$DW$139       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1373                      .dwattr $C$DW$139, DW_AT_name("Tc")
    1374                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_Tc")
    1375                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1376                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1377              
    1378              $C$DW$140       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1380                      .dwattr $C$DW$140, DW_AT_name("tmp1")
    1381                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_tmp1")
    1382                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1383                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1384              
    1385              $C$DW$141       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$141, DW_AT_name("tmp2")
    1388                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_tmp2")
    1389                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1390                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1391              
    1392              $C$DW$142       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$142, DW_AT_name("tmp3")
    1395                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_tmp3")
    1396                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1397                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1398              
    1399              $C$DW$143       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$34)
    1401                      .dwattr $C$DW$143, DW_AT_name("VecSector")
    1402                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_VecSector")
    1403                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1404                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1405              
    1406                      .dwendtag $C$DW$T$35
    1407              
    1408              $C$DW$T$85      .dwtag  DW_TAG_typedef
    1409                      .dwattr $C$DW$T$85, DW_AT_name("SVGEN")
    1410                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$35)
    1411                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1412              
    1413              
    1414              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1415                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    1416              $C$DW$144       .dwtag  DW_TAG_member
    1417                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1418                      .dwattr $C$DW$144, DW_AT_name("TargetValue")
    1419                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_TargetValue")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   27

    1420                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1421                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1422              
    1423              $C$DW$145       .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$36)
    1425                      .dwattr $C$DW$145, DW_AT_name("RampDelayMax")
    1426                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_RampDelayMax")
    1427                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1428                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1429              
    1430              $C$DW$146       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1432                      .dwattr $C$DW$146, DW_AT_name("RampLowLimit")
    1433                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_RampLowLimit")
    1434                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1435                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1436              
    1437              $C$DW$147       .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1439                      .dwattr $C$DW$147, DW_AT_name("RampHighLimit")
    1440                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_RampHighLimit")
    1441                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1442                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1443              
    1444              $C$DW$148       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$36)
    1446                      .dwattr $C$DW$148, DW_AT_name("RampDelayCount")
    1447                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_RampDelayCount")
    1448                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1449                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1450              
    1451              $C$DW$149       .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1453                      .dwattr $C$DW$149, DW_AT_name("SetpointValue")
    1454                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_SetpointValue")
    1455                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1456                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1457              
    1458              $C$DW$150       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$36)
    1460                      .dwattr $C$DW$150, DW_AT_name("EqualFlag")
    1461                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_EqualFlag")
    1462                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1463                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1464              
    1465              $C$DW$151       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1467                      .dwattr $C$DW$151, DW_AT_name("Tmp")
    1468                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Tmp")
    1469                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1470                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1471              
    1472                      .dwendtag $C$DW$T$37
    1473              
    1474              $C$DW$T$86      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   28

    1475                      .dwattr $C$DW$T$86, DW_AT_name("RMPCNTL")
    1476                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$37)
    1477                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1478              
    1479              
    1480              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1481                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
    1482              $C$DW$152       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1484                      .dwattr $C$DW$152, DW_AT_name("Freq")
    1485                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_Freq")
    1486                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1487                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1488              
    1489              $C$DW$153       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1491                      .dwattr $C$DW$153, DW_AT_name("StepAngleMax")
    1492                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_StepAngleMax")
    1493                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1494                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496              $C$DW$154       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1498                      .dwattr $C$DW$154, DW_AT_name("Angle")
    1499                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_Angle")
    1500                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1501                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1502              
    1503              $C$DW$155       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1505                      .dwattr $C$DW$155, DW_AT_name("Gain")
    1506                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_Gain")
    1507                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1508                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1509              
    1510              $C$DW$156       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$156, DW_AT_name("Out")
    1513                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_Out")
    1514                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1515                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1516              
    1517              $C$DW$157       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1519                      .dwattr $C$DW$157, DW_AT_name("Offset")
    1520                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_Offset")
    1521                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1522                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524                      .dwendtag $C$DW$T$38
    1525              
    1526              $C$DW$T$87      .dwtag  DW_TAG_typedef
    1527                      .dwattr $C$DW$T$87, DW_AT_name("RAMPGEN")
    1528                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$38)
    1529                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   29

    1530              
    1531              
    1532              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1533                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x16)
    1534              $C$DW$158       .dwtag  DW_TAG_member
    1535                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1536                      .dwattr $C$DW$158, DW_AT_name("DcBusVolt")
    1537                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_DcBusVolt")
    1538                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1539                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1540              
    1541              $C$DW$159       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1543                      .dwattr $C$DW$159, DW_AT_name("MfuncV1")
    1544                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_MfuncV1")
    1545                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1546                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1547              
    1548              $C$DW$160       .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1550                      .dwattr $C$DW$160, DW_AT_name("MfuncV2")
    1551                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_MfuncV2")
    1552                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1553                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1554              
    1555              $C$DW$161       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1557                      .dwattr $C$DW$161, DW_AT_name("MfuncV3")
    1558                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_MfuncV3")
    1559                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1560                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1561              
    1562              $C$DW$162       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$34)
    1564                      .dwattr $C$DW$162, DW_AT_name("OutOfPhase")
    1565                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_OutOfPhase")
    1566                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1567                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1568              
    1569              $C$DW$163       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1571                      .dwattr $C$DW$163, DW_AT_name("VphaseA")
    1572                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_VphaseA")
    1573                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1574                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1575              
    1576              $C$DW$164       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1578                      .dwattr $C$DW$164, DW_AT_name("VphaseB")
    1579                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_VphaseB")
    1580                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1581                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1582              
    1583              $C$DW$165       .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   30

    1585                      .dwattr $C$DW$165, DW_AT_name("VphaseC")
    1586                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_VphaseC")
    1587                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1588                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1589              
    1590              $C$DW$166       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1592                      .dwattr $C$DW$166, DW_AT_name("Valpha")
    1593                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_Valpha")
    1594                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1595                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1596              
    1597              $C$DW$167       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1599                      .dwattr $C$DW$167, DW_AT_name("Vbeta")
    1600                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_Vbeta")
    1601                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1602                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1603              
    1604              $C$DW$168       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1606                      .dwattr $C$DW$168, DW_AT_name("temp")
    1607                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_temp")
    1608                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1609                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1610              
    1611                      .dwendtag $C$DW$T$39
    1612              
    1613              $C$DW$T$88      .dwtag  DW_TAG_typedef
    1614                      .dwattr $C$DW$T$88, DW_AT_name("PHASEVOLTAGE")
    1615                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$39)
    1616                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1617              
    1618              
    1619              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1620                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x14)
    1621              $C$DW$169       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1623                      .dwattr $C$DW$169, DW_AT_name("ElecTheta")
    1624                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_ElecTheta")
    1625                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1626                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1627              
    1628              $C$DW$170       .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$36)
    1630                      .dwattr $C$DW$170, DW_AT_name("DirectionQep")
    1631                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_DirectionQep")
    1632                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1633                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1634              
    1635              $C$DW$171       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1637                      .dwattr $C$DW$171, DW_AT_name("OldElecTheta")
    1638                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_OldElecTheta")
    1639                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   31

    1640                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1641              
    1642              $C$DW$172       .dwtag  DW_TAG_member
    1643                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1644                      .dwattr $C$DW$172, DW_AT_name("Speed")
    1645                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_Speed")
    1646                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1647                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1648              
    1649              $C$DW$173       .dwtag  DW_TAG_member
    1650                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$36)
    1651                      .dwattr $C$DW$173, DW_AT_name("BaseRpm")
    1652                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_BaseRpm")
    1653                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1654                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1655              
    1656              $C$DW$174       .dwtag  DW_TAG_member
    1657                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$40)
    1658                      .dwattr $C$DW$174, DW_AT_name("K1")
    1659                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_K1")
    1660                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1661                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1662              
    1663              $C$DW$175       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1665                      .dwattr $C$DW$175, DW_AT_name("K2")
    1666                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_K2")
    1667                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1668                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1669              
    1670              $C$DW$176       .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1672                      .dwattr $C$DW$176, DW_AT_name("K3")
    1673                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_K3")
    1674                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1675                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1676              
    1677              $C$DW$177       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$41)
    1679                      .dwattr $C$DW$177, DW_AT_name("SpeedRpm")
    1680                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_SpeedRpm")
    1681                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1682                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1683              
    1684              $C$DW$178       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1686                      .dwattr $C$DW$178, DW_AT_name("Tmp")
    1687                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_Tmp")
    1688                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1689                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1690              
    1691                      .dwendtag $C$DW$T$42
    1692              
    1693              $C$DW$T$89      .dwtag  DW_TAG_typedef
    1694                      .dwattr $C$DW$T$89, DW_AT_name("SPEED_MEAS_QEP")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   32

    1695                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$42)
    1696                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1697              
    1698              
    1699              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1700                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x12)
    1701              $C$DW$179       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$32)
    1703                      .dwattr $C$DW$179, DW_AT_name("ElecTheta")
    1704                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ElecTheta")
    1705                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1706                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1707              
    1708              $C$DW$180       .dwtag  DW_TAG_member
    1709                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$32)
    1710                      .dwattr $C$DW$180, DW_AT_name("MechTheta")
    1711                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_MechTheta")
    1712                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1713                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1714              
    1715              $C$DW$181       .dwtag  DW_TAG_member
    1716                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$34)
    1717                      .dwattr $C$DW$181, DW_AT_name("DirectionQep")
    1718                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_DirectionQep")
    1719                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1720                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1721              
    1722              $C$DW$182       .dwtag  DW_TAG_member
    1723                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$34)
    1724                      .dwattr $C$DW$182, DW_AT_name("QepPeriod")
    1725                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_QepPeriod")
    1726                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1727                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1728              
    1729              $C$DW$183       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$36)
    1731                      .dwattr $C$DW$183, DW_AT_name("QepCountIndex")
    1732                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_QepCountIndex")
    1733                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1734                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1735              
    1736              $C$DW$184       .dwtag  DW_TAG_member
    1737                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$41)
    1738                      .dwattr $C$DW$184, DW_AT_name("RawTheta")
    1739                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_RawTheta")
    1740                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1741                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1742              
    1743              $C$DW$185       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$32)
    1745                      .dwattr $C$DW$185, DW_AT_name("MechScaler")
    1746                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_MechScaler")
    1747                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1748                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1749              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   33

    1750              $C$DW$186       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$34)
    1752                      .dwattr $C$DW$186, DW_AT_name("LineEncoder")
    1753                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_LineEncoder")
    1754                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1755                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1756              
    1757              $C$DW$187       .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$34)
    1759                      .dwattr $C$DW$187, DW_AT_name("PolePairs")
    1760                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PolePairs")
    1761                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1762                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1763              
    1764              $C$DW$188       .dwtag  DW_TAG_member
    1765                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$41)
    1766                      .dwattr $C$DW$188, DW_AT_name("CalibratedAngle")
    1767                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_CalibratedAngle")
    1768                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1769                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1770              
    1771              $C$DW$189       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$34)
    1773                      .dwattr $C$DW$189, DW_AT_name("IndexSyncFlag")
    1774                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_IndexSyncFlag")
    1775                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1776                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1777              
    1778                      .dwendtag $C$DW$T$43
    1779              
    1780              $C$DW$T$90      .dwtag  DW_TAG_typedef
    1781                      .dwattr $C$DW$T$90, DW_AT_name("QEP")
    1782                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$43)
    1783                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1784              
    1785              
    1786              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1787                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x07)
    1788              $C$DW$190       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$44)
    1790                      .dwattr $C$DW$190, DW_AT_name("stat_reg1")
    1791                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_stat_reg1")
    1792                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1793                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1794              
    1795              $C$DW$191       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$45)
    1797                      .dwattr $C$DW$191, DW_AT_name("stat_reg2")
    1798                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_stat_reg2")
    1799                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1800                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1801              
    1802              $C$DW$192       .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$46)
    1804                      .dwattr $C$DW$192, DW_AT_name("cntrl_reg1")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   34

    1805                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_cntrl_reg1")
    1806                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1807                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1808              
    1809              $C$DW$193       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$47)
    1811                      .dwattr $C$DW$193, DW_AT_name("cntrl_reg2")
    1812                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_cntrl_reg2")
    1813                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1814                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1815              
    1816              $C$DW$194       .dwtag  DW_TAG_member
    1817                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$34)
    1818                      .dwattr $C$DW$194, DW_AT_name("readCntrl1")
    1819                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_readCntrl1")
    1820                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1821                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1822              
    1823              $C$DW$195       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$34)
    1825                      .dwattr $C$DW$195, DW_AT_name("readCntrl2")
    1826                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_readCntrl2")
    1827                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1828                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1829              
    1830              $C$DW$196       .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$34)
    1832                      .dwattr $C$DW$196, DW_AT_name("DRV_fault")
    1833                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_DRV_fault")
    1834                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1835                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1836              
    1837                      .dwendtag $C$DW$T$48
    1838              
    1839              $C$DW$T$91      .dwtag  DW_TAG_typedef
    1840                      .dwattr $C$DW$T$91, DW_AT_name("DRV8301_Vars")
    1841                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$48)
    1842                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    1843              
    1844              
    1845              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    1846                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x15)
    1847              $C$DW$197       .dwtag  DW_TAG_member
    1848                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$34)
    1849                      .dwattr $C$DW$197, DW_AT_name("Rsvd0")
    1850                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_Rsvd0")
    1851                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1852                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1853              
    1854              $C$DW$198       .dwtag  DW_TAG_member
    1855                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$49)
    1856                      .dwattr $C$DW$198, DW_AT_name("status1_wwd")
    1857                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_status1_wwd")
    1858                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1859                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   35

    1860              
    1861              $C$DW$199       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$50)
    1863                      .dwattr $C$DW$199, DW_AT_name("status2_ov_vds")
    1864                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_status2_ov_vds")
    1865                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1866                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1867              
    1868              $C$DW$200       .dwtag  DW_TAG_member
    1869                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$51)
    1870                      .dwattr $C$DW$200, DW_AT_name("status3_IC")
    1871                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_status3_IC")
    1872                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1873                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1874              
    1875              $C$DW$201       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$52)
    1877                      .dwattr $C$DW$201, DW_AT_name("status4_gd_Vgs")
    1878                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    1879                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1880                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1881              
    1882              $C$DW$202       .dwtag  DW_TAG_member
    1883                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$53)
    1884                      .dwattr $C$DW$202, DW_AT_name("cntrl5_hs_gd")
    1885                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    1886                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1887                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1888              
    1889              $C$DW$203       .dwtag  DW_TAG_member
    1890                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$54)
    1891                      .dwattr $C$DW$203, DW_AT_name("cntrl6_ls_gd")
    1892                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    1893                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1894                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1895              
    1896              $C$DW$204       .dwtag  DW_TAG_member
    1897                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$55)
    1898                      .dwattr $C$DW$204, DW_AT_name("cntrl7_gd")
    1899                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_cntrl7_gd")
    1900                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1901                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1902              
    1903              $C$DW$205       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$34)
    1905                      .dwattr $C$DW$205, DW_AT_name("Rsvd8")
    1906                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_Rsvd8")
    1907                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1908                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1909              
    1910              $C$DW$206       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$56)
    1912                      .dwattr $C$DW$206, DW_AT_name("cntrl9_IC_ops")
    1913                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    1914                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   36

    1915                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1916              
    1917              $C$DW$207       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$57)
    1919                      .dwattr $C$DW$207, DW_AT_name("cntrlA_shunt_amp")
    1920                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    1921                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1922                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1923              
    1924              $C$DW$208       .dwtag  DW_TAG_member
    1925                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$58)
    1926                      .dwattr $C$DW$208, DW_AT_name("cntrlB_Vreg")
    1927                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_cntrlB_Vreg")
