TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:57 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/drv8305.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DRV8305_SPI_Write")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DRV8305_SPI_Write")

         00000151 05FF 
     771                      .dwpsn  file "../sources/drv8305.c",line 155,column 2,is_stmt,isa 0
     772 00000152 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |155| 
     773                      .dwpsn  file "../sources/drv8305.c",line 154,column 2,is_stmt,isa 0
     774 00000153 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |154| 
     775                      .dwpsn  file "../sources/drv8305.c",line 155,column 2,is_stmt,isa 0
     776 00000154 9A02          MOVB      AL,#2                 ; [CPU_ALU] |155| 
     777              $C$DW$41        .dwtag  DW_TAG_TI_branch
     778                      .dwattr $C$DW$41, DW_AT_low_pc(0x00)
     779                      .dwattr $C$DW$41, DW_AT_name("_DRV8305_SPI_Read")
     780                      .dwattr $C$DW$41, DW_AT_TI_call
     781              
     782 00000155 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |155| 
         00000156 0000 
     783                      ; call occurs [#_DRV8305_SPI_Read] ; [] |155| 
     784 00000157 8D00          MOVL      XAR0,#381             ; [CPU_ALU] |155| 
         00000158 017D 
     785 00000159 CCA9          AND       AL,AL,#0x07e7         ; [CPU_ALU] |155| 
         0000015a 07E7 
     786                      .dwpsn  file "../sources/drv8305.c",line 156,column 2,is_stmt,isa 0
     787 0000015b 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |156| 
     788                      .dwpsn  file "../sources/drv8305.c",line 155,column 2,is_stmt,isa 0
     789 0000015c 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |155| 
     790                      .dwpsn  file "../sources/drv8305.c",line 156,column 2,is_stmt,isa 0
     791 0000015d 9A03          MOVB      AL,#3                 ; [CPU_ALU] |156| 
     792              $C$DW$42        .dwtag  DW_TAG_TI_branch
     793                      .dwattr $C$DW$42, DW_AT_low_pc(0x00)
     794                      .dwattr $C$DW$42, DW_AT_name("_DRV8305_SPI_Read")
     795                      .dwattr $C$DW$42, DW_AT_TI_call
     796              
     797 0000015e 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |156| 
         0000015f 0000 
     798                      ; call occurs [#_DRV8305_SPI_Read] ; [] |156| 
     799 00000160 8D00          MOVL      XAR0,#382             ; [CPU_ALU] |156| 
         00000161 017E 
     800 00000162 CCA9          AND       AL,AL,#0x0777         ; [CPU_ALU] |156| 
         00000163 0777 
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   17

     801                      .dwpsn  file "../sources/drv8305.c",line 157,column 2,is_stmt,isa 0
     802 00000164 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |157| 
     803                      .dwpsn  file "../sources/drv8305.c",line 156,column 2,is_stmt,isa 0
     804 00000165 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |156| 
     805                      .dwpsn  file "../sources/drv8305.c",line 157,column 2,is_stmt,isa 0
     806 00000166 9A04          MOVB      AL,#4                 ; [CPU_ALU] |157| 
     807              $C$DW$43        .dwtag  DW_TAG_TI_branch
     808                      .dwattr $C$DW$43, DW_AT_low_pc(0x00)
     809                      .dwattr $C$DW$43, DW_AT_name("_DRV8305_SPI_Read")
     810                      .dwattr $C$DW$43, DW_AT_TI_call
     811              
     812 00000167 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |157| 
         00000168 0000 
     813                      ; call occurs [#_DRV8305_SPI_Read] ; [] |157| 
     814 00000169 8D00          MOVL      XAR0,#383             ; [CPU_ALU] |157| 
         0000016a 017F 
     815 0000016b CCA9          AND       AL,AL,#0x07e0         ; [CPU_ALU] |157| 
         0000016c 07E0 
     816 0000016d 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |157| 
     817 0000016e 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     818                      .dwcfi  cfa_offset, -2
     819                      .dwcfi  restore_reg, 7
     820              $C$DW$44        .dwtag  DW_TAG_TI_branch
     821                      .dwattr $C$DW$44, DW_AT_low_pc(0x00)
     822                      .dwattr $C$DW$44, DW_AT_TI_return
     823              
     824 0000016f 0006          LRETR     ; [CPU_ALU] 
     825                      ; return occurs ; [] 
     826                      .dwattr $C$DW$37, DW_AT_TI_end_file("../sources/drv8305.c")
     827                      .dwattr $C$DW$37, DW_AT_TI_end_line(0xb4)
     828                      .dwattr $C$DW$37, DW_AT_TI_end_column(0x01)
     829                      .dwendentry
     830                      .dwendtag $C$DW$37
     831              
     832              ;**************************************************************
     833              ;* UNDEFINED EXTERNAL REFERENCES                              *
     834              ;**************************************************************
     835                      .global _DRV8305_SPI_Write
     836                      .global _DRV8305_SPI_Read
     837              
     838              ;***************************************************************
     839              ;* TYPE INFORMATION                                            *
     840              ;***************************************************************
     841              
     842              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     843                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     844              $C$DW$45        .dwtag  DW_TAG_member
     845                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     846                      .dwattr $C$DW$45, DW_AT_name("As")
     847                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_As")
     848                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     849                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     850              
     851              $C$DW$46        .dwtag  DW_TAG_member
     852                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   18

     853                      .dwattr $C$DW$46, DW_AT_name("Bs")
     854                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_Bs")
     855                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     856                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     857              
     858              $C$DW$47        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     860                      .dwattr $C$DW$47, DW_AT_name("Cs")
     861                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_Cs")
     862                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     863                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     864              
     865              $C$DW$48        .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     867                      .dwattr $C$DW$48, DW_AT_name("Alpha")
     868                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_Alpha")
     869                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     870                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     871              
     872              $C$DW$49        .dwtag  DW_TAG_member
     873                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     874                      .dwattr $C$DW$49, DW_AT_name("Beta")
     875                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_Beta")
     876                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     877                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     878              
     879                      .dwendtag $C$DW$T$20
     880              
     881              $C$DW$T$77      .dwtag  DW_TAG_typedef
     882                      .dwattr $C$DW$T$77, DW_AT_name("CLARKE")
     883                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$20)
     884                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
     885              
     886              
     887              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     888                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     889              $C$DW$50        .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     891                      .dwattr $C$DW$50, DW_AT_name("Alpha")
     892                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_Alpha")
     893                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     894                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     895              
     896              $C$DW$51        .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     898                      .dwattr $C$DW$51, DW_AT_name("Beta")
     899                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_Beta")
     900                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     901                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     902              
     903              $C$DW$52        .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     905                      .dwattr $C$DW$52, DW_AT_name("Angle")
     906                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_Angle")
     907                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   19

     908                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     909              
     910              $C$DW$53        .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     912                      .dwattr $C$DW$53, DW_AT_name("Ds")
     913                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_Ds")
     914                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     915                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     916              
     917              $C$DW$54        .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     919                      .dwattr $C$DW$54, DW_AT_name("Qs")
     920                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Qs")
     921                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     922                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     923              
     924              $C$DW$55        .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     926                      .dwattr $C$DW$55, DW_AT_name("Sine")
     927                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_Sine")
     928                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     929                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     930              
     931              $C$DW$56        .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     933                      .dwattr $C$DW$56, DW_AT_name("Cosine")
     934                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_Cosine")
     935                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     936                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     937              
     938                      .dwendtag $C$DW$T$21
     939              
     940              $C$DW$T$78      .dwtag  DW_TAG_typedef
     941                      .dwattr $C$DW$T$78, DW_AT_name("PARK")
     942                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$21)
     943                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
     944              
     945              
     946              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     947                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     948              $C$DW$57        .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     950                      .dwattr $C$DW$57, DW_AT_name("Alpha")
     951                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_Alpha")
     952                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     953                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     954              
     955              $C$DW$58        .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     957                      .dwattr $C$DW$58, DW_AT_name("Beta")
     958                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_Beta")
     959                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     960                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     961              
     962              $C$DW$59        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   20

     963                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     964                      .dwattr $C$DW$59, DW_AT_name("Angle")
     965                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_Angle")
     966                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     967                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     968              
     969              $C$DW$60        .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     971                      .dwattr $C$DW$60, DW_AT_name("Ds")
     972                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Ds")
     973                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     974                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     975              
     976              $C$DW$61        .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     978                      .dwattr $C$DW$61, DW_AT_name("Qs")
     979                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Qs")
     980                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     981                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     982              
     983              $C$DW$62        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$62, DW_AT_name("Sine")
     986                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Sine")
     987                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     988                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     989              
     990              $C$DW$63        .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     992                      .dwattr $C$DW$63, DW_AT_name("Cosine")
     993                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_Cosine")
     994                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     995                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     996              
     997                      .dwendtag $C$DW$T$22
     998              
     999              $C$DW$T$79      .dwtag  DW_TAG_typedef
    1000                      .dwattr $C$DW$T$79, DW_AT_name("IPARK")
    1001                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$22)
    1002                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1003              
    1004              
    1005              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1006                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    1007              $C$DW$64        .dwtag  DW_TAG_member
    1008                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1009                      .dwattr $C$DW$64, DW_AT_name("Ref")
    1010                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_Ref")
    1011                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1012                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1013              
    1014              $C$DW$65        .dwtag  DW_TAG_member
    1015                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1016                      .dwattr $C$DW$65, DW_AT_name("Fdb")
    1017                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Fdb")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   21

    1018                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1019                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1020              
    1021              $C$DW$66        .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1023                      .dwattr $C$DW$66, DW_AT_name("Err")
    1024                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Err")
    1025                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1026                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1027              
    1028              $C$DW$67        .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1030                      .dwattr $C$DW$67, DW_AT_name("Kp")
    1031                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Kp")
    1032                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1033                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1034              
    1035              $C$DW$68        .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1037                      .dwattr $C$DW$68, DW_AT_name("Up")
    1038                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Up")
    1039                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1040                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1041              
    1042              $C$DW$69        .dwtag  DW_TAG_member
    1043                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1044                      .dwattr $C$DW$69, DW_AT_name("Ui")
    1045                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Ui")
    1046                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1047                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1048              
    1049              $C$DW$70        .dwtag  DW_TAG_member
    1050                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1051                      .dwattr $C$DW$70, DW_AT_name("Ud")
    1052                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_Ud")
    1053                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1054                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1055              
    1056              $C$DW$71        .dwtag  DW_TAG_member
    1057                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1058                      .dwattr $C$DW$71, DW_AT_name("OutPreSat")
    1059                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_OutPreSat")
    1060                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1061                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1062              
    1063              $C$DW$72        .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1065                      .dwattr $C$DW$72, DW_AT_name("OutMax")
    1066                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_OutMax")
    1067                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1068                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1069              
    1070              $C$DW$73        .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1072                      .dwattr $C$DW$73, DW_AT_name("OutMin")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   22

    1073                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_OutMin")
    1074                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1075                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1076              
    1077              $C$DW$74        .dwtag  DW_TAG_member
    1078                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1079                      .dwattr $C$DW$74, DW_AT_name("Out")
    1080                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_Out")
    1081                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1082                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1083              
    1084              $C$DW$75        .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1086                      .dwattr $C$DW$75, DW_AT_name("SatErr")
    1087                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_SatErr")
    1088                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1089                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1090              
    1091              $C$DW$76        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$76, DW_AT_name("Ki")
    1094                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Ki")
    1095                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1096                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1097              
    1098              $C$DW$77        .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1100                      .dwattr $C$DW$77, DW_AT_name("Kc")
    1101                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Kc")
    1102                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1103                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1104              
    1105              $C$DW$78        .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1107                      .dwattr $C$DW$78, DW_AT_name("Kd")
    1108                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Kd")
    1109                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1110                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1111              
    1112              $C$DW$79        .dwtag  DW_TAG_member
    1113                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1114                      .dwattr $C$DW$79, DW_AT_name("Up1")
    1115                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_Up1")
    1116                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1117                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1118              
    1119                      .dwendtag $C$DW$T$23
    1120              
    1121              $C$DW$T$80      .dwtag  DW_TAG_typedef
    1122                      .dwattr $C$DW$T$80, DW_AT_name("PIDREG3")
    1123                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$23)
    1124                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1125              
    1126              
    1127              $C$DW$T$24      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   23

    1128                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x18)
    1129              $C$DW$80        .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1131                      .dwattr $C$DW$80, DW_AT_name("Ref")
    1132                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_Ref")
    1133                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1135              
    1136              $C$DW$81        .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1138                      .dwattr $C$DW$81, DW_AT_name("Fbk")
    1139                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_Fbk")
    1140                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1141                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1142              
    1143              $C$DW$82        .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1145                      .dwattr $C$DW$82, DW_AT_name("Out")
    1146                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Out")
    1147                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1148                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1149              
    1150              $C$DW$83        .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1152                      .dwattr $C$DW$83, DW_AT_name("Kp")
    1153                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Kp")
    1154                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1155                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1156              
    1157              $C$DW$84        .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1159                      .dwattr $C$DW$84, DW_AT_name("Ki")
    1160                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Ki")
    1161                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1162                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1163              
    1164              $C$DW$85        .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1166                      .dwattr $C$DW$85, DW_AT_name("Umax")
    1167                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Umax")
    1168                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1169                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1170              
    1171              $C$DW$86        .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$86, DW_AT_name("Umin")
    1174                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Umin")
    1175                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1176                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1177              
    1178              $C$DW$87        .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1180                      .dwattr $C$DW$87, DW_AT_name("up")
    1181                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_up")
    1182                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   24

    1183                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1184              
    1185              $C$DW$88        .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1187                      .dwattr $C$DW$88, DW_AT_name("ui")
    1188                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ui")
    1189                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1190                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1191              
    1192              $C$DW$89        .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1194                      .dwattr $C$DW$89, DW_AT_name("v1")
    1195                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_v1")
    1196                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1197                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1198              
    1199              $C$DW$90        .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1201                      .dwattr $C$DW$90, DW_AT_name("i1")
    1202                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_i1")
    1203                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1204                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1205              
    1206              $C$DW$91        .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1208                      .dwattr $C$DW$91, DW_AT_name("w1")
    1209                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_w1")
    1210                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1211                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1212              
    1213                      .dwendtag $C$DW$T$24
    1214              
    1215              $C$DW$T$81      .dwtag  DW_TAG_typedef
    1216                      .dwattr $C$DW$T$81, DW_AT_name("PI_CONTROLLER")
    1217                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$24)
    1218                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1219              
    1220              
    1221              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1222                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
    1223              $C$DW$92        .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1225                      .dwattr $C$DW$92, DW_AT_name("Ref")
    1226                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_Ref")
    1227                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1229              
    1230              $C$DW$93        .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1232                      .dwattr $C$DW$93, DW_AT_name("Fbk")
    1233                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_Fbk")
    1234                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1235                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1236              
    1237              $C$DW$94        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   25

    1238                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1239                      .dwattr $C$DW$94, DW_AT_name("Out")
    1240                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_Out")
    1241                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1242                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1243              
    1244              $C$DW$95        .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1246                      .dwattr $C$DW$95, DW_AT_name("c1")
    1247                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_c1")
    1248                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1249                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1250              
    1251              $C$DW$96        .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1253                      .dwattr $C$DW$96, DW_AT_name("c2")
    1254                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_c2")
    1255                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1256                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1257              
    1258                      .dwendtag $C$DW$T$25
    1259              
    1260              $C$DW$T$28      .dwtag  DW_TAG_typedef
    1261                      .dwattr $C$DW$T$28, DW_AT_name("PID_TERMINALS")
    1262                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    1263                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1264              
    1265              
    1266              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1267                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0e)
    1268              $C$DW$97        .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1270                      .dwattr $C$DW$97, DW_AT_name("Kr")
    1271                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_Kr")
    1272                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1274              
    1275              $C$DW$98        .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1277                      .dwattr $C$DW$98, DW_AT_name("Kp")
    1278                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_Kp")
    1279                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1280                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1281              
    1282              $C$DW$99        .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1284                      .dwattr $C$DW$99, DW_AT_name("Ki")
    1285                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_Ki")
    1286                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1287                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1288              
    1289              $C$DW$100       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1291                      .dwattr $C$DW$100, DW_AT_name("Kd")
    1292                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_Kd")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   26

    1293                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1294                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1295              
    1296              $C$DW$101       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1298                      .dwattr $C$DW$101, DW_AT_name("Km")
    1299                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_Km")
    1300                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1301                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1302              
    1303              $C$DW$102       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1305                      .dwattr $C$DW$102, DW_AT_name("Umax")
    1306                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_Umax")
    1307                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1308                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1309              
    1310              $C$DW$103       .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1312                      .dwattr $C$DW$103, DW_AT_name("Umin")
    1313                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_Umin")
    1314                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1315                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1316              
    1317                      .dwendtag $C$DW$T$26
    1318              
    1319              $C$DW$T$29      .dwtag  DW_TAG_typedef
    1320                      .dwattr $C$DW$T$29, DW_AT_name("PID_PARAMETERS")
    1321                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    1322                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1323              
    1324              
    1325              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1326                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
    1327              $C$DW$104       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$104, DW_AT_name("up")
    1330                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_up")
    1331                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1333              
    1334              $C$DW$105       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1336                      .dwattr $C$DW$105, DW_AT_name("ui")
    1337                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ui")
    1338                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1339                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1340              
    1341              $C$DW$106       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$106, DW_AT_name("ud")
    1344                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_ud")
    1345                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1346                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1347              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   27

    1348              $C$DW$107       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$107, DW_AT_name("v1")
    1351                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_v1")
    1352                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1353                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1354              
    1355              $C$DW$108       .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1357                      .dwattr $C$DW$108, DW_AT_name("i1")
    1358                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_i1")
    1359                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1360                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1361              
    1362              $C$DW$109       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1364                      .dwattr $C$DW$109, DW_AT_name("d1")
    1365                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_d1")
    1366                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1367                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1368              
    1369              $C$DW$110       .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1371                      .dwattr $C$DW$110, DW_AT_name("d2")
    1372                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_d2")
    1373                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1374                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1375              
    1376              $C$DW$111       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1378                      .dwattr $C$DW$111, DW_AT_name("w1")
    1379                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_w1")
    1380                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1381                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1382              
    1383                      .dwendtag $C$DW$T$27
    1384              
    1385              $C$DW$T$30      .dwtag  DW_TAG_typedef
    1386                      .dwattr $C$DW$T$30, DW_AT_name("PID_DATA")
    1387                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
    1388                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1389              
    1390              
    1391              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1392                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x28)
    1393              $C$DW$112       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$28)
    1395                      .dwattr $C$DW$112, DW_AT_name("term")
    1396                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_term")
    1397                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1399              
    1400              $C$DW$113       .dwtag  DW_TAG_member
    1401                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$29)
    1402                      .dwattr $C$DW$113, DW_AT_name("param")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   28

    1403                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_param")
    1404                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1405                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1406              
    1407              $C$DW$114       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$30)
    1409                      .dwattr $C$DW$114, DW_AT_name("data")
    1410                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_data")
    1411                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1412                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1413              
    1414                      .dwendtag $C$DW$T$31
    1415              
    1416              $C$DW$T$82      .dwtag  DW_TAG_typedef
    1417                      .dwattr $C$DW$T$82, DW_AT_name("PID_CONTROLLER")
    1418                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$31)
    1419                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1420              
    1421              
    1422              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1423                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x22)
    1424              $C$DW$115       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$32)
    1426                      .dwattr $C$DW$115, DW_AT_name("Ref")
    1427                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_Ref")
    1428                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1429                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1430              
    1431              $C$DW$116       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$32)
    1433                      .dwattr $C$DW$116, DW_AT_name("Fbk")
    1434                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_Fbk")
    1435                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1436                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1437              
    1438              $C$DW$117       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$32)
    1440                      .dwattr $C$DW$117, DW_AT_name("Err")
    1441                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_Err")
    1442                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1443                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1444              
    1445              $C$DW$118       .dwtag  DW_TAG_member
    1446                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$32)
    1447                      .dwattr $C$DW$118, DW_AT_name("xErr")
    1448                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_xErr")
    1449                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1450                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1451              
    1452              $C$DW$119       .dwtag  DW_TAG_member
    1453                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$32)
    1454                      .dwattr $C$DW$119, DW_AT_name("Out")
    1455                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_Out")
    1456                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1457                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   29

    1458              
    1459              $C$DW$120       .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$32)
    1461                      .dwattr $C$DW$120, DW_AT_name("CarryOver")
    1462                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_CarryOver")
    1463                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1464                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1465              
    1466              $C$DW$121       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$32)
    1468                      .dwattr $C$DW$121, DW_AT_name("Kp")
    1469                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_Kp")
    1470                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1471                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1472              
    1473              $C$DW$122       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$32)
    1475                      .dwattr $C$DW$122, DW_AT_name("Ki")
    1476                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_Ki")
    1477                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1478                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1479              
    1480              $C$DW$123       .dwtag  DW_TAG_member
    1481                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$32)
    1482                      .dwattr $C$DW$123, DW_AT_name("Kerr")
    1483                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_Kerr")
    1484                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1485                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1486              
    1487              $C$DW$124       .dwtag  DW_TAG_member
    1488                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$32)
    1489                      .dwattr $C$DW$124, DW_AT_name("Kxerr")
    1490                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_Kxerr")
    1491                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1492                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1493              
    1494              $C$DW$125       .dwtag  DW_TAG_member
    1495                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$32)
    1496                      .dwattr $C$DW$125, DW_AT_name("KerrOld")
    1497                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_KerrOld")
    1498                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1499                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1500              
    1501              $C$DW$126       .dwtag  DW_TAG_member
    1502                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$32)
    1503                      .dwattr $C$DW$126, DW_AT_name("cosWTs")
    1504                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_cosWTs")
    1505                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1506                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1507              
    1508              $C$DW$127       .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$32)
    1510                      .dwattr $C$DW$127, DW_AT_name("sinWTs")
    1511                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_sinWTs")
    1512                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   30

    1513                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1514              
    1515              $C$DW$128       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$32)
    1517                      .dwattr $C$DW$128, DW_AT_name("expVal")
    1518                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_expVal")
    1519                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1520                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1521              
    1522              $C$DW$129       .dwtag  DW_TAG_member
    1523                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$32)
    1524                      .dwattr $C$DW$129, DW_AT_name("kDirect")
    1525                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_kDirect")
    1526                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1527                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1528              
    1529              $C$DW$130       .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$32)
    1531                      .dwattr $C$DW$130, DW_AT_name("Umax")
    1532                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_Umax")
    1533                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1534                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1535              
    1536              $C$DW$131       .dwtag  DW_TAG_member
    1537                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$32)
    1538                      .dwattr $C$DW$131, DW_AT_name("Umin")
    1539                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_Umin")
    1540                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1541                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1542              
    1543                      .dwendtag $C$DW$T$33
    1544              
    1545              $C$DW$T$83      .dwtag  DW_TAG_typedef
    1546                      .dwattr $C$DW$T$83, DW_AT_name("CURRENT_CONTROLLER")
    1547                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
    1548                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1549              
    1550              
    1551              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1552                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x12)
    1553              $C$DW$132       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1555                      .dwattr $C$DW$132, DW_AT_name("Ualpha")
    1556                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_Ualpha")
    1557                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1559              
    1560              $C$DW$133       .dwtag  DW_TAG_member
    1561                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1562                      .dwattr $C$DW$133, DW_AT_name("Ubeta")
    1563                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_Ubeta")
    1564                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1565                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1566              
    1567              $C$DW$134       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   31

    1568                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1569                      .dwattr $C$DW$134, DW_AT_name("Ta")
    1570                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_Ta")
    1571                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1572                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1573              
    1574              $C$DW$135       .dwtag  DW_TAG_member
    1575                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1576                      .dwattr $C$DW$135, DW_AT_name("Tb")
    1577                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_Tb")
    1578                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1579                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1580              
    1581              $C$DW$136       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1583                      .dwattr $C$DW$136, DW_AT_name("Tc")
    1584                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_Tc")
    1585                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1586                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1587              
    1588              $C$DW$137       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1590                      .dwattr $C$DW$137, DW_AT_name("tmp1")
    1591                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_tmp1")
    1592                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1593                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1594              
    1595              $C$DW$138       .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1597                      .dwattr $C$DW$138, DW_AT_name("tmp2")
    1598                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_tmp2")
    1599                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1600                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1601              
    1602              $C$DW$139       .dwtag  DW_TAG_member
    1603                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1604                      .dwattr $C$DW$139, DW_AT_name("tmp3")
    1605                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_tmp3")
    1606                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1607                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1608              
    1609              $C$DW$140       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$34)
    1611                      .dwattr $C$DW$140, DW_AT_name("VecSector")
    1612                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_VecSector")
    1613                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1614                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1615              
    1616                      .dwendtag $C$DW$T$35
    1617              
    1618              $C$DW$T$85      .dwtag  DW_TAG_typedef
    1619                      .dwattr $C$DW$T$85, DW_AT_name("SVGEN")
    1620                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$35)
    1621                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1622              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   32

    1623              
    1624              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1625                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    1626              $C$DW$141       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1628                      .dwattr $C$DW$141, DW_AT_name("TargetValue")
    1629                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_TargetValue")
    1630                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1631                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1632              
    1633              $C$DW$142       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$36)
    1635                      .dwattr $C$DW$142, DW_AT_name("RampDelayMax")
    1636                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_RampDelayMax")
    1637                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1638                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1639              
    1640              $C$DW$143       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1642                      .dwattr $C$DW$143, DW_AT_name("RampLowLimit")
    1643                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_RampLowLimit")
    1644                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1645                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1646              
    1647              $C$DW$144       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1649                      .dwattr $C$DW$144, DW_AT_name("RampHighLimit")
    1650                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_RampHighLimit")
    1651                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1652                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1653              
    1654              $C$DW$145       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$36)
    1656                      .dwattr $C$DW$145, DW_AT_name("RampDelayCount")
    1657                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_RampDelayCount")
    1658                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1659                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1660              
    1661              $C$DW$146       .dwtag  DW_TAG_member
    1662                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1663                      .dwattr $C$DW$146, DW_AT_name("SetpointValue")
    1664                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_SetpointValue")
    1665                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1666                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1667              
    1668              $C$DW$147       .dwtag  DW_TAG_member
    1669                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$36)
    1670                      .dwattr $C$DW$147, DW_AT_name("EqualFlag")
    1671                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_EqualFlag")
    1672                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1673                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1674              
    1675              $C$DW$148       .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1677                      .dwattr $C$DW$148, DW_AT_name("Tmp")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   33

    1678                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_Tmp")
    1679                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1680                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1681              
    1682                      .dwendtag $C$DW$T$37
    1683              
    1684              $C$DW$T$86      .dwtag  DW_TAG_typedef
    1685                      .dwattr $C$DW$T$86, DW_AT_name("RMPCNTL")
    1686                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$37)
    1687                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1688              
    1689              
    1690              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1691                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
    1692              $C$DW$149       .dwtag  DW_TAG_member
    1693                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1694                      .dwattr $C$DW$149, DW_AT_name("Freq")
    1695                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_Freq")
    1696                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1698              
    1699              $C$DW$150       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1701                      .dwattr $C$DW$150, DW_AT_name("StepAngleMax")
    1702                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_StepAngleMax")
    1703                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1704                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1705              
    1706              $C$DW$151       .dwtag  DW_TAG_member
    1707                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1708                      .dwattr $C$DW$151, DW_AT_name("Angle")
    1709                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Angle")
    1710                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1711                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1712              
    1713              $C$DW$152       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1715                      .dwattr $C$DW$152, DW_AT_name("Gain")
    1716                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_Gain")
    1717                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1718                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1719              
    1720              $C$DW$153       .dwtag  DW_TAG_member
    1721                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1722                      .dwattr $C$DW$153, DW_AT_name("Out")
    1723                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_Out")
    1724                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1725                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1726              
    1727              $C$DW$154       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1729                      .dwattr $C$DW$154, DW_AT_name("Offset")
    1730                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_Offset")
    1731                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1732                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   34

    1733              
    1734                      .dwendtag $C$DW$T$38
    1735              
    1736              $C$DW$T$87      .dwtag  DW_TAG_typedef
    1737                      .dwattr $C$DW$T$87, DW_AT_name("RAMPGEN")
    1738                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$38)
    1739                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1740              
    1741              
    1742              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1743                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x16)
    1744              $C$DW$155       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1746                      .dwattr $C$DW$155, DW_AT_name("DcBusVolt")
    1747                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_DcBusVolt")
    1748                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1750              
    1751              $C$DW$156       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1753                      .dwattr $C$DW$156, DW_AT_name("MfuncV1")
    1754                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_MfuncV1")
    1755                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1756                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1757              
    1758              $C$DW$157       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1760                      .dwattr $C$DW$157, DW_AT_name("MfuncV2")
    1761                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_MfuncV2")
    1762                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1763                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1764              
    1765              $C$DW$158       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1767                      .dwattr $C$DW$158, DW_AT_name("MfuncV3")
    1768                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_MfuncV3")
    1769                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1770                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1771              
    1772              $C$DW$159       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$34)
    1774                      .dwattr $C$DW$159, DW_AT_name("OutOfPhase")
    1775                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_OutOfPhase")
    1776                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1777                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1778              
    1779              $C$DW$160       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1781                      .dwattr $C$DW$160, DW_AT_name("VphaseA")
    1782                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_VphaseA")
    1783                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1784                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1785              
    1786              $C$DW$161       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   35

    1788                      .dwattr $C$DW$161, DW_AT_name("VphaseB")
    1789                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_VphaseB")
    1790                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1791                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1792              
    1793              $C$DW$162       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1795                      .dwattr $C$DW$162, DW_AT_name("VphaseC")
    1796                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_VphaseC")
    1797                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1798                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1799              
    1800              $C$DW$163       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1802                      .dwattr $C$DW$163, DW_AT_name("Valpha")
    1803                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_Valpha")
    1804                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1805                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1806              
    1807              $C$DW$164       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1809                      .dwattr $C$DW$164, DW_AT_name("Vbeta")
    1810                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_Vbeta")
    1811                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1812                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1813              
    1814              $C$DW$165       .dwtag  DW_TAG_member
    1815                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1816                      .dwattr $C$DW$165, DW_AT_name("temp")
    1817                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_temp")
    1818                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1819                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1820              
    1821                      .dwendtag $C$DW$T$39
    1822              
    1823              $C$DW$T$88      .dwtag  DW_TAG_typedef
    1824                      .dwattr $C$DW$T$88, DW_AT_name("PHASEVOLTAGE")
    1825                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$39)
    1826                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1827              
    1828              
    1829              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1830                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x14)
    1831              $C$DW$166       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1833                      .dwattr $C$DW$166, DW_AT_name("ElecTheta")
    1834                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_ElecTheta")
    1835                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1836                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1837              
    1838              $C$DW$167       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$36)
    1840                      .dwattr $C$DW$167, DW_AT_name("DirectionQep")
    1841                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_DirectionQep")
    1842                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   36

    1843                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1844              
    1845              $C$DW$168       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1847                      .dwattr $C$DW$168, DW_AT_name("OldElecTheta")
    1848                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_OldElecTheta")
    1849                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1850                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1851              
    1852              $C$DW$169       .dwtag  DW_TAG_member
    1853                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1854                      .dwattr $C$DW$169, DW_AT_name("Speed")
    1855                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_Speed")
    1856                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1857                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1858              
    1859              $C$DW$170       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$36)
    1861                      .dwattr $C$DW$170, DW_AT_name("BaseRpm")
    1862                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_BaseRpm")
    1863                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1864                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1865              
    1866              $C$DW$171       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$40)
    1868                      .dwattr $C$DW$171, DW_AT_name("K1")
    1869                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_K1")
    1870                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1871                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1872              
    1873              $C$DW$172       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1875                      .dwattr $C$DW$172, DW_AT_name("K2")
    1876                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_K2")
    1877                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1878                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1879              
    1880              $C$DW$173       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1882                      .dwattr $C$DW$173, DW_AT_name("K3")
    1883                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_K3")
    1884                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1885                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1886              
    1887              $C$DW$174       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$41)
    1889                      .dwattr $C$DW$174, DW_AT_name("SpeedRpm")
    1890                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_SpeedRpm")
    1891                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1892                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1893              
    1894              $C$DW$175       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1896                      .dwattr $C$DW$175, DW_AT_name("Tmp")
    1897                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_Tmp")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   37

    1898                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1899                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1900              
    1901                      .dwendtag $C$DW$T$42
    1902              
    1903              $C$DW$T$89      .dwtag  DW_TAG_typedef
    1904                      .dwattr $C$DW$T$89, DW_AT_name("SPEED_MEAS_QEP")
    1905                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$42)
    1906                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1907              
    1908              
    1909              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1910                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x12)
    1911              $C$DW$176       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$32)
    1913                      .dwattr $C$DW$176, DW_AT_name("ElecTheta")
    1914                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ElecTheta")
    1915                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1916                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1917              
    1918              $C$DW$177       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$32)
    1920                      .dwattr $C$DW$177, DW_AT_name("MechTheta")
    1921                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_MechTheta")
    1922                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1923                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1924              
    1925              $C$DW$178       .dwtag  DW_TAG_member
    1926                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$34)
    1927                      .dwattr $C$DW$178, DW_AT_name("DirectionQep")
    1928                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_DirectionQep")
    1929                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1930                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1931              
    1932              $C$DW$179       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$34)
    1934                      .dwattr $C$DW$179, DW_AT_name("QepPeriod")
    1935                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_QepPeriod")
    1936                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1937                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1938              
    1939              $C$DW$180       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$36)
    1941                      .dwattr $C$DW$180, DW_AT_name("QepCountIndex")
    1942                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_QepCountIndex")
    1943                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1944                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1945              
    1946              $C$DW$181       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$41)
    1948                      .dwattr $C$DW$181, DW_AT_name("RawTheta")
    1949                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_RawTheta")
    1950                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1951                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1952              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   38

    1953              $C$DW$182       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$32)
    1955                      .dwattr $C$DW$182, DW_AT_name("MechScaler")
    1956                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_MechScaler")
    1957                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1958                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1959              
    1960              $C$DW$183       .dwtag  DW_TAG_member
    1961                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$34)
    1962                      .dwattr $C$DW$183, DW_AT_name("LineEncoder")
    1963                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_LineEncoder")
    1964                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1965                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1966              
    1967              $C$DW$184       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$34)
    1969                      .dwattr $C$DW$184, DW_AT_name("PolePairs")
    1970                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_PolePairs")
    1971                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1972                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1973              
    1974              $C$DW$185       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$41)
    1976                      .dwattr $C$DW$185, DW_AT_name("CalibratedAngle")
    1977                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_CalibratedAngle")
    1978                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1979                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1980              
    1981              $C$DW$186       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$34)
    1983                      .dwattr $C$DW$186, DW_AT_name("IndexSyncFlag")
    1984                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_IndexSyncFlag")
    1985                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1986                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1987              
    1988                      .dwendtag $C$DW$T$43
    1989              
    1990              $C$DW$T$90      .dwtag  DW_TAG_typedef
    1991                      .dwattr $C$DW$T$90, DW_AT_name("QEP")
    1992                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$43)
    1993                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1994              
    1995              
    1996              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1997                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x07)
    1998              $C$DW$187       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$44)
    2000                      .dwattr $C$DW$187, DW_AT_name("stat_reg1")
    2001                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_stat_reg1")
    2002                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2003                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2004              
    2005              $C$DW$188       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$45)
    2007                      .dwattr $C$DW$188, DW_AT_name("stat_reg2")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   39

    2008                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_stat_reg2")
    2009                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2010                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2011              
    2012              $C$DW$189       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$46)
    2014                      .dwattr $C$DW$189, DW_AT_name("cntrl_reg1")
    2015                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_cntrl_reg1")
    2016                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2017                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2018              
    2019              $C$DW$190       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$47)
    2021                      .dwattr $C$DW$190, DW_AT_name("cntrl_reg2")
    2022                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_cntrl_reg2")
    2023                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2024                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2025              
    2026              $C$DW$191       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$34)
    2028                      .dwattr $C$DW$191, DW_AT_name("readCntrl1")
    2029                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_readCntrl1")
    2030                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2031                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2032              
    2033              $C$DW$192       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$34)
    2035                      .dwattr $C$DW$192, DW_AT_name("readCntrl2")
    2036                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_readCntrl2")
    2037                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2038                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2039              
    2040              $C$DW$193       .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$34)
    2042                      .dwattr $C$DW$193, DW_AT_name("DRV_fault")
    2043                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_DRV_fault")
    2044                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2045                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2046              
    2047                      .dwendtag $C$DW$T$48
    2048              
    2049              $C$DW$T$91      .dwtag  DW_TAG_typedef
    2050                      .dwattr $C$DW$T$91, DW_AT_name("DRV8301_Vars")
    2051                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$48)
    2052                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2053              
    2054              
    2055              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    2056                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x15)
    2057              $C$DW$194       .dwtag  DW_TAG_member
    2058                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$34)
    2059                      .dwattr $C$DW$194, DW_AT_name("Rsvd0")
    2060                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_Rsvd0")
    2061                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2062                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   40

    2063              
    2064              $C$DW$195       .dwtag  DW_TAG_member
    2065                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$49)
    2066                      .dwattr $C$DW$195, DW_AT_name("status1_wwd")
    2067                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_status1_wwd")
    2068                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2069                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2070              
    2071              $C$DW$196       .dwtag  DW_TAG_member
    2072                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$50)
    2073                      .dwattr $C$DW$196, DW_AT_name("status2_ov_vds")
    2074                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_status2_ov_vds")
    2075                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2076                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2077              
    2078              $C$DW$197       .dwtag  DW_TAG_member
    2079                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$51)
    2080                      .dwattr $C$DW$197, DW_AT_name("status3_IC")
    2081                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_status3_IC")
    2082                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2083                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2084              
    2085              $C$DW$198       .dwtag  DW_TAG_member
    2086                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$52)
    2087                      .dwattr $C$DW$198, DW_AT_name("status4_gd_Vgs")
    2088                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    2089                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2090                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2091              
    2092              $C$DW$199       .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$53)
    2094                      .dwattr $C$DW$199, DW_AT_name("cntrl5_hs_gd")
    2095                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    2096                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2097                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2098              
    2099              $C$DW$200       .dwtag  DW_TAG_member
    2100                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$54)
    2101                      .dwattr $C$DW$200, DW_AT_name("cntrl6_ls_gd")
    2102                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    2103                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2104                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2105              
    2106              $C$DW$201       .dwtag  DW_TAG_member
    2107                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$55)
    2108                      .dwattr $C$DW$201, DW_AT_name("cntrl7_gd")
    2109                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_cntrl7_gd")
    2110                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2111                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2112              
    2113              $C$DW$202       .dwtag  DW_TAG_member
    2114                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$34)
    2115                      .dwattr $C$DW$202, DW_AT_name("Rsvd8")
    2116                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_Rsvd8")
    2117                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   41

    2118                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2119              
    2120              $C$DW$203       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$56)
    2122                      .dwattr $C$DW$203, DW_AT_name("cntrl9_IC_ops")
    2123                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    2124                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2125                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2126              
    2127              $C$DW$204       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$57)
    2129                      .dwattr $C$DW$204, DW_AT_name("cntrlA_shunt_amp")
    2130                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    2131                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2132                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2133              
    2134              $C$DW$205       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$58)
    2136                      .dwattr $C$DW$205, DW_AT_name("cntrlB_Vreg")
    2137                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_cntrlB_Vreg")
