TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:54 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/FCL_SFRA_XL_DualServo.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    6258                      .dwcfi  restore_reg, 14
    6259 0000029d 8ABE          MOVL      XAR4,*--SP            ; [CPU_ALU] 
    6260                      .dwcfi  cfa_offset, -6
    6261                      .dwcfi  restore_reg, 12
    6262 0000029e 87BE          MOVL      XT,*--SP              ; [CPU_ALU] 
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  144

    6263                      .dwcfi  cfa_offset, -4
    6264                      .dwcfi  restore_reg, 22
    6265                      .dwcfi  restore_reg, 21
    6266 0000029f 0003          POP       AR1H:AR0H             ; [CPU_ALU] 
    6267                      .dwcfi  cfa_offset, -2
    6268                      .dwcfi  restore_reg, 5
    6269                      .dwcfi  restore_reg, 7
    6270 000002a0 7617          NASP      ; [CPU_ALU] 
    6271              $C$DW$230       .dwtag  DW_TAG_TI_branch
    6272                      .dwattr $C$DW$230, DW_AT_low_pc(0x00)
    6273                      .dwattr $C$DW$230, DW_AT_TI_return
    6274              
    6275 000002a1 7602          IRET      ; [CPU_ALU] 
    6276                      ; return occurs ; [] 
    6277                      .dwattr $C$DW$220, DW_AT_TI_end_file("../sources/FCL_SFRA_XL_DualServo.c")
    6278                      .dwattr $C$DW$220, DW_AT_TI_end_line(0x8fa)
    6279                      .dwattr $C$DW$220, DW_AT_TI_end_column(0x01)
    6280                      .dwendentry
    6281                      .dwendtag $C$DW$220
    6282              
    6283              ;**************************************************************
    6284              ;* UNDEFINED EXTERNAL REFERENCES                              *
    6285              ;**************************************************************
    6286                      .global _PwmDac1
    6287                      .global _PwmDac2
    6288                      .global _PwmDac3
    6289                      .global _PwmDac4
    6290                      .global _InitSysCtrl
    6291                      .global _InitPieCtrl
    6292                      .global _InitPieVectTable
    6293                      .global _GPIO_SetupPinOptions
    6294                      .global _GPIO_SetupPinMux
    6295                      .global _PWM_1ch_UpDwnCnt_CNF
    6296                      .global _InitMotor1EPwmGpio
    6297                      .global _InitMotor2EPwmGpio
    6298                      .global _ConfigureADC
    6299                      .global _PwmDac_Init
    6300                      .global _InitMotor1EQepGpio
    6301                      .global _InitMotor2EQepGpio
    6302                      .global _InitMotor1_DRV_Gpio
    6303                      .global _InitMotor2_DRV_Gpio
    6304                      .global _ENABLE_INVERTER
    6305                      .global _F28x_usDelay
    6306                      .global _FCL_initPWM
    6307                      .global _DLOG_4CH_F_init
    6308                      .global _DMC1_Protection_Config
    6309                      .global _DMC2_Protection_Config
    6310                      .global _DMC_Protection
    6311                      .global _DLOG_4CH_F_FUNC
    6312                      .global _Pwmdac12_PwmRegs
    6313                      .global _Pwmdac34_PwmRegs
    6314                      .global _FCL_GetSwVersion
    6315                      .global _SyncSocRegs
    6316                      .global _CpuTimer0Regs
    6317                      .global _CpuTimer1Regs
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  145

    6318                      .global _CpuTimer2Regs
    6319                      .global _SpiaRegs
    6320                      .global _SpibRegs
    6321                      .global _AdcaResultRegs
    6322                      .global _AdcbResultRegs
    6323                      .global _AdccResultRegs
    6324                      .global _PieCtrlRegs
    6325                      .global _Cmpss1Regs
    6326                      .global _Cmpss2Regs
    6327                      .global _Cmpss3Regs
    6328                      .global _Cmpss5Regs
    6329                      .global _Cmpss6Regs
    6330                      .global _EQep1Regs
    6331                      .global _EQep2Regs
    6332                      .global _GpioDataRegs
    6333                      .global _AdcaRegs
    6334                      .global _AdcbRegs
    6335                      .global _AdccRegs
    6336                      .global _CpuSysRegs
    6337                      .global _EPwm1Regs
    6338                      .global _EPwm2Regs
    6339                      .global _EPwm3Regs
    6340                      .global _EPwm4Regs
    6341                      .global _EPwm5Regs
    6342                      .global _EPwm6Regs
    6343                      .global _EPwm7Regs
    6344                      .global _EPwm8Regs
    6345                      .global _PieVectTable
    6346              
    6347              ;***************************************************************
    6348              ;* TYPE INFORMATION                                            *
    6349              ;***************************************************************
    6350              
    6351              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    6352                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x1a)
    6353              $C$DW$231       .dwtag  DW_TAG_member
    6354                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    6355                      .dwattr $C$DW$231, DW_AT_name("input_ptr1")
    6356                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_input_ptr1")
    6357                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6358                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    6359              
    6360              $C$DW$232       .dwtag  DW_TAG_member
    6361                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    6362                      .dwattr $C$DW$232, DW_AT_name("input_ptr2")
    6363                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_input_ptr2")
    6364                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6365                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    6366              
    6367              $C$DW$233       .dwtag  DW_TAG_member
    6368                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    6369                      .dwattr $C$DW$233, DW_AT_name("input_ptr3")
    6370                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_input_ptr3")
    6371                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6372                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  146

    6373              
    6374              $C$DW$234       .dwtag  DW_TAG_member
    6375                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    6376                      .dwattr $C$DW$234, DW_AT_name("input_ptr4")
    6377                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_input_ptr4")
    6378                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6379                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    6380              
    6381              $C$DW$235       .dwtag  DW_TAG_member
    6382                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    6383                      .dwattr $C$DW$235, DW_AT_name("output_ptr1")
    6384                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_output_ptr1")
    6385                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6386                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    6387              
    6388              $C$DW$236       .dwtag  DW_TAG_member
    6389                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    6390                      .dwattr $C$DW$236, DW_AT_name("output_ptr2")
    6391                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_output_ptr2")
    6392                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6393                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    6394              
    6395              $C$DW$237       .dwtag  DW_TAG_member
    6396                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    6397                      .dwattr $C$DW$237, DW_AT_name("output_ptr3")
    6398                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_output_ptr3")
    6399                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6400                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    6401              
    6402              $C$DW$238       .dwtag  DW_TAG_member
    6403                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$20)
    6404                      .dwattr $C$DW$238, DW_AT_name("output_ptr4")
    6405                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_output_ptr4")
    6406                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6407                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    6408              
    6409              $C$DW$239       .dwtag  DW_TAG_member
    6410                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    6411                      .dwattr $C$DW$239, DW_AT_name("prev_value")
    6412                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_prev_value")
    6413                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6414                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    6415              
    6416              $C$DW$240       .dwtag  DW_TAG_member
    6417                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    6418                      .dwattr $C$DW$240, DW_AT_name("trig_value")
    6419                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_trig_value")
    6420                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6421                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    6422              
    6423              $C$DW$241       .dwtag  DW_TAG_member
    6424                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$21)
    6425                      .dwattr $C$DW$241, DW_AT_name("status")
    6426                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_status")
    6427                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  147

    6428                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    6429              
    6430              $C$DW$242       .dwtag  DW_TAG_member
    6431                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$21)
    6432                      .dwattr $C$DW$242, DW_AT_name("pre_scalar")
    6433                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_pre_scalar")
    6434                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6435                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    6436              
    6437              $C$DW$243       .dwtag  DW_TAG_member
    6438                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$21)
    6439                      .dwattr $C$DW$243, DW_AT_name("skip_count")
    6440                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_skip_count")
    6441                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6442                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    6443              
    6444              $C$DW$244       .dwtag  DW_TAG_member
    6445                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$21)
    6446                      .dwattr $C$DW$244, DW_AT_name("size")
    6447                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_size")
    6448                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6449                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    6450              
    6451              $C$DW$245       .dwtag  DW_TAG_member
    6452                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$21)
    6453                      .dwattr $C$DW$245, DW_AT_name("count")
    6454                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_count")
    6455                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6456                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    6457              
    6458                      .dwendtag $C$DW$T$22
    6459              
    6460              $C$DW$T$645     .dwtag  DW_TAG_typedef
    6461                      .dwattr $C$DW$T$645, DW_AT_name("DLOG_4CH_F")
    6462                      .dwattr $C$DW$T$645, DW_AT_type(*$C$DW$T$22)
    6463                      .dwattr $C$DW$T$645, DW_AT_language(DW_LANG_C)
    6464              
    6465              $C$DW$T$646     .dwtag  DW_TAG_pointer_type
    6466                      .dwattr $C$DW$T$646, DW_AT_type(*$C$DW$T$645)
    6467                      .dwattr $C$DW$T$646, DW_AT_address_class(0x20)
    6468              
    6469              
    6470              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    6471                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
    6472              $C$DW$246       .dwtag  DW_TAG_member
    6473                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$23)
    6474                      .dwattr $C$DW$246, DW_AT_name("As")
    6475                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_As")
    6476                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6477                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    6478              
    6479              $C$DW$247       .dwtag  DW_TAG_member
    6480                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$23)
    6481                      .dwattr $C$DW$247, DW_AT_name("Bs")
    6482                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_Bs")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  148

    6483                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6484                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    6485              
    6486              $C$DW$248       .dwtag  DW_TAG_member
    6487                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$23)
    6488                      .dwattr $C$DW$248, DW_AT_name("Cs")
    6489                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_Cs")
    6490                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6491                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    6492              
    6493              $C$DW$249       .dwtag  DW_TAG_member
    6494                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$23)
    6495                      .dwattr $C$DW$249, DW_AT_name("Alpha")
    6496                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_Alpha")
    6497                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6498                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    6499              
    6500              $C$DW$250       .dwtag  DW_TAG_member
    6501                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$23)
    6502                      .dwattr $C$DW$250, DW_AT_name("Beta")
    6503                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_Beta")
    6504                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6505                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    6506              
    6507                      .dwendtag $C$DW$T$24
    6508              
    6509              $C$DW$T$80      .dwtag  DW_TAG_typedef
    6510                      .dwattr $C$DW$T$80, DW_AT_name("CLARKE")
    6511                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$24)
    6512                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    6513              
    6514              
    6515              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    6516                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    6517              $C$DW$251       .dwtag  DW_TAG_member
    6518                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$23)
    6519                      .dwattr $C$DW$251, DW_AT_name("Alpha")
    6520                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_Alpha")
    6521                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6522                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    6523              
    6524              $C$DW$252       .dwtag  DW_TAG_member
    6525                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$23)
    6526                      .dwattr $C$DW$252, DW_AT_name("Beta")
    6527                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_Beta")
    6528                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6529                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    6530              
    6531              $C$DW$253       .dwtag  DW_TAG_member
    6532                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$23)
    6533                      .dwattr $C$DW$253, DW_AT_name("Angle")
    6534                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_Angle")
    6535                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6536                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    6537              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  149

    6538              $C$DW$254       .dwtag  DW_TAG_member
    6539                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$23)
    6540                      .dwattr $C$DW$254, DW_AT_name("Ds")
    6541                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_Ds")
    6542                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6543                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    6544              
    6545              $C$DW$255       .dwtag  DW_TAG_member
    6546                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$23)
    6547                      .dwattr $C$DW$255, DW_AT_name("Qs")
    6548                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_Qs")
    6549                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6550                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    6551              
    6552              $C$DW$256       .dwtag  DW_TAG_member
    6553                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$23)
    6554                      .dwattr $C$DW$256, DW_AT_name("Sine")
    6555                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_Sine")
    6556                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6557                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    6558              
    6559              $C$DW$257       .dwtag  DW_TAG_member
    6560                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$23)
    6561                      .dwattr $C$DW$257, DW_AT_name("Cosine")
    6562                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_Cosine")
    6563                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6564                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    6565              
    6566                      .dwendtag $C$DW$T$25
    6567              
    6568              $C$DW$T$81      .dwtag  DW_TAG_typedef
    6569                      .dwattr $C$DW$T$81, DW_AT_name("PARK")
    6570                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$25)
    6571                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    6572              
    6573              
    6574              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    6575                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0e)
    6576              $C$DW$258       .dwtag  DW_TAG_member
    6577                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$23)
    6578                      .dwattr $C$DW$258, DW_AT_name("Alpha")
    6579                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_Alpha")
    6580                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6581                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    6582              
    6583              $C$DW$259       .dwtag  DW_TAG_member
    6584                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$23)
    6585                      .dwattr $C$DW$259, DW_AT_name("Beta")
    6586                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_Beta")
    6587                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6588                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    6589              
    6590              $C$DW$260       .dwtag  DW_TAG_member
    6591                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$23)
    6592                      .dwattr $C$DW$260, DW_AT_name("Angle")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  150

    6593                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_Angle")
    6594                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6595                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    6596              
    6597              $C$DW$261       .dwtag  DW_TAG_member
    6598                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$23)
    6599                      .dwattr $C$DW$261, DW_AT_name("Ds")
    6600                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_Ds")
    6601                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6602                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    6603              
    6604              $C$DW$262       .dwtag  DW_TAG_member
    6605                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$23)
    6606                      .dwattr $C$DW$262, DW_AT_name("Qs")
    6607                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_Qs")
    6608                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6609                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    6610              
    6611              $C$DW$263       .dwtag  DW_TAG_member
    6612                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$23)
    6613                      .dwattr $C$DW$263, DW_AT_name("Sine")
    6614                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_Sine")
    6615                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6616                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    6617              
    6618              $C$DW$264       .dwtag  DW_TAG_member
    6619                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$23)
    6620                      .dwattr $C$DW$264, DW_AT_name("Cosine")
    6621                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_Cosine")
    6622                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6623                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    6624              
    6625                      .dwendtag $C$DW$T$26
    6626              
    6627              $C$DW$T$82      .dwtag  DW_TAG_typedef
    6628                      .dwattr $C$DW$T$82, DW_AT_name("IPARK")
    6629                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$26)
    6630                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    6631              
    6632              
    6633              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    6634                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
    6635              $C$DW$265       .dwtag  DW_TAG_member
    6636                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$23)
    6637                      .dwattr $C$DW$265, DW_AT_name("Ref")
    6638                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_Ref")
    6639                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6640                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    6641              
    6642              $C$DW$266       .dwtag  DW_TAG_member
    6643                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$23)
    6644                      .dwattr $C$DW$266, DW_AT_name("Fdb")
    6645                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_Fdb")
    6646                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6647                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  151

    6648              
    6649              $C$DW$267       .dwtag  DW_TAG_member
    6650                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$23)
    6651                      .dwattr $C$DW$267, DW_AT_name("Err")
    6652                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_Err")
    6653                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6654                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    6655              
    6656              $C$DW$268       .dwtag  DW_TAG_member
    6657                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$23)
    6658                      .dwattr $C$DW$268, DW_AT_name("Kp")
    6659                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_Kp")
    6660                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6661                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    6662              
    6663              $C$DW$269       .dwtag  DW_TAG_member
    6664                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$23)
    6665                      .dwattr $C$DW$269, DW_AT_name("Up")
    6666                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_Up")
    6667                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6668                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    6669              
    6670              $C$DW$270       .dwtag  DW_TAG_member
    6671                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$23)
    6672                      .dwattr $C$DW$270, DW_AT_name("Ui")
    6673                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_Ui")
    6674                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6675                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    6676              
    6677              $C$DW$271       .dwtag  DW_TAG_member
    6678                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$23)
    6679                      .dwattr $C$DW$271, DW_AT_name("Ud")
    6680                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_Ud")
    6681                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6682                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    6683              
    6684              $C$DW$272       .dwtag  DW_TAG_member
    6685                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$23)
    6686                      .dwattr $C$DW$272, DW_AT_name("OutPreSat")
    6687                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_OutPreSat")
    6688                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6689                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    6690              
    6691              $C$DW$273       .dwtag  DW_TAG_member
    6692                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$23)
    6693                      .dwattr $C$DW$273, DW_AT_name("OutMax")
    6694                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_OutMax")
    6695                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6696                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    6697              
    6698              $C$DW$274       .dwtag  DW_TAG_member
    6699                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$23)
    6700                      .dwattr $C$DW$274, DW_AT_name("OutMin")
    6701                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_OutMin")
    6702                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  152

    6703                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    6704              
    6705              $C$DW$275       .dwtag  DW_TAG_member
    6706                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$23)
    6707                      .dwattr $C$DW$275, DW_AT_name("Out")
    6708                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_Out")
    6709                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6710                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    6711              
    6712              $C$DW$276       .dwtag  DW_TAG_member
    6713                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$23)
    6714                      .dwattr $C$DW$276, DW_AT_name("SatErr")
    6715                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_SatErr")
    6716                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6717                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    6718              
    6719              $C$DW$277       .dwtag  DW_TAG_member
    6720                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$23)
    6721                      .dwattr $C$DW$277, DW_AT_name("Ki")
    6722                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_Ki")
    6723                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6724                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    6725              
    6726              $C$DW$278       .dwtag  DW_TAG_member
    6727                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$23)
    6728                      .dwattr $C$DW$278, DW_AT_name("Kc")
    6729                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_Kc")
    6730                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6731                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    6732              
    6733              $C$DW$279       .dwtag  DW_TAG_member
    6734                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$23)
    6735                      .dwattr $C$DW$279, DW_AT_name("Kd")
    6736                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_Kd")
    6737                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6738                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    6739              
    6740              $C$DW$280       .dwtag  DW_TAG_member
    6741                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$23)
    6742                      .dwattr $C$DW$280, DW_AT_name("Up1")
    6743                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_Up1")
    6744                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6745                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    6746              
    6747                      .dwendtag $C$DW$T$27
    6748              
    6749              $C$DW$T$83      .dwtag  DW_TAG_typedef
    6750                      .dwattr $C$DW$T$83, DW_AT_name("PIDREG3")
    6751                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$27)
    6752                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    6753              
    6754              
    6755              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    6756                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x18)
    6757              $C$DW$281       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  153

    6758                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$23)
    6759                      .dwattr $C$DW$281, DW_AT_name("Ref")
    6760                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_Ref")
    6761                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6762                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    6763              
    6764              $C$DW$282       .dwtag  DW_TAG_member
    6765                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$23)
    6766                      .dwattr $C$DW$282, DW_AT_name("Fbk")
    6767                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_Fbk")
    6768                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6769                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    6770              
    6771              $C$DW$283       .dwtag  DW_TAG_member
    6772                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$23)
    6773                      .dwattr $C$DW$283, DW_AT_name("Out")
    6774                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_Out")
    6775                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6776                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    6777              
    6778              $C$DW$284       .dwtag  DW_TAG_member
    6779                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$23)
    6780                      .dwattr $C$DW$284, DW_AT_name("Kp")
    6781                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_Kp")
    6782                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6783                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    6784              
    6785              $C$DW$285       .dwtag  DW_TAG_member
    6786                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$23)
    6787                      .dwattr $C$DW$285, DW_AT_name("Ki")
    6788                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_Ki")
    6789                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6790                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    6791              
    6792              $C$DW$286       .dwtag  DW_TAG_member
    6793                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$23)
    6794                      .dwattr $C$DW$286, DW_AT_name("Umax")
    6795                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_Umax")
    6796                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6797                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    6798              
    6799              $C$DW$287       .dwtag  DW_TAG_member
    6800                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$23)
    6801                      .dwattr $C$DW$287, DW_AT_name("Umin")
    6802                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_Umin")
    6803                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6804                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    6805              
    6806              $C$DW$288       .dwtag  DW_TAG_member
    6807                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$23)
    6808                      .dwattr $C$DW$288, DW_AT_name("up")
    6809                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_up")
    6810                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6811                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    6812              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  154

    6813              $C$DW$289       .dwtag  DW_TAG_member
    6814                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$23)
    6815                      .dwattr $C$DW$289, DW_AT_name("ui")
    6816                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_ui")
    6817                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6818                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    6819              
    6820              $C$DW$290       .dwtag  DW_TAG_member
    6821                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$23)
    6822                      .dwattr $C$DW$290, DW_AT_name("v1")
    6823                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_v1")
    6824                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6825                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    6826              
    6827              $C$DW$291       .dwtag  DW_TAG_member
    6828                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$23)
    6829                      .dwattr $C$DW$291, DW_AT_name("i1")
    6830                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_i1")
    6831                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6832                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    6833              
    6834              $C$DW$292       .dwtag  DW_TAG_member
    6835                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$23)
    6836                      .dwattr $C$DW$292, DW_AT_name("w1")
    6837                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_w1")
    6838                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6839                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    6840              
    6841                      .dwendtag $C$DW$T$28
    6842              
    6843              $C$DW$T$84      .dwtag  DW_TAG_typedef
    6844                      .dwattr $C$DW$T$84, DW_AT_name("PI_CONTROLLER")
    6845                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$28)
    6846                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    6847              
    6848              
    6849              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    6850                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x0a)
    6851              $C$DW$293       .dwtag  DW_TAG_member
    6852                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$23)
    6853                      .dwattr $C$DW$293, DW_AT_name("Ref")
    6854                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_Ref")
    6855                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6856                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    6857              
    6858              $C$DW$294       .dwtag  DW_TAG_member
    6859                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$23)
    6860                      .dwattr $C$DW$294, DW_AT_name("Fbk")
    6861                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_Fbk")
    6862                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6863                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    6864              
    6865              $C$DW$295       .dwtag  DW_TAG_member
    6866                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$23)
    6867                      .dwattr $C$DW$295, DW_AT_name("Out")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  155

    6868                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_Out")
    6869                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6870                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    6871              
    6872              $C$DW$296       .dwtag  DW_TAG_member
    6873                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$23)
    6874                      .dwattr $C$DW$296, DW_AT_name("c1")
    6875                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_c1")
    6876                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6877                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    6878              
    6879              $C$DW$297       .dwtag  DW_TAG_member
    6880                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$23)
    6881                      .dwattr $C$DW$297, DW_AT_name("c2")
    6882                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_c2")
    6883                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6884                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    6885              
    6886                      .dwendtag $C$DW$T$29
    6887              
    6888              $C$DW$T$32      .dwtag  DW_TAG_typedef
    6889                      .dwattr $C$DW$T$32, DW_AT_name("PID_TERMINALS")
    6890                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$29)
    6891                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    6892              
    6893              
    6894              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6895                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0e)
    6896              $C$DW$298       .dwtag  DW_TAG_member
    6897                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$23)
    6898                      .dwattr $C$DW$298, DW_AT_name("Kr")
    6899                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_Kr")
    6900                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6901                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    6902              
    6903              $C$DW$299       .dwtag  DW_TAG_member
    6904                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$23)
    6905                      .dwattr $C$DW$299, DW_AT_name("Kp")
    6906                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_Kp")
    6907                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6908                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    6909              
    6910              $C$DW$300       .dwtag  DW_TAG_member
    6911                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$23)
    6912                      .dwattr $C$DW$300, DW_AT_name("Ki")
    6913                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_Ki")
    6914                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6915                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    6916              
    6917              $C$DW$301       .dwtag  DW_TAG_member
    6918                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$23)
    6919                      .dwattr $C$DW$301, DW_AT_name("Kd")
    6920                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_Kd")
    6921                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6922                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  156

    6923              
    6924              $C$DW$302       .dwtag  DW_TAG_member
    6925                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$23)
    6926                      .dwattr $C$DW$302, DW_AT_name("Km")
    6927                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_Km")
    6928                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6929                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    6930              
    6931              $C$DW$303       .dwtag  DW_TAG_member
    6932                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$23)
    6933                      .dwattr $C$DW$303, DW_AT_name("Umax")
    6934                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_Umax")
    6935                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6936                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    6937              
    6938              $C$DW$304       .dwtag  DW_TAG_member
    6939                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$23)
    6940                      .dwattr $C$DW$304, DW_AT_name("Umin")
    6941                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_Umin")
    6942                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6943                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    6944              
    6945                      .dwendtag $C$DW$T$30
    6946              
    6947              $C$DW$T$33      .dwtag  DW_TAG_typedef
    6948                      .dwattr $C$DW$T$33, DW_AT_name("PID_PARAMETERS")
    6949                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$30)
    6950                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    6951              
    6952              
    6953              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6954                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x10)
    6955              $C$DW$305       .dwtag  DW_TAG_member
    6956                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$23)
    6957                      .dwattr $C$DW$305, DW_AT_name("up")
    6958                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_up")
    6959                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6960                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    6961              
    6962              $C$DW$306       .dwtag  DW_TAG_member
    6963                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$23)
    6964                      .dwattr $C$DW$306, DW_AT_name("ui")
    6965                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_ui")
    6966                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6967                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    6968              
    6969              $C$DW$307       .dwtag  DW_TAG_member
    6970                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$23)
    6971                      .dwattr $C$DW$307, DW_AT_name("ud")
    6972                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_ud")
    6973                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6974                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    6975              
    6976              $C$DW$308       .dwtag  DW_TAG_member
    6977                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  157

    6978                      .dwattr $C$DW$308, DW_AT_name("v1")
    6979                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_v1")
    6980                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6981                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    6982              
    6983              $C$DW$309       .dwtag  DW_TAG_member
    6984                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$23)
    6985                      .dwattr $C$DW$309, DW_AT_name("i1")
    6986                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_i1")
    6987                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6988                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    6989              
    6990              $C$DW$310       .dwtag  DW_TAG_member
    6991                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$23)
    6992                      .dwattr $C$DW$310, DW_AT_name("d1")
    6993                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_d1")
    6994                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6995                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    6996              
    6997              $C$DW$311       .dwtag  DW_TAG_member
    6998                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$23)
    6999                      .dwattr $C$DW$311, DW_AT_name("d2")
    7000                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_d2")
    7001                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7002                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    7003              
    7004              $C$DW$312       .dwtag  DW_TAG_member
    7005                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$23)
    7006                      .dwattr $C$DW$312, DW_AT_name("w1")
    7007                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_w1")
    7008                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7009                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    7010              
    7011                      .dwendtag $C$DW$T$31
    7012              
    7013              $C$DW$T$34      .dwtag  DW_TAG_typedef
    7014                      .dwattr $C$DW$T$34, DW_AT_name("PID_DATA")
    7015                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
    7016                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    7017              
    7018              
    7019              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7020                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x28)
    7021              $C$DW$313       .dwtag  DW_TAG_member
    7022                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$32)
    7023                      .dwattr $C$DW$313, DW_AT_name("term")
    7024                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_term")
    7025                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7026                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    7027              
    7028              $C$DW$314       .dwtag  DW_TAG_member
    7029                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$33)
    7030                      .dwattr $C$DW$314, DW_AT_name("param")
    7031                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_param")
    7032                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  158

    7033                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    7034              
    7035              $C$DW$315       .dwtag  DW_TAG_member
    7036                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$34)
    7037                      .dwattr $C$DW$315, DW_AT_name("data")
    7038                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_data")
    7039                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7040                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    7041              
    7042                      .dwendtag $C$DW$T$35
    7043              
    7044              $C$DW$T$85      .dwtag  DW_TAG_typedef
    7045                      .dwattr $C$DW$T$85, DW_AT_name("PID_CONTROLLER")
    7046                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$35)
    7047                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    7048              
    7049              
    7050              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    7051                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x22)
    7052              $C$DW$316       .dwtag  DW_TAG_member
    7053                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    7054                      .dwattr $C$DW$316, DW_AT_name("Ref")
    7055                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_Ref")
    7056                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7057                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    7058              
    7059              $C$DW$317       .dwtag  DW_TAG_member
    7060                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    7061                      .dwattr $C$DW$317, DW_AT_name("Fbk")
    7062                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_Fbk")
    7063                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7064                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    7065              
    7066              $C$DW$318       .dwtag  DW_TAG_member
    7067                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    7068                      .dwattr $C$DW$318, DW_AT_name("Err")
    7069                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_Err")
    7070                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7071                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    7072              
    7073              $C$DW$319       .dwtag  DW_TAG_member
    7074                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    7075                      .dwattr $C$DW$319, DW_AT_name("xErr")
    7076                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_xErr")
    7077                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7078                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    7079              
    7080              $C$DW$320       .dwtag  DW_TAG_member
    7081                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    7082                      .dwattr $C$DW$320, DW_AT_name("Out")
    7083                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_Out")
    7084                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7085                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    7086              
    7087              $C$DW$321       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  159

    7088                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    7089                      .dwattr $C$DW$321, DW_AT_name("CarryOver")
    7090                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_CarryOver")
    7091                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7092                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    7093              
    7094              $C$DW$322       .dwtag  DW_TAG_member
    7095                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    7096                      .dwattr $C$DW$322, DW_AT_name("Kp")
    7097                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_Kp")
    7098                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7099                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    7100              
    7101              $C$DW$323       .dwtag  DW_TAG_member
    7102                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    7103                      .dwattr $C$DW$323, DW_AT_name("Ki")
    7104                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_Ki")
    7105                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7106                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    7107              
    7108              $C$DW$324       .dwtag  DW_TAG_member
    7109                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    7110                      .dwattr $C$DW$324, DW_AT_name("Kerr")
    7111                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_Kerr")
    7112                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7113                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    7114              
    7115              $C$DW$325       .dwtag  DW_TAG_member
    7116                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    7117                      .dwattr $C$DW$325, DW_AT_name("Kxerr")
    7118                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_Kxerr")
    7119                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7120                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    7121              
    7122              $C$DW$326       .dwtag  DW_TAG_member
    7123                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    7124                      .dwattr $C$DW$326, DW_AT_name("KerrOld")
    7125                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_KerrOld")
    7126                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7127                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    7128              
    7129              $C$DW$327       .dwtag  DW_TAG_member
    7130                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    7131                      .dwattr $C$DW$327, DW_AT_name("cosWTs")
    7132                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_cosWTs")
    7133                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7134                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    7135              
    7136              $C$DW$328       .dwtag  DW_TAG_member
    7137                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    7138                      .dwattr $C$DW$328, DW_AT_name("sinWTs")
    7139                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_sinWTs")
    7140                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7141                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    7142              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  160

    7143              $C$DW$329       .dwtag  DW_TAG_member
    7144                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    7145                      .dwattr $C$DW$329, DW_AT_name("expVal")
    7146                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_expVal")
    7147                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7148                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    7149              
    7150              $C$DW$330       .dwtag  DW_TAG_member
    7151                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    7152                      .dwattr $C$DW$330, DW_AT_name("kDirect")
    7153                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_kDirect")
    7154                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7155                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    7156              
    7157              $C$DW$331       .dwtag  DW_TAG_member
    7158                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    7159                      .dwattr $C$DW$331, DW_AT_name("Umax")
    7160                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_Umax")
    7161                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7162                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    7163              
    7164              $C$DW$332       .dwtag  DW_TAG_member
    7165                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    7166                      .dwattr $C$DW$332, DW_AT_name("Umin")
    7167                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_Umin")
    7168                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7169                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    7170              
    7171                      .dwendtag $C$DW$T$36
    7172              
    7173              $C$DW$T$86      .dwtag  DW_TAG_typedef
    7174                      .dwattr $C$DW$T$86, DW_AT_name("CURRENT_CONTROLLER")
    7175                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$36)
    7176                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    7177              
    7178              
    7179              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    7180                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x12)
    7181              $C$DW$333       .dwtag  DW_TAG_member
    7182                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$23)
    7183                      .dwattr $C$DW$333, DW_AT_name("Ualpha")
    7184                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_Ualpha")
    7185                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7186                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    7187              
    7188              $C$DW$334       .dwtag  DW_TAG_member
    7189                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$23)
    7190                      .dwattr $C$DW$334, DW_AT_name("Ubeta")
    7191                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_Ubeta")
    7192                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7193                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    7194              
    7195              $C$DW$335       .dwtag  DW_TAG_member
    7196                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$23)
    7197                      .dwattr $C$DW$335, DW_AT_name("Ta")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  161

    7198                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_Ta")
    7199                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7200                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    7201              
    7202              $C$DW$336       .dwtag  DW_TAG_member
    7203                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$23)
    7204                      .dwattr $C$DW$336, DW_AT_name("Tb")
    7205                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_Tb")
    7206                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7207                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    7208              
    7209              $C$DW$337       .dwtag  DW_TAG_member
    7210                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$23)
    7211                      .dwattr $C$DW$337, DW_AT_name("Tc")
    7212                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_Tc")
    7213                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7214                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    7215              
    7216              $C$DW$338       .dwtag  DW_TAG_member
    7217                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$23)
    7218                      .dwattr $C$DW$338, DW_AT_name("tmp1")
    7219                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_tmp1")
    7220                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7221                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    7222              
    7223              $C$DW$339       .dwtag  DW_TAG_member
    7224                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$23)
    7225                      .dwattr $C$DW$339, DW_AT_name("tmp2")
    7226                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_tmp2")
    7227                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7228                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    7229              
    7230              $C$DW$340       .dwtag  DW_TAG_member
    7231                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$23)
    7232                      .dwattr $C$DW$340, DW_AT_name("tmp3")
    7233                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_tmp3")
    7234                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7235                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    7236              
    7237              $C$DW$341       .dwtag  DW_TAG_member
    7238                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$37)
    7239                      .dwattr $C$DW$341, DW_AT_name("VecSector")
    7240                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_VecSector")
    7241                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7242                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    7243              
    7244                      .dwendtag $C$DW$T$38
    7245              
    7246              $C$DW$T$88      .dwtag  DW_TAG_typedef
    7247                      .dwattr $C$DW$T$88, DW_AT_name("SVGEN")
    7248                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$38)
    7249                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    7250              
    7251              
    7252              $C$DW$T$40      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  162

    7253                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x10)
    7254              $C$DW$342       .dwtag  DW_TAG_member
    7255                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$23)
    7256                      .dwattr $C$DW$342, DW_AT_name("TargetValue")
    7257                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_TargetValue")
    7258                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7259                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    7260              
    7261              $C$DW$343       .dwtag  DW_TAG_member
    7262                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$39)
    7263                      .dwattr $C$DW$343, DW_AT_name("RampDelayMax")
    7264                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_RampDelayMax")
    7265                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7266                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    7267              
    7268              $C$DW$344       .dwtag  DW_TAG_member
    7269                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$23)
    7270                      .dwattr $C$DW$344, DW_AT_name("RampLowLimit")
    7271                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_RampLowLimit")
    7272                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7273                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    7274              
    7275              $C$DW$345       .dwtag  DW_TAG_member
    7276                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$23)
    7277                      .dwattr $C$DW$345, DW_AT_name("RampHighLimit")
    7278                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_RampHighLimit")
    7279                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7280                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    7281              
    7282              $C$DW$346       .dwtag  DW_TAG_member
    7283                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$39)
    7284                      .dwattr $C$DW$346, DW_AT_name("RampDelayCount")
    7285                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_RampDelayCount")
    7286                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7287                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    7288              
    7289              $C$DW$347       .dwtag  DW_TAG_member
    7290                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$23)
    7291                      .dwattr $C$DW$347, DW_AT_name("SetpointValue")
    7292                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_SetpointValue")
    7293                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7294                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    7295              
    7296              $C$DW$348       .dwtag  DW_TAG_member
    7297                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$39)
    7298                      .dwattr $C$DW$348, DW_AT_name("EqualFlag")
    7299                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_EqualFlag")
    7300                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7301                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    7302              
    7303              $C$DW$349       .dwtag  DW_TAG_member
    7304                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$23)
    7305                      .dwattr $C$DW$349, DW_AT_name("Tmp")
    7306                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_Tmp")
    7307                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  163

    7308                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    7309              
    7310                      .dwendtag $C$DW$T$40
    7311              
    7312              $C$DW$T$89      .dwtag  DW_TAG_typedef
    7313                      .dwattr $C$DW$T$89, DW_AT_name("RMPCNTL")
    7314                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$40)
    7315                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    7316              
    7317              
    7318              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    7319                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    7320              $C$DW$350       .dwtag  DW_TAG_member
    7321                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$23)
    7322                      .dwattr $C$DW$350, DW_AT_name("Freq")
    7323                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_Freq")
    7324                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7325                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    7326              
    7327              $C$DW$351       .dwtag  DW_TAG_member
    7328                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$23)
    7329                      .dwattr $C$DW$351, DW_AT_name("StepAngleMax")
    7330                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_StepAngleMax")
    7331                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7332                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    7333              
    7334              $C$DW$352       .dwtag  DW_TAG_member
    7335                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
    7336                      .dwattr $C$DW$352, DW_AT_name("Angle")
    7337                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_Angle")
    7338                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7339                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    7340              
    7341              $C$DW$353       .dwtag  DW_TAG_member
    7342                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
    7343                      .dwattr $C$DW$353, DW_AT_name("Gain")
    7344                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_Gain")
    7345                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7346                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    7347              
    7348              $C$DW$354       .dwtag  DW_TAG_member
    7349                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$23)
    7350                      .dwattr $C$DW$354, DW_AT_name("Out")
    7351                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_Out")
    7352                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7353                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    7354              
    7355              $C$DW$355       .dwtag  DW_TAG_member
    7356                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$23)
    7357                      .dwattr $C$DW$355, DW_AT_name("Offset")
    7358                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_Offset")
    7359                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7360                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    7361              
    7362                      .dwendtag $C$DW$T$41
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  164

    7363              
    7364              $C$DW$T$90      .dwtag  DW_TAG_typedef
    7365                      .dwattr $C$DW$T$90, DW_AT_name("RAMPGEN")
    7366                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$41)
    7367                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    7368              
    7369              
    7370              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    7371                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x16)
    7372              $C$DW$356       .dwtag  DW_TAG_member
    7373                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$23)
    7374                      .dwattr $C$DW$356, DW_AT_name("DcBusVolt")
    7375                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_DcBusVolt")
    7376                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7377                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    7378              
    7379              $C$DW$357       .dwtag  DW_TAG_member
    7380                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$23)
    7381                      .dwattr $C$DW$357, DW_AT_name("MfuncV1")
    7382                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_MfuncV1")
    7383                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7384                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    7385              
    7386              $C$DW$358       .dwtag  DW_TAG_member
    7387                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
    7388                      .dwattr $C$DW$358, DW_AT_name("MfuncV2")
    7389                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_MfuncV2")
    7390                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7391                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    7392              
    7393              $C$DW$359       .dwtag  DW_TAG_member
    7394                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$23)
    7395                      .dwattr $C$DW$359, DW_AT_name("MfuncV3")
    7396                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_MfuncV3")
    7397                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7398                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    7399              
    7400              $C$DW$360       .dwtag  DW_TAG_member
    7401                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$37)
    7402                      .dwattr $C$DW$360, DW_AT_name("OutOfPhase")
    7403                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_OutOfPhase")
    7404                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7405                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    7406              
    7407              $C$DW$361       .dwtag  DW_TAG_member
    7408                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$23)
    7409                      .dwattr $C$DW$361, DW_AT_name("VphaseA")
    7410                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_VphaseA")
    7411                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7412                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    7413              
    7414              $C$DW$362       .dwtag  DW_TAG_member
    7415                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$23)
    7416                      .dwattr $C$DW$362, DW_AT_name("VphaseB")
    7417                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_VphaseB")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  165

    7418                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7419                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    7420              
    7421              $C$DW$363       .dwtag  DW_TAG_member
    7422                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$23)
    7423                      .dwattr $C$DW$363, DW_AT_name("VphaseC")
    7424                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_VphaseC")
    7425                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7426                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    7427              
    7428              $C$DW$364       .dwtag  DW_TAG_member
    7429                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
    7430                      .dwattr $C$DW$364, DW_AT_name("Valpha")
    7431                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_Valpha")
    7432                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7433                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    7434              
    7435              $C$DW$365       .dwtag  DW_TAG_member
    7436                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
    7437                      .dwattr $C$DW$365, DW_AT_name("Vbeta")
    7438                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_Vbeta")
    7439                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7440                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    7441              
    7442              $C$DW$366       .dwtag  DW_TAG_member
    7443                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$23)
    7444                      .dwattr $C$DW$366, DW_AT_name("temp")
    7445                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_temp")
    7446                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7447                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    7448              
    7449                      .dwendtag $C$DW$T$42
    7450              
    7451              $C$DW$T$91      .dwtag  DW_TAG_typedef
    7452                      .dwattr $C$DW$T$91, DW_AT_name("PHASEVOLTAGE")
    7453                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$42)
    7454                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    7455              
    7456              
    7457              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    7458                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x14)
    7459              $C$DW$367       .dwtag  DW_TAG_member
    7460                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$23)
    7461                      .dwattr $C$DW$367, DW_AT_name("ElecTheta")
    7462                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_ElecTheta")
    7463                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7464                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    7465              
    7466              $C$DW$368       .dwtag  DW_TAG_member
    7467                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$39)
    7468                      .dwattr $C$DW$368, DW_AT_name("DirectionQep")
    7469                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_DirectionQep")
    7470                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7471                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    7472              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  166

    7473              $C$DW$369       .dwtag  DW_TAG_member
    7474                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$23)
    7475                      .dwattr $C$DW$369, DW_AT_name("OldElecTheta")
    7476                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_OldElecTheta")
    7477                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7478                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    7479              
    7480              $C$DW$370       .dwtag  DW_TAG_member
    7481                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$23)
    7482                      .dwattr $C$DW$370, DW_AT_name("Speed")
    7483                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_Speed")
    7484                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7485                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    7486              
    7487              $C$DW$371       .dwtag  DW_TAG_member
    7488                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$39)
    7489                      .dwattr $C$DW$371, DW_AT_name("BaseRpm")
    7490                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_BaseRpm")
    7491                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7492                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    7493              
    7494              $C$DW$372       .dwtag  DW_TAG_member
    7495                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$43)
    7496                      .dwattr $C$DW$372, DW_AT_name("K1")
    7497                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_K1")
    7498                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7499                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    7500              
    7501              $C$DW$373       .dwtag  DW_TAG_member
    7502                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
    7503                      .dwattr $C$DW$373, DW_AT_name("K2")
    7504                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_K2")
    7505                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7506                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    7507              
    7508              $C$DW$374       .dwtag  DW_TAG_member
    7509                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$23)
    7510                      .dwattr $C$DW$374, DW_AT_name("K3")
    7511                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_K3")
    7512                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7513                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    7514              
    7515              $C$DW$375       .dwtag  DW_TAG_member
    7516                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$44)
    7517                      .dwattr $C$DW$375, DW_AT_name("SpeedRpm")
    7518                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_SpeedRpm")
    7519                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7520                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    7521              
    7522              $C$DW$376       .dwtag  DW_TAG_member
    7523                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$23)
    7524                      .dwattr $C$DW$376, DW_AT_name("Tmp")
    7525                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_Tmp")
    7526                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7527                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  167

    7528              
    7529                      .dwendtag $C$DW$T$45
    7530              
    7531              $C$DW$T$92      .dwtag  DW_TAG_typedef
    7532                      .dwattr $C$DW$T$92, DW_AT_name("SPEED_MEAS_QEP")
    7533                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$45)
    7534                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    7535              
    7536              
    7537              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    7538                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x12)
    7539              $C$DW$377       .dwtag  DW_TAG_member
    7540                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
    7541                      .dwattr $C$DW$377, DW_AT_name("ElecTheta")
    7542                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_ElecTheta")
    7543                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7544                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    7545              
    7546              $C$DW$378       .dwtag  DW_TAG_member
    7547                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
    7548                      .dwattr $C$DW$378, DW_AT_name("MechTheta")
    7549                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_MechTheta")
    7550                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7551                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    7552              
    7553              $C$DW$379       .dwtag  DW_TAG_member
    7554                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$37)
    7555                      .dwattr $C$DW$379, DW_AT_name("DirectionQep")
    7556                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_DirectionQep")
    7557                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7558                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    7559              
    7560              $C$DW$380       .dwtag  DW_TAG_member
    7561                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$37)
    7562                      .dwattr $C$DW$380, DW_AT_name("QepPeriod")
    7563                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_QepPeriod")
    7564                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7565                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    7566              
    7567              $C$DW$381       .dwtag  DW_TAG_member
    7568                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$39)
    7569                      .dwattr $C$DW$381, DW_AT_name("QepCountIndex")
    7570                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_QepCountIndex")
    7571                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7572                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    7573              
    7574              $C$DW$382       .dwtag  DW_TAG_member
    7575                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$44)
    7576                      .dwattr $C$DW$382, DW_AT_name("RawTheta")
    7577                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_RawTheta")
    7578                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7579                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    7580              
    7581              $C$DW$383       .dwtag  DW_TAG_member
    7582                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  168

    7583                      .dwattr $C$DW$383, DW_AT_name("MechScaler")
    7584                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_MechScaler")
    7585                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7586                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    7587              
    7588              $C$DW$384       .dwtag  DW_TAG_member
    7589                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$37)
    7590                      .dwattr $C$DW$384, DW_AT_name("LineEncoder")
    7591                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_LineEncoder")
    7592                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7593                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    7594              
    7595              $C$DW$385       .dwtag  DW_TAG_member
    7596                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$37)
    7597                      .dwattr $C$DW$385, DW_AT_name("PolePairs")
    7598                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_PolePairs")
    7599                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7600                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    7601              
    7602              $C$DW$386       .dwtag  DW_TAG_member
    7603                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$44)
    7604                      .dwattr $C$DW$386, DW_AT_name("CalibratedAngle")
    7605                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_CalibratedAngle")
    7606                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7607                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    7608              
    7609              $C$DW$387       .dwtag  DW_TAG_member
    7610                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$37)
    7611                      .dwattr $C$DW$387, DW_AT_name("IndexSyncFlag")
    7612                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_IndexSyncFlag")
    7613                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7614                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    7615              
    7616                      .dwendtag $C$DW$T$46
    7617              
    7618              $C$DW$T$93      .dwtag  DW_TAG_typedef
    7619                      .dwattr $C$DW$T$93, DW_AT_name("QEP")
    7620                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$46)
    7621                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    7622              
    7623              
    7624              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    7625                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x07)
    7626              $C$DW$388       .dwtag  DW_TAG_member
    7627                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$47)
    7628                      .dwattr $C$DW$388, DW_AT_name("stat_reg1")
    7629                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_stat_reg1")
    7630                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7631                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    7632              
    7633              $C$DW$389       .dwtag  DW_TAG_member
    7634                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$48)
    7635                      .dwattr $C$DW$389, DW_AT_name("stat_reg2")
    7636                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_stat_reg2")
    7637                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:54 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
FCL_SFRA_XL_DualServo.asm                                            PAGE  169

    7638                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    7639              
    7640              $C$DW$390       .dwtag  DW_TAG_member
    7641                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$49)
    7642                      .dwattr $C$DW$390, DW_AT_name("cntrl_reg1")
    7643                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_cntrl_reg1")
    7644                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
