TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:57 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/pwmdac.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_SetupPinMux")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GPIO_SetupPinMux")

     613                      .dwendtag $C$DW$34
     614              
     615 000000ba               .sect   ".text"
     616                      .clink
     617                      .global _PwmDac1
     618              
     619              $C$DW$38        .dwtag  DW_TAG_subprogram
     620                      .dwattr $C$DW$38, DW_AT_name("PwmDac1")
     621                      .dwattr $C$DW$38, DW_AT_low_pc(_PwmDac1)
     622                      .dwattr $C$DW$38, DW_AT_high_pc(0x00)
     623                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_PwmDac1")
     624                      .dwattr $C$DW$38, DW_AT_external
     625                      .dwattr $C$DW$38, DW_AT_TI_begin_file("../sources/pwmdac.c")
     626                      .dwattr $C$DW$38, DW_AT_TI_begin_line(0x62)
     627                      .dwattr $C$DW$38, DW_AT_TI_begin_column(0x06)
     628                      .dwattr $C$DW$38, DW_AT_TI_max_frame_size(-2)
     629                      .dwpsn  file "../sources/pwmdac.c",line 99,column 1,is_stmt,address _PwmDac1,isa 0
     630              
     631                      .dwfde $C$DW$CIE, _PwmDac1
     632              $C$DW$39        .dwtag  DW_TAG_formal_parameter
     633                      .dwattr $C$DW$39, DW_AT_name("A")
     634                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_A")
     635                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$183)
     636                      .dwattr $C$DW$39, DW_AT_location[DW_OP_regx 0x2b]
     637              
     638              
     639              ;***************************************************************
     640              ;* FNAME: _PwmDac1                      FR SIZE:   0           *
     641              ;*                                                             *
     642              ;* FUNCTION ENVIRONMENT                                        *
     643              ;*                                                             *
     644              ;* FUNCTION PROPERTIES                                         *
     645              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     646              ;***************************************************************
     647              
     648              _PwmDac1:
     649              ;* R0    assigned to _A
     650              $C$DW$40        .dwtag  DW_TAG_variable
     651                      .dwattr $C$DW$40, DW_AT_name("A")
     652                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_A")
     653                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$190)
     654                      .dwattr $C$DW$40, DW_AT_location[DW_OP_regx 0x2b]
     655              
     656                      .dwcfi  cfa_offset, -2
     657                      .dwcfi  save_reg_to_mem, 26, 0
     658                      .dwpsn  file "../sources/pwmdac.c",line 100,column 5,is_stmt,isa 0
     659 000000ba E88F          ADDF32    R0H,R0H,#16256        ; [CPU_FPU] |100| 
         000000bb E000 
     660 000000bc 026B          MOVB      ACC,#107              ; [CPU_ALU] |100| 
     661 000000bd E851          MPYF32    R0H,R0H,#17530        ; [CPU_FPU] |100| 
         000000be 1E80 
     662 000000bf 761F-         MOVW      DP,#_Pwmdac12_PwmRegs ; [CPU_ARAU] 
         000000c0 0000 
     663 000000c1 E84F          MPYF32    R0H,R0H,#16000        ; [CPU_FPU] |100| 
         000000c2 A000 
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   14

     664 000000c3 0700-         ADDL      ACC,@_Pwmdac12_PwmRegs ; [CPU_ALU] |100| 
     665 000000c4 E68E          F32TOUI16 R0H,R0H               ; [CPU_FPU] |100| 
         000000c5 0000 
     666 000000c6 8AA9          MOVL      XAR4,ACC              ; [CPU_ALU] |100| 
     667 000000c7 E213          MOV16     *+XAR4[0],R0H         ; [CPU_FPU] |100| 
         000000c8 00C4 
     668              $C$DW$41        .dwtag  DW_TAG_TI_branch
     669                      .dwattr $C$DW$41, DW_AT_low_pc(0x00)
     670                      .dwattr $C$DW$41, DW_AT_TI_return
     671              
     672 000000c9 0006          LRETR     ; [CPU_ALU] 
     673                      ; return occurs ; [] 
     674                      .dwattr $C$DW$38, DW_AT_TI_end_file("../sources/pwmdac.c")
     675                      .dwattr $C$DW$38, DW_AT_TI_end_line(0x65)
     676                      .dwattr $C$DW$38, DW_AT_TI_end_column(0x01)
     677                      .dwendentry
     678                      .dwendtag $C$DW$38
     679              
     680              ;**************************************************************
     681              ;* UNDEFINED EXTERNAL REFERENCES                              *
     682              ;**************************************************************
     683                      .global _GPIO_SetupPinMux
     684              
     685              ;***************************************************************
     686              ;* TYPE INFORMATION                                            *
     687              ;***************************************************************
     688              
     689              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     690                      .dwattr $C$DW$T$20, DW_AT_name("AQCSFRC_BITS")
     691                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     692              $C$DW$42        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     694                      .dwattr $C$DW$42, DW_AT_name("CSFA")
     695                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_CSFA")
     696                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0e)
     697                      .dwattr $C$DW$42, DW_AT_bit_size(0x02)
     698                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     699                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     700              
     701              $C$DW$43        .dwtag  DW_TAG_member
     702                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     703                      .dwattr $C$DW$43, DW_AT_name("CSFB")
     704                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_CSFB")
     705                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0c)
     706                      .dwattr $C$DW$43, DW_AT_bit_size(0x02)
     707                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     708                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     709              
     710              $C$DW$44        .dwtag  DW_TAG_member
     711                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     712                      .dwattr $C$DW$44, DW_AT_name("rsvd1")
     713                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_rsvd1")
     714                      .dwattr $C$DW$44, DW_AT_bit_offset(0x00)
     715                      .dwattr $C$DW$44, DW_AT_bit_size(0x0c)
     716                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   15

     717                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     718              
     719                      .dwendtag $C$DW$T$20
     720              
     721              
     722              $C$DW$T$21      .dwtag  DW_TAG_union_type
     723                      .dwattr $C$DW$T$21, DW_AT_name("AQCSFRC_REG")
     724                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     725              $C$DW$45        .dwtag  DW_TAG_member
     726                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     727                      .dwattr $C$DW$45, DW_AT_name("all")
     728                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_all")
     729                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     731              
     732              $C$DW$46        .dwtag  DW_TAG_member
     733                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$20)
     734                      .dwattr $C$DW$46, DW_AT_name("bit")
     735                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_bit")
     736                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     737                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     738              
     739                      .dwendtag $C$DW$T$21
     740              
     741              
     742              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     743                      .dwattr $C$DW$T$22, DW_AT_name("AQCTLA2_BITS")
     744                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     745              $C$DW$47        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     747                      .dwattr $C$DW$47, DW_AT_name("T1U")
     748                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_T1U")
     749                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0e)
     750                      .dwattr $C$DW$47, DW_AT_bit_size(0x02)
     751                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     752                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     753              
     754              $C$DW$48        .dwtag  DW_TAG_member
     755                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     756                      .dwattr $C$DW$48, DW_AT_name("T1D")
     757                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_T1D")
     758                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0c)
     759                      .dwattr $C$DW$48, DW_AT_bit_size(0x02)
     760                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     761                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     762              
     763              $C$DW$49        .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     765                      .dwattr $C$DW$49, DW_AT_name("T2U")
     766                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_T2U")
     767                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0a)
     768                      .dwattr $C$DW$49, DW_AT_bit_size(0x02)
     769                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     770                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     771              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   16

     772              $C$DW$50        .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     774                      .dwattr $C$DW$50, DW_AT_name("T2D")
     775                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_T2D")
     776                      .dwattr $C$DW$50, DW_AT_bit_offset(0x08)
     777                      .dwattr $C$DW$50, DW_AT_bit_size(0x02)
     778                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     779                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     780              
     781              $C$DW$51        .dwtag  DW_TAG_member
     782                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     783                      .dwattr $C$DW$51, DW_AT_name("rsvd1")
     784                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd1")
     785                      .dwattr $C$DW$51, DW_AT_bit_offset(0x00)
     786                      .dwattr $C$DW$51, DW_AT_bit_size(0x08)
     787                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     788                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     789              
     790                      .dwendtag $C$DW$T$22
     791              
     792              
     793              $C$DW$T$23      .dwtag  DW_TAG_union_type
     794                      .dwattr $C$DW$T$23, DW_AT_name("AQCTLA2_REG")
     795                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     796              $C$DW$52        .dwtag  DW_TAG_member
     797                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     798                      .dwattr $C$DW$52, DW_AT_name("all")
     799                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_all")
     800                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     801                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     802              
     803              $C$DW$53        .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$22)
     805                      .dwattr $C$DW$53, DW_AT_name("bit")
     806                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_bit")
     807                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     808                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     809              
     810                      .dwendtag $C$DW$T$23
     811              
     812              
     813              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     814                      .dwattr $C$DW$T$24, DW_AT_name("AQCTLA_BITS")
     815                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     816              $C$DW$54        .dwtag  DW_TAG_member
     817                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     818                      .dwattr $C$DW$54, DW_AT_name("ZRO")
     819                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_ZRO")
     820                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0e)
     821                      .dwattr $C$DW$54, DW_AT_bit_size(0x02)
     822                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     824              
     825              $C$DW$55        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   17

     827                      .dwattr $C$DW$55, DW_AT_name("PRD")
     828                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_PRD")
     829                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0c)
     830                      .dwattr $C$DW$55, DW_AT_bit_size(0x02)
     831                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     832                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     833              
     834              $C$DW$56        .dwtag  DW_TAG_member
     835                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     836                      .dwattr $C$DW$56, DW_AT_name("CAU")
     837                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_CAU")
     838                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0a)
     839                      .dwattr $C$DW$56, DW_AT_bit_size(0x02)
     840                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     841                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     842              
     843              $C$DW$57        .dwtag  DW_TAG_member
     844                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     845                      .dwattr $C$DW$57, DW_AT_name("CAD")
     846                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_CAD")
     847                      .dwattr $C$DW$57, DW_AT_bit_offset(0x08)
     848                      .dwattr $C$DW$57, DW_AT_bit_size(0x02)
     849                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     851              
     852              $C$DW$58        .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     854                      .dwattr $C$DW$58, DW_AT_name("CBU")
     855                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_CBU")
     856                      .dwattr $C$DW$58, DW_AT_bit_offset(0x06)
     857                      .dwattr $C$DW$58, DW_AT_bit_size(0x02)
     858                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     859                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     860              
     861              $C$DW$59        .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     863                      .dwattr $C$DW$59, DW_AT_name("CBD")
     864                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_CBD")
     865                      .dwattr $C$DW$59, DW_AT_bit_offset(0x04)
     866                      .dwattr $C$DW$59, DW_AT_bit_size(0x02)
     867                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     868                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     869              
     870              $C$DW$60        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     872                      .dwattr $C$DW$60, DW_AT_name("rsvd1")
     873                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd1")
     874                      .dwattr $C$DW$60, DW_AT_bit_offset(0x00)
     875                      .dwattr $C$DW$60, DW_AT_bit_size(0x04)
     876                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     877                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     878              
     879                      .dwendtag $C$DW$T$24
     880              
     881              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   18

     882              $C$DW$T$25      .dwtag  DW_TAG_union_type
     883                      .dwattr $C$DW$T$25, DW_AT_name("AQCTLA_REG")
     884                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     885              $C$DW$61        .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     887                      .dwattr $C$DW$61, DW_AT_name("all")
     888                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_all")
     889                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     890                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     891              
     892              $C$DW$62        .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$24)
     894                      .dwattr $C$DW$62, DW_AT_name("bit")
     895                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_bit")
     896                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     897                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     898              
     899                      .dwendtag $C$DW$T$25
     900              
     901              
     902              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     903                      .dwattr $C$DW$T$26, DW_AT_name("AQCTLB2_BITS")
     904                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     905              $C$DW$63        .dwtag  DW_TAG_member
     906                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     907                      .dwattr $C$DW$63, DW_AT_name("T1U")
     908                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_T1U")
     909                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0e)
     910                      .dwattr $C$DW$63, DW_AT_bit_size(0x02)
     911                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     912                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     913              
     914              $C$DW$64        .dwtag  DW_TAG_member
     915                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     916                      .dwattr $C$DW$64, DW_AT_name("T1D")
     917                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_T1D")
     918                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c)
     919                      .dwattr $C$DW$64, DW_AT_bit_size(0x02)
     920                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     921                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     922              
     923              $C$DW$65        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     925                      .dwattr $C$DW$65, DW_AT_name("T2U")
     926                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_T2U")
     927                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0a)
     928                      .dwattr $C$DW$65, DW_AT_bit_size(0x02)
     929                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     930                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     931              
     932              $C$DW$66        .dwtag  DW_TAG_member
     933                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     934                      .dwattr $C$DW$66, DW_AT_name("T2D")
     935                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_T2D")
     936                      .dwattr $C$DW$66, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   19

     937                      .dwattr $C$DW$66, DW_AT_bit_size(0x02)
     938                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     940              
     941              $C$DW$67        .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     943                      .dwattr $C$DW$67, DW_AT_name("rsvd1")
     944                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_rsvd1")
     945                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
     946                      .dwattr $C$DW$67, DW_AT_bit_size(0x08)
     947                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     949              
     950                      .dwendtag $C$DW$T$26
     951              
     952              
     953              $C$DW$T$27      .dwtag  DW_TAG_union_type
     954                      .dwattr $C$DW$T$27, DW_AT_name("AQCTLB2_REG")
     955                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     956              $C$DW$68        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     958                      .dwattr $C$DW$68, DW_AT_name("all")
     959                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_all")
     960                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     962              
     963              $C$DW$69        .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$26)
     965                      .dwattr $C$DW$69, DW_AT_name("bit")
     966                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_bit")
     967                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     968                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     969              
     970                      .dwendtag $C$DW$T$27
     971              
     972              
     973              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     974                      .dwattr $C$DW$T$28, DW_AT_name("AQCTLB_BITS")
     975                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     976              $C$DW$70        .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     978                      .dwattr $C$DW$70, DW_AT_name("ZRO")
     979                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_ZRO")
     980                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0e)
     981                      .dwattr $C$DW$70, DW_AT_bit_size(0x02)
     982                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     983                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     984              
     985              $C$DW$71        .dwtag  DW_TAG_member
     986                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     987                      .dwattr $C$DW$71, DW_AT_name("PRD")
     988                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_PRD")
     989                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0c)
     990                      .dwattr $C$DW$71, DW_AT_bit_size(0x02)
     991                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   20

     992                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     993              
     994              $C$DW$72        .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     996                      .dwattr $C$DW$72, DW_AT_name("CAU")
     997                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_CAU")
     998                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0a)
     999                      .dwattr $C$DW$72, DW_AT_bit_size(0x02)
    1000                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1002              
    1003              $C$DW$73        .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1005                      .dwattr $C$DW$73, DW_AT_name("CAD")
    1006                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_CAD")
    1007                      .dwattr $C$DW$73, DW_AT_bit_offset(0x08)
    1008                      .dwattr $C$DW$73, DW_AT_bit_size(0x02)
    1009                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1010                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1011              
    1012              $C$DW$74        .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1014                      .dwattr $C$DW$74, DW_AT_name("CBU")
    1015                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_CBU")
    1016                      .dwattr $C$DW$74, DW_AT_bit_offset(0x06)
    1017                      .dwattr $C$DW$74, DW_AT_bit_size(0x02)
    1018                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1019                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1020              
    1021              $C$DW$75        .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1023                      .dwattr $C$DW$75, DW_AT_name("CBD")
    1024                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_CBD")
    1025                      .dwattr $C$DW$75, DW_AT_bit_offset(0x04)
    1026                      .dwattr $C$DW$75, DW_AT_bit_size(0x02)
    1027                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1029              
    1030              $C$DW$76        .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1032                      .dwattr $C$DW$76, DW_AT_name("rsvd1")
    1033                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_rsvd1")
    1034                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00)
    1035                      .dwattr $C$DW$76, DW_AT_bit_size(0x04)
    1036                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1038              
    1039                      .dwendtag $C$DW$T$28
    1040              
    1041              
    1042              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1043                      .dwattr $C$DW$T$29, DW_AT_name("AQCTLB_REG")
    1044                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1045              $C$DW$77        .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   21

    1047                      .dwattr $C$DW$77, DW_AT_name("all")
    1048                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_all")
    1049                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1050                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1051              
    1052              $C$DW$78        .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$28)
    1054                      .dwattr $C$DW$78, DW_AT_name("bit")
    1055                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_bit")
    1056                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1057                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1058              
    1059                      .dwendtag $C$DW$T$29
    1060              
    1061              
    1062              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1063                      .dwattr $C$DW$T$30, DW_AT_name("AQCTL_BITS")
    1064                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1065              $C$DW$79        .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1067                      .dwattr $C$DW$79, DW_AT_name("LDAQAMODE")
    1068                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_LDAQAMODE")
    1069                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0e)
    1070                      .dwattr $C$DW$79, DW_AT_bit_size(0x02)
    1071                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1072                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1073              
    1074              $C$DW$80        .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1076                      .dwattr $C$DW$80, DW_AT_name("LDAQBMODE")
    1077                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_LDAQBMODE")
    1078                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0c)
    1079                      .dwattr $C$DW$80, DW_AT_bit_size(0x02)
    1080                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1081                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1082              
    1083              $C$DW$81        .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1085                      .dwattr $C$DW$81, DW_AT_name("SHDWAQAMODE")
    1086                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_SHDWAQAMODE")
    1087                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0b)
    1088                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1089                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1091              
    1092              $C$DW$82        .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$82, DW_AT_name("rsvd1")
    1095                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd1")
    1096                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0a)
    1097                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1098                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1099                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1100              
    1101              $C$DW$83        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   22

    1102                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1103                      .dwattr $C$DW$83, DW_AT_name("SHDWAQBMODE")
    1104                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_SHDWAQBMODE")
    1105                      .dwattr $C$DW$83, DW_AT_bit_offset(0x09)
    1106                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1107                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1108                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1109              
    1110              $C$DW$84        .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1112                      .dwattr $C$DW$84, DW_AT_name("rsvd2")
    1113                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd2")
    1114                      .dwattr $C$DW$84, DW_AT_bit_offset(0x08)
    1115                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1116                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1117                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1118              
    1119              $C$DW$85        .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1121                      .dwattr $C$DW$85, DW_AT_name("LDAQASYNC")
    1122                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_LDAQASYNC")
    1123                      .dwattr $C$DW$85, DW_AT_bit_offset(0x06)
    1124                      .dwattr $C$DW$85, DW_AT_bit_size(0x02)
    1125                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1126                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1127              
    1128              $C$DW$86        .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1130                      .dwattr $C$DW$86, DW_AT_name("LDAQBSYNC")
    1131                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_LDAQBSYNC")
    1132                      .dwattr $C$DW$86, DW_AT_bit_offset(0x04)
    1133                      .dwattr $C$DW$86, DW_AT_bit_size(0x02)
    1134                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1136              
    1137              $C$DW$87        .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$87, DW_AT_name("rsvd3")
    1140                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd3")
    1141                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
    1142                      .dwattr $C$DW$87, DW_AT_bit_size(0x04)
    1143                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1144                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1145              
    1146                      .dwendtag $C$DW$T$30
    1147              
    1148              
    1149              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1150                      .dwattr $C$DW$T$31, DW_AT_name("AQCTL_REG")
    1151                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1152              $C$DW$88        .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1154                      .dwattr $C$DW$88, DW_AT_name("all")
    1155                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
    1156                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   23

    1157                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1158              
    1159              $C$DW$89        .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$30)
    1161                      .dwattr $C$DW$89, DW_AT_name("bit")
    1162                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
    1163                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1165              
    1166                      .dwendtag $C$DW$T$31
    1167              
    1168              
    1169              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1170                      .dwattr $C$DW$T$32, DW_AT_name("AQSFRC_BITS")
    1171                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1172              $C$DW$90        .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1174                      .dwattr $C$DW$90, DW_AT_name("ACTSFA")
    1175                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_ACTSFA")
    1176                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0e)
    1177                      .dwattr $C$DW$90, DW_AT_bit_size(0x02)
    1178                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1179                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1180              
    1181              $C$DW$91        .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1183                      .dwattr $C$DW$91, DW_AT_name("OTSFA")
    1184                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_OTSFA")
    1185                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0d)
    1186                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1187                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1188                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1189              
    1190              $C$DW$92        .dwtag  DW_TAG_member
    1191                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1192                      .dwattr $C$DW$92, DW_AT_name("ACTSFB")
    1193                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_ACTSFB")
    1194                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0b)
    1195                      .dwattr $C$DW$92, DW_AT_bit_size(0x02)
    1196                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1197                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1198              
    1199              $C$DW$93        .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1201                      .dwattr $C$DW$93, DW_AT_name("OTSFB")
    1202                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_OTSFB")
    1203                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0a)
    1204                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1205                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1206                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1207              
    1208              $C$DW$94        .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1210                      .dwattr $C$DW$94, DW_AT_name("RLDCSF")
    1211                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_RLDCSF")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   24

    1212                      .dwattr $C$DW$94, DW_AT_bit_offset(0x08)
    1213                      .dwattr $C$DW$94, DW_AT_bit_size(0x02)
    1214                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1216              
    1217              $C$DW$95        .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1219                      .dwattr $C$DW$95, DW_AT_name("rsvd1")
    1220                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd1")
    1221                      .dwattr $C$DW$95, DW_AT_bit_offset(0x00)
    1222                      .dwattr $C$DW$95, DW_AT_bit_size(0x08)
    1223                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1224                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1225              
    1226                      .dwendtag $C$DW$T$32
    1227              
    1228              
    1229              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1230                      .dwattr $C$DW$T$33, DW_AT_name("AQSFRC_REG")
    1231                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1232              $C$DW$96        .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1234                      .dwattr $C$DW$96, DW_AT_name("all")
    1235                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_all")
    1236                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1237                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1238              
    1239              $C$DW$97        .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$32)
    1241                      .dwattr $C$DW$97, DW_AT_name("bit")
    1242                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_bit")
    1243                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1244                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1245              
    1246                      .dwendtag $C$DW$T$33
    1247              
    1248              
    1249              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1250                      .dwattr $C$DW$T$34, DW_AT_name("AQTSRCSEL_BITS")
    1251                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1252              $C$DW$98        .dwtag  DW_TAG_member
    1253                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1254                      .dwattr $C$DW$98, DW_AT_name("T1SEL")
    1255                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_T1SEL")
    1256                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c)
    1257                      .dwattr $C$DW$98, DW_AT_bit_size(0x04)
    1258                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1259                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1260              
    1261              $C$DW$99        .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1263                      .dwattr $C$DW$99, DW_AT_name("T2SEL")
    1264                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_T2SEL")
    1265                      .dwattr $C$DW$99, DW_AT_bit_offset(0x08)
    1266                      .dwattr $C$DW$99, DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   25

    1267                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1268                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1269              
    1270              $C$DW$100       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$100, DW_AT_name("rsvd1")
    1273                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd1")
    1274                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00)
    1275                      .dwattr $C$DW$100, DW_AT_bit_size(0x08)
    1276                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1278              
    1279                      .dwendtag $C$DW$T$34
    1280              
    1281              
    1282              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1283                      .dwattr $C$DW$T$35, DW_AT_name("AQTSRCSEL_REG")
    1284                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1285              $C$DW$101       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$101, DW_AT_name("all")
    1288                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1289                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1290                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1291              
    1292              $C$DW$102       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$34)
    1294                      .dwattr $C$DW$102, DW_AT_name("bit")
    1295                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1296                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1298              
    1299                      .dwendtag $C$DW$T$35
    1300              
    1301              
    1302              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1303                      .dwattr $C$DW$T$36, DW_AT_name("CMPA_BITS")
    1304                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1305              $C$DW$103       .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$103, DW_AT_name("CMPAHR")
    1308                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_CMPAHR")
    1309                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1310                      .dwattr $C$DW$103, DW_AT_bit_size(0x10)
    1311                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1313              
    1314              $C$DW$104       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1316                      .dwattr $C$DW$104, DW_AT_name("CMPA")
    1317                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_CMPA")
    1318                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1319                      .dwattr $C$DW$104, DW_AT_bit_size(0x10)
    1320                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1321                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   26

    1322              
    1323                      .dwendtag $C$DW$T$36
    1324              
    1325              
    1326              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1327                      .dwattr $C$DW$T$38, DW_AT_name("CMPA_REG")
    1328                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1329              $C$DW$105       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$37)
    1331                      .dwattr $C$DW$105, DW_AT_name("all")
    1332                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_all")
    1333                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1334                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1335              
    1336              $C$DW$106       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$36)
    1338                      .dwattr $C$DW$106, DW_AT_name("bit")
    1339                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_bit")
    1340                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1342              
    1343                      .dwendtag $C$DW$T$38
    1344              
    1345              
    1346              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1347                      .dwattr $C$DW$T$39, DW_AT_name("CMPB_BITS")
    1348                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1349              $C$DW$107       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1351                      .dwattr $C$DW$107, DW_AT_name("CMPBHR")
    1352                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_CMPBHR")
    1353                      .dwattr $C$DW$107, DW_AT_bit_offset(0x00)
    1354                      .dwattr $C$DW$107, DW_AT_bit_size(0x10)
    1355                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1356                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1357              
    1358              $C$DW$108       .dwtag  DW_TAG_member
    1359                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1360                      .dwattr $C$DW$108, DW_AT_name("CMPB")
    1361                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_CMPB")
    1362                      .dwattr $C$DW$108, DW_AT_bit_offset(0x00)
    1363                      .dwattr $C$DW$108, DW_AT_bit_size(0x10)
    1364                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1365                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1366              
    1367                      .dwendtag $C$DW$T$39
    1368              
    1369              
    1370              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1371                      .dwattr $C$DW$T$40, DW_AT_name("CMPB_REG")
    1372                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1373              $C$DW$109       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$37)
    1375                      .dwattr $C$DW$109, DW_AT_name("all")
    1376                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   27

    1377                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1379              
    1380              $C$DW$110       .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$39)
    1382                      .dwattr $C$DW$110, DW_AT_name("bit")
    1383                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_bit")
    1384                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1386              
    1387                      .dwendtag $C$DW$T$40
    1388              
    1389              
    1390              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1391                      .dwattr $C$DW$T$41, DW_AT_name("CMPCTL2_BITS")
    1392                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1393              $C$DW$111       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1395                      .dwattr $C$DW$111, DW_AT_name("LOADCMODE")
    1396                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_LOADCMODE")
    1397                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0e)
    1398                      .dwattr $C$DW$111, DW_AT_bit_size(0x02)
    1399                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1401              
    1402              $C$DW$112       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1404                      .dwattr $C$DW$112, DW_AT_name("LOADDMODE")
    1405                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_LOADDMODE")
    1406                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0c)
    1407                      .dwattr $C$DW$112, DW_AT_bit_size(0x02)
    1408                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1410              
    1411              $C$DW$113       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1413                      .dwattr $C$DW$113, DW_AT_name("SHDWCMODE")
    1414                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_SHDWCMODE")
    1415                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0b)
    1416                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1417                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1419              
    1420              $C$DW$114       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1422                      .dwattr $C$DW$114, DW_AT_name("rsvd1")
    1423                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd1")
    1424                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0a)
    1425                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1426                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1428              
    1429              $C$DW$115       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1431                      .dwattr $C$DW$115, DW_AT_name("SHDWDMODE")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   28

    1432                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_SHDWDMODE")
    1433                      .dwattr $C$DW$115, DW_AT_bit_offset(0x09)
    1434                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1435                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1437              
    1438              $C$DW$116       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1440                      .dwattr $C$DW$116, DW_AT_name("rsvd2")
    1441                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd2")
    1442                      .dwattr $C$DW$116, DW_AT_bit_offset(0x06)
    1443                      .dwattr $C$DW$116, DW_AT_bit_size(0x03)
    1444                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1446              
    1447              $C$DW$117       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1449                      .dwattr $C$DW$117, DW_AT_name("LOADCSYNC")
    1450                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_LOADCSYNC")
    1451                      .dwattr $C$DW$117, DW_AT_bit_offset(0x04)
    1452                      .dwattr $C$DW$117, DW_AT_bit_size(0x02)
    1453                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1454                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1455              
    1456              $C$DW$118       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1458                      .dwattr $C$DW$118, DW_AT_name("LOADDSYNC")
    1459                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_LOADDSYNC")
    1460                      .dwattr $C$DW$118, DW_AT_bit_offset(0x02)
    1461                      .dwattr $C$DW$118, DW_AT_bit_size(0x02)
    1462                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1463                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1464              
    1465              $C$DW$119       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1467                      .dwattr $C$DW$119, DW_AT_name("rsvd3")
    1468                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd3")
    1469                      .dwattr $C$DW$119, DW_AT_bit_offset(0x00)
    1470                      .dwattr $C$DW$119, DW_AT_bit_size(0x02)
    1471                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1473              
    1474                      .dwendtag $C$DW$T$41
    1475              
    1476              
    1477              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1478                      .dwattr $C$DW$T$42, DW_AT_name("CMPCTL2_REG")
    1479                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1480              $C$DW$120       .dwtag  DW_TAG_member
    1481                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1482                      .dwattr $C$DW$120, DW_AT_name("all")
    1483                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_all")
    1484                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1485                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1486              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   29

    1487              $C$DW$121       .dwtag  DW_TAG_member
    1488                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$41)
    1489                      .dwattr $C$DW$121, DW_AT_name("bit")
    1490                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_bit")
    1491                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1493              
    1494                      .dwendtag $C$DW$T$42
    1495              
    1496              
    1497              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1498                      .dwattr $C$DW$T$43, DW_AT_name("CMPCTL_BITS")
    1499                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1500              $C$DW$122       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1502                      .dwattr $C$DW$122, DW_AT_name("LOADAMODE")
    1503                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_LOADAMODE")
    1504                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e)
    1505                      .dwattr $C$DW$122, DW_AT_bit_size(0x02)
    1506                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1508              
    1509              $C$DW$123       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1511                      .dwattr $C$DW$123, DW_AT_name("LOADBMODE")
    1512                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_LOADBMODE")
    1513                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0c)
    1514                      .dwattr $C$DW$123, DW_AT_bit_size(0x02)
    1515                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1517              
    1518              $C$DW$124       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1520                      .dwattr $C$DW$124, DW_AT_name("SHDWAMODE")
    1521                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_SHDWAMODE")
    1522                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0b)
    1523                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1524                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1525                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1526              
    1527              $C$DW$125       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1529                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    1530                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
    1531                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0a)
    1532                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1533                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1535              
    1536              $C$DW$126       .dwtag  DW_TAG_member
    1537                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1538                      .dwattr $C$DW$126, DW_AT_name("SHDWBMODE")
    1539                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_SHDWBMODE")
    1540                      .dwattr $C$DW$126, DW_AT_bit_offset(0x09)
    1541                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   30

    1542                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1543                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1544              
    1545              $C$DW$127       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1547                      .dwattr $C$DW$127, DW_AT_name("rsvd2")
    1548                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd2")
    1549                      .dwattr $C$DW$127, DW_AT_bit_offset(0x08)
    1550                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1551                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1553              
    1554              $C$DW$128       .dwtag  DW_TAG_member
    1555                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1556                      .dwattr $C$DW$128, DW_AT_name("SHDWAFULL")
    1557                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_SHDWAFULL")
    1558                      .dwattr $C$DW$128, DW_AT_bit_offset(0x07)
    1559                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1560                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1561                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1562              
    1563              $C$DW$129       .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1565                      .dwattr $C$DW$129, DW_AT_name("SHDWBFULL")
    1566                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_SHDWBFULL")
    1567                      .dwattr $C$DW$129, DW_AT_bit_offset(0x06)
    1568                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1569                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1570                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1571              
    1572              $C$DW$130       .dwtag  DW_TAG_member
    1573                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1574                      .dwattr $C$DW$130, DW_AT_name("LOADASYNC")
    1575                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_LOADASYNC")
    1576                      .dwattr $C$DW$130, DW_AT_bit_offset(0x04)
    1577                      .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    1578                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1579                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1580              
    1581              $C$DW$131       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1583                      .dwattr $C$DW$131, DW_AT_name("LOADBSYNC")
    1584                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_LOADBSYNC")
    1585                      .dwattr $C$DW$131, DW_AT_bit_offset(0x02)
    1586                      .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    1587                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1588                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1589              
    1590              $C$DW$132       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1592                      .dwattr $C$DW$132, DW_AT_name("rsvd3")
    1593                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd3")
    1594                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    1595                      .dwattr $C$DW$132, DW_AT_bit_size(0x02)
    1596                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   31

    1597                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1598              
    1599                      .dwendtag $C$DW$T$43
    1600              
    1601              
    1602              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1603                      .dwattr $C$DW$T$44, DW_AT_name("CMPCTL_REG")
    1604                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1605              $C$DW$133       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1607                      .dwattr $C$DW$133, DW_AT_name("all")
    1608                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_all")
    1609                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1610                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1611              
    1612              $C$DW$134       .dwtag  DW_TAG_member
    1613                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$43)
    1614                      .dwattr $C$DW$134, DW_AT_name("bit")
    1615                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_bit")
    1616                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1618              
    1619                      .dwendtag $C$DW$T$44
    1620              
    1621              
    1622              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1623                      .dwattr $C$DW$T$45, DW_AT_name("DBCTL2_BITS")
    1624                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1625              $C$DW$135       .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1627                      .dwattr $C$DW$135, DW_AT_name("LOADDBCTLMODE")
    1628                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_LOADDBCTLMODE")
    1629                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0e)
    1630                      .dwattr $C$DW$135, DW_AT_bit_size(0x02)
    1631                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1632                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1633              
    1634              $C$DW$136       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1636                      .dwattr $C$DW$136, DW_AT_name("SHDWDBCTLMODE")
    1637                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_SHDWDBCTLMODE")
    1638                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0d)
    1639                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1640                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1641                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1642              
    1643              $C$DW$137       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1645                      .dwattr $C$DW$137, DW_AT_name("rsvd1")
    1646                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd1")
    1647                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    1648                      .dwattr $C$DW$137, DW_AT_bit_size(0x0d)
    1649                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1650                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1651              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   32

    1652                      .dwendtag $C$DW$T$45
    1653              
    1654              
    1655              $C$DW$T$46      .dwtag  DW_TAG_union_type
    1656                      .dwattr $C$DW$T$46, DW_AT_name("DBCTL2_REG")
    1657                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1658              $C$DW$138       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1660                      .dwattr $C$DW$138, DW_AT_name("all")
    1661                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    1662                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1663                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1664              
    1665              $C$DW$139       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$45)
    1667                      .dwattr $C$DW$139, DW_AT_name("bit")
    1668                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    1669                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1670                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1671              
    1672                      .dwendtag $C$DW$T$46
    1673              
    1674              
    1675              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1676                      .dwattr $C$DW$T$47, DW_AT_name("DBCTL_BITS")
    1677                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1678              $C$DW$140       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1680                      .dwattr $C$DW$140, DW_AT_name("OUT_MODE")
    1681                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_OUT_MODE")
    1682                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0e)
    1683                      .dwattr $C$DW$140, DW_AT_bit_size(0x02)
    1684                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1685                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1686              
    1687              $C$DW$141       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1689                      .dwattr $C$DW$141, DW_AT_name("POLSEL")
    1690                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_POLSEL")
    1691                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0c)
    1692                      .dwattr $C$DW$141, DW_AT_bit_size(0x02)
    1693                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1694                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1695              
    1696              $C$DW$142       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1698                      .dwattr $C$DW$142, DW_AT_name("IN_MODE")
    1699                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_IN_MODE")
    1700                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0a)
    1701                      .dwattr $C$DW$142, DW_AT_bit_size(0x02)
    1702                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1703                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1704              
    1705              $C$DW$143       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   33

    1707                      .dwattr $C$DW$143, DW_AT_name("LOADREDMODE")
    1708                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_LOADREDMODE")
    1709                      .dwattr $C$DW$143, DW_AT_bit_offset(0x08)
    1710                      .dwattr $C$DW$143, DW_AT_bit_size(0x02)
    1711                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1712                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1713              
    1714              $C$DW$144       .dwtag  DW_TAG_member
    1715                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1716                      .dwattr $C$DW$144, DW_AT_name("LOADFEDMODE")
    1717                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_LOADFEDMODE")
    1718                      .dwattr $C$DW$144, DW_AT_bit_offset(0x06)
    1719                      .dwattr $C$DW$144, DW_AT_bit_size(0x02)
    1720                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1721                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1722              
    1723              $C$DW$145       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1725                      .dwattr $C$DW$145, DW_AT_name("SHDWDBREDMODE")
    1726                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_SHDWDBREDMODE")
    1727                      .dwattr $C$DW$145, DW_AT_bit_offset(0x05)
    1728                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1729                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1730                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1731              
    1732              $C$DW$146       .dwtag  DW_TAG_member
    1733                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1734                      .dwattr $C$DW$146, DW_AT_name("SHDWDBFEDMODE")
    1735                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_SHDWDBFEDMODE")
    1736                      .dwattr $C$DW$146, DW_AT_bit_offset(0x04)
    1737                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1738                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1739                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1740              
    1741              $C$DW$147       .dwtag  DW_TAG_member
    1742                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1743                      .dwattr $C$DW$147, DW_AT_name("OUTSWAP")
    1744                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_OUTSWAP")
    1745                      .dwattr $C$DW$147, DW_AT_bit_offset(0x02)
    1746                      .dwattr $C$DW$147, DW_AT_bit_size(0x02)
    1747                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1748                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1749              
    1750              $C$DW$148       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1752                      .dwattr $C$DW$148, DW_AT_name("DEDB_MODE")
    1753                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_DEDB_MODE")
    1754                      .dwattr $C$DW$148, DW_AT_bit_offset(0x01)
    1755                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1756                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1758              
    1759              $C$DW$149       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1761                      .dwattr $C$DW$149, DW_AT_name("HALFCYCLE")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   34

    1762                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_HALFCYCLE")
    1763                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00)
    1764                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1765                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1766                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1767              
    1768                      .dwendtag $C$DW$T$47
    1769              
    1770              
    1771              $C$DW$T$48      .dwtag  DW_TAG_union_type
    1772                      .dwattr $C$DW$T$48, DW_AT_name("DBCTL_REG")
    1773                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1774              $C$DW$150       .dwtag  DW_TAG_member
    1775                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1776                      .dwattr $C$DW$150, DW_AT_name("all")
    1777                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_all")
    1778                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1779                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1780              
    1781              $C$DW$151       .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$47)
    1783                      .dwattr $C$DW$151, DW_AT_name("bit")
    1784                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_bit")
    1785                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1786                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1787              
    1788                      .dwendtag $C$DW$T$48
    1789              
    1790              
    1791              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1792                      .dwattr $C$DW$T$49, DW_AT_name("DBFEDHR_BITS")
    1793                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    1794              $C$DW$152       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1796                      .dwattr $C$DW$152, DW_AT_name("rsvd1")
    1797                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd1")
    1798                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0f)
    1799                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1800                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1801                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1802              
    1803              $C$DW$153       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1805                      .dwattr $C$DW$153, DW_AT_name("rsvd2")
    1806                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd2")
    1807                      .dwattr $C$DW$153, DW_AT_bit_offset(0x08)
    1808                      .dwattr $C$DW$153, DW_AT_bit_size(0x07)
    1809                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1810                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1811              
    1812              $C$DW$154       .dwtag  DW_TAG_member
    1813                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1814                      .dwattr $C$DW$154, DW_AT_name("rsvd3")
    1815                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd3")
    1816                      .dwattr $C$DW$154, DW_AT_bit_offset(0x07)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   35

    1817                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1818                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1819                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1820              
    1821              $C$DW$155       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1823                      .dwattr $C$DW$155, DW_AT_name("DBFEDHR")
    1824                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_DBFEDHR")
    1825                      .dwattr $C$DW$155, DW_AT_bit_offset(0x00)
    1826                      .dwattr $C$DW$155, DW_AT_bit_size(0x07)
    1827                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1828                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1829              
    1830                      .dwendtag $C$DW$T$49
    1831              
    1832              
    1833              $C$DW$T$50      .dwtag  DW_TAG_union_type
    1834                      .dwattr $C$DW$T$50, DW_AT_name("DBFEDHR_REG")
    1835                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    1836              $C$DW$156       .dwtag  DW_TAG_member
    1837                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1838                      .dwattr $C$DW$156, DW_AT_name("all")
    1839                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_all")
    1840                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1841                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1842              
    1843              $C$DW$157       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$49)
    1845                      .dwattr $C$DW$157, DW_AT_name("bit")
    1846                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_bit")
    1847                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1848                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1849              
    1850                      .dwendtag $C$DW$T$50
    1851              
    1852              
    1853              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1854                      .dwattr $C$DW$T$51, DW_AT_name("DBFED_BITS")
    1855                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    1856              $C$DW$158       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1858                      .dwattr $C$DW$158, DW_AT_name("DBFED")
    1859                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_DBFED")
    1860                      .dwattr $C$DW$158, DW_AT_bit_offset(0x02)
    1861                      .dwattr $C$DW$158, DW_AT_bit_size(0x0e)
    1862                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1863                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1864              
    1865              $C$DW$159       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1867                      .dwattr $C$DW$159, DW_AT_name("rsvd1")
    1868                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd1")
    1869                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00)
    1870                      .dwattr $C$DW$159, DW_AT_bit_size(0x02)
    1871                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   36

    1872                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1873              
    1874                      .dwendtag $C$DW$T$51
    1875              
    1876              
    1877              $C$DW$T$52      .dwtag  DW_TAG_union_type
    1878                      .dwattr $C$DW$T$52, DW_AT_name("DBFED_REG")
    1879                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    1880              $C$DW$160       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1882                      .dwattr $C$DW$160, DW_AT_name("all")
    1883                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_all")
    1884                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1885                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1886              
    1887              $C$DW$161       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$51)
    1889                      .dwattr $C$DW$161, DW_AT_name("bit")
    1890                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_bit")
    1891                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1892                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1893              
    1894                      .dwendtag $C$DW$T$52
    1895              
    1896              
    1897              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    1898                      .dwattr $C$DW$T$53, DW_AT_name("DBREDHR_BITS")
    1899                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    1900              $C$DW$162       .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1902                      .dwattr $C$DW$162, DW_AT_name("rsvd1")
    1903                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd1")
    1904                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0f)
    1905                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    1906                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1907                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1908              
    1909              $C$DW$163       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1911                      .dwattr $C$DW$163, DW_AT_name("rsvd2")
    1912                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd2")
    1913                      .dwattr $C$DW$163, DW_AT_bit_offset(0x08)
    1914                      .dwattr $C$DW$163, DW_AT_bit_size(0x07)
    1915                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1916                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1917              
    1918              $C$DW$164       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1920                      .dwattr $C$DW$164, DW_AT_name("rsvd3")
    1921                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd3")
    1922                      .dwattr $C$DW$164, DW_AT_bit_offset(0x07)
    1923                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    1924                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1925                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1926              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   37

    1927              $C$DW$165       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1929                      .dwattr $C$DW$165, DW_AT_name("DBREDHR")
    1930                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_DBREDHR")
    1931                      .dwattr $C$DW$165, DW_AT_bit_offset(0x00)
    1932                      .dwattr $C$DW$165, DW_AT_bit_size(0x07)
    1933                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1934                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1935              
    1936                      .dwendtag $C$DW$T$53
    1937              
    1938              
    1939              $C$DW$T$54      .dwtag  DW_TAG_union_type
    1940                      .dwattr $C$DW$T$54, DW_AT_name("DBREDHR_REG")
    1941                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    1942              $C$DW$166       .dwtag  DW_TAG_member
    1943                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1944                      .dwattr $C$DW$166, DW_AT_name("all")
    1945                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_all")
    1946                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1947                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1948              
    1949              $C$DW$167       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$53)
    1951                      .dwattr $C$DW$167, DW_AT_name("bit")
    1952                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_bit")
    1953                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1955              
    1956                      .dwendtag $C$DW$T$54
    1957              
    1958              
    1959              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    1960                      .dwattr $C$DW$T$55, DW_AT_name("DBRED_BITS")
    1961                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    1962              $C$DW$168       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1964                      .dwattr $C$DW$168, DW_AT_name("DBRED")
    1965                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_DBRED")
    1966                      .dwattr $C$DW$168, DW_AT_bit_offset(0x02)
    1967                      .dwattr $C$DW$168, DW_AT_bit_size(0x0e)
    1968                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1969                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1970              
    1971              $C$DW$169       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1973                      .dwattr $C$DW$169, DW_AT_name("rsvd1")
    1974                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd1")
    1975                      .dwattr $C$DW$169, DW_AT_bit_offset(0x00)
    1976                      .dwattr $C$DW$169, DW_AT_bit_size(0x02)
    1977                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1978                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1979              
    1980                      .dwendtag $C$DW$T$55
    1981              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:57 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
pwmdac.asm                                                           PAGE   38

    1982              
    1983              $C$DW$T$56      .dwtag  DW_TAG_union_type
    1984                      .dwattr $C$DW$T$56, DW_AT_name("DBRED_REG")
    1985                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    1986              $C$DW$170       .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1988                      .dwattr $C$DW$170, DW_AT_name("all")
    1989                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_all")
    1990                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1992              
    1993              $C$DW$171       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$55)
    1995                      .dwattr $C$DW$171, DW_AT_name("bit")
    1996                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_bit")
    1997                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1998                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1999              
    2000                      .dwendtag $C$DW$T$56
    2001              
    2002              
    2003              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2004                      .dwattr $C$DW$T$57, DW_AT_name("DCACTL_BITS")
    2005                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
    2006              $C$DW$172       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2008                      .dwattr $C$DW$172, DW_AT_name("EVT1SRCSEL")
