TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:55 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/SciCommsGui_32bit.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    2057 000002e3 3AE5          MOVL      *+XAR5[4],XAR0        ; [CPU_ALU] |153| 
    2058 000002e4 761F!         MOVW      DP,#_SciaRegs+15      ; [CPU_ARAU] 
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   42

         000002e5 0000 
    2059 000002e6 8E52          MOVL      XAR0,*-SP[18]         ; [CPU_ALU] |153| 
    2060                      .dwpsn  file "../sources/SciCommsGui_32bit.c",line 158,column 3,is_stmt,isa 0
    2061 000002e7 76C0'         MOVL      XAR7,#_DataSet32      ; [CPU_ARAU] |158| 
         000002e8 0183 
    2062                      .dwpsn  file "../sources/SciCommsGui_32bit.c",line 136,column 2,is_stmt,isa 0
    2063 000002e9 A94A          MOVL      *-SP[10],P            ; [CPU_ALU] |136| 
    2064                      .dwpsn  file "../sources/SciCommsGui_32bit.c",line 145,column 3,is_stmt,isa 0
    2065 000002ea 2BC4          MOV       *+XAR4[0],#0          ; [CPU_ALU] |145| 
    2066                      .dwpsn  file "../sources/SciCommsGui_32bit.c",line 154,column 3,is_stmt,isa 0
    2067 000002eb 3AF5          MOVL      *+XAR5[6],XAR0        ; [CPU_ALU] |154| 
    2068                      .dwpsn  file "../sources/SciCommsGui_32bit.c",line 155,column 3,is_stmt,isa 0
    2069 000002ec D008          MOVB      XAR0,#8               ; [CPU_ALU] |155| 
    2070                      .dwpsn  file "../sources/SciCommsGui_32bit.c",line 118,column 5,is_stmt,isa 0
    2071 000002ed 960F!         MOV       @$BLOCKED(_SciaRegs)+15,AL ; [CPU_ALU] |118| 
    2072                      .dwpsn  file "../sources/SciCommsGui_32bit.c",line 155,column 3,is_stmt,isa 0
    2073 000002ee AB95          MOVL      *+XAR5[AR0],XT        ; [CPU_ALU] |155| 
    2074                      .dwpsn  file "../sources/SciCommsGui_32bit.c",line 156,column 3,is_stmt,isa 0
    2075 000002ef D00A          MOVB      XAR0,#10              ; [CPU_ALU] |156| 
    2076 000002f0 A295          MOVL      *+XAR5[AR0],XAR3      ; [CPU_ALU] |156| 
    2077                      .dwpsn  file "../sources/SciCommsGui_32bit.c",line 157,column 3,is_stmt,isa 0
    2078 000002f1 D00C          MOVB      XAR0,#12              ; [CPU_ALU] |157| 
    2079 000002f2 AA95          MOVL      *+XAR5[AR0],XAR2      ; [CPU_ALU] |157| 
    2080                      .dwpsn  file "../sources/SciCommsGui_32bit.c",line 158,column 3,is_stmt,isa 0
    2081 000002f3 D00E          MOVB      XAR0,#14              ; [CPU_ALU] |158| 
    2082 000002f4 C395          MOVL      *+XAR5[AR0],XAR7      ; [CPU_ALU] |158| 
    2083 000002f5 FE94          SUBB      SP,#20                ; [CPU_ARAU] 
    2084                      .dwcfi  cfa_offset, -8
    2085 000002f6 82BE          MOVL      XAR3,*--SP            ; [CPU_ALU] 
    2086                      .dwcfi  cfa_offset, -6
    2087                      .dwcfi  restore_reg, 11
    2088 000002f7 86BE          MOVL      XAR2,*--SP            ; [CPU_ALU] 
    2089                      .dwcfi  cfa_offset, -4
    2090                      .dwcfi  restore_reg, 9
    2091 000002f8 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
    2092                      .dwcfi  cfa_offset, -2
    2093                      .dwcfi  restore_reg, 7
    2094              $C$DW$86        .dwtag  DW_TAG_TI_branch
    2095                      .dwattr $C$DW$86, DW_AT_low_pc(0x00)
    2096                      .dwattr $C$DW$86, DW_AT_TI_return
    2097              
    2098 000002f9 0006          LRETR     ; [CPU_ALU] 
    2099                      ; return occurs ; [] 
    2100                      .dwattr $C$DW$80, DW_AT_TI_end_file("../sources/SciCommsGui_32bit.c")
    2101                      .dwattr $C$DW$80, DW_AT_TI_end_line(0xa1)
    2102                      .dwattr $C$DW$80, DW_AT_TI_end_column(0x01)
    2103                      .dwendentry
    2104                      .dwendtag $C$DW$80
    2105              
    2106              ;**************************************************************
    2107              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2108              ;**************************************************************
    2109                      .global _varSetTxtList
    2110                      .global _varSetBtnList
    2111                      .global _varSetSldrList
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   43

    2112                      .global _varGetList
    2113                      .global _arrayGetList
    2114                      .global _dataSetList
    2115                      .global _CommsOKflg
    2116                      .global _SerialCommsTimer
    2117                      .global _SciaRegs
    2118                      .global _GpioDataRegs
    2119                      .global L$$DIV
    2120              
    2121              ;***************************************************************
    2122              ;* TYPE INFORMATION                                            *
    2123              ;***************************************************************
    2124              
    2125              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2126                      .dwattr $C$DW$T$20, DW_AT_name("GPACLEAR_BITS")
    2127                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    2128              $C$DW$87        .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    2130                      .dwattr $C$DW$87, DW_AT_name("GPIO0")
    2131                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO0")
    2132                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0f)
    2133                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    2134                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2135                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    2136              
    2137              $C$DW$88        .dwtag  DW_TAG_member
    2138                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    2139                      .dwattr $C$DW$88, DW_AT_name("GPIO1")
    2140                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO1")
    2141                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0e)
    2142                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    2143                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2144                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2145              
    2146              $C$DW$89        .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    2148                      .dwattr $C$DW$89, DW_AT_name("GPIO2")
    2149                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO2")
    2150                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0d)
    2151                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    2152                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2154              
    2155              $C$DW$90        .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    2157                      .dwattr $C$DW$90, DW_AT_name("GPIO3")
    2158                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO3")
    2159                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0c)
    2160                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    2161                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2162                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2163              
    2164              $C$DW$91        .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    2166                      .dwattr $C$DW$91, DW_AT_name("GPIO4")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   44

    2167                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO4")
    2168                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0b)
    2169                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    2170                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2171                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2172              
    2173              $C$DW$92        .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    2175                      .dwattr $C$DW$92, DW_AT_name("GPIO5")
    2176                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO5")
    2177                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0a)
    2178                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    2179                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2180                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2181              
    2182              $C$DW$93        .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    2184                      .dwattr $C$DW$93, DW_AT_name("GPIO6")
    2185                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO6")
    2186                      .dwattr $C$DW$93, DW_AT_bit_offset(0x09)
    2187                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    2188                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2189                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2190              
    2191              $C$DW$94        .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    2193                      .dwattr $C$DW$94, DW_AT_name("GPIO7")
    2194                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO7")
    2195                      .dwattr $C$DW$94, DW_AT_bit_offset(0x08)
    2196                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    2197                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2199              
    2200              $C$DW$95        .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    2202                      .dwattr $C$DW$95, DW_AT_name("GPIO8")
    2203                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO8")
    2204                      .dwattr $C$DW$95, DW_AT_bit_offset(0x07)
    2205                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    2206                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2208              
    2209              $C$DW$96        .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    2211                      .dwattr $C$DW$96, DW_AT_name("GPIO9")
    2212                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO9")
    2213                      .dwattr $C$DW$96, DW_AT_bit_offset(0x06)
    2214                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    2215                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2216                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2217              
    2218              $C$DW$97        .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    2220                      .dwattr $C$DW$97, DW_AT_name("GPIO10")
    2221                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO10")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   45

    2222                      .dwattr $C$DW$97, DW_AT_bit_offset(0x05)
    2223                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    2224                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2225                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2226              
    2227              $C$DW$98        .dwtag  DW_TAG_member
    2228                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    2229                      .dwattr $C$DW$98, DW_AT_name("GPIO11")
    2230                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO11")
    2231                      .dwattr $C$DW$98, DW_AT_bit_offset(0x04)
    2232                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    2233                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2234                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2235              
    2236              $C$DW$99        .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$99, DW_AT_name("GPIO12")
    2239                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO12")
    2240                      .dwattr $C$DW$99, DW_AT_bit_offset(0x03)
    2241                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    2242                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2243                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2244              
    2245              $C$DW$100       .dwtag  DW_TAG_member
    2246                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    2247                      .dwattr $C$DW$100, DW_AT_name("GPIO13")
    2248                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO13")
    2249                      .dwattr $C$DW$100, DW_AT_bit_offset(0x02)
    2250                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    2251                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2252                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2253              
    2254              $C$DW$101       .dwtag  DW_TAG_member
    2255                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2256                      .dwattr $C$DW$101, DW_AT_name("GPIO14")
    2257                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO14")
    2258                      .dwattr $C$DW$101, DW_AT_bit_offset(0x01)
    2259                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    2260                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2261                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2262              
    2263              $C$DW$102       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    2265                      .dwattr $C$DW$102, DW_AT_name("GPIO15")
    2266                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO15")
    2267                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    2268                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    2269                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2270                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2271              
    2272              $C$DW$103       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    2274                      .dwattr $C$DW$103, DW_AT_name("GPIO16")
    2275                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO16")
    2276                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   46

    2277                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    2278                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2279                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2280              
    2281              $C$DW$104       .dwtag  DW_TAG_member
    2282                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2283                      .dwattr $C$DW$104, DW_AT_name("GPIO17")
    2284                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO17")
    2285                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e)
    2286                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    2287                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2288                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2289              
    2290              $C$DW$105       .dwtag  DW_TAG_member
    2291                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2292                      .dwattr $C$DW$105, DW_AT_name("GPIO18")
    2293                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO18")
    2294                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0d)
    2295                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    2296                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2297                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2298              
    2299              $C$DW$106       .dwtag  DW_TAG_member
    2300                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    2301                      .dwattr $C$DW$106, DW_AT_name("GPIO19")
    2302                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO19")
    2303                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0c)
    2304                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    2305                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2306                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2307              
    2308              $C$DW$107       .dwtag  DW_TAG_member
    2309                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    2310                      .dwattr $C$DW$107, DW_AT_name("GPIO20")
    2311                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO20")
    2312                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0b)
    2313                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    2314                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2315                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2316              
    2317              $C$DW$108       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2319                      .dwattr $C$DW$108, DW_AT_name("GPIO21")
    2320                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO21")
    2321                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0a)
    2322                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    2323                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2324                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2325              
    2326              $C$DW$109       .dwtag  DW_TAG_member
    2327                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2328                      .dwattr $C$DW$109, DW_AT_name("GPIO22")
    2329                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO22")
    2330                      .dwattr $C$DW$109, DW_AT_bit_offset(0x09)
    2331                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   47

    2332                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2333                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2334              
    2335              $C$DW$110       .dwtag  DW_TAG_member
    2336                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2337                      .dwattr $C$DW$110, DW_AT_name("GPIO23")
    2338                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO23")
    2339                      .dwattr $C$DW$110, DW_AT_bit_offset(0x08)
    2340                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    2341                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2342                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2343              
    2344              $C$DW$111       .dwtag  DW_TAG_member
    2345                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2346                      .dwattr $C$DW$111, DW_AT_name("GPIO24")
    2347                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO24")
    2348                      .dwattr $C$DW$111, DW_AT_bit_offset(0x07)
    2349                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    2350                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2351                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2352              
    2353              $C$DW$112       .dwtag  DW_TAG_member
    2354                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2355                      .dwattr $C$DW$112, DW_AT_name("GPIO25")
    2356                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO25")
    2357                      .dwattr $C$DW$112, DW_AT_bit_offset(0x06)
    2358                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    2359                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2360                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2361              
    2362              $C$DW$113       .dwtag  DW_TAG_member
    2363                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2364                      .dwattr $C$DW$113, DW_AT_name("GPIO26")
    2365                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO26")
    2366                      .dwattr $C$DW$113, DW_AT_bit_offset(0x05)
    2367                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    2368                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2369                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2370              
    2371              $C$DW$114       .dwtag  DW_TAG_member
    2372                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2373                      .dwattr $C$DW$114, DW_AT_name("GPIO27")
    2374                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO27")
    2375                      .dwattr $C$DW$114, DW_AT_bit_offset(0x04)
    2376                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    2377                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2378                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2379              
    2380              $C$DW$115       .dwtag  DW_TAG_member
    2381                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2382                      .dwattr $C$DW$115, DW_AT_name("GPIO28")
    2383                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO28")
    2384                      .dwattr $C$DW$115, DW_AT_bit_offset(0x03)
    2385                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    2386                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   48

    2387                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2388              
    2389              $C$DW$116       .dwtag  DW_TAG_member
    2390                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2391                      .dwattr $C$DW$116, DW_AT_name("GPIO29")
    2392                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO29")
    2393                      .dwattr $C$DW$116, DW_AT_bit_offset(0x02)
    2394                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    2395                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2396                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2397              
    2398              $C$DW$117       .dwtag  DW_TAG_member
    2399                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2400                      .dwattr $C$DW$117, DW_AT_name("GPIO30")
    2401                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO30")
    2402                      .dwattr $C$DW$117, DW_AT_bit_offset(0x01)
    2403                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    2404                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2405                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2406              
    2407              $C$DW$118       .dwtag  DW_TAG_member
    2408                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2409                      .dwattr $C$DW$118, DW_AT_name("GPIO31")
    2410                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO31")
    2411                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    2412                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    2413                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2414                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2415              
    2416                      .dwendtag $C$DW$T$20
    2417              
    2418              
    2419              $C$DW$T$22      .dwtag  DW_TAG_union_type
    2420                      .dwattr $C$DW$T$22, DW_AT_name("GPACLEAR_REG")
    2421                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    2422              $C$DW$119       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$21)
    2424                      .dwattr $C$DW$119, DW_AT_name("all")
    2425                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    2426                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2427                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2428              
    2429              $C$DW$120       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
    2431                      .dwattr $C$DW$120, DW_AT_name("bit")
    2432                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    2433                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2434                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2435              
    2436                      .dwendtag $C$DW$T$22
    2437              
    2438              
    2439              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2440                      .dwattr $C$DW$T$23, DW_AT_name("GPADAT_BITS")
    2441                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   49

    2442              $C$DW$121       .dwtag  DW_TAG_member
    2443                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2444                      .dwattr $C$DW$121, DW_AT_name("GPIO0")
    2445                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO0")
    2446                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0f)
    2447                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    2448                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2449                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2450              
    2451              $C$DW$122       .dwtag  DW_TAG_member
    2452                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2453                      .dwattr $C$DW$122, DW_AT_name("GPIO1")
    2454                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO1")
    2455                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e)
    2456                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    2457                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2458                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2459              
    2460              $C$DW$123       .dwtag  DW_TAG_member
    2461                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2462                      .dwattr $C$DW$123, DW_AT_name("GPIO2")
    2463                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO2")
    2464                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0d)
    2465                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    2466                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2467                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2468              
    2469              $C$DW$124       .dwtag  DW_TAG_member
    2470                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2471                      .dwattr $C$DW$124, DW_AT_name("GPIO3")
    2472                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO3")
    2473                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0c)
    2474                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    2475                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2476                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2477              
    2478              $C$DW$125       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2480                      .dwattr $C$DW$125, DW_AT_name("GPIO4")
    2481                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO4")
    2482                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0b)
    2483                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    2484                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2485                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2486              
    2487              $C$DW$126       .dwtag  DW_TAG_member
    2488                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2489                      .dwattr $C$DW$126, DW_AT_name("GPIO5")
    2490                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO5")
    2491                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0a)
    2492                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    2493                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2494                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2495              
    2496              $C$DW$127       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   50

    2497                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2498                      .dwattr $C$DW$127, DW_AT_name("GPIO6")
    2499                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO6")
    2500                      .dwattr $C$DW$127, DW_AT_bit_offset(0x09)
    2501                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    2502                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2503                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2504              
    2505              $C$DW$128       .dwtag  DW_TAG_member
    2506                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2507                      .dwattr $C$DW$128, DW_AT_name("GPIO7")
    2508                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO7")
    2509                      .dwattr $C$DW$128, DW_AT_bit_offset(0x08)
    2510                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2511                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2512                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2513              
    2514              $C$DW$129       .dwtag  DW_TAG_member
    2515                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2516                      .dwattr $C$DW$129, DW_AT_name("GPIO8")
    2517                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO8")
    2518                      .dwattr $C$DW$129, DW_AT_bit_offset(0x07)
    2519                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    2520                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2521                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2522              
    2523              $C$DW$130       .dwtag  DW_TAG_member
    2524                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2525                      .dwattr $C$DW$130, DW_AT_name("GPIO9")
    2526                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO9")
    2527                      .dwattr $C$DW$130, DW_AT_bit_offset(0x06)
    2528                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2529                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2530                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2531              
    2532              $C$DW$131       .dwtag  DW_TAG_member
    2533                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2534                      .dwattr $C$DW$131, DW_AT_name("GPIO10")
    2535                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO10")
    2536                      .dwattr $C$DW$131, DW_AT_bit_offset(0x05)
    2537                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2538                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2539                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2540              
    2541              $C$DW$132       .dwtag  DW_TAG_member
    2542                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2543                      .dwattr $C$DW$132, DW_AT_name("GPIO11")
    2544                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO11")
    2545                      .dwattr $C$DW$132, DW_AT_bit_offset(0x04)
    2546                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2547                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2548                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2549              
    2550              $C$DW$133       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   51

    2552                      .dwattr $C$DW$133, DW_AT_name("GPIO12")
    2553                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO12")
    2554                      .dwattr $C$DW$133, DW_AT_bit_offset(0x03)
    2555                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2556                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2557                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2558              
    2559              $C$DW$134       .dwtag  DW_TAG_member
    2560                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2561                      .dwattr $C$DW$134, DW_AT_name("GPIO13")
    2562                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO13")
    2563                      .dwattr $C$DW$134, DW_AT_bit_offset(0x02)
    2564                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    2565                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2566                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2567              
    2568              $C$DW$135       .dwtag  DW_TAG_member
    2569                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2570                      .dwattr $C$DW$135, DW_AT_name("GPIO14")
    2571                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO14")
    2572                      .dwattr $C$DW$135, DW_AT_bit_offset(0x01)
    2573                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2574                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2575                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2576              
    2577              $C$DW$136       .dwtag  DW_TAG_member
    2578                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2579                      .dwattr $C$DW$136, DW_AT_name("GPIO15")
    2580                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO15")
    2581                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    2582                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2583                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2584                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2585              
    2586              $C$DW$137       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2588                      .dwattr $C$DW$137, DW_AT_name("GPIO16")
    2589                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO16")
    2590                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0f)
    2591                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2592                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2593                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2594              
    2595              $C$DW$138       .dwtag  DW_TAG_member
    2596                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2597                      .dwattr $C$DW$138, DW_AT_name("GPIO17")
    2598                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO17")
    2599                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0e)
    2600                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2601                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2602                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2603              
    2604              $C$DW$139       .dwtag  DW_TAG_member
    2605                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2606                      .dwattr $C$DW$139, DW_AT_name("GPIO18")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   52

    2607                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO18")
    2608                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0d)
    2609                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2610                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2611                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2612              
    2613              $C$DW$140       .dwtag  DW_TAG_member
    2614                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2615                      .dwattr $C$DW$140, DW_AT_name("GPIO19")
    2616                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO19")
    2617                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0c)
    2618                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2619                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2620                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2621              
    2622              $C$DW$141       .dwtag  DW_TAG_member
    2623                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2624                      .dwattr $C$DW$141, DW_AT_name("GPIO20")
    2625                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO20")
    2626                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0b)
    2627                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2628                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2629                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2630              
    2631              $C$DW$142       .dwtag  DW_TAG_member
    2632                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2633                      .dwattr $C$DW$142, DW_AT_name("GPIO21")
    2634                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO21")
    2635                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0a)
    2636                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2637                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2638                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2639              
    2640              $C$DW$143       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2642                      .dwattr $C$DW$143, DW_AT_name("GPIO22")
    2643                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO22")
    2644                      .dwattr $C$DW$143, DW_AT_bit_offset(0x09)
    2645                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2646                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2647                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2648              
    2649              $C$DW$144       .dwtag  DW_TAG_member
    2650                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2651                      .dwattr $C$DW$144, DW_AT_name("GPIO23")
    2652                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO23")
    2653                      .dwattr $C$DW$144, DW_AT_bit_offset(0x08)
    2654                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2655                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2656                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2657              
    2658              $C$DW$145       .dwtag  DW_TAG_member
    2659                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2660                      .dwattr $C$DW$145, DW_AT_name("GPIO24")
    2661                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO24")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   53

    2662                      .dwattr $C$DW$145, DW_AT_bit_offset(0x07)
    2663                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2664                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2665                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2666              
    2667              $C$DW$146       .dwtag  DW_TAG_member
    2668                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2669                      .dwattr $C$DW$146, DW_AT_name("GPIO25")
    2670                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO25")
    2671                      .dwattr $C$DW$146, DW_AT_bit_offset(0x06)
    2672                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2673                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2674                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2675              
    2676              $C$DW$147       .dwtag  DW_TAG_member
    2677                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2678                      .dwattr $C$DW$147, DW_AT_name("GPIO26")
    2679                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO26")
    2680                      .dwattr $C$DW$147, DW_AT_bit_offset(0x05)
    2681                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2682                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2683                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2684              
    2685              $C$DW$148       .dwtag  DW_TAG_member
    2686                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2687                      .dwattr $C$DW$148, DW_AT_name("GPIO27")
    2688                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO27")
    2689                      .dwattr $C$DW$148, DW_AT_bit_offset(0x04)
    2690                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2691                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2692                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2693              
    2694              $C$DW$149       .dwtag  DW_TAG_member
    2695                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2696                      .dwattr $C$DW$149, DW_AT_name("GPIO28")
    2697                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO28")
    2698                      .dwattr $C$DW$149, DW_AT_bit_offset(0x03)
    2699                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2700                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2701                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2702              
    2703              $C$DW$150       .dwtag  DW_TAG_member
    2704                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2705                      .dwattr $C$DW$150, DW_AT_name("GPIO29")
    2706                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO29")
    2707                      .dwattr $C$DW$150, DW_AT_bit_offset(0x02)
    2708                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2709                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2710                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2711              
    2712              $C$DW$151       .dwtag  DW_TAG_member
    2713                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2714                      .dwattr $C$DW$151, DW_AT_name("GPIO30")
    2715                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO30")
    2716                      .dwattr $C$DW$151, DW_AT_bit_offset(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   54

    2717                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2718                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2719                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2720              
    2721              $C$DW$152       .dwtag  DW_TAG_member
    2722                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2723                      .dwattr $C$DW$152, DW_AT_name("GPIO31")
    2724                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO31")
    2725                      .dwattr $C$DW$152, DW_AT_bit_offset(0x00)
    2726                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2727                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2728                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2729              
    2730                      .dwendtag $C$DW$T$23
    2731              
    2732              
    2733              $C$DW$T$24      .dwtag  DW_TAG_union_type
    2734                      .dwattr $C$DW$T$24, DW_AT_name("GPADAT_REG")
    2735                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    2736              $C$DW$153       .dwtag  DW_TAG_member
    2737                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$21)
    2738                      .dwattr $C$DW$153, DW_AT_name("all")
    2739                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_all")
    2740                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2741                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2742              
    2743              $C$DW$154       .dwtag  DW_TAG_member
    2744                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$23)
    2745                      .dwattr $C$DW$154, DW_AT_name("bit")
    2746                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_bit")
    2747                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2748                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2749              
    2750                      .dwendtag $C$DW$T$24
    2751              
    2752              
    2753              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2754                      .dwattr $C$DW$T$25, DW_AT_name("GPASET_BITS")
    2755                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    2756              $C$DW$155       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2758                      .dwattr $C$DW$155, DW_AT_name("GPIO0")
    2759                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO0")
    2760                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0f)
    2761                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2762                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2763                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2764              
    2765              $C$DW$156       .dwtag  DW_TAG_member
    2766                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2767                      .dwattr $C$DW$156, DW_AT_name("GPIO1")
    2768                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO1")
    2769                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0e)
    2770                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2771                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   55

    2772                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2773              
    2774              $C$DW$157       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2776                      .dwattr $C$DW$157, DW_AT_name("GPIO2")
    2777                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO2")
    2778                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0d)
    2779                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2780                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2781                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2782              
    2783              $C$DW$158       .dwtag  DW_TAG_member
    2784                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2785                      .dwattr $C$DW$158, DW_AT_name("GPIO3")
    2786                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO3")
    2787                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0c)
    2788                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2789                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2790                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2791              
    2792              $C$DW$159       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2794                      .dwattr $C$DW$159, DW_AT_name("GPIO4")
    2795                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO4")
    2796                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0b)
    2797                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2798                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2799                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2800              
    2801              $C$DW$160       .dwtag  DW_TAG_member
    2802                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2803                      .dwattr $C$DW$160, DW_AT_name("GPIO5")
    2804                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO5")
    2805                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0a)
    2806                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2807                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2808                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2809              
    2810              $C$DW$161       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2812                      .dwattr $C$DW$161, DW_AT_name("GPIO6")
    2813                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO6")
    2814                      .dwattr $C$DW$161, DW_AT_bit_offset(0x09)
    2815                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2816                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2817                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2818              
    2819              $C$DW$162       .dwtag  DW_TAG_member
    2820                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2821                      .dwattr $C$DW$162, DW_AT_name("GPIO7")
    2822                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO7")
    2823                      .dwattr $C$DW$162, DW_AT_bit_offset(0x08)
    2824                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2825                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2826                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   56

    2827              
    2828              $C$DW$163       .dwtag  DW_TAG_member
    2829                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2830                      .dwattr $C$DW$163, DW_AT_name("GPIO8")
    2831                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO8")
    2832                      .dwattr $C$DW$163, DW_AT_bit_offset(0x07)
    2833                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2834                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2835                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2836              
    2837              $C$DW$164       .dwtag  DW_TAG_member
    2838                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2839                      .dwattr $C$DW$164, DW_AT_name("GPIO9")
    2840                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO9")
    2841                      .dwattr $C$DW$164, DW_AT_bit_offset(0x06)
    2842                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2843                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2844                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2845              
    2846              $C$DW$165       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2848                      .dwattr $C$DW$165, DW_AT_name("GPIO10")
    2849                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO10")
    2850                      .dwattr $C$DW$165, DW_AT_bit_offset(0x05)
    2851                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2852                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2853                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2854              
    2855              $C$DW$166       .dwtag  DW_TAG_member
    2856                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2857                      .dwattr $C$DW$166, DW_AT_name("GPIO11")
    2858                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO11")
    2859                      .dwattr $C$DW$166, DW_AT_bit_offset(0x04)
    2860                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2861                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2862                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2863              
    2864              $C$DW$167       .dwtag  DW_TAG_member
    2865                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2866                      .dwattr $C$DW$167, DW_AT_name("GPIO12")
    2867                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO12")
    2868                      .dwattr $C$DW$167, DW_AT_bit_offset(0x03)
    2869                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2870                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2871                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2872              
    2873              $C$DW$168       .dwtag  DW_TAG_member
    2874                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2875                      .dwattr $C$DW$168, DW_AT_name("GPIO13")
    2876                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO13")
    2877                      .dwattr $C$DW$168, DW_AT_bit_offset(0x02)
    2878                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2879                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2880                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2881              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   57

    2882              $C$DW$169       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2884                      .dwattr $C$DW$169, DW_AT_name("GPIO14")
    2885                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO14")
    2886                      .dwattr $C$DW$169, DW_AT_bit_offset(0x01)
    2887                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2888                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2889                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2890              
    2891              $C$DW$170       .dwtag  DW_TAG_member
    2892                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2893                      .dwattr $C$DW$170, DW_AT_name("GPIO15")
    2894                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIO15")
    2895                      .dwattr $C$DW$170, DW_AT_bit_offset(0x00)
    2896                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2897                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2898                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2899              
    2900              $C$DW$171       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2902                      .dwattr $C$DW$171, DW_AT_name("GPIO16")
    2903                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GPIO16")
    2904                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0f)
    2905                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2906                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2907                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2908              
    2909              $C$DW$172       .dwtag  DW_TAG_member
    2910                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2911                      .dwattr $C$DW$172, DW_AT_name("GPIO17")
    2912                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIO17")
    2913                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0e)
    2914                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2915                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2916                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2917              
    2918              $C$DW$173       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2920                      .dwattr $C$DW$173, DW_AT_name("GPIO18")
    2921                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GPIO18")
    2922                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0d)
    2923                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2924                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2925                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2926              
    2927              $C$DW$174       .dwtag  DW_TAG_member
    2928                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2929                      .dwattr $C$DW$174, DW_AT_name("GPIO19")
    2930                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GPIO19")
    2931                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0c)
    2932                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2933                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2934                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2935              
    2936              $C$DW$175       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   58

    2937                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2938                      .dwattr $C$DW$175, DW_AT_name("GPIO20")
    2939                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIO20")
    2940                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0b)
    2941                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2942                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2943                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2944              
    2945              $C$DW$176       .dwtag  DW_TAG_member
    2946                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2947                      .dwattr $C$DW$176, DW_AT_name("GPIO21")
    2948                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_GPIO21")
    2949                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0a)
    2950                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2951                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2952                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2953              
    2954              $C$DW$177       .dwtag  DW_TAG_member
    2955                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2956                      .dwattr $C$DW$177, DW_AT_name("GPIO22")
    2957                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_GPIO22")
    2958                      .dwattr $C$DW$177, DW_AT_bit_offset(0x09)
    2959                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2960                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2961                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2962              
    2963              $C$DW$178       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2965                      .dwattr $C$DW$178, DW_AT_name("GPIO23")
    2966                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIO23")
    2967                      .dwattr $C$DW$178, DW_AT_bit_offset(0x08)
    2968                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2969                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2970                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2971              
    2972              $C$DW$179       .dwtag  DW_TAG_member
    2973                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2974                      .dwattr $C$DW$179, DW_AT_name("GPIO24")
    2975                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIO24")
    2976                      .dwattr $C$DW$179, DW_AT_bit_offset(0x07)
    2977                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2978                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2979                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2980              
    2981              $C$DW$180       .dwtag  DW_TAG_member
    2982                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2983                      .dwattr $C$DW$180, DW_AT_name("GPIO25")
    2984                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GPIO25")
    2985                      .dwattr $C$DW$180, DW_AT_bit_offset(0x06)
    2986                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2987                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2988                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2989              
    2990              $C$DW$181       .dwtag  DW_TAG_member
    2991                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   59

    2992                      .dwattr $C$DW$181, DW_AT_name("GPIO26")
    2993                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_GPIO26")
    2994                      .dwattr $C$DW$181, DW_AT_bit_offset(0x05)
    2995                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2996                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2997                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2998              
    2999              $C$DW$182       .dwtag  DW_TAG_member
    3000                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3001                      .dwattr $C$DW$182, DW_AT_name("GPIO27")
    3002                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_GPIO27")
    3003                      .dwattr $C$DW$182, DW_AT_bit_offset(0x04)
    3004                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    3005                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3006                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3007              
    3008              $C$DW$183       .dwtag  DW_TAG_member
    3009                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3010                      .dwattr $C$DW$183, DW_AT_name("GPIO28")
    3011                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_GPIO28")
    3012                      .dwattr $C$DW$183, DW_AT_bit_offset(0x03)
    3013                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    3014                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3015                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3016              
    3017              $C$DW$184       .dwtag  DW_TAG_member
    3018                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    3019                      .dwattr $C$DW$184, DW_AT_name("GPIO29")
    3020                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_GPIO29")
    3021                      .dwattr $C$DW$184, DW_AT_bit_offset(0x02)
    3022                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    3023                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3024                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3025              
    3026              $C$DW$185       .dwtag  DW_TAG_member
    3027                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    3028                      .dwattr $C$DW$185, DW_AT_name("GPIO30")
    3029                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GPIO30")
    3030                      .dwattr $C$DW$185, DW_AT_bit_offset(0x01)
    3031                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    3032                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3033                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3034              
    3035              $C$DW$186       .dwtag  DW_TAG_member
    3036                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    3037                      .dwattr $C$DW$186, DW_AT_name("GPIO31")
    3038                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_GPIO31")
    3039                      .dwattr $C$DW$186, DW_AT_bit_offset(0x00)
    3040                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    3041                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3042                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3043              
    3044                      .dwendtag $C$DW$T$25
    3045              
    3046              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   60

    3047              $C$DW$T$26      .dwtag  DW_TAG_union_type
    3048                      .dwattr $C$DW$T$26, DW_AT_name("GPASET_REG")
    3049                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    3050              $C$DW$187       .dwtag  DW_TAG_member
    3051                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$21)
    3052                      .dwattr $C$DW$187, DW_AT_name("all")
    3053                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_all")
    3054                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3055                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3056              
    3057              $C$DW$188       .dwtag  DW_TAG_member
    3058                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$25)
    3059                      .dwattr $C$DW$188, DW_AT_name("bit")
    3060                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_bit")
    3061                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3062                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3063              
    3064                      .dwendtag $C$DW$T$26
    3065              
    3066              
    3067              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3068                      .dwattr $C$DW$T$27, DW_AT_name("GPATOGGLE_BITS")
    3069                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    3070              $C$DW$189       .dwtag  DW_TAG_member
    3071                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    3072                      .dwattr $C$DW$189, DW_AT_name("GPIO0")
    3073                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_GPIO0")
    3074                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0f)
    3075                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    3076                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3077                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3078              
    3079              $C$DW$190       .dwtag  DW_TAG_member
    3080                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    3081                      .dwattr $C$DW$190, DW_AT_name("GPIO1")
    3082                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_GPIO1")
    3083                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0e)
    3084                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    3085                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3086                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3087              
    3088              $C$DW$191       .dwtag  DW_TAG_member
    3089                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3090                      .dwattr $C$DW$191, DW_AT_name("GPIO2")
    3091                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_GPIO2")
    3092                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0d)
    3093                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    3094                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3095                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3096              
    3097              $C$DW$192       .dwtag  DW_TAG_member
    3098                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3099                      .dwattr $C$DW$192, DW_AT_name("GPIO3")
    3100                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_GPIO3")
    3101                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   61

    3102                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    3103                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3104                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3105              
    3106              $C$DW$193       .dwtag  DW_TAG_member
    3107                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    3108                      .dwattr $C$DW$193, DW_AT_name("GPIO4")
    3109                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_GPIO4")
    3110                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0b)
    3111                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    3112                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3113                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3114              
    3115              $C$DW$194       .dwtag  DW_TAG_member
    3116                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    3117                      .dwattr $C$DW$194, DW_AT_name("GPIO5")
    3118                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_GPIO5")
    3119                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0a)
    3120                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    3121                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3122                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3123              
    3124              $C$DW$195       .dwtag  DW_TAG_member
    3125                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    3126                      .dwattr $C$DW$195, DW_AT_name("GPIO6")
    3127                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_GPIO6")
    3128                      .dwattr $C$DW$195, DW_AT_bit_offset(0x09)
    3129                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    3130                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3131                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3132              
    3133              $C$DW$196       .dwtag  DW_TAG_member
    3134                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    3135                      .dwattr $C$DW$196, DW_AT_name("GPIO7")
    3136                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GPIO7")
    3137                      .dwattr $C$DW$196, DW_AT_bit_offset(0x08)
    3138                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    3139                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3140                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3141              
    3142              $C$DW$197       .dwtag  DW_TAG_member
    3143                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    3144                      .dwattr $C$DW$197, DW_AT_name("GPIO8")
    3145                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GPIO8")
    3146                      .dwattr $C$DW$197, DW_AT_bit_offset(0x07)
    3147                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    3148                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3149                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3150              
    3151              $C$DW$198       .dwtag  DW_TAG_member
    3152                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    3153                      .dwattr $C$DW$198, DW_AT_name("GPIO9")
    3154                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_GPIO9")
    3155                      .dwattr $C$DW$198, DW_AT_bit_offset(0x06)
    3156                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   62

    3157                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3158                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3159              
    3160              $C$DW$199       .dwtag  DW_TAG_member
    3161                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3162                      .dwattr $C$DW$199, DW_AT_name("GPIO10")
    3163                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_GPIO10")
    3164                      .dwattr $C$DW$199, DW_AT_bit_offset(0x05)
    3165                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    3166                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3167                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3168              
    3169              $C$DW$200       .dwtag  DW_TAG_member
    3170                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    3171                      .dwattr $C$DW$200, DW_AT_name("GPIO11")
    3172                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_GPIO11")
    3173                      .dwattr $C$DW$200, DW_AT_bit_offset(0x04)
    3174                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    3175                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3176                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3177              
    3178              $C$DW$201       .dwtag  DW_TAG_member
    3179                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    3180                      .dwattr $C$DW$201, DW_AT_name("GPIO12")
    3181                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_GPIO12")
    3182                      .dwattr $C$DW$201, DW_AT_bit_offset(0x03)
    3183                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    3184                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3185                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3186              
    3187              $C$DW$202       .dwtag  DW_TAG_member
    3188                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    3189                      .dwattr $C$DW$202, DW_AT_name("GPIO13")
    3190                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_GPIO13")
    3191                      .dwattr $C$DW$202, DW_AT_bit_offset(0x02)
    3192                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    3193                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3194                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3195              
    3196              $C$DW$203       .dwtag  DW_TAG_member
    3197                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    3198                      .dwattr $C$DW$203, DW_AT_name("GPIO14")
    3199                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_GPIO14")
    3200                      .dwattr $C$DW$203, DW_AT_bit_offset(0x01)
    3201                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    3202                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3203                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3204              
    3205              $C$DW$204       .dwtag  DW_TAG_member
    3206                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3207                      .dwattr $C$DW$204, DW_AT_name("GPIO15")
    3208                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_GPIO15")
    3209                      .dwattr $C$DW$204, DW_AT_bit_offset(0x00)
    3210                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    3211                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   63

    3212                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3213              
    3214              $C$DW$205       .dwtag  DW_TAG_member
    3215                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3216                      .dwattr $C$DW$205, DW_AT_name("GPIO16")
    3217                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_GPIO16")
    3218                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0f)
    3219                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    3220                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3221                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3222              
    3223              $C$DW$206       .dwtag  DW_TAG_member
    3224                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3225                      .dwattr $C$DW$206, DW_AT_name("GPIO17")
    3226                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_GPIO17")
    3227                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0e)
    3228                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    3229                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3230                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3231              
    3232              $C$DW$207       .dwtag  DW_TAG_member
    3233                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3234                      .dwattr $C$DW$207, DW_AT_name("GPIO18")
    3235                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_GPIO18")
    3236                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0d)
    3237                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    3238                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3239                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3240              
    3241              $C$DW$208       .dwtag  DW_TAG_member
    3242                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    3243                      .dwattr $C$DW$208, DW_AT_name("GPIO19")
    3244                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_GPIO19")
    3245                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0c)
    3246                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    3247                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3248                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3249              
    3250              $C$DW$209       .dwtag  DW_TAG_member
    3251                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    3252                      .dwattr $C$DW$209, DW_AT_name("GPIO20")
    3253                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_GPIO20")
    3254                      .dwattr $C$DW$209, DW_AT_bit_offset(0x0b)
    3255                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    3256                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3257                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3258              
    3259              $C$DW$210       .dwtag  DW_TAG_member
    3260                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3261                      .dwattr $C$DW$210, DW_AT_name("GPIO21")
    3262                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_GPIO21")
    3263                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0a)
    3264                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    3265                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3266                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   64

    3267              
    3268              $C$DW$211       .dwtag  DW_TAG_member
    3269                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    3270                      .dwattr $C$DW$211, DW_AT_name("GPIO22")
    3271                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_GPIO22")
    3272                      .dwattr $C$DW$211, DW_AT_bit_offset(0x09)
    3273                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    3274                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3275                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3276              
    3277              $C$DW$212       .dwtag  DW_TAG_member
    3278                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    3279                      .dwattr $C$DW$212, DW_AT_name("GPIO23")
    3280                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_GPIO23")
    3281                      .dwattr $C$DW$212, DW_AT_bit_offset(0x08)
    3282                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    3283                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3284                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3285              
    3286              $C$DW$213       .dwtag  DW_TAG_member
    3287                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    3288                      .dwattr $C$DW$213, DW_AT_name("GPIO24")
    3289                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_GPIO24")
    3290                      .dwattr $C$DW$213, DW_AT_bit_offset(0x07)
    3291                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    3292                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3293                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3294              
    3295              $C$DW$214       .dwtag  DW_TAG_member
    3296                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    3297                      .dwattr $C$DW$214, DW_AT_name("GPIO25")
    3298                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_GPIO25")
    3299                      .dwattr $C$DW$214, DW_AT_bit_offset(0x06)
    3300                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    3301                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3302                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3303              
    3304              $C$DW$215       .dwtag  DW_TAG_member
    3305                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    3306                      .dwattr $C$DW$215, DW_AT_name("GPIO26")
    3307                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_GPIO26")
    3308                      .dwattr $C$DW$215, DW_AT_bit_offset(0x05)
    3309                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    3310                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3311                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3312              
    3313              $C$DW$216       .dwtag  DW_TAG_member
    3314                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3315                      .dwattr $C$DW$216, DW_AT_name("GPIO27")
    3316                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_GPIO27")
    3317                      .dwattr $C$DW$216, DW_AT_bit_offset(0x04)
    3318                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    3319                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3320                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3321              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   65

    3322              $C$DW$217       .dwtag  DW_TAG_member
    3323                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    3324                      .dwattr $C$DW$217, DW_AT_name("GPIO28")
    3325                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_GPIO28")
    3326                      .dwattr $C$DW$217, DW_AT_bit_offset(0x03)
    3327                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    3328                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3329                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3330              
    3331              $C$DW$218       .dwtag  DW_TAG_member
    3332                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    3333                      .dwattr $C$DW$218, DW_AT_name("GPIO29")
    3334                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_GPIO29")
    3335                      .dwattr $C$DW$218, DW_AT_bit_offset(0x02)
    3336                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    3337                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3338                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3339              
    3340              $C$DW$219       .dwtag  DW_TAG_member
    3341                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3342                      .dwattr $C$DW$219, DW_AT_name("GPIO30")
    3343                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_GPIO30")
    3344                      .dwattr $C$DW$219, DW_AT_bit_offset(0x01)
    3345                      .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    3346                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3347                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3348              
    3349              $C$DW$220       .dwtag  DW_TAG_member
    3350                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3351                      .dwattr $C$DW$220, DW_AT_name("GPIO31")
    3352                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_GPIO31")
    3353                      .dwattr $C$DW$220, DW_AT_bit_offset(0x00)
    3354                      .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    3355                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3356                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3357              
    3358                      .dwendtag $C$DW$T$27
    3359              
    3360              
    3361              $C$DW$T$28      .dwtag  DW_TAG_union_type
    3362                      .dwattr $C$DW$T$28, DW_AT_name("GPATOGGLE_REG")
    3363                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    3364              $C$DW$221       .dwtag  DW_TAG_member
    3365                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$21)
    3366                      .dwattr $C$DW$221, DW_AT_name("all")
    3367                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_all")
    3368                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3369                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3370              
    3371              $C$DW$222       .dwtag  DW_TAG_member
    3372                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$27)
    3373                      .dwattr $C$DW$222, DW_AT_name("bit")
    3374                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_bit")
    3375                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3376                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:55 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
SciCommsGui_32bit.asm                                                PAGE   66

    3377              
    3378                      .dwendtag $C$DW$T$28
    3379              
    3380              
    3381              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3382                      .dwattr $C$DW$T$29, DW_AT_name("GPBCLEAR_BITS")
    3383                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    3384              $C$DW$223       .dwtag  DW_TAG_member
    3385                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    3386                      .dwattr $C$DW$223, DW_AT_name("GPIO32")
    3387                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_GPIO32")
    3388                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0f)
    3389                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    3390                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3391                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3392              
    3393              $C$DW$224       .dwtag  DW_TAG_member
    3394                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3395                      .dwattr $C$DW$224, DW_AT_name("GPIO33")
    3396                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_GPIO33")
    3397                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0e)
