TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:58 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:58 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/sfra_gui.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SFRA_F_INIT")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SFRA_F_INIT")

     226 00000008 E802          MOVIZ     R3H,#16672            ; [CPU_FPU] |76| 
         00000009 0903 
     227                      .dwpsn  file "../sources/sfra_gui.c",line 78,column 5,is_stmt,isa 0
     228 0000000a 8D00-         MOVL      XAR0,#_FreqVect       ; [CPU_ARAU] |78| 
         0000000b 0000 
     229                      .dwpsn  file "../sources/sfra_gui.c",line 79,column 5,is_stmt,isa 0
     230 0000000c 76C0-         MOVL      XAR7,#_OL_MagVect     ; [CPU_ARAU] |79| 
         0000000d 0000 
     231                      .dwpsn  file "../sources/sfra_gui.c",line 80,column 5,is_stmt,isa 0
     232 0000000e 7680-         MOVL      XAR6,#_OL_PhaseVect   ; [CPU_ARAU] |80| 
         0000000f 0000 
     233                      .dwpsn  file "../sources/sfra_gui.c",line 81,column 5,is_stmt,isa 0
     234 00000010 8F40-         MOVL      XAR5,#_Plant_MagVect  ; [CPU_ARAU] |81| 
         00000011 0000 
     235                      .dwpsn  file "../sources/sfra_gui.c",line 82,column 5,is_stmt,isa 0
     236 00000012 A814!         MOVL      @$BLOCKED(_SFRA1)+2,XAR4 ; [CPU_ALU] |82| 
     237                      .dwpsn  file "../sources/sfra_gui.c",line 73,column 5,is_stmt,isa 0
     238 00000013 E80E          MOVXI     R2H,#55050            ; [CPU_FPU] |73| 
         00000014 B852 
     239                      .dwpsn  file "../sources/sfra_gui.c",line 74,column 5,is_stmt,isa 0
     240 00000015 56BF!         MOVB      @$BLOCKED(_SFRA1)+21,#26,UNC ; [CPU_ALU] |74| 
         00000016 1A27 
     241                      .dwpsn  file "../sources/sfra_gui.c",line 75,column 5,is_stmt,isa 0
     242 00000017 E203!         MOV32     @$BLOCKED(_SFRA1)+12,R0H ; [CPU_FPU] |75| 
         00000018 001E 
     243                      .dwpsn  file "../sources/sfra_gui.c",line 77,column 5,is_stmt,isa 0
     244 00000019 E80A          MOVXI     R1H,#20864            ; [CPU_FPU] |77| 
         0000001a 8C01 
     245                      .dwpsn  file "../sources/sfra_gui.c",line 76,column 5,is_stmt,isa 0
     246 0000001b E203!         MOV32     @$BLOCKED(_SFRA1)+14,R3H ; [CPU_FPU] |76| 
         0000001c 0320 
     247                      .dwpsn  file "../sources/sfra_gui.c",line 78,column 5,is_stmt,isa 0
     248 0000001d 3A1A!         MOVL      @$BLOCKED(_SFRA1)+8,XAR0 ; [CPU_ALU] |78| 
     249                      .dwpsn  file "../sources/sfra_gui.c",line 79,column 5,is_stmt,isa 0
     250 0000001e C316!         MOVL      @$BLOCKED(_SFRA1)+4,XAR7 ; [CPU_ALU] |79| 
     251                      .dwpsn  file "../sources/sfra_gui.c",line 80,column 5,is_stmt,isa 0
     252 0000001f C218!         MOVL      @$BLOCKED(_SFRA1)+6,XAR6 ; [CPU_ALU] |80| 
     253                      .dwpsn  file "../sources/sfra_gui.c",line 81,column 5,is_stmt,isa 0
     254 00000020 A012!         MOVL      @$BLOCKED(_SFRA1),XAR5 ; [CPU_ALU] |81| 
     255                      .dwpsn  file "../sources/sfra_gui.c",line 83,column 5,is_stmt,isa 0
     256 00000021 8F00-         MOVL      XAR4,#_SFRA1          ; [CPU_ARAU] |83| 
         00000022 0012 
     257                      .dwpsn  file "../sources/sfra_gui.c",line 73,column 5,is_stmt,isa 0
     258 00000023 E203!         MOV32     @$BLOCKED(_SFRA1)+10,R2H ; [CPU_FPU] |73| 
         00000024 021C 
     259                      .dwpsn  file "../sources/sfra_gui.c",line 77,column 5,is_stmt,isa 0
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:58 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE    6

     260 00000025 E203!         MOV32     @$BLOCKED(_SFRA1)+16,R1H ; [CPU_FPU] |77| 
         00000026 0122 
     261                      .dwpsn  file "../sources/sfra_gui.c",line 83,column 5,is_stmt,isa 0
     262              $C$DW$20        .dwtag  DW_TAG_TI_branch
     263                      .dwattr $C$DW$20, DW_AT_low_pc(0x00)
     264                      .dwattr $C$DW$20, DW_AT_name("_SFRA_F_INIT")
     265                      .dwattr $C$DW$20, DW_AT_TI_call
     266              
     267 00000027 7640!         LCR       #_SFRA_F_INIT         ; [CPU_ALU] |83| 
         00000028 0000 
     268                      ; call occurs [#_SFRA_F_INIT] ; [] |83| 
     269              $C$DW$21        .dwtag  DW_TAG_TI_branch
     270                      .dwattr $C$DW$21, DW_AT_low_pc(0x00)
     271                      .dwattr $C$DW$21, DW_AT_TI_return
     272              
     273 00000029 0006          LRETR     ; [CPU_ALU] 
     274                      ; return occurs ; [] 
     275                      .dwattr $C$DW$17, DW_AT_TI_end_file("../sources/sfra_gui.c")
     276                      .dwattr $C$DW$17, DW_AT_TI_end_line(0x73)
     277                      .dwattr $C$DW$17, DW_AT_TI_end_column(0x01)
     278                      .dwendentry
     279                      .dwendtag $C$DW$17
     280              
     281              ;**************************************************************
     282              ;* UNDEFINED EXTERNAL REFERENCES                              *
     283              ;**************************************************************
     284                      .global _SFRA_F_INIT
     285              
     286              ;***************************************************************
     287              ;* TYPE INFORMATION                                            *
     288              ;***************************************************************
     289              
     290              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     291                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x18)
     292              $C$DW$22        .dwtag  DW_TAG_member
     293                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     294                      .dwattr $C$DW$22, DW_AT_name("H_MagVect")
     295                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_H_MagVect")
     296                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     297                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     298              
     299              $C$DW$23        .dwtag  DW_TAG_member
     300                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     301                      .dwattr $C$DW$23, DW_AT_name("H_PhaseVect")
     302                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_H_PhaseVect")
     303                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     304                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     305              
     306              $C$DW$24        .dwtag  DW_TAG_member
     307                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     308                      .dwattr $C$DW$24, DW_AT_name("GH_MagVect")
     309                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_GH_MagVect")
     310                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     311                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     312              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:58 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE    7

     313              $C$DW$25        .dwtag  DW_TAG_member
     314                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     315                      .dwattr $C$DW$25, DW_AT_name("GH_PhaseVect")
     316                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_GH_PhaseVect")
     317                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     318                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     319              
     320              $C$DW$26        .dwtag  DW_TAG_member
     321                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     322                      .dwattr $C$DW$26, DW_AT_name("FreqVect")
     323                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_FreqVect")
     324                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     325                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     326              
     327              $C$DW$27        .dwtag  DW_TAG_member
     328                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$16)
     329                      .dwattr $C$DW$27, DW_AT_name("amplitude")
     330                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_amplitude")
     331                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     332                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     333              
     334              $C$DW$28        .dwtag  DW_TAG_member
     335                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$16)
     336                      .dwattr $C$DW$28, DW_AT_name("ISR_Freq")
     337                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_ISR_Freq")
     338                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     339                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     340              
     341              $C$DW$29        .dwtag  DW_TAG_member
     342                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$16)
     343                      .dwattr $C$DW$29, DW_AT_name("Freq_Start")
     344                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_Freq_Start")
     345                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     346                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     347              
     348              $C$DW$30        .dwtag  DW_TAG_member
     349                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$16)
     350                      .dwattr $C$DW$30, DW_AT_name("Freq_Step")
     351                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_Freq_Step")
     352                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     353                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     354              
     355              $C$DW$31        .dwtag  DW_TAG_member
     356                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$21)
     357                      .dwattr $C$DW$31, DW_AT_name("start")
     358                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_start")
     359                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     360                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     361              
     362              $C$DW$32        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$21)
     364                      .dwattr $C$DW$32, DW_AT_name("state")
     365                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_state")
     366                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     367                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:58 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE    8

     368              
     369              $C$DW$33        .dwtag  DW_TAG_member
     370                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$21)
     371                      .dwattr $C$DW$33, DW_AT_name("status")
     372                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_status")
     373                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     374                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     375              
     376              $C$DW$34        .dwtag  DW_TAG_member
     377                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$21)
     378                      .dwattr $C$DW$34, DW_AT_name("Vec_Length")
     379                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_Vec_Length")
     380                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     381                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     382              
     383              $C$DW$35        .dwtag  DW_TAG_member
     384                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$21)
     385                      .dwattr $C$DW$35, DW_AT_name("FreqIndex")
     386                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_FreqIndex")
     387                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     388                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     389              
     390                      .dwendtag $C$DW$T$22
     391              
     392              $C$DW$T$28      .dwtag  DW_TAG_typedef
     393                      .dwattr $C$DW$T$28, DW_AT_name("SFRA_F")
     394                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
     395                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     396              
     397              $C$DW$36        .dwtag  DW_TAG_TI_far_type
     398                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$28)
     399              
     400              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
     401                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$36)
     402              
     403              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
     404                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
     405                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
     406              
     407              
     408              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     409                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
     410              $C$DW$37        .dwtag  DW_TAG_member
     411                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$24)
     412                      .dwattr $C$DW$37, DW_AT_name("driveSpeedSet")
     413                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_driveSpeedSet")
     414                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     415                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     416              
     417              $C$DW$38        .dwtag  DW_TAG_member
     418                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$24)
     419                      .dwattr $C$DW$38, DW_AT_name("loadCurrentSet")
     420                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_loadCurrentSet")
     421                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     422                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:58 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE    9

     423              
     424              $C$DW$39        .dwtag  DW_TAG_member
     425                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$24)
     426                      .dwattr $C$DW$39, DW_AT_name("driveSpeedFbk")
     427                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_driveSpeedFbk")
     428                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     429                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     430              
     431              $C$DW$40        .dwtag  DW_TAG_member
     432                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$24)
     433                      .dwattr $C$DW$40, DW_AT_name("loadCurrentFbk")
     434                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_loadCurrentFbk")
     435                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     436                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     437              
     438              $C$DW$41        .dwtag  DW_TAG_member
     439                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$24)
     440                      .dwattr $C$DW$41, DW_AT_name("driveLatency")
     441                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_driveLatency")
     442                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     443                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     444              
     445              $C$DW$42        .dwtag  DW_TAG_member
     446                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$24)
     447                      .dwattr $C$DW$42, DW_AT_name("loadLatency")
     448                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_loadLatency")
     449                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     450                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     451              
     452              $C$DW$43        .dwtag  DW_TAG_member
     453                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$26)
     454                      .dwattr $C$DW$43, DW_AT_name("loadMotor")
     455                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_loadMotor")
     456                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     457                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     458              
     459              $C$DW$44        .dwtag  DW_TAG_member
     460                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$26)
     461                      .dwattr $C$DW$44, DW_AT_name("runDrive")
     462                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_runDrive")
     463                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     464                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     465              
     466              $C$DW$45        .dwtag  DW_TAG_member
     467                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$26)
     468                      .dwattr $C$DW$45, DW_AT_name("runLoad")
     469                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_runLoad")
     470                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     471                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     472              
     473                      .dwendtag $C$DW$T$27
     474              
     475              $C$DW$T$32      .dwtag  DW_TAG_typedef
     476                      .dwattr $C$DW$T$32, DW_AT_name("SFRA_CONTROL")
     477                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:58 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE   10

     478                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     479              
     480              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     481                      .dwattr $C$DW$T$2, DW_AT_name("void")
     482              
     483              $C$DW$T$4       .dwtag  DW_TAG_base_type
     484                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     485                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     486                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     487              
     488              $C$DW$T$5       .dwtag  DW_TAG_base_type
     489                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     490                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     491                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     492              
     493              $C$DW$T$6       .dwtag  DW_TAG_base_type
     494                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     495                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     496                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     497              
     498              $C$DW$T$7       .dwtag  DW_TAG_base_type
     499                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     500                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     501                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     502              
     503              $C$DW$T$8       .dwtag  DW_TAG_base_type
     504                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     505                      .dwattr $C$DW$T$8, DW_AT_name("short")
     506                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     507              
     508              $C$DW$T$9       .dwtag  DW_TAG_base_type
     509                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     510                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     511                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     512              
     513              $C$DW$T$10      .dwtag  DW_TAG_base_type
     514                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     515                      .dwattr $C$DW$T$10, DW_AT_name("int")
     516                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     517              
     518              $C$DW$T$20      .dwtag  DW_TAG_typedef
     519                      .dwattr $C$DW$T$20, DW_AT_name("__int16_t")
     520                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$10)
     521                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     522              
     523              $C$DW$T$21      .dwtag  DW_TAG_typedef
     524                      .dwattr $C$DW$T$21, DW_AT_name("int16_t")
     525                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     526                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     527              
     528              $C$DW$T$36      .dwtag  DW_TAG_typedef
     529                      .dwattr $C$DW$T$36, DW_AT_name("int16")
     530                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$10)
     531                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
     532              
