TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:51 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("SDFM")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SDFM")

    1683                      .dwattr $C$DW$72, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/so
    1684                      .dwattr $C$DW$72, DW_AT_TI_end_line(0x209)
    1685                      .dwattr $C$DW$72, DW_AT_TI_end_column(0x01)
    1686                      .dwendentry
    1687                      .dwendtag $C$DW$72
    1688              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   35

    1689 00000334               .sect   ".text"
    1690                      .clink
    1691                      .global _SDFM_disableMFE
    1692              
    1693              $C$DW$76        .dwtag  DW_TAG_subprogram
    1694                      .dwattr $C$DW$76, DW_AT_name("SDFM_disableMFE")
    1695                      .dwattr $C$DW$76, DW_AT_low_pc(_SDFM_disableMFE)
    1696                      .dwattr $C$DW$76, DW_AT_high_pc(0x00)
    1697                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_SDFM_disableMFE")
    1698                      .dwattr $C$DW$76, DW_AT_external
    1699                      .dwattr $C$DW$76, DW_AT_TI_begin_file("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/
    1700                      .dwattr $C$DW$76, DW_AT_TI_begin_line(0x1d1)
    1701                      .dwattr $C$DW$76, DW_AT_TI_begin_column(0x06)
    1702                      .dwattr $C$DW$76, DW_AT_TI_max_frame_size(-2)
    1703                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_sdfm_drive
    1704              
    1705                      .dwfde $C$DW$CIE, _SDFM_disableMFE
    1706              $C$DW$77        .dwtag  DW_TAG_formal_parameter
    1707                      .dwattr $C$DW$77, DW_AT_name("sdfmNumber")
    1708                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_sdfmNumber")
    1709                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1710                      .dwattr $C$DW$77, DW_AT_location[DW_OP_reg0]
    1711              
    1712              
    1713              ;***************************************************************
    1714              ;* FNAME: _SDFM_disableMFE              FR SIZE:   0           *
    1715              ;*                                                             *
    1716              ;* FUNCTION ENVIRONMENT                                        *
    1717              ;*                                                             *
    1718              ;* FUNCTION PROPERTIES                                         *
    1719              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1720              ;***************************************************************
    1721              
    1722 00000334       _SDFM_disableMFE:
    1723                      .dwcfi  cfa_offset, -2
    1724                      .dwcfi  save_reg_to_mem, 26, 0
    1725 00000334 7622   EALLOW
    1726 00000335 2901          CLRC      SXM                   ; [CPU_ALU] 
    1727                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_sdfm_drive
    1728 00000336 8F00!         MOVL      XAR4,#_SDFM           ; [CPU_ARAU] |468| 
         00000337 0000 
    1729 00000338 5603          MOV       ACC,AL << 1           ; [CPU_ALU] |468| 
         00000339 01A9 
    1730 0000033a 5601          ADDL      XAR4,ACC              ; [CPU_ALU] |468| 
         0000033b 00A4 
    1731 0000033c 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_ALU] |468| 
    1732 0000033d 18F4          AND       *+XAR4[6],#0xf7ff     ; [CPU_ALU] |468| 
         0000033e F7FF 
    1733 0000033f 761A   EDIS
    1734 00000340 FF69          SPM       #0                    ; [CPU_ALU] 
    1735              $C$DW$78        .dwtag  DW_TAG_TI_branch
    1736                      .dwattr $C$DW$78, DW_AT_low_pc(0x00)
    1737                      .dwattr $C$DW$78, DW_AT_TI_return
    1738              
    1739 00000341 0006          LRETR     ; [CPU_ALU] 
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   36

    1740                      ; return occurs ; [] 
    1741                      .dwattr $C$DW$76, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/so
    1742                      .dwattr $C$DW$76, DW_AT_TI_end_line(0x1d6)
    1743                      .dwattr $C$DW$76, DW_AT_TI_end_column(0x01)
    1744                      .dwendentry
    1745                      .dwendtag $C$DW$76
    1746              
    1747              ;**************************************************************
    1748              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1749              ;**************************************************************
    1750                      .global _SDFM
    1751              
    1752              ;***************************************************************
    1753              ;* TYPE INFORMATION                                            *
    1754              ;***************************************************************
    1755              
    1756              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1757                      .dwattr $C$DW$T$20, DW_AT_name("SDCMPH1_BITS")
    1758                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1759              $C$DW$79        .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1761                      .dwattr $C$DW$79, DW_AT_name("HLT")
    1762                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_HLT")
    1763                      .dwattr $C$DW$79, DW_AT_bit_offset(0x01)
    1764                      .dwattr $C$DW$79, DW_AT_bit_size(0x0f)
    1765                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1766                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1767              
    1768              $C$DW$80        .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1770                      .dwattr $C$DW$80, DW_AT_name("rsvd1")
    1771                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_rsvd1")
    1772                      .dwattr $C$DW$80, DW_AT_bit_offset(0x00)
    1773                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1774                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1775                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1776              
    1777                      .dwendtag $C$DW$T$20
    1778              
    1779              
    1780              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1781                      .dwattr $C$DW$T$21, DW_AT_name("SDCMPH1_REG")
    1782                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1783              $C$DW$81        .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1785                      .dwattr $C$DW$81, DW_AT_name("all")
    1786                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_all")
    1787                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1788                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1789              
    1790              $C$DW$82        .dwtag  DW_TAG_member
    1791                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    1792                      .dwattr $C$DW$82, DW_AT_name("bit")
    1793                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_bit")
    1794                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   37

    1795                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1796              
    1797                      .dwendtag $C$DW$T$21
    1798              
    1799              
    1800              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1801                      .dwattr $C$DW$T$22, DW_AT_name("SDCMPH2_BITS")
    1802                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1803              $C$DW$83        .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1805                      .dwattr $C$DW$83, DW_AT_name("HLT")
    1806                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_HLT")
    1807                      .dwattr $C$DW$83, DW_AT_bit_offset(0x01)
    1808                      .dwattr $C$DW$83, DW_AT_bit_size(0x0f)
    1809                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1810                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1811              
    1812              $C$DW$84        .dwtag  DW_TAG_member
    1813                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1814                      .dwattr $C$DW$84, DW_AT_name("rsvd1")
    1815                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd1")
    1816                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00)
    1817                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1818                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1819                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1820              
    1821                      .dwendtag $C$DW$T$22
    1822              
    1823              
    1824              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1825                      .dwattr $C$DW$T$23, DW_AT_name("SDCMPH2_REG")
    1826                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1827              $C$DW$85        .dwtag  DW_TAG_member
    1828                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1829                      .dwattr $C$DW$85, DW_AT_name("all")
    1830                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_all")
    1831                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1832                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1833              
    1834              $C$DW$86        .dwtag  DW_TAG_member
    1835                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$22)
    1836                      .dwattr $C$DW$86, DW_AT_name("bit")
    1837                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_bit")
    1838                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1839                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1840              
    1841                      .dwendtag $C$DW$T$23
    1842              
    1843              
    1844              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1845                      .dwattr $C$DW$T$24, DW_AT_name("SDCMPH3_BITS")
    1846                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1847              $C$DW$87        .dwtag  DW_TAG_member
    1848                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1849                      .dwattr $C$DW$87, DW_AT_name("HLT")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   38

    1850                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_HLT")
    1851                      .dwattr $C$DW$87, DW_AT_bit_offset(0x01)
    1852                      .dwattr $C$DW$87, DW_AT_bit_size(0x0f)
    1853                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1854                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1855              
    1856              $C$DW$88        .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1858                      .dwattr $C$DW$88, DW_AT_name("rsvd1")
    1859                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd1")
    1860                      .dwattr $C$DW$88, DW_AT_bit_offset(0x00)
    1861                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1862                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1863                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1864              
    1865                      .dwendtag $C$DW$T$24
    1866              
    1867              
    1868              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1869                      .dwattr $C$DW$T$25, DW_AT_name("SDCMPH3_REG")
    1870                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1871              $C$DW$89        .dwtag  DW_TAG_member
    1872                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1873                      .dwattr $C$DW$89, DW_AT_name("all")
    1874                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_all")
    1875                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1876                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1877              
    1878              $C$DW$90        .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$24)
    1880                      .dwattr $C$DW$90, DW_AT_name("bit")
    1881                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_bit")
    1882                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1883                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1884              
    1885                      .dwendtag $C$DW$T$25
    1886              
    1887              
    1888              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1889                      .dwattr $C$DW$T$26, DW_AT_name("SDCMPH4_BITS")
    1890                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1891              $C$DW$91        .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1893                      .dwattr $C$DW$91, DW_AT_name("HLT")
    1894                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_HLT")
    1895                      .dwattr $C$DW$91, DW_AT_bit_offset(0x01)
    1896                      .dwattr $C$DW$91, DW_AT_bit_size(0x0f)
    1897                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1899              
    1900              $C$DW$92        .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1902                      .dwattr $C$DW$92, DW_AT_name("rsvd1")
    1903                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd1")
    1904                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   39

    1905                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1906                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1907                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1908              
    1909                      .dwendtag $C$DW$T$26
    1910              
    1911              
    1912              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1913                      .dwattr $C$DW$T$27, DW_AT_name("SDCMPH4_REG")
    1914                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1915              $C$DW$93        .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1917                      .dwattr $C$DW$93, DW_AT_name("all")
    1918                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_all")
    1919                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1920                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1921              
    1922              $C$DW$94        .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$26)
    1924                      .dwattr $C$DW$94, DW_AT_name("bit")
    1925                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_bit")
    1926                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1927                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1928              
    1929                      .dwendtag $C$DW$T$27
    1930              
    1931              
    1932              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1933                      .dwattr $C$DW$T$28, DW_AT_name("SDCMPL1_BITS")
    1934                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1935              $C$DW$95        .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1937                      .dwattr $C$DW$95, DW_AT_name("LLT")
    1938                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_LLT")
    1939                      .dwattr $C$DW$95, DW_AT_bit_offset(0x01)
    1940                      .dwattr $C$DW$95, DW_AT_bit_size(0x0f)
    1941                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1942                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1943              
    1944              $C$DW$96        .dwtag  DW_TAG_member
    1945                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1946                      .dwattr $C$DW$96, DW_AT_name("rsvd1")
    1947                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd1")
    1948                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
    1949                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1950                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1951                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1952              
    1953                      .dwendtag $C$DW$T$28
    1954              
    1955              
    1956              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1957                      .dwattr $C$DW$T$29, DW_AT_name("SDCMPL1_REG")
    1958                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1959              $C$DW$97        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   40

    1960                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1961                      .dwattr $C$DW$97, DW_AT_name("all")
    1962                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_all")
    1963                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1964                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1965              
    1966              $C$DW$98        .dwtag  DW_TAG_member
    1967                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$28)
    1968                      .dwattr $C$DW$98, DW_AT_name("bit")
    1969                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_bit")
    1970                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1971                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1972              
    1973                      .dwendtag $C$DW$T$29
    1974              
    1975              
    1976              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1977                      .dwattr $C$DW$T$30, DW_AT_name("SDCMPL2_BITS")
    1978                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1979              $C$DW$99        .dwtag  DW_TAG_member
    1980                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1981                      .dwattr $C$DW$99, DW_AT_name("LLT")
    1982                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_LLT")
    1983                      .dwattr $C$DW$99, DW_AT_bit_offset(0x01)
    1984                      .dwattr $C$DW$99, DW_AT_bit_size(0x0f)
    1985                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1986                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1987              
    1988              $C$DW$100       .dwtag  DW_TAG_member
    1989                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1990                      .dwattr $C$DW$100, DW_AT_name("rsvd1")
    1991                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd1")
    1992                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00)
    1993                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1994                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1995                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1996              
    1997                      .dwendtag $C$DW$T$30
    1998              
    1999              
    2000              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2001                      .dwattr $C$DW$T$31, DW_AT_name("SDCMPL2_REG")
    2002                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2003              $C$DW$101       .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2005                      .dwattr $C$DW$101, DW_AT_name("all")
    2006                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    2007                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2008                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2009              
    2010              $C$DW$102       .dwtag  DW_TAG_member
    2011                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$30)
    2012                      .dwattr $C$DW$102, DW_AT_name("bit")
    2013                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    2014                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   41

    2015                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2016              
    2017                      .dwendtag $C$DW$T$31
    2018              
    2019              
    2020              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2021                      .dwattr $C$DW$T$32, DW_AT_name("SDCMPL3_BITS")
    2022                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2023              $C$DW$103       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    2025                      .dwattr $C$DW$103, DW_AT_name("LLT")
    2026                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_LLT")
    2027                      .dwattr $C$DW$103, DW_AT_bit_offset(0x01)
    2028                      .dwattr $C$DW$103, DW_AT_bit_size(0x0f)
    2029                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2030                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2031              
    2032              $C$DW$104       .dwtag  DW_TAG_member
    2033                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2034                      .dwattr $C$DW$104, DW_AT_name("rsvd1")
    2035                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd1")
    2036                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    2037                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    2038                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2039                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2040              
    2041                      .dwendtag $C$DW$T$32
    2042              
    2043              
    2044              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2045                      .dwattr $C$DW$T$33, DW_AT_name("SDCMPL3_REG")
    2046                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2047              $C$DW$105       .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2049                      .dwattr $C$DW$105, DW_AT_name("all")
    2050                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_all")
    2051                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2052                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2053              
    2054              $C$DW$106       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$32)
    2056                      .dwattr $C$DW$106, DW_AT_name("bit")
    2057                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_bit")
    2058                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2059                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2060              
    2061                      .dwendtag $C$DW$T$33
    2062              
    2063              
    2064              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2065                      .dwattr $C$DW$T$34, DW_AT_name("SDCMPL4_BITS")
    2066                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2067              $C$DW$107       .dwtag  DW_TAG_member
    2068                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    2069                      .dwattr $C$DW$107, DW_AT_name("LLT")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   42

    2070                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_LLT")
    2071                      .dwattr $C$DW$107, DW_AT_bit_offset(0x01)
    2072                      .dwattr $C$DW$107, DW_AT_bit_size(0x0f)
    2073                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2074                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2075              
    2076              $C$DW$108       .dwtag  DW_TAG_member
    2077                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2078                      .dwattr $C$DW$108, DW_AT_name("rsvd1")
    2079                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_rsvd1")
    2080                      .dwattr $C$DW$108, DW_AT_bit_offset(0x00)
    2081                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    2082                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2083                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2084              
    2085                      .dwendtag $C$DW$T$34
    2086              
    2087              
    2088              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2089                      .dwattr $C$DW$T$35, DW_AT_name("SDCMPL4_REG")
    2090                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2091              $C$DW$109       .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2093                      .dwattr $C$DW$109, DW_AT_name("all")
    2094                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_all")
    2095                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2096                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2097              
    2098              $C$DW$110       .dwtag  DW_TAG_member
    2099                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$34)
    2100                      .dwattr $C$DW$110, DW_AT_name("bit")
    2101                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_bit")
    2102                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2103                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2104              
    2105                      .dwendtag $C$DW$T$35
    2106              
    2107              
    2108              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2109                      .dwattr $C$DW$T$36, DW_AT_name("SDCPARM1_BITS")
    2110                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2111              $C$DW$111       .dwtag  DW_TAG_member
    2112                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2113                      .dwattr $C$DW$111, DW_AT_name("COSR")
    2114                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_COSR")
    2115                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0b)
    2116                      .dwattr $C$DW$111, DW_AT_bit_size(0x05)
    2117                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2118                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2119              
    2120              $C$DW$112       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2122                      .dwattr $C$DW$112, DW_AT_name("IEH")
    2123                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_IEH")
    2124                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   43

    2125                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    2126                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2127                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2128              
    2129              $C$DW$113       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2131                      .dwattr $C$DW$113, DW_AT_name("IEL")
    2132                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_IEL")
    2133                      .dwattr $C$DW$113, DW_AT_bit_offset(0x09)
    2134                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    2135                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2136                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2137              
    2138              $C$DW$114       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2140                      .dwattr $C$DW$114, DW_AT_name("CS1_CS0")
    2141                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_CS1_CS0")
    2142                      .dwattr $C$DW$114, DW_AT_bit_offset(0x07)
    2143                      .dwattr $C$DW$114, DW_AT_bit_size(0x02)
    2144                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2145                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2146              
    2147              $C$DW$115       .dwtag  DW_TAG_member
    2148                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2149                      .dwattr $C$DW$115, DW_AT_name("MFIE")
    2150                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_MFIE")
    2151                      .dwattr $C$DW$115, DW_AT_bit_offset(0x06)
    2152                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    2153                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2154                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2155              
    2156              $C$DW$116       .dwtag  DW_TAG_member
    2157                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2158                      .dwattr $C$DW$116, DW_AT_name("rsvd1")
    2159                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd1")
    2160                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    2161                      .dwattr $C$DW$116, DW_AT_bit_size(0x06)
    2162                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2163                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2164              
    2165                      .dwendtag $C$DW$T$36
    2166              
    2167              
    2168              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2169                      .dwattr $C$DW$T$37, DW_AT_name("SDCPARM1_REG")
    2170                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2171              $C$DW$117       .dwtag  DW_TAG_member
    2172                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2173                      .dwattr $C$DW$117, DW_AT_name("all")
    2174                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_all")
    2175                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2176                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2177              
    2178              $C$DW$118       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$36)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   44

    2180                      .dwattr $C$DW$118, DW_AT_name("bit")
    2181                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bit")
    2182                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2183                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2184              
    2185                      .dwendtag $C$DW$T$37
    2186              
    2187              
    2188              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2189                      .dwattr $C$DW$T$38, DW_AT_name("SDCPARM2_BITS")
    2190                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2191              $C$DW$119       .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2193                      .dwattr $C$DW$119, DW_AT_name("COSR")
    2194                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_COSR")
    2195                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0b)
    2196                      .dwattr $C$DW$119, DW_AT_bit_size(0x05)
    2197                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2199              
    2200              $C$DW$120       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2202                      .dwattr $C$DW$120, DW_AT_name("IEH")
    2203                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_IEH")
    2204                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0a)
    2205                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    2206                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2208              
    2209              $C$DW$121       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2211                      .dwattr $C$DW$121, DW_AT_name("IEL")
    2212                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_IEL")
    2213                      .dwattr $C$DW$121, DW_AT_bit_offset(0x09)
    2214                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    2215                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2216                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2217              
    2218              $C$DW$122       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2220                      .dwattr $C$DW$122, DW_AT_name("CS1_CS0")
    2221                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_CS1_CS0")
    2222                      .dwattr $C$DW$122, DW_AT_bit_offset(0x07)
    2223                      .dwattr $C$DW$122, DW_AT_bit_size(0x02)
    2224                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2225                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2226              
    2227              $C$DW$123       .dwtag  DW_TAG_member
    2228                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2229                      .dwattr $C$DW$123, DW_AT_name("MFIE")
    2230                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_MFIE")
    2231                      .dwattr $C$DW$123, DW_AT_bit_offset(0x06)
    2232                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    2233                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2234                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   45

    2235              
    2236              $C$DW$124       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$124, DW_AT_name("rsvd1")
    2239                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd1")
    2240                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    2241                      .dwattr $C$DW$124, DW_AT_bit_size(0x06)
    2242                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2243                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2244              
    2245                      .dwendtag $C$DW$T$38
    2246              
    2247              
    2248              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2249                      .dwattr $C$DW$T$39, DW_AT_name("SDCPARM2_REG")
    2250                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2251              $C$DW$125       .dwtag  DW_TAG_member
    2252                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2253                      .dwattr $C$DW$125, DW_AT_name("all")
    2254                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    2255                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2256                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2257              
    2258              $C$DW$126       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$38)
    2260                      .dwattr $C$DW$126, DW_AT_name("bit")
    2261                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    2262                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2263                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2264              
    2265                      .dwendtag $C$DW$T$39
    2266              
    2267              
    2268              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2269                      .dwattr $C$DW$T$40, DW_AT_name("SDCPARM3_BITS")
    2270                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2271              $C$DW$127       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2273                      .dwattr $C$DW$127, DW_AT_name("COSR")
    2274                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_COSR")
    2275                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0b)
    2276                      .dwattr $C$DW$127, DW_AT_bit_size(0x05)
    2277                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2279              
    2280              $C$DW$128       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2282                      .dwattr $C$DW$128, DW_AT_name("IEH")
    2283                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_IEH")
    2284                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0a)
    2285                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2286                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2288              
    2289              $C$DW$129       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   46

    2290                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2291                      .dwattr $C$DW$129, DW_AT_name("IEL")
    2292                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_IEL")
    2293                      .dwattr $C$DW$129, DW_AT_bit_offset(0x09)
    2294                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    2295                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2297              
    2298              $C$DW$130       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2300                      .dwattr $C$DW$130, DW_AT_name("CS1_CS0")
    2301                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_CS1_CS0")
    2302                      .dwattr $C$DW$130, DW_AT_bit_offset(0x07)
    2303                      .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    2304                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2305                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2306              
    2307              $C$DW$131       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2309                      .dwattr $C$DW$131, DW_AT_name("MFIE")
    2310                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_MFIE")
    2311                      .dwattr $C$DW$131, DW_AT_bit_offset(0x06)
    2312                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2313                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2315              
    2316              $C$DW$132       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2318                      .dwattr $C$DW$132, DW_AT_name("rsvd1")
    2319                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd1")
    2320                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    2321                      .dwattr $C$DW$132, DW_AT_bit_size(0x06)
    2322                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2323                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2324              
    2325                      .dwendtag $C$DW$T$40
    2326              
    2327              
    2328              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2329                      .dwattr $C$DW$T$41, DW_AT_name("SDCPARM3_REG")
    2330                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2331              $C$DW$133       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2333                      .dwattr $C$DW$133, DW_AT_name("all")
    2334                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_all")
    2335                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2336                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2337              
    2338              $C$DW$134       .dwtag  DW_TAG_member
    2339                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$40)
    2340                      .dwattr $C$DW$134, DW_AT_name("bit")
    2341                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_bit")
    2342                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2343                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2344              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   47

    2345                      .dwendtag $C$DW$T$41
    2346              
    2347              
    2348              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2349                      .dwattr $C$DW$T$42, DW_AT_name("SDCPARM4_BITS")
    2350                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2351              $C$DW$135       .dwtag  DW_TAG_member
    2352                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2353                      .dwattr $C$DW$135, DW_AT_name("COSR")
    2354                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_COSR")
    2355                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0b)
    2356                      .dwattr $C$DW$135, DW_AT_bit_size(0x05)
    2357                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2358                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2359              
    2360              $C$DW$136       .dwtag  DW_TAG_member
    2361                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2362                      .dwattr $C$DW$136, DW_AT_name("IEH")
    2363                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_IEH")
    2364                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0a)
    2365                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2366                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2367                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2368              
    2369              $C$DW$137       .dwtag  DW_TAG_member
    2370                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2371                      .dwattr $C$DW$137, DW_AT_name("IEL")
    2372                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_IEL")
    2373                      .dwattr $C$DW$137, DW_AT_bit_offset(0x09)
    2374                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2375                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2376                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2377              
    2378              $C$DW$138       .dwtag  DW_TAG_member
    2379                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2380                      .dwattr $C$DW$138, DW_AT_name("CS1_CS0")
    2381                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_CS1_CS0")
    2382                      .dwattr $C$DW$138, DW_AT_bit_offset(0x07)
    2383                      .dwattr $C$DW$138, DW_AT_bit_size(0x02)
    2384                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2385                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2386              
    2387              $C$DW$139       .dwtag  DW_TAG_member
    2388                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2389                      .dwattr $C$DW$139, DW_AT_name("MFIE")
    2390                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_MFIE")
    2391                      .dwattr $C$DW$139, DW_AT_bit_offset(0x06)
    2392                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2393                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2394                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2395              
    2396              $C$DW$140       .dwtag  DW_TAG_member
    2397                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2398                      .dwattr $C$DW$140, DW_AT_name("rsvd1")
    2399                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   48

    2400                      .dwattr $C$DW$140, DW_AT_bit_offset(0x00)
    2401                      .dwattr $C$DW$140, DW_AT_bit_size(0x06)
    2402                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2403                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2404              
    2405                      .dwendtag $C$DW$T$42
    2406              
    2407              
    2408              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2409                      .dwattr $C$DW$T$43, DW_AT_name("SDCPARM4_REG")
    2410                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2411              $C$DW$141       .dwtag  DW_TAG_member
    2412                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2413                      .dwattr $C$DW$141, DW_AT_name("all")
    2414                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_all")
    2415                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2416                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2417              
    2418              $C$DW$142       .dwtag  DW_TAG_member
    2419                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$42)
    2420                      .dwattr $C$DW$142, DW_AT_name("bit")
    2421                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_bit")
    2422                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2423                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2424              
    2425                      .dwendtag $C$DW$T$43
    2426              
    2427              
    2428              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2429                      .dwattr $C$DW$T$44, DW_AT_name("SDCTLPARM1_BITS")
    2430                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2431              $C$DW$143       .dwtag  DW_TAG_member
    2432                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2433                      .dwattr $C$DW$143, DW_AT_name("MOD")
    2434                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_MOD")
    2435                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0e)
    2436                      .dwattr $C$DW$143, DW_AT_bit_size(0x02)
    2437                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2438                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2439              
    2440              $C$DW$144       .dwtag  DW_TAG_member
    2441                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2442                      .dwattr $C$DW$144, DW_AT_name("rsvd1")
    2443                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd1")
    2444                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0d)
    2445                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2446                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2447                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2448              
    2449              $C$DW$145       .dwtag  DW_TAG_member
    2450                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2451                      .dwattr $C$DW$145, DW_AT_name("rsvd2")
    2452                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd2")
    2453                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0c)
    2454                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   49

    2455                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2456                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2457              
    2458              $C$DW$146       .dwtag  DW_TAG_member
    2459                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2460                      .dwattr $C$DW$146, DW_AT_name("rsvd3")
    2461                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd3")
    2462                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0b)
    2463                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2464                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2465                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2466              
    2467              $C$DW$147       .dwtag  DW_TAG_member
    2468                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2469                      .dwattr $C$DW$147, DW_AT_name("rsvd4")
    2470                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd4")
    2471                      .dwattr $C$DW$147, DW_AT_bit_offset(0x00)
    2472                      .dwattr $C$DW$147, DW_AT_bit_size(0x0b)
    2473                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2474                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2475              
    2476                      .dwendtag $C$DW$T$44
    2477              
    2478              
    2479              $C$DW$T$45      .dwtag  DW_TAG_union_type
    2480                      .dwattr $C$DW$T$45, DW_AT_name("SDCTLPARM1_REG")
    2481                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2482              $C$DW$148       .dwtag  DW_TAG_member
    2483                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2484                      .dwattr $C$DW$148, DW_AT_name("all")
    2485                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_all")
    2486                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2487                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2488              
    2489              $C$DW$149       .dwtag  DW_TAG_member
    2490                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$44)
    2491                      .dwattr $C$DW$149, DW_AT_name("bit")
    2492                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_bit")
    2493                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2494                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2495              
    2496                      .dwendtag $C$DW$T$45
    2497              
    2498              
    2499              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2500                      .dwattr $C$DW$T$46, DW_AT_name("SDCTLPARM2_BITS")
    2501                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    2502              $C$DW$150       .dwtag  DW_TAG_member
    2503                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2504                      .dwattr $C$DW$150, DW_AT_name("MOD")
    2505                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_MOD")
    2506                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0e)
    2507                      .dwattr $C$DW$150, DW_AT_bit_size(0x02)
    2508                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2509                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   50

    2510              
    2511              $C$DW$151       .dwtag  DW_TAG_member
    2512                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2513                      .dwattr $C$DW$151, DW_AT_name("rsvd1")
    2514                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd1")
    2515                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0d)
    2516                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2517                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2518                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2519              
    2520              $C$DW$152       .dwtag  DW_TAG_member
    2521                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2522                      .dwattr $C$DW$152, DW_AT_name("rsvd2")
    2523                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd2")
    2524                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0c)
    2525                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2526                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2527                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2528              
    2529              $C$DW$153       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2531                      .dwattr $C$DW$153, DW_AT_name("rsvd3")
    2532                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd3")
    2533                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0b)
    2534                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2535                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2536                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2537              
    2538              $C$DW$154       .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2540                      .dwattr $C$DW$154, DW_AT_name("rsvd4")
    2541                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd4")
    2542                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    2543                      .dwattr $C$DW$154, DW_AT_bit_size(0x0b)
    2544                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2545                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2546              
    2547                      .dwendtag $C$DW$T$46
    2548              
    2549              
    2550              $C$DW$T$47      .dwtag  DW_TAG_union_type
    2551                      .dwattr $C$DW$T$47, DW_AT_name("SDCTLPARM2_REG")
    2552                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    2553              $C$DW$155       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2555                      .dwattr $C$DW$155, DW_AT_name("all")
    2556                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_all")
    2557                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2558                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2559              
    2560              $C$DW$156       .dwtag  DW_TAG_member
    2561                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$46)
    2562                      .dwattr $C$DW$156, DW_AT_name("bit")
    2563                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_bit")
    2564                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   51

    2565                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2566              
    2567                      .dwendtag $C$DW$T$47
    2568              
    2569              
    2570              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2571                      .dwattr $C$DW$T$48, DW_AT_name("SDCTLPARM3_BITS")
    2572                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2573              $C$DW$157       .dwtag  DW_TAG_member
    2574                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2575                      .dwattr $C$DW$157, DW_AT_name("MOD")
    2576                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_MOD")
    2577                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0e)
    2578                      .dwattr $C$DW$157, DW_AT_bit_size(0x02)
    2579                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2580                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2581              
    2582              $C$DW$158       .dwtag  DW_TAG_member
    2583                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2584                      .dwattr $C$DW$158, DW_AT_name("rsvd1")
    2585                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd1")
    2586                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0d)
    2587                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2588                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2589                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2590              
    2591              $C$DW$159       .dwtag  DW_TAG_member
    2592                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2593                      .dwattr $C$DW$159, DW_AT_name("rsvd2")
    2594                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd2")
    2595                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0c)
    2596                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2597                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2598                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2599              
    2600              $C$DW$160       .dwtag  DW_TAG_member
    2601                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2602                      .dwattr $C$DW$160, DW_AT_name("rsvd3")
    2603                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd3")
    2604                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0b)
    2605                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2606                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2607                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2608              
    2609              $C$DW$161       .dwtag  DW_TAG_member
    2610                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2611                      .dwattr $C$DW$161, DW_AT_name("rsvd4")
    2612                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rsvd4")
    2613                      .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    2614                      .dwattr $C$DW$161, DW_AT_bit_size(0x0b)
    2615                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2616                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2617              
    2618                      .dwendtag $C$DW$T$48
    2619              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   52

    2620              
    2621              $C$DW$T$49      .dwtag  DW_TAG_union_type
    2622                      .dwattr $C$DW$T$49, DW_AT_name("SDCTLPARM3_REG")
    2623                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    2624              $C$DW$162       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2626                      .dwattr $C$DW$162, DW_AT_name("all")
    2627                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_all")
    2628                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2629                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2630              
    2631              $C$DW$163       .dwtag  DW_TAG_member
    2632                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$48)
    2633                      .dwattr $C$DW$163, DW_AT_name("bit")
    2634                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_bit")
    2635                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2636                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2637              
    2638                      .dwendtag $C$DW$T$49
    2639              
    2640              
    2641              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2642                      .dwattr $C$DW$T$50, DW_AT_name("SDCTLPARM4_BITS")
    2643                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    2644              $C$DW$164       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2646                      .dwattr $C$DW$164, DW_AT_name("MOD")
    2647                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_MOD")
    2648                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0e)
    2649                      .dwattr $C$DW$164, DW_AT_bit_size(0x02)
    2650                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2651                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2652              
    2653              $C$DW$165       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2655                      .dwattr $C$DW$165, DW_AT_name("rsvd1")
    2656                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd1")
    2657                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0d)
    2658                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2659                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2660                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2661              
    2662              $C$DW$166       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2664                      .dwattr $C$DW$166, DW_AT_name("rsvd2")
    2665                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd2")
    2666                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0c)
    2667                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2668                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2669                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2670              
    2671              $C$DW$167       .dwtag  DW_TAG_member
    2672                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2673                      .dwattr $C$DW$167, DW_AT_name("rsvd3")
    2674                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd3")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   53

    2675                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0b)
    2676                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2677                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2678                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2679              
    2680              $C$DW$168       .dwtag  DW_TAG_member
    2681                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2682                      .dwattr $C$DW$168, DW_AT_name("rsvd4")
    2683                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd4")
    2684                      .dwattr $C$DW$168, DW_AT_bit_offset(0x00)
    2685                      .dwattr $C$DW$168, DW_AT_bit_size(0x0b)
    2686                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2687                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2688              
    2689                      .dwendtag $C$DW$T$50
    2690              
    2691              
    2692              $C$DW$T$51      .dwtag  DW_TAG_union_type
    2693                      .dwattr $C$DW$T$51, DW_AT_name("SDCTLPARM4_REG")
    2694                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    2695              $C$DW$169       .dwtag  DW_TAG_member
    2696                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2697                      .dwattr $C$DW$169, DW_AT_name("all")
    2698                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_all")
    2699                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2700                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2701              
    2702              $C$DW$170       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$50)
    2704                      .dwattr $C$DW$170, DW_AT_name("bit")
    2705                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_bit")
    2706                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2707                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2708              
    2709                      .dwendtag $C$DW$T$51
    2710              
    2711              
    2712              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2713                      .dwattr $C$DW$T$52, DW_AT_name("SDCTL_BITS")
    2714                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    2715              $C$DW$171       .dwtag  DW_TAG_member
    2716                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2717                      .dwattr $C$DW$171, DW_AT_name("rsvd1")
    2718                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd1")
    2719                      .dwattr $C$DW$171, DW_AT_bit_offset(0x03)
    2720                      .dwattr $C$DW$171, DW_AT_bit_size(0x0d)
    2721                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2722                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2723              
    2724              $C$DW$172       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2726                      .dwattr $C$DW$172, DW_AT_name("MIE")
    2727                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_MIE")
    2728                      .dwattr $C$DW$172, DW_AT_bit_offset(0x02)
    2729                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   54

    2730                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2731                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2732              
    2733              $C$DW$173       .dwtag  DW_TAG_member
    2734                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2735                      .dwattr $C$DW$173, DW_AT_name("rsvd2")
    2736                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd2")
    2737                      .dwattr $C$DW$173, DW_AT_bit_offset(0x01)
    2738                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2739                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2740                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2741              
    2742              $C$DW$174       .dwtag  DW_TAG_member
    2743                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2744                      .dwattr $C$DW$174, DW_AT_name("rsvd3")
    2745                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd3")
    2746                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00)
    2747                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2748                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2749                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2750              
    2751                      .dwendtag $C$DW$T$52
    2752              
    2753              
    2754              $C$DW$T$53      .dwtag  DW_TAG_union_type
    2755                      .dwattr $C$DW$T$53, DW_AT_name("SDCTL_REG")
    2756                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    2757              $C$DW$175       .dwtag  DW_TAG_member
    2758                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2759                      .dwattr $C$DW$175, DW_AT_name("all")
    2760                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_all")
    2761                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2762                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2763              
    2764              $C$DW$176       .dwtag  DW_TAG_member
    2765                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$52)
    2766                      .dwattr $C$DW$176, DW_AT_name("bit")
    2767                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_bit")
    2768                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2769                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2770              
    2771                      .dwendtag $C$DW$T$53
    2772              
    2773              
    2774              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    2775                      .dwattr $C$DW$T$54, DW_AT_name("SDDATA1_BITS")
    2776                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    2777              $C$DW$177       .dwtag  DW_TAG_member
    2778                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2779                      .dwattr $C$DW$177, DW_AT_name("DATA16")
    2780                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_DATA16")
    2781                      .dwattr $C$DW$177, DW_AT_bit_offset(0x00)
    2782                      .dwattr $C$DW$177, DW_AT_bit_size(0x10)
    2783                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2784                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   55

    2785              
    2786              $C$DW$178       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2788                      .dwattr $C$DW$178, DW_AT_name("DATA32HI")
    2789                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_DATA32HI")
    2790                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00)
    2791                      .dwattr $C$DW$178, DW_AT_bit_size(0x10)
    2792                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2793                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2794              
    2795                      .dwendtag $C$DW$T$54
    2796              
    2797              
    2798              $C$DW$T$56      .dwtag  DW_TAG_union_type
    2799                      .dwattr $C$DW$T$56, DW_AT_name("SDDATA1_REG")
    2800                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x02)
    2801              $C$DW$179       .dwtag  DW_TAG_member
    2802                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$55)
    2803                      .dwattr $C$DW$179, DW_AT_name("all")
    2804                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_all")
    2805                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2806                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2807              
    2808              $C$DW$180       .dwtag  DW_TAG_member
    2809                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$54)
    2810                      .dwattr $C$DW$180, DW_AT_name("bit")
    2811                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_bit")
    2812                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2813                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2814              
    2815                      .dwendtag $C$DW$T$56
    2816              
    2817              
    2818              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2819                      .dwattr $C$DW$T$57, DW_AT_name("SDDATA2_BITS")
    2820                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x02)
    2821              $C$DW$181       .dwtag  DW_TAG_member
    2822                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2823                      .dwattr $C$DW$181, DW_AT_name("DATA16")
    2824                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_DATA16")
    2825                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00)
    2826                      .dwattr $C$DW$181, DW_AT_bit_size(0x10)
    2827                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2828                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2829              
    2830              $C$DW$182       .dwtag  DW_TAG_member
    2831                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2832                      .dwattr $C$DW$182, DW_AT_name("DATA32HI")
    2833                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_DATA32HI")
    2834                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    2835                      .dwattr $C$DW$182, DW_AT_bit_size(0x10)
    2836                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2837                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2838              
    2839                      .dwendtag $C$DW$T$57
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   56

    2840              
    2841              
    2842              $C$DW$T$58      .dwtag  DW_TAG_union_type
    2843                      .dwattr $C$DW$T$58, DW_AT_name("SDDATA2_REG")
    2844                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x02)
    2845              $C$DW$183       .dwtag  DW_TAG_member
    2846                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$55)
    2847                      .dwattr $C$DW$183, DW_AT_name("all")
    2848                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    2849                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2850                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2851              
    2852              $C$DW$184       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$57)
    2854                      .dwattr $C$DW$184, DW_AT_name("bit")
    2855                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    2856                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2857                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2858              
    2859                      .dwendtag $C$DW$T$58
    2860              
    2861              
    2862              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    2863                      .dwattr $C$DW$T$59, DW_AT_name("SDDATA3_BITS")
    2864                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    2865              $C$DW$185       .dwtag  DW_TAG_member
    2866                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2867                      .dwattr $C$DW$185, DW_AT_name("DATA16")
    2868                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_DATA16")
    2869                      .dwattr $C$DW$185, DW_AT_bit_offset(0x00)
    2870                      .dwattr $C$DW$185, DW_AT_bit_size(0x10)
    2871                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2872                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2873              
    2874              $C$DW$186       .dwtag  DW_TAG_member
    2875                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2876                      .dwattr $C$DW$186, DW_AT_name("DATA32HI")
    2877                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_DATA32HI")
    2878                      .dwattr $C$DW$186, DW_AT_bit_offset(0x00)
    2879                      .dwattr $C$DW$186, DW_AT_bit_size(0x10)
    2880                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2881                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2882              
    2883                      .dwendtag $C$DW$T$59
    2884              
    2885              
    2886              $C$DW$T$60      .dwtag  DW_TAG_union_type
    2887                      .dwattr $C$DW$T$60, DW_AT_name("SDDATA3_REG")
    2888                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
    2889              $C$DW$187       .dwtag  DW_TAG_member
    2890                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$55)
    2891                      .dwattr $C$DW$187, DW_AT_name("all")
    2892                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_all")
    2893                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2894                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   57

    2895              
    2896              $C$DW$188       .dwtag  DW_TAG_member
    2897                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$59)
    2898                      .dwattr $C$DW$188, DW_AT_name("bit")
    2899                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_bit")
    2900                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2901                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2902              
    2903                      .dwendtag $C$DW$T$60
    2904              
    2905              
    2906              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    2907                      .dwattr $C$DW$T$61, DW_AT_name("SDDATA4_BITS")
    2908                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x02)
    2909              $C$DW$189       .dwtag  DW_TAG_member
    2910                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2911                      .dwattr $C$DW$189, DW_AT_name("DATA16")
    2912                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_DATA16")
    2913                      .dwattr $C$DW$189, DW_AT_bit_offset(0x00)
    2914                      .dwattr $C$DW$189, DW_AT_bit_size(0x10)
    2915                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2916                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2917              
    2918              $C$DW$190       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2920                      .dwattr $C$DW$190, DW_AT_name("DATA32HI")
    2921                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_DATA32HI")
    2922                      .dwattr $C$DW$190, DW_AT_bit_offset(0x00)
    2923                      .dwattr $C$DW$190, DW_AT_bit_size(0x10)
    2924                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2925                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2926              
    2927                      .dwendtag $C$DW$T$61
    2928              
    2929              
    2930              $C$DW$T$62      .dwtag  DW_TAG_union_type
    2931                      .dwattr $C$DW$T$62, DW_AT_name("SDDATA4_REG")
    2932                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x02)
    2933              $C$DW$191       .dwtag  DW_TAG_member
    2934                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$55)
    2935                      .dwattr $C$DW$191, DW_AT_name("all")
    2936                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_all")
    2937                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2938                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2939              
    2940              $C$DW$192       .dwtag  DW_TAG_member
    2941                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$61)
    2942                      .dwattr $C$DW$192, DW_AT_name("bit")
    2943                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_bit")
    2944                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2945                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2946              
    2947                      .dwendtag $C$DW$T$62
    2948              
    2949              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   58

    2950              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    2951                      .dwattr $C$DW$T$63, DW_AT_name("SDDFPARM1_BITS")
    2952                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
    2953              $C$DW$193       .dwtag  DW_TAG_member
    2954                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2955                      .dwattr $C$DW$193, DW_AT_name("DOSR")
    2956                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_DOSR")
    2957                      .dwattr $C$DW$193, DW_AT_bit_offset(0x08)
    2958                      .dwattr $C$DW$193, DW_AT_bit_size(0x08)
    2959                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2960                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2961              
    2962              $C$DW$194       .dwtag  DW_TAG_member
    2963                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2964                      .dwattr $C$DW$194, DW_AT_name("FEN")
    2965                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_FEN")
    2966                      .dwattr $C$DW$194, DW_AT_bit_offset(0x07)
    2967                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2968                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2969                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2970              
    2971              $C$DW$195       .dwtag  DW_TAG_member
    2972                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2973                      .dwattr $C$DW$195, DW_AT_name("AE")
    2974                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_AE")
    2975                      .dwattr $C$DW$195, DW_AT_bit_offset(0x06)
    2976                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2977                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2978                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2979              
    2980              $C$DW$196       .dwtag  DW_TAG_member
    2981                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2982                      .dwattr $C$DW$196, DW_AT_name("SST")
    2983                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_SST")
    2984                      .dwattr $C$DW$196, DW_AT_bit_offset(0x04)
    2985                      .dwattr $C$DW$196, DW_AT_bit_size(0x02)
    2986                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2987                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2988              
    2989              $C$DW$197       .dwtag  DW_TAG_member
    2990                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2991                      .dwattr $C$DW$197, DW_AT_name("FILRESEN")
    2992                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_FILRESEN")
    2993                      .dwattr $C$DW$197, DW_AT_bit_offset(0x03)
    2994                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2995                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2996                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2997              
    2998              $C$DW$198       .dwtag  DW_TAG_member
    2999                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    3000                      .dwattr $C$DW$198, DW_AT_name("rsvd1")
    3001                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_rsvd1")
    3002                      .dwattr $C$DW$198, DW_AT_bit_offset(0x00)
    3003                      .dwattr $C$DW$198, DW_AT_bit_size(0x03)
    3004                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   59

    3005                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3006              
    3007                      .dwendtag $C$DW$T$63
    3008              
    3009              
    3010              $C$DW$T$64      .dwtag  DW_TAG_union_type
    3011                      .dwattr $C$DW$T$64, DW_AT_name("SDDFPARM1_REG")
    3012                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    3013              $C$DW$199       .dwtag  DW_TAG_member
    3014                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3015                      .dwattr $C$DW$199, DW_AT_name("all")
    3016                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_all")
    3017                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3018                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3019              
    3020              $C$DW$200       .dwtag  DW_TAG_member
    3021                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$63)
    3022                      .dwattr $C$DW$200, DW_AT_name("bit")
    3023                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_bit")
    3024                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3025                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3026              
    3027                      .dwendtag $C$DW$T$64
    3028              
    3029              
    3030              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3031                      .dwattr $C$DW$T$65, DW_AT_name("SDDFPARM2_BITS")
    3032                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
    3033              $C$DW$201       .dwtag  DW_TAG_member
    3034                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    3035                      .dwattr $C$DW$201, DW_AT_name("DOSR")
    3036                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_DOSR")
    3037                      .dwattr $C$DW$201, DW_AT_bit_offset(0x08)
    3038                      .dwattr $C$DW$201, DW_AT_bit_size(0x08)
    3039                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3040                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3041              
    3042              $C$DW$202       .dwtag  DW_TAG_member
    3043                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    3044                      .dwattr $C$DW$202, DW_AT_name("FEN")
    3045                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_FEN")
    3046                      .dwattr $C$DW$202, DW_AT_bit_offset(0x07)
    3047                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    3048                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3049                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3050              
    3051              $C$DW$203       .dwtag  DW_TAG_member
    3052                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    3053                      .dwattr $C$DW$203, DW_AT_name("AE")
    3054                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_AE")
    3055                      .dwattr $C$DW$203, DW_AT_bit_offset(0x06)
    3056                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    3057                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3058                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3059              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:51 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   60

    3060              $C$DW$204       .dwtag  DW_TAG_member
    3061                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3062                      .dwattr $C$DW$204, DW_AT_name("SST")
    3063                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_SST")
    3064                      .dwattr $C$DW$204, DW_AT_bit_offset(0x04)
    3065                      .dwattr $C$DW$204, DW_AT_bit_size(0x02)
    3066                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3067                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3068              
    3069              $C$DW$205       .dwtag  DW_TAG_member
    3070                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3071                      .dwattr $C$DW$205, DW_AT_name("FILRESEN")
    3072                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_FILRESEN")
    3073                      .dwattr $C$DW$205, DW_AT_bit_offset(0x03)
    3074                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    3075                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3076                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3077              
    3078              $C$DW$206       .dwtag  DW_TAG_member
    3079                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3080                      .dwattr $C$DW$206, DW_AT_name("rsvd1")
    3081                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_rsvd1")
    3082                      .dwattr $C$DW$206, DW_AT_bit_offset(0x00)
    3083                      .dwattr $C$DW$206, DW_AT_bit_size(0x03)
    3084                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3085                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3086              
