TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:49 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("PieCtrlRegs")

     103                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_PieCtrl.c"
     104 0000001d 2B19!         MOV       @$BLOCKED(_PieCtrlRegs)+25,#0 ; [CPU_ALU] |66| 
     105              $C$DW$3 .dwtag  DW_TAG_TI_branch
     106                      .dwattr $C$DW$3, DW_AT_low_pc(0x00)
     107                      .dwattr $C$DW$3, DW_AT_TI_return
     108              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    3

     109 0000001e 0006          LRETR     ; [CPU_ALU] 
     110                      ; return occurs ; [] 
     111                      .dwattr $C$DW$2, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/sou
     112                      .dwattr $C$DW$2, DW_AT_TI_end_line(0x43)
     113                      .dwattr $C$DW$2, DW_AT_TI_end_column(0x01)
     114                      .dwendentry
     115                      .dwendtag $C$DW$2
     116              
     117 0000001f               .sect   ".text"
     118                      .clink
     119                      .global _EnableInterrupts
     120              
     121              $C$DW$4 .dwtag  DW_TAG_subprogram
     122                      .dwattr $C$DW$4, DW_AT_name("EnableInterrupts")
     123                      .dwattr $C$DW$4, DW_AT_low_pc(_EnableInterrupts)
     124                      .dwattr $C$DW$4, DW_AT_high_pc(0x00)
     125                      .dwattr $C$DW$4, DW_AT_TI_symbol_name("_EnableInterrupts")
     126                      .dwattr $C$DW$4, DW_AT_external
     127                      .dwattr $C$DW$4, DW_AT_TI_begin_file("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/s
     128                      .dwattr $C$DW$4, DW_AT_TI_begin_line(0x48)
     129                      .dwattr $C$DW$4, DW_AT_TI_begin_column(0x06)
     130                      .dwattr $C$DW$4, DW_AT_TI_max_frame_size(-2)
     131                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_PieCtrl.c"
     132              
     133                      .dwfde $C$DW$CIE, _EnableInterrupts
     134              
     135              ;***************************************************************
     136              ;* FNAME: _EnableInterrupts             FR SIZE:   0           *
     137              ;*                                                             *
     138              ;* FUNCTION ENVIRONMENT                                        *
     139              ;*                                                             *
     140              ;* FUNCTION PROPERTIES                                         *
     141              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     142              ;***************************************************************
     143              
     144 0000001f       _EnableInterrupts:
     145                      .dwcfi  cfa_offset, -2
     146                      .dwcfi  save_reg_to_mem, 26, 0
     147 0000001f 761F!         MOVW      DP,#_PieCtrlRegs      ; [CPU_ARAU] 
         00000020 0000 
     148                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_PieCtrl.c"
     149 00000021 1A00!         OR        @$BLOCKED(_PieCtrlRegs),#0x0001 ; [CPU_ALU] |77| 
         00000022 0001 
     150                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_PieCtrl.c"
     151 00000023 2801!         MOV       @$BLOCKED(_PieCtrlRegs)+1,#65535 ; [CPU_ALU] |82| 
         00000024 FFFF 
     152 00000025 2910   clrc INTM
     153 00000026 FF69          SPM       #0                    ; [CPU_ALU] 
     154              $C$DW$5 .dwtag  DW_TAG_TI_branch
     155                      .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     156                      .dwattr $C$DW$5, DW_AT_TI_return
     157              
     158 00000027 0006          LRETR     ; [CPU_ALU] 
     159                      ; return occurs ; [] 
     160                      .dwattr $C$DW$4, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/sou
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    4

     161                      .dwattr $C$DW$4, DW_AT_TI_end_line(0x58)
     162                      .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     163                      .dwendentry
     164                      .dwendtag $C$DW$4
     165              
     166              ;**************************************************************
     167              ;* UNDEFINED EXTERNAL REFERENCES                              *
     168              ;**************************************************************
     169                      .global _PieCtrlRegs
     170              
     171              ;***************************************************************
     172              ;* TYPE INFORMATION                                            *
     173              ;***************************************************************
     174              
     175              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     176                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
     177                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     178              $C$DW$6 .dwtag  DW_TAG_member
     179                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     180                      .dwattr $C$DW$6, DW_AT_name("ACK1")
     181                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_ACK1")
     182                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0f)
     183                      .dwattr $C$DW$6, DW_AT_bit_size(0x01)
     184                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     185                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     186              
     187              $C$DW$7 .dwtag  DW_TAG_member
     188                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     189                      .dwattr $C$DW$7, DW_AT_name("ACK2")
     190                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_ACK2")
     191                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0e)
     192                      .dwattr $C$DW$7, DW_AT_bit_size(0x01)
     193                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     194                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     195              
     196              $C$DW$8 .dwtag  DW_TAG_member
     197                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     198                      .dwattr $C$DW$8, DW_AT_name("ACK3")
     199                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_ACK3")
     200                      .dwattr $C$DW$8, DW_AT_bit_offset(0x0d)
     201                      .dwattr $C$DW$8, DW_AT_bit_size(0x01)
     202                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     203                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     204              
     205              $C$DW$9 .dwtag  DW_TAG_member
     206                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     207                      .dwattr $C$DW$9, DW_AT_name("ACK4")
     208                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_ACK4")
     209                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0c)
     210                      .dwattr $C$DW$9, DW_AT_bit_size(0x01)
     211                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     212                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     213              
     214              $C$DW$10        .dwtag  DW_TAG_member
     215                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    5

     216                      .dwattr $C$DW$10, DW_AT_name("ACK5")
     217                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_ACK5")
     218                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0b)
     219                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     220                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     221                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     222              
     223              $C$DW$11        .dwtag  DW_TAG_member
     224                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     225                      .dwattr $C$DW$11, DW_AT_name("ACK6")
     226                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_ACK6")
     227                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0a)
     228                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     229                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     230                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     231              
     232              $C$DW$12        .dwtag  DW_TAG_member
     233                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     234                      .dwattr $C$DW$12, DW_AT_name("ACK7")
     235                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_ACK7")
     236                      .dwattr $C$DW$12, DW_AT_bit_offset(0x09)
     237                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     238                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     239                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     240              
     241              $C$DW$13        .dwtag  DW_TAG_member
     242                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     243                      .dwattr $C$DW$13, DW_AT_name("ACK8")
     244                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_ACK8")
     245                      .dwattr $C$DW$13, DW_AT_bit_offset(0x08)
     246                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     247                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     248                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     249              
     250              $C$DW$14        .dwtag  DW_TAG_member
     251                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     252                      .dwattr $C$DW$14, DW_AT_name("ACK9")
     253                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_ACK9")
     254                      .dwattr $C$DW$14, DW_AT_bit_offset(0x07)
     255                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     256                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     257                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     258              
     259              $C$DW$15        .dwtag  DW_TAG_member
     260                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     261                      .dwattr $C$DW$15, DW_AT_name("ACK10")
     262                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_ACK10")
     263                      .dwattr $C$DW$15, DW_AT_bit_offset(0x06)
     264                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     265                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     266                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     267              
     268              $C$DW$16        .dwtag  DW_TAG_member
     269                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     270                      .dwattr $C$DW$16, DW_AT_name("ACK11")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    6

     271                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_ACK11")
     272                      .dwattr $C$DW$16, DW_AT_bit_offset(0x05)
     273                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     274                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     275                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     276              
     277              $C$DW$17        .dwtag  DW_TAG_member
     278                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     279                      .dwattr $C$DW$17, DW_AT_name("ACK12")
     280                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_ACK12")
     281                      .dwattr $C$DW$17, DW_AT_bit_offset(0x04)
     282                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     283                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     284                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     285              
     286              $C$DW$18        .dwtag  DW_TAG_member
     287                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     288                      .dwattr $C$DW$18, DW_AT_name("rsvd1")
     289                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_rsvd1")
     290                      .dwattr $C$DW$18, DW_AT_bit_offset(0x00)
     291                      .dwattr $C$DW$18, DW_AT_bit_size(0x04)
     292                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     293                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     294              
     295                      .dwendtag $C$DW$T$20
     296              
     297              
     298              $C$DW$T$21      .dwtag  DW_TAG_union_type
     299                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
     300                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     301              $C$DW$19        .dwtag  DW_TAG_member
     302                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     303                      .dwattr $C$DW$19, DW_AT_name("all")
     304                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_all")
     305                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     306                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     307              
     308              $C$DW$20        .dwtag  DW_TAG_member
     309                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$20)
     310                      .dwattr $C$DW$20, DW_AT_name("bit")
     311                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_bit")
     312                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     313                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     314              
     315                      .dwendtag $C$DW$T$21
     316              
     317              
     318              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     319                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
     320                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     321              $C$DW$21        .dwtag  DW_TAG_member
     322                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     323                      .dwattr $C$DW$21, DW_AT_name("ENPIE")
     324                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_ENPIE")
     325                      .dwattr $C$DW$21, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    7

     326                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     327                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     328                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     329              
     330              $C$DW$22        .dwtag  DW_TAG_member
     331                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     332                      .dwattr $C$DW$22, DW_AT_name("PIEVECT")
     333                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_PIEVECT")
     334                      .dwattr $C$DW$22, DW_AT_bit_offset(0x00)
     335                      .dwattr $C$DW$22, DW_AT_bit_size(0x0f)
     336                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     337                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     338              
     339                      .dwendtag $C$DW$T$22
     340              
     341              
     342              $C$DW$T$23      .dwtag  DW_TAG_union_type
     343                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
     344                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     345              $C$DW$23        .dwtag  DW_TAG_member
     346                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     347                      .dwattr $C$DW$23, DW_AT_name("all")
     348                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_all")
     349                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     350                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     351              
     352              $C$DW$24        .dwtag  DW_TAG_member
     353                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     354                      .dwattr $C$DW$24, DW_AT_name("bit")
     355                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_bit")
     356                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     357                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     358              
     359                      .dwendtag $C$DW$T$23
     360              
     361              
     362              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     363                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER10_BITS")
     364                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     365              $C$DW$25        .dwtag  DW_TAG_member
     366                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     367                      .dwattr $C$DW$25, DW_AT_name("INTx1")
     368                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_INTx1")
     369                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0f)
     370                      .dwattr $C$DW$25, DW_AT_bit_size(0x01)
     371                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     372                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     373              
     374              $C$DW$26        .dwtag  DW_TAG_member
     375                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     376                      .dwattr $C$DW$26, DW_AT_name("INTx2")
     377                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_INTx2")
     378                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0e)
     379                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     380                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    8

     381                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     382              
     383              $C$DW$27        .dwtag  DW_TAG_member
     384                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     385                      .dwattr $C$DW$27, DW_AT_name("INTx3")
     386                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_INTx3")
     387                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0d)
     388                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     389                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     390                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     391              
     392              $C$DW$28        .dwtag  DW_TAG_member
     393                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     394                      .dwattr $C$DW$28, DW_AT_name("INTx4")
     395                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_INTx4")
     396                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0c)
     397                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     398                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     399                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     400              
     401              $C$DW$29        .dwtag  DW_TAG_member
     402                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     403                      .dwattr $C$DW$29, DW_AT_name("INTx5")
     404                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_INTx5")
     405                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0b)
     406                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     407                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     408                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     409              
     410              $C$DW$30        .dwtag  DW_TAG_member
     411                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     412                      .dwattr $C$DW$30, DW_AT_name("INTx6")
     413                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_INTx6")
     414                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0a)
     415                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     416                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     417                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     418              
     419              $C$DW$31        .dwtag  DW_TAG_member
     420                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     421                      .dwattr $C$DW$31, DW_AT_name("INTx7")
     422                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_INTx7")
     423                      .dwattr $C$DW$31, DW_AT_bit_offset(0x09)
     424                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     425                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     426                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     427              
     428              $C$DW$32        .dwtag  DW_TAG_member
     429                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     430                      .dwattr $C$DW$32, DW_AT_name("INTx8")
     431                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_INTx8")
     432                      .dwattr $C$DW$32, DW_AT_bit_offset(0x08)
     433                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     434                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     435                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    9

     436              
     437              $C$DW$33        .dwtag  DW_TAG_member
     438                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     439                      .dwattr $C$DW$33, DW_AT_name("INTx9")
     440                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_INTx9")
     441                      .dwattr $C$DW$33, DW_AT_bit_offset(0x07)
     442                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     443                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     444                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     445              
     446              $C$DW$34        .dwtag  DW_TAG_member
     447                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     448                      .dwattr $C$DW$34, DW_AT_name("INTx10")
     449                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_INTx10")
     450                      .dwattr $C$DW$34, DW_AT_bit_offset(0x06)
     451                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     452                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     453                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     454              
     455              $C$DW$35        .dwtag  DW_TAG_member
     456                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     457                      .dwattr $C$DW$35, DW_AT_name("INTx11")
     458                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_INTx11")
     459                      .dwattr $C$DW$35, DW_AT_bit_offset(0x05)
     460                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     461                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     462                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     463              
     464              $C$DW$36        .dwtag  DW_TAG_member
     465                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     466                      .dwattr $C$DW$36, DW_AT_name("INTx12")
     467                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_INTx12")
     468                      .dwattr $C$DW$36, DW_AT_bit_offset(0x04)
     469                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     470                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     471                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     472              
     473              $C$DW$37        .dwtag  DW_TAG_member
     474                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     475                      .dwattr $C$DW$37, DW_AT_name("INTx13")
     476                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_INTx13")
     477                      .dwattr $C$DW$37, DW_AT_bit_offset(0x03)
     478                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     479                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     480                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     481              
     482              $C$DW$38        .dwtag  DW_TAG_member
     483                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     484                      .dwattr $C$DW$38, DW_AT_name("INTx14")
     485                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_INTx14")
     486                      .dwattr $C$DW$38, DW_AT_bit_offset(0x02)
     487                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     488                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     489                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     490              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   10

     491              $C$DW$39        .dwtag  DW_TAG_member
     492                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     493                      .dwattr $C$DW$39, DW_AT_name("INTx15")
     494                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_INTx15")
     495                      .dwattr $C$DW$39, DW_AT_bit_offset(0x01)
     496                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     497                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     498                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     499              
     500              $C$DW$40        .dwtag  DW_TAG_member
     501                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     502                      .dwattr $C$DW$40, DW_AT_name("INTx16")
     503                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_INTx16")
     504                      .dwattr $C$DW$40, DW_AT_bit_offset(0x00)
     505                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     506                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     507                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     508              
     509                      .dwendtag $C$DW$T$24
     510              
     511              
     512              $C$DW$T$25      .dwtag  DW_TAG_union_type
     513                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER10_REG")
     514                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     515              $C$DW$41        .dwtag  DW_TAG_member
     516                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     517                      .dwattr $C$DW$41, DW_AT_name("all")
     518                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_all")
     519                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     520                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     521              
     522              $C$DW$42        .dwtag  DW_TAG_member
     523                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$24)
     524                      .dwattr $C$DW$42, DW_AT_name("bit")
     525                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_bit")
     526                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     527                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     528              
     529                      .dwendtag $C$DW$T$25
     530              
     531              
     532              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     533                      .dwattr $C$DW$T$26, DW_AT_name("PIEIER11_BITS")
     534                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     535              $C$DW$43        .dwtag  DW_TAG_member
     536                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     537                      .dwattr $C$DW$43, DW_AT_name("INTx1")
     538                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_INTx1")
     539                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0f)
     540                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     541                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     542                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     543              
     544              $C$DW$44        .dwtag  DW_TAG_member
     545                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   11

     546                      .dwattr $C$DW$44, DW_AT_name("INTx2")
     547                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_INTx2")
     548                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0e)
     549                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     550                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     551                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     552              
     553              $C$DW$45        .dwtag  DW_TAG_member
     554                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     555                      .dwattr $C$DW$45, DW_AT_name("INTx3")
     556                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_INTx3")
     557                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0d)
     558                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     559                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     560                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     561              
     562              $C$DW$46        .dwtag  DW_TAG_member
     563                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     564                      .dwattr $C$DW$46, DW_AT_name("INTx4")
     565                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_INTx4")
     566                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0c)
     567                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     568                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     569                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     570              
     571              $C$DW$47        .dwtag  DW_TAG_member
     572                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     573                      .dwattr $C$DW$47, DW_AT_name("INTx5")
     574                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_INTx5")
     575                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0b)
     576                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     577                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     578                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     579              
     580              $C$DW$48        .dwtag  DW_TAG_member
     581                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     582                      .dwattr $C$DW$48, DW_AT_name("INTx6")
     583                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_INTx6")
     584                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0a)
     585                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     586                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     587                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     588              
     589              $C$DW$49        .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     591                      .dwattr $C$DW$49, DW_AT_name("INTx7")
     592                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_INTx7")
     593                      .dwattr $C$DW$49, DW_AT_bit_offset(0x09)
     594                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     595                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     596                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     597              
     598              $C$DW$50        .dwtag  DW_TAG_member
     599                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     600                      .dwattr $C$DW$50, DW_AT_name("INTx8")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   12

     601                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_INTx8")
     602                      .dwattr $C$DW$50, DW_AT_bit_offset(0x08)
     603                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     604                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     605                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     606              
     607              $C$DW$51        .dwtag  DW_TAG_member
     608                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     609                      .dwattr $C$DW$51, DW_AT_name("INTx9")
     610                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_INTx9")
     611                      .dwattr $C$DW$51, DW_AT_bit_offset(0x07)
     612                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     613                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     614                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     615              
     616              $C$DW$52        .dwtag  DW_TAG_member
     617                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     618                      .dwattr $C$DW$52, DW_AT_name("INTx10")
     619                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_INTx10")
     620                      .dwattr $C$DW$52, DW_AT_bit_offset(0x06)
     621                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     622                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     623                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     624              
     625              $C$DW$53        .dwtag  DW_TAG_member
     626                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     627                      .dwattr $C$DW$53, DW_AT_name("INTx11")
     628                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_INTx11")
     629                      .dwattr $C$DW$53, DW_AT_bit_offset(0x05)
     630                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     631                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     632                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     633              
     634              $C$DW$54        .dwtag  DW_TAG_member
     635                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     636                      .dwattr $C$DW$54, DW_AT_name("INTx12")
     637                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_INTx12")
     638                      .dwattr $C$DW$54, DW_AT_bit_offset(0x04)
     639                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     640                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     641                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     642              
     643              $C$DW$55        .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     645                      .dwattr $C$DW$55, DW_AT_name("INTx13")
     646                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_INTx13")
     647                      .dwattr $C$DW$55, DW_AT_bit_offset(0x03)
     648                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     649                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     650                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     651              
     652              $C$DW$56        .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     654                      .dwattr $C$DW$56, DW_AT_name("INTx14")
     655                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_INTx14")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   13

     656                      .dwattr $C$DW$56, DW_AT_bit_offset(0x02)
     657                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     658                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     659                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     660              
     661              $C$DW$57        .dwtag  DW_TAG_member
     662                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     663                      .dwattr $C$DW$57, DW_AT_name("INTx15")
     664                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_INTx15")
     665                      .dwattr $C$DW$57, DW_AT_bit_offset(0x01)
     666                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     667                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     668                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     669              
     670              $C$DW$58        .dwtag  DW_TAG_member
     671                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     672                      .dwattr $C$DW$58, DW_AT_name("INTx16")
     673                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_INTx16")
     674                      .dwattr $C$DW$58, DW_AT_bit_offset(0x00)
     675                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     676                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     677                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     678              
     679                      .dwendtag $C$DW$T$26
     680              
     681              
     682              $C$DW$T$27      .dwtag  DW_TAG_union_type
     683                      .dwattr $C$DW$T$27, DW_AT_name("PIEIER11_REG")
     684                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     685              $C$DW$59        .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     687                      .dwattr $C$DW$59, DW_AT_name("all")
     688                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_all")
     689                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     691              
     692              $C$DW$60        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$26)
     694                      .dwattr $C$DW$60, DW_AT_name("bit")
     695                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_bit")
     696                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     698              
     699                      .dwendtag $C$DW$T$27
     700              
     701              
     702              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     703                      .dwattr $C$DW$T$28, DW_AT_name("PIEIER12_BITS")
     704                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     705              $C$DW$61        .dwtag  DW_TAG_member
     706                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     707                      .dwattr $C$DW$61, DW_AT_name("INTx1")
     708                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_INTx1")
     709                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0f)
     710                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   14

     711                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     712                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     713              
     714              $C$DW$62        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     716                      .dwattr $C$DW$62, DW_AT_name("INTx2")
     717                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_INTx2")
     718                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0e)
     719                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     720                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     721                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     722              
     723              $C$DW$63        .dwtag  DW_TAG_member
     724                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     725                      .dwattr $C$DW$63, DW_AT_name("INTx3")
     726                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_INTx3")
     727                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0d)
     728                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     729                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     731              
     732              $C$DW$64        .dwtag  DW_TAG_member
     733                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     734                      .dwattr $C$DW$64, DW_AT_name("INTx4")
     735                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_INTx4")
     736                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c)
     737                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     738                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     740              
     741              $C$DW$65        .dwtag  DW_TAG_member
     742                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     743                      .dwattr $C$DW$65, DW_AT_name("INTx5")
     744                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_INTx5")
     745                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0b)
     746                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     747                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     748                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     749              
     750              $C$DW$66        .dwtag  DW_TAG_member
     751                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     752                      .dwattr $C$DW$66, DW_AT_name("INTx6")
     753                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_INTx6")
     754                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0a)
     755                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     756                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     757                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     758              
     759              $C$DW$67        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$67, DW_AT_name("INTx7")
     762                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_INTx7")
     763                      .dwattr $C$DW$67, DW_AT_bit_offset(0x09)
     764                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     765                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   15

     766                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     767              
     768              $C$DW$68        .dwtag  DW_TAG_member
     769                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     770                      .dwattr $C$DW$68, DW_AT_name("INTx8")
     771                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_INTx8")
     772                      .dwattr $C$DW$68, DW_AT_bit_offset(0x08)
     773                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     774                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     775                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     776              
     777              $C$DW$69        .dwtag  DW_TAG_member
     778                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     779                      .dwattr $C$DW$69, DW_AT_name("INTx9")
     780                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_INTx9")
     781                      .dwattr $C$DW$69, DW_AT_bit_offset(0x07)
     782                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     783                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     784                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     785              
     786              $C$DW$70        .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     788                      .dwattr $C$DW$70, DW_AT_name("INTx10")
     789                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_INTx10")
     790                      .dwattr $C$DW$70, DW_AT_bit_offset(0x06)
     791                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     792                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     793                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     794              
     795              $C$DW$71        .dwtag  DW_TAG_member
     796                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     797                      .dwattr $C$DW$71, DW_AT_name("INTx11")
     798                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_INTx11")
     799                      .dwattr $C$DW$71, DW_AT_bit_offset(0x05)
     800                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     801                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     803              
     804              $C$DW$72        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     806                      .dwattr $C$DW$72, DW_AT_name("INTx12")
     807                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_INTx12")
     808                      .dwattr $C$DW$72, DW_AT_bit_offset(0x04)
     809                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     810                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     811                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     812              
     813              $C$DW$73        .dwtag  DW_TAG_member
     814                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     815                      .dwattr $C$DW$73, DW_AT_name("INTx13")
     816                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_INTx13")
     817                      .dwattr $C$DW$73, DW_AT_bit_offset(0x03)
     818                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     819                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     820                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   16

     821              
     822              $C$DW$74        .dwtag  DW_TAG_member
     823                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     824                      .dwattr $C$DW$74, DW_AT_name("INTx14")
     825                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_INTx14")
     826                      .dwattr $C$DW$74, DW_AT_bit_offset(0x02)
     827                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     828                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     829                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     830              
     831              $C$DW$75        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     833                      .dwattr $C$DW$75, DW_AT_name("INTx15")
     834                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_INTx15")
     835                      .dwattr $C$DW$75, DW_AT_bit_offset(0x01)
     836                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
     837                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     838                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     839              
     840              $C$DW$76        .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     842                      .dwattr $C$DW$76, DW_AT_name("INTx16")
     843                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_INTx16")
     844                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00)
     845                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
     846                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     847                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     848              
     849                      .dwendtag $C$DW$T$28
     850              
     851              
     852              $C$DW$T$29      .dwtag  DW_TAG_union_type
     853                      .dwattr $C$DW$T$29, DW_AT_name("PIEIER12_REG")
     854                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     855              $C$DW$77        .dwtag  DW_TAG_member
     856                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     857                      .dwattr $C$DW$77, DW_AT_name("all")
     858                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_all")
     859                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     860                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     861              
     862              $C$DW$78        .dwtag  DW_TAG_member
     863                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$28)
     864                      .dwattr $C$DW$78, DW_AT_name("bit")
     865                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_bit")
     866                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     867                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     868              
     869                      .dwendtag $C$DW$T$29
     870              
     871              
     872              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     873                      .dwattr $C$DW$T$30, DW_AT_name("PIEIER1_BITS")
     874                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     875              $C$DW$79        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   17

     876                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     877                      .dwattr $C$DW$79, DW_AT_name("INTx1")
     878                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_INTx1")
     879                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0f)
     880                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
     881                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     883              
     884              $C$DW$80        .dwtag  DW_TAG_member
     885                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     886                      .dwattr $C$DW$80, DW_AT_name("INTx2")
     887                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_INTx2")
     888                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0e)
     889                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
     890                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     891                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     892              
     893              $C$DW$81        .dwtag  DW_TAG_member
     894                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     895                      .dwattr $C$DW$81, DW_AT_name("INTx3")
     896                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_INTx3")
     897                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0d)
     898                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     899                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     900                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     901              
     902              $C$DW$82        .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     904                      .dwattr $C$DW$82, DW_AT_name("INTx4")
     905                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_INTx4")
     906                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0c)
     907                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
     908                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     909                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     910              
     911              $C$DW$83        .dwtag  DW_TAG_member
     912                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     913                      .dwattr $C$DW$83, DW_AT_name("INTx5")
     914                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_INTx5")
     915                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0b)
     916                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
     917                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     918                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     919              
     920              $C$DW$84        .dwtag  DW_TAG_member
     921                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     922                      .dwattr $C$DW$84, DW_AT_name("INTx6")
     923                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_INTx6")
     924                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0a)
     925                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
     926                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     928              
     929              $C$DW$85        .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   18

     931                      .dwattr $C$DW$85, DW_AT_name("INTx7")
     932                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_INTx7")
     933                      .dwattr $C$DW$85, DW_AT_bit_offset(0x09)
     934                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
     935                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     936                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     937              
     938              $C$DW$86        .dwtag  DW_TAG_member
     939                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     940                      .dwattr $C$DW$86, DW_AT_name("INTx8")
     941                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_INTx8")
     942                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08)
     943                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
     944                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     945                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     946              
     947              $C$DW$87        .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     949                      .dwattr $C$DW$87, DW_AT_name("INTx9")
     950                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_INTx9")
     951                      .dwattr $C$DW$87, DW_AT_bit_offset(0x07)
     952                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
     953                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     955              
     956              $C$DW$88        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     958                      .dwattr $C$DW$88, DW_AT_name("INTx10")
     959                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_INTx10")
     960                      .dwattr $C$DW$88, DW_AT_bit_offset(0x06)
     961                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
     962                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     963                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     964              
     965              $C$DW$89        .dwtag  DW_TAG_member
     966                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     967                      .dwattr $C$DW$89, DW_AT_name("INTx11")
     968                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_INTx11")
     969                      .dwattr $C$DW$89, DW_AT_bit_offset(0x05)
     970                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
     971                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     972                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     973              
     974              $C$DW$90        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$90, DW_AT_name("INTx12")
     977                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_INTx12")
     978                      .dwattr $C$DW$90, DW_AT_bit_offset(0x04)
     979                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
     980                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     982              
     983              $C$DW$91        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$91, DW_AT_name("INTx13")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   19

     986                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_INTx13")
     987                      .dwattr $C$DW$91, DW_AT_bit_offset(0x03)
     988                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
     989                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     990                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     991              
     992              $C$DW$92        .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     994                      .dwattr $C$DW$92, DW_AT_name("INTx14")
     995                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_INTx14")
     996                      .dwattr $C$DW$92, DW_AT_bit_offset(0x02)
     997                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
     998                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1000              
    1001              $C$DW$93        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$93, DW_AT_name("INTx15")
    1004                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_INTx15")
    1005                      .dwattr $C$DW$93, DW_AT_bit_offset(0x01)
    1006                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1007                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1008                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1009              
    1010              $C$DW$94        .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$94, DW_AT_name("INTx16")
    1013                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_INTx16")
    1014                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00)
    1015                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1016                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1018              
    1019                      .dwendtag $C$DW$T$30
    1020              
    1021              
    1022              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1023                      .dwattr $C$DW$T$31, DW_AT_name("PIEIER1_REG")
    1024                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1025              $C$DW$95        .dwtag  DW_TAG_member
    1026                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1027                      .dwattr $C$DW$95, DW_AT_name("all")
    1028                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
    1029                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1030                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1031              
    1032              $C$DW$96        .dwtag  DW_TAG_member
    1033                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$30)
    1034                      .dwattr $C$DW$96, DW_AT_name("bit")
    1035                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
    1036                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1038              
    1039                      .dwendtag $C$DW$T$31
    1040              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   20

    1041              
    1042              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1043                      .dwattr $C$DW$T$32, DW_AT_name("PIEIER2_BITS")
    1044                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1045              $C$DW$97        .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1047                      .dwattr $C$DW$97, DW_AT_name("INTx1")
    1048                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_INTx1")
    1049                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0f)
    1050                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1051                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1052                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1053              
    1054              $C$DW$98        .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1056                      .dwattr $C$DW$98, DW_AT_name("INTx2")
    1057                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_INTx2")
    1058                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0e)
    1059                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1060                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1061                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1062              
    1063              $C$DW$99        .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1065                      .dwattr $C$DW$99, DW_AT_name("INTx3")
    1066                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_INTx3")
    1067                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0d)
    1068                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1069                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1071              
    1072              $C$DW$100       .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1074                      .dwattr $C$DW$100, DW_AT_name("INTx4")
    1075                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_INTx4")
    1076                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0c)
    1077                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1078                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1079                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1080              
    1081              $C$DW$101       .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1083                      .dwattr $C$DW$101, DW_AT_name("INTx5")
    1084                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_INTx5")
    1085                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0b)
    1086                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1087                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1088                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1089              
    1090              $C$DW$102       .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1092                      .dwattr $C$DW$102, DW_AT_name("INTx6")
    1093                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_INTx6")
    1094                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0a)
    1095                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   21

    1096                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1098              
    1099              $C$DW$103       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1101                      .dwattr $C$DW$103, DW_AT_name("INTx7")
    1102                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_INTx7")
    1103                      .dwattr $C$DW$103, DW_AT_bit_offset(0x09)
    1104                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1105                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1107              
    1108              $C$DW$104       .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1110                      .dwattr $C$DW$104, DW_AT_name("INTx8")
    1111                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_INTx8")
    1112                      .dwattr $C$DW$104, DW_AT_bit_offset(0x08)
    1113                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1114                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1115                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1116              
    1117              $C$DW$105       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1119                      .dwattr $C$DW$105, DW_AT_name("INTx9")
    1120                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_INTx9")
    1121                      .dwattr $C$DW$105, DW_AT_bit_offset(0x07)
    1122                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1123                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1124                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1125              
    1126              $C$DW$106       .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1128                      .dwattr $C$DW$106, DW_AT_name("INTx10")
    1129                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_INTx10")
    1130                      .dwattr $C$DW$106, DW_AT_bit_offset(0x06)
    1131                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1132                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1133                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1134              
    1135              $C$DW$107       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1137                      .dwattr $C$DW$107, DW_AT_name("INTx11")
    1138                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_INTx11")
    1139                      .dwattr $C$DW$107, DW_AT_bit_offset(0x05)
    1140                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1141                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1143              
    1144              $C$DW$108       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1146                      .dwattr $C$DW$108, DW_AT_name("INTx12")
    1147                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_INTx12")
    1148                      .dwattr $C$DW$108, DW_AT_bit_offset(0x04)
    1149                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1150                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   22

    1151                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1152              
    1153              $C$DW$109       .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1155                      .dwattr $C$DW$109, DW_AT_name("INTx13")
    1156                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_INTx13")
    1157                      .dwattr $C$DW$109, DW_AT_bit_offset(0x03)
    1158                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1159                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1160                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1161              
    1162              $C$DW$110       .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1164                      .dwattr $C$DW$110, DW_AT_name("INTx14")
    1165                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_INTx14")
    1166                      .dwattr $C$DW$110, DW_AT_bit_offset(0x02)
    1167                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1168                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1170              
    1171              $C$DW$111       .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$111, DW_AT_name("INTx15")
    1174                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_INTx15")
    1175                      .dwattr $C$DW$111, DW_AT_bit_offset(0x01)
    1176                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1177                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1179              
    1180              $C$DW$112       .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1182                      .dwattr $C$DW$112, DW_AT_name("INTx16")
    1183                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_INTx16")
    1184                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    1185                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1186                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1188              
    1189                      .dwendtag $C$DW$T$32
    1190              
    1191              
    1192              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1193                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER2_REG")
    1194                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1195              $C$DW$113       .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1197                      .dwattr $C$DW$113, DW_AT_name("all")
    1198                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
    1199                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1200                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1201              
    1202              $C$DW$114       .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$32)
    1204                      .dwattr $C$DW$114, DW_AT_name("bit")
    1205                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   23

    1206                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1208              
    1209                      .dwendtag $C$DW$T$33
    1210              
    1211              
    1212              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1213                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER3_BITS")
    1214                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1215              $C$DW$115       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1217                      .dwattr $C$DW$115, DW_AT_name("INTx1")
    1218                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_INTx1")
    1219                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0f)
    1220                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1221                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1223              
    1224              $C$DW$116       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1226                      .dwattr $C$DW$116, DW_AT_name("INTx2")
    1227                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_INTx2")
    1228                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0e)
    1229                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1230                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1231                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1232              
    1233              $C$DW$117       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1235                      .dwattr $C$DW$117, DW_AT_name("INTx3")
    1236                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_INTx3")
    1237                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0d)
    1238                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1239                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1240                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1241              
    1242              $C$DW$118       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$118, DW_AT_name("INTx4")
    1245                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_INTx4")
    1246                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0c)
    1247                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1248                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1250              
    1251              $C$DW$119       .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1253                      .dwattr $C$DW$119, DW_AT_name("INTx5")
    1254                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_INTx5")
    1255                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0b)
    1256                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1257                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1258                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1259              
    1260              $C$DW$120       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   24

    1261                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1262                      .dwattr $C$DW$120, DW_AT_name("INTx6")
    1263                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_INTx6")
    1264                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0a)
    1265                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1266                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1267                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1268              
    1269              $C$DW$121       .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1271                      .dwattr $C$DW$121, DW_AT_name("INTx7")
    1272                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_INTx7")
    1273                      .dwattr $C$DW$121, DW_AT_bit_offset(0x09)
    1274                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1275                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1277              
    1278              $C$DW$122       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1280                      .dwattr $C$DW$122, DW_AT_name("INTx8")
    1281                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_INTx8")
    1282                      .dwattr $C$DW$122, DW_AT_bit_offset(0x08)
    1283                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1284                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1286              
    1287              $C$DW$123       .dwtag  DW_TAG_member
    1288                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1289                      .dwattr $C$DW$123, DW_AT_name("INTx9")
    1290                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_INTx9")
    1291                      .dwattr $C$DW$123, DW_AT_bit_offset(0x07)
    1292                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1293                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1295              
    1296              $C$DW$124       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1298                      .dwattr $C$DW$124, DW_AT_name("INTx10")
    1299                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_INTx10")
    1300                      .dwattr $C$DW$124, DW_AT_bit_offset(0x06)
    1301                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1302                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1303                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1304              
    1305              $C$DW$125       .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$125, DW_AT_name("INTx11")
    1308                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_INTx11")
    1309                      .dwattr $C$DW$125, DW_AT_bit_offset(0x05)
    1310                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1311                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1313              
    1314              $C$DW$126       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   25

    1316                      .dwattr $C$DW$126, DW_AT_name("INTx12")
    1317                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_INTx12")
    1318                      .dwattr $C$DW$126, DW_AT_bit_offset(0x04)
    1319                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1320                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1321                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1322              
    1323              $C$DW$127       .dwtag  DW_TAG_member
    1324                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1325                      .dwattr $C$DW$127, DW_AT_name("INTx13")
    1326                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_INTx13")
    1327                      .dwattr $C$DW$127, DW_AT_bit_offset(0x03)
    1328                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1329                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1331              
    1332              $C$DW$128       .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1334                      .dwattr $C$DW$128, DW_AT_name("INTx14")
    1335                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_INTx14")
    1336                      .dwattr $C$DW$128, DW_AT_bit_offset(0x02)
    1337                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1338                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1340              
    1341              $C$DW$129       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$129, DW_AT_name("INTx15")
    1344                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_INTx15")
    1345                      .dwattr $C$DW$129, DW_AT_bit_offset(0x01)
    1346                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1347                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1349              
    1350              $C$DW$130       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1352                      .dwattr $C$DW$130, DW_AT_name("INTx16")
    1353                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_INTx16")
    1354                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    1355                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1356                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1358              
    1359                      .dwendtag $C$DW$T$34
    1360              
    1361              
    1362              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1363                      .dwattr $C$DW$T$35, DW_AT_name("PIEIER3_REG")
    1364                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1365              $C$DW$131       .dwtag  DW_TAG_member
    1366                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1367                      .dwattr $C$DW$131, DW_AT_name("all")
    1368                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    1369                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   26

    1371              
    1372              $C$DW$132       .dwtag  DW_TAG_member
    1373                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$34)
    1374                      .dwattr $C$DW$132, DW_AT_name("bit")
    1375                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    1376                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1377                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1378              
    1379                      .dwendtag $C$DW$T$35
    1380              
    1381              
    1382              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1383                      .dwattr $C$DW$T$36, DW_AT_name("PIEIER4_BITS")
    1384                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1385              $C$DW$133       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$133, DW_AT_name("INTx1")
    1388                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_INTx1")
    1389                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0f)
    1390                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1391                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1393              
    1394              $C$DW$134       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1396                      .dwattr $C$DW$134, DW_AT_name("INTx2")
    1397                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_INTx2")
    1398                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0e)
    1399                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1400                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1401                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1402              
    1403              $C$DW$135       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1405                      .dwattr $C$DW$135, DW_AT_name("INTx3")
    1406                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_INTx3")
    1407                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0d)
    1408                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1409                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1411              
    1412              $C$DW$136       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1414                      .dwattr $C$DW$136, DW_AT_name("INTx4")
    1415                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_INTx4")
    1416                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0c)
    1417                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1418                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1420              
    1421              $C$DW$137       .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1423                      .dwattr $C$DW$137, DW_AT_name("INTx5")
    1424                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_INTx5")
    1425                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0b)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   27

    1426                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1427                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1429              
    1430              $C$DW$138       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1432                      .dwattr $C$DW$138, DW_AT_name("INTx6")
    1433                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_INTx6")
    1434                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0a)
    1435                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1436                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1437                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1438              
    1439              $C$DW$139       .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1441                      .dwattr $C$DW$139, DW_AT_name("INTx7")
    1442                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_INTx7")
    1443                      .dwattr $C$DW$139, DW_AT_bit_offset(0x09)
    1444                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1445                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1446                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1447              
    1448              $C$DW$140       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1450                      .dwattr $C$DW$140, DW_AT_name("INTx8")
    1451                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_INTx8")
    1452                      .dwattr $C$DW$140, DW_AT_bit_offset(0x08)
    1453                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1454                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1456              
    1457              $C$DW$141       .dwtag  DW_TAG_member
    1458                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1459                      .dwattr $C$DW$141, DW_AT_name("INTx9")
    1460                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_INTx9")
    1461                      .dwattr $C$DW$141, DW_AT_bit_offset(0x07)
    1462                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1463                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1464                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1465              
    1466              $C$DW$142       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1468                      .dwattr $C$DW$142, DW_AT_name("INTx10")
    1469                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_INTx10")
