TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:48 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("InputXbarRegs")

    1567              $C$DW$77        .dwtag  DW_TAG_variable
    1568                      .dwattr $C$DW$77, DW_AT_name("pin_count")
    1569                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_pin_count")
    1570                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$6)
    1571                      .dwattr $C$DW$77, DW_AT_location[DW_OP_reg0]
    1572              
    1573                      .dwcfi  cfa_offset, -2
    1574                      .dwcfi  save_reg_to_mem, 26, 0
    1575 00000208 761F!         MOVW      DP,#_DevCfgRegs+8     ; [CPU_ARAU] 
         00000209 0000 
    1576 0000020a 2901          CLRC      SXM                   ; [CPU_ALU] 
    1577                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_Gpio.c",li
    1578 0000020b 0608!         MOVL      ACC,@$BLOCKED(_DevCfgRegs)+8 ; [CPU_ALU] |415| 
    1579 0000020c FF47          SFR       ACC,8                 ; [CPU_ALU] |415| 
    1580 0000020d 9007          ANDB      AL,#0x07              ; [CPU_ALU] |415| 
    1581 0000020e 5205          CMPB      AL,#5                 ; [CPU_ALU] |415| 
    1582 0000020f 6106          B         $C$L23,EQ             ; [CPU_ALU] |415| 
    1583                      ; branchcc occurs ; [] |415| 
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   31

    1584                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_Gpio.c",li
    1585 00000210 5206          CMPB      AL,#6                 ; [CPU_ALU] |426| 
    1586 00000211 6006          B         $C$L24,NEQ            ; [CPU_ALU] |426| 
    1587                      ; branchcc occurs ; [] |426| 
    1588                      .dwcfi  remember_state
    1589                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_Gpio.c",li
    1590              $C$DW$78        .dwtag  DW_TAG_TI_branch
    1591                      .dwattr $C$DW$78, DW_AT_low_pc(0x00)
    1592                      .dwattr $C$DW$78, DW_AT_name("_GPIO_EnableUnbondedIOPullupsFor176Pin")
    1593                      .dwattr $C$DW$78, DW_AT_TI_call
    1594              
    1595 00000212 7640'         LCR       #_GPIO_EnableUnbondedIOPullupsFor176Pin ; [CPU_ALU] |428| 
         00000213 01CA 
    1596                      ; call occurs [#_GPIO_EnableUnbondedIOPullupsFor176Pin] ; [] |428| 
    1597              $C$DW$79        .dwtag  DW_TAG_TI_branch
    1598                      .dwattr $C$DW$79, DW_AT_low_pc(0x00)
    1599                      .dwattr $C$DW$79, DW_AT_TI_return
    1600              
    1601 00000214 0006          LRETR     ; [CPU_ALU] 
    1602                      ; return occurs ; [] 
    1603                      .dwcfi  restore_state
    1604 00000215       $C$L23:    
    1605                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_Gpio.c",li
    1606              $C$DW$80        .dwtag  DW_TAG_TI_branch
    1607                      .dwattr $C$DW$80, DW_AT_low_pc(0x00)
    1608                      .dwattr $C$DW$80, DW_AT_name("_GPIO_EnableUnbondedIOPullupsFor100Pin")
    1609                      .dwattr $C$DW$80, DW_AT_TI_call
    1610              
    1611 00000215 7640'         LCR       #_GPIO_EnableUnbondedIOPullupsFor100Pin ; [CPU_ALU] |424| 
         00000216 01E3 
    1612                      ; call occurs [#_GPIO_EnableUnbondedIOPullupsFor100Pin] ; [] |424| 
    1613              $C$L24:    
    1614              $C$DW$81        .dwtag  DW_TAG_TI_branch
    1615                      .dwattr $C$DW$81, DW_AT_low_pc(0x00)
    1616                      .dwattr $C$DW$81, DW_AT_TI_return
    1617              
    1618 00000217 0006          LRETR     ; [CPU_ALU] 
    1619                      ; return occurs ; [] 
    1620                      .dwattr $C$DW$76, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/so
    1621                      .dwattr $C$DW$76, DW_AT_TI_end_line(0x1b2)
    1622                      .dwattr $C$DW$76, DW_AT_TI_end_column(0x05)
    1623                      .dwendentry
    1624                      .dwendtag $C$DW$76
    1625              
    1626              ;**************************************************************
    1627              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1628              ;**************************************************************
    1629                      .global _InputXbarRegs
    1630                      .global _GpioDataRegs
    1631                      .global _DevCfgRegs
    1632                      .global _GpioCtrlRegs
    1633              
    1634              ;***************************************************************
    1635              ;* TYPE INFORMATION                                            *
    1636              ;***************************************************************
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   32

    1637              
    1638              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1639                      .dwattr $C$DW$T$20, DW_AT_name("CPU2RESCTL_BITS")
    1640                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1641              $C$DW$82        .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1643                      .dwattr $C$DW$82, DW_AT_name("RESET")
    1644                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_RESET")
    1645                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0f)
    1646                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1647                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1649              
    1650              $C$DW$83        .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1652                      .dwattr $C$DW$83, DW_AT_name("rsvd1")
    1653                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd1")
    1654                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00)
    1655                      .dwattr $C$DW$83, DW_AT_bit_size(0x0f)
    1656                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1657                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1658              
    1659              $C$DW$84        .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1661                      .dwattr $C$DW$84, DW_AT_name("KEY")
    1662                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_KEY")
    1663                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00)
    1664                      .dwattr $C$DW$84, DW_AT_bit_size(0x10)
    1665                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1666                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1667              
    1668                      .dwendtag $C$DW$T$20
    1669              
    1670              
    1671              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1672                      .dwattr $C$DW$T$22, DW_AT_name("CPU2RESCTL_REG")
    1673                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1674              $C$DW$85        .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
    1676                      .dwattr $C$DW$85, DW_AT_name("all")
    1677                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_all")
    1678                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1680              
    1681              $C$DW$86        .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
    1683                      .dwattr $C$DW$86, DW_AT_name("bit")
    1684                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_bit")
    1685                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1686                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1687              
    1688                      .dwendtag $C$DW$T$22
    1689              
    1690              
    1691              $C$DW$T$23      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   33

    1692                      .dwattr $C$DW$T$23, DW_AT_name("CPUSEL0_BITS")
    1693                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1694              $C$DW$87        .dwtag  DW_TAG_member
    1695                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1696                      .dwattr $C$DW$87, DW_AT_name("EPWM1")
    1697                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_EPWM1")
    1698                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0f)
    1699                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1700                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1701                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1702              
    1703              $C$DW$88        .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1705                      .dwattr $C$DW$88, DW_AT_name("EPWM2")
    1706                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_EPWM2")
    1707                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0e)
    1708                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1709                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1710                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1711              
    1712              $C$DW$89        .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1714                      .dwattr $C$DW$89, DW_AT_name("EPWM3")
    1715                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_EPWM3")
    1716                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0d)
    1717                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1718                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1719                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1720              
    1721              $C$DW$90        .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1723                      .dwattr $C$DW$90, DW_AT_name("EPWM4")
    1724                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_EPWM4")
    1725                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0c)
    1726                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1727                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1729              
    1730              $C$DW$91        .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1732                      .dwattr $C$DW$91, DW_AT_name("EPWM5")
    1733                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_EPWM5")
    1734                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0b)
    1735                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1736                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1738              
    1739              $C$DW$92        .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1741                      .dwattr $C$DW$92, DW_AT_name("EPWM6")
    1742                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_EPWM6")
    1743                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0a)
    1744                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1745                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1746                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   34

    1747              
    1748              $C$DW$93        .dwtag  DW_TAG_member
    1749                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1750                      .dwattr $C$DW$93, DW_AT_name("EPWM7")
    1751                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_EPWM7")
    1752                      .dwattr $C$DW$93, DW_AT_bit_offset(0x09)
    1753                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1754                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1755                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1756              
    1757              $C$DW$94        .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1759                      .dwattr $C$DW$94, DW_AT_name("EPWM8")
    1760                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_EPWM8")
    1761                      .dwattr $C$DW$94, DW_AT_bit_offset(0x08)
    1762                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1763                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1764                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1765              
    1766              $C$DW$95        .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1768                      .dwattr $C$DW$95, DW_AT_name("EPWM9")
    1769                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_EPWM9")
    1770                      .dwattr $C$DW$95, DW_AT_bit_offset(0x07)
    1771                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1772                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1773                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1774              
    1775              $C$DW$96        .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1777                      .dwattr $C$DW$96, DW_AT_name("EPWM10")
    1778                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_EPWM10")
    1779                      .dwattr $C$DW$96, DW_AT_bit_offset(0x06)
    1780                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1781                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1782                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1783              
    1784              $C$DW$97        .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1786                      .dwattr $C$DW$97, DW_AT_name("EPWM11")
    1787                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_EPWM11")
    1788                      .dwattr $C$DW$97, DW_AT_bit_offset(0x05)
    1789                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1790                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1791                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1792              
    1793              $C$DW$98        .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1795                      .dwattr $C$DW$98, DW_AT_name("EPWM12")
    1796                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_EPWM12")
    1797                      .dwattr $C$DW$98, DW_AT_bit_offset(0x04)
    1798                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1799                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1801              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   35

    1802              $C$DW$99        .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1804                      .dwattr $C$DW$99, DW_AT_name("rsvd1")
    1805                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd1")
    1806                      .dwattr $C$DW$99, DW_AT_bit_offset(0x03)
    1807                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1808                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1809                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1810              
    1811              $C$DW$100       .dwtag  DW_TAG_member
    1812                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1813                      .dwattr $C$DW$100, DW_AT_name("rsvd2")
    1814                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd2")
    1815                      .dwattr $C$DW$100, DW_AT_bit_offset(0x02)
    1816                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1817                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1818                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1819              
    1820              $C$DW$101       .dwtag  DW_TAG_member
    1821                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1822                      .dwattr $C$DW$101, DW_AT_name("rsvd3")
    1823                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd3")
    1824                      .dwattr $C$DW$101, DW_AT_bit_offset(0x01)
    1825                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1826                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1827                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1828              
    1829              $C$DW$102       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1831                      .dwattr $C$DW$102, DW_AT_name("rsvd4")
    1832                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd4")
    1833                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    1834                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1835                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1836                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1837              
    1838              $C$DW$103       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1840                      .dwattr $C$DW$103, DW_AT_name("rsvd5")
    1841                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd5")
    1842                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1843                      .dwattr $C$DW$103, DW_AT_bit_size(0x10)
    1844                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1845                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1846              
    1847                      .dwendtag $C$DW$T$23
    1848              
    1849              
    1850              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1851                      .dwattr $C$DW$T$24, DW_AT_name("CPUSEL0_REG")
    1852                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1853              $C$DW$104       .dwtag  DW_TAG_member
    1854                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$21)
    1855                      .dwattr $C$DW$104, DW_AT_name("all")
    1856                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   36

    1857                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1858                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1859              
    1860              $C$DW$105       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$23)
    1862                      .dwattr $C$DW$105, DW_AT_name("bit")
    1863                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
    1864                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1865                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1866              
    1867                      .dwendtag $C$DW$T$24
    1868              
    1869              
    1870              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1871                      .dwattr $C$DW$T$25, DW_AT_name("CPUSEL11_BITS")
    1872                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1873              $C$DW$106       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1875                      .dwattr $C$DW$106, DW_AT_name("ADC_A")
    1876                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_ADC_A")
    1877                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0f)
    1878                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1879                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1880                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1881              
    1882              $C$DW$107       .dwtag  DW_TAG_member
    1883                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1884                      .dwattr $C$DW$107, DW_AT_name("ADC_B")
    1885                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_ADC_B")
    1886                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0e)
    1887                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1888                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1889                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1890              
    1891              $C$DW$108       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1893                      .dwattr $C$DW$108, DW_AT_name("ADC_C")
    1894                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_ADC_C")
    1895                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0d)
    1896                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1897                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1899              
    1900              $C$DW$109       .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1902                      .dwattr $C$DW$109, DW_AT_name("ADC_D")
    1903                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_ADC_D")
    1904                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0c)
    1905                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1906                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1907                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1908              
    1909              $C$DW$110       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1911                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   37

    1912                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    1913                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1914                      .dwattr $C$DW$110, DW_AT_bit_size(0x0c)
    1915                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1916                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1917              
    1918              $C$DW$111       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1920                      .dwattr $C$DW$111, DW_AT_name("rsvd2")
    1921                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd2")
    1922                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1923                      .dwattr $C$DW$111, DW_AT_bit_size(0x10)
    1924                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1925                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1926              
    1927                      .dwendtag $C$DW$T$25
    1928              
    1929              
    1930              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1931                      .dwattr $C$DW$T$26, DW_AT_name("CPUSEL11_REG")
    1932                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1933              $C$DW$112       .dwtag  DW_TAG_member
    1934                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    1935                      .dwattr $C$DW$112, DW_AT_name("all")
    1936                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_all")
    1937                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1938                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1939              
    1940              $C$DW$113       .dwtag  DW_TAG_member
    1941                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$25)
    1942                      .dwattr $C$DW$113, DW_AT_name("bit")
    1943                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_bit")
    1944                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1946              
    1947                      .dwendtag $C$DW$T$26
    1948              
    1949              
    1950              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1951                      .dwattr $C$DW$T$27, DW_AT_name("CPUSEL12_BITS")
    1952                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1953              $C$DW$114       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1955                      .dwattr $C$DW$114, DW_AT_name("CMPSS1")
    1956                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_CMPSS1")
    1957                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0f)
    1958                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1959                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1960                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1961              
    1962              $C$DW$115       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1964                      .dwattr $C$DW$115, DW_AT_name("CMPSS2")
    1965                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_CMPSS2")
    1966                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   38

    1967                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1968                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1969                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1970              
    1971              $C$DW$116       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1973                      .dwattr $C$DW$116, DW_AT_name("CMPSS3")
    1974                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_CMPSS3")
    1975                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0d)
    1976                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1977                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1978                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1979              
    1980              $C$DW$117       .dwtag  DW_TAG_member
    1981                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1982                      .dwattr $C$DW$117, DW_AT_name("CMPSS4")
    1983                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_CMPSS4")
    1984                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0c)
    1985                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1986                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1987                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1988              
    1989              $C$DW$118       .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1991                      .dwattr $C$DW$118, DW_AT_name("CMPSS5")
    1992                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_CMPSS5")
    1993                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0b)
    1994                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1995                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1996                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1997              
    1998              $C$DW$119       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2000                      .dwattr $C$DW$119, DW_AT_name("CMPSS6")
    2001                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_CMPSS6")
    2002                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0a)
    2003                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    2004                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2005                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2006              
    2007              $C$DW$120       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2009                      .dwattr $C$DW$120, DW_AT_name("CMPSS7")
    2010                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_CMPSS7")
    2011                      .dwattr $C$DW$120, DW_AT_bit_offset(0x09)
    2012                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    2013                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2014                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2015              
    2016              $C$DW$121       .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2018                      .dwattr $C$DW$121, DW_AT_name("CMPSS8")
    2019                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_CMPSS8")
    2020                      .dwattr $C$DW$121, DW_AT_bit_offset(0x08)
    2021                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   39

    2022                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2023                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2024              
    2025              $C$DW$122       .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2027                      .dwattr $C$DW$122, DW_AT_name("rsvd1")
    2028                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd1")
    2029                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00)
    2030                      .dwattr $C$DW$122, DW_AT_bit_size(0x08)
    2031                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2032                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2033              
    2034              $C$DW$123       .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2036                      .dwattr $C$DW$123, DW_AT_name("rsvd2")
    2037                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd2")
    2038                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    2039                      .dwattr $C$DW$123, DW_AT_bit_size(0x10)
    2040                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2041                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2042              
    2043                      .dwendtag $C$DW$T$27
    2044              
    2045              
    2046              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2047                      .dwattr $C$DW$T$28, DW_AT_name("CPUSEL12_REG")
    2048                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2049              $C$DW$124       .dwtag  DW_TAG_member
    2050                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
    2051                      .dwattr $C$DW$124, DW_AT_name("all")
    2052                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_all")
    2053                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2054                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2055              
    2056              $C$DW$125       .dwtag  DW_TAG_member
    2057                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$27)
    2058                      .dwattr $C$DW$125, DW_AT_name("bit")
    2059                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_bit")
    2060                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2061                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2062              
    2063                      .dwendtag $C$DW$T$28
    2064              
    2065              
    2066              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2067                      .dwattr $C$DW$T$29, DW_AT_name("CPUSEL14_BITS")
    2068                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2069              $C$DW$126       .dwtag  DW_TAG_member
    2070                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2071                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
    2072                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
    2073                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0f)
    2074                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    2075                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2076                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   40

    2077              
    2078              $C$DW$127       .dwtag  DW_TAG_member
    2079                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2080                      .dwattr $C$DW$127, DW_AT_name("rsvd2")
    2081                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd2")
    2082                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0e)
    2083                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    2084                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2085                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2086              
    2087              $C$DW$128       .dwtag  DW_TAG_member
    2088                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2089                      .dwattr $C$DW$128, DW_AT_name("rsvd3")
    2090                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd3")
    2091                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0d)
    2092                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2093                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2094                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2095              
    2096              $C$DW$129       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2098                      .dwattr $C$DW$129, DW_AT_name("rsvd4")
    2099                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd4")
    2100                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0c)
    2101                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    2102                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2103                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2104              
    2105              $C$DW$130       .dwtag  DW_TAG_member
    2106                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2107                      .dwattr $C$DW$130, DW_AT_name("rsvd5")
    2108                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd5")
    2109                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    2110                      .dwattr $C$DW$130, DW_AT_bit_size(0x0c)
    2111                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2112                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2113              
    2114              $C$DW$131       .dwtag  DW_TAG_member
    2115                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2116                      .dwattr $C$DW$131, DW_AT_name("DAC_A")
    2117                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_DAC_A")
    2118                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0f)
    2119                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2120                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2121                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2122              
    2123              $C$DW$132       .dwtag  DW_TAG_member
    2124                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2125                      .dwattr $C$DW$132, DW_AT_name("DAC_B")
    2126                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_DAC_B")
    2127                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0e)
    2128                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2129                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2130                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2131              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   41

    2132              $C$DW$133       .dwtag  DW_TAG_member
    2133                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2134                      .dwattr $C$DW$133, DW_AT_name("DAC_C")
    2135                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_DAC_C")
    2136                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0d)
    2137                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2138                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2139                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2140              
    2141              $C$DW$134       .dwtag  DW_TAG_member
    2142                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2143                      .dwattr $C$DW$134, DW_AT_name("rsvd6")
    2144                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd6")
    2145                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0c)
    2146                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    2147                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2148                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2149              
    2150              $C$DW$135       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2152                      .dwattr $C$DW$135, DW_AT_name("rsvd7")
    2153                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd7")
    2154                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    2155                      .dwattr $C$DW$135, DW_AT_bit_size(0x0c)
    2156                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2157                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2158              
    2159                      .dwendtag $C$DW$T$29
    2160              
    2161              
    2162              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2163                      .dwattr $C$DW$T$30, DW_AT_name("CPUSEL14_REG")
    2164                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2165              $C$DW$136       .dwtag  DW_TAG_member
    2166                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    2167                      .dwattr $C$DW$136, DW_AT_name("all")
    2168                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_all")
    2169                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2170                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2171              
    2172              $C$DW$137       .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$29)
    2174                      .dwattr $C$DW$137, DW_AT_name("bit")
    2175                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_bit")
    2176                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2177                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2178              
    2179                      .dwendtag $C$DW$T$30
    2180              
    2181              
    2182              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2183                      .dwattr $C$DW$T$31, DW_AT_name("CPUSEL1_BITS")
    2184                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2185              $C$DW$138       .dwtag  DW_TAG_member
    2186                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   42

    2187                      .dwattr $C$DW$138, DW_AT_name("ECAP1")
    2188                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ECAP1")
    2189                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0f)
    2190                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2191                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2192                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2193              
    2194              $C$DW$139       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2196                      .dwattr $C$DW$139, DW_AT_name("ECAP2")
    2197                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ECAP2")
    2198                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0e)
    2199                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2200                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2201                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2202              
    2203              $C$DW$140       .dwtag  DW_TAG_member
    2204                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2205                      .dwattr $C$DW$140, DW_AT_name("ECAP3")
    2206                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ECAP3")
    2207                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0d)
    2208                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2209                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2210                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2211              
    2212              $C$DW$141       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2214                      .dwattr $C$DW$141, DW_AT_name("ECAP4")
    2215                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ECAP4")
    2216                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0c)
    2217                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2218                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2219                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2220              
    2221              $C$DW$142       .dwtag  DW_TAG_member
    2222                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2223                      .dwattr $C$DW$142, DW_AT_name("ECAP5")
    2224                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ECAP5")
    2225                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0b)
    2226                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2227                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2228                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2229              
    2230              $C$DW$143       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2232                      .dwattr $C$DW$143, DW_AT_name("ECAP6")
    2233                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ECAP6")
    2234                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0a)
    2235                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2236                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2237                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2238              
    2239              $C$DW$144       .dwtag  DW_TAG_member
    2240                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2241                      .dwattr $C$DW$144, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   43

    2242                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd1")
    2243                      .dwattr $C$DW$144, DW_AT_bit_offset(0x09)
    2244                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2245                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2246                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2247              
    2248              $C$DW$145       .dwtag  DW_TAG_member
    2249                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2250                      .dwattr $C$DW$145, DW_AT_name("rsvd2")
    2251                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd2")
    2252                      .dwattr $C$DW$145, DW_AT_bit_offset(0x08)
    2253                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2254                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2255                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2256              
    2257              $C$DW$146       .dwtag  DW_TAG_member
    2258                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2259                      .dwattr $C$DW$146, DW_AT_name("rsvd3")
    2260                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd3")
    2261                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    2262                      .dwattr $C$DW$146, DW_AT_bit_size(0x08)
    2263                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2264                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2265              
    2266              $C$DW$147       .dwtag  DW_TAG_member
    2267                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2268                      .dwattr $C$DW$147, DW_AT_name("rsvd4")
    2269                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd4")
    2270                      .dwattr $C$DW$147, DW_AT_bit_offset(0x00)
    2271                      .dwattr $C$DW$147, DW_AT_bit_size(0x10)
    2272                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2273                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2274              
    2275                      .dwendtag $C$DW$T$31
    2276              
    2277              
    2278              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2279                      .dwattr $C$DW$T$32, DW_AT_name("CPUSEL1_REG")
    2280                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2281              $C$DW$148       .dwtag  DW_TAG_member
    2282                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$21)
    2283                      .dwattr $C$DW$148, DW_AT_name("all")
    2284                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_all")
    2285                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2286                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2287              
    2288              $C$DW$149       .dwtag  DW_TAG_member
    2289                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$31)
    2290                      .dwattr $C$DW$149, DW_AT_name("bit")
    2291                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_bit")
    2292                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2293                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2294              
    2295                      .dwendtag $C$DW$T$32
    2296              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   44

    2297              
    2298              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2299                      .dwattr $C$DW$T$33, DW_AT_name("CPUSEL2_BITS")
    2300                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2301              $C$DW$150       .dwtag  DW_TAG_member
    2302                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2303                      .dwattr $C$DW$150, DW_AT_name("EQEP1")
    2304                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_EQEP1")
    2305                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0f)
    2306                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2307                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2308                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2309              
    2310              $C$DW$151       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2312                      .dwattr $C$DW$151, DW_AT_name("EQEP2")
    2313                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_EQEP2")
    2314                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0e)
    2315                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2316                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2317                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2318              
    2319              $C$DW$152       .dwtag  DW_TAG_member
    2320                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2321                      .dwattr $C$DW$152, DW_AT_name("EQEP3")
    2322                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_EQEP3")
    2323                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0d)
    2324                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2325                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2326                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2327              
    2328              $C$DW$153       .dwtag  DW_TAG_member
    2329                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2330                      .dwattr $C$DW$153, DW_AT_name("rsvd1")
    2331                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd1")
    2332                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0c)
    2333                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2334                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2335                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2336              
    2337              $C$DW$154       .dwtag  DW_TAG_member
    2338                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2339                      .dwattr $C$DW$154, DW_AT_name("rsvd2")
    2340                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd2")
    2341                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    2342                      .dwattr $C$DW$154, DW_AT_bit_size(0x0c)
    2343                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2344                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2345              
    2346              $C$DW$155       .dwtag  DW_TAG_member
    2347                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2348                      .dwattr $C$DW$155, DW_AT_name("rsvd3")
    2349                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd3")
    2350                      .dwattr $C$DW$155, DW_AT_bit_offset(0x00)
    2351                      .dwattr $C$DW$155, DW_AT_bit_size(0x10)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   45

    2352                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2353                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2354              
    2355                      .dwendtag $C$DW$T$33
    2356              
    2357              
    2358              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2359                      .dwattr $C$DW$T$34, DW_AT_name("CPUSEL2_REG")
    2360                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2361              $C$DW$156       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$21)
    2363                      .dwattr $C$DW$156, DW_AT_name("all")
    2364                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_all")
    2365                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2366                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2367              
    2368              $C$DW$157       .dwtag  DW_TAG_member
    2369                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$33)
    2370                      .dwattr $C$DW$157, DW_AT_name("bit")
    2371                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_bit")
    2372                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2373                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2374              
    2375                      .dwendtag $C$DW$T$34
    2376              
    2377              
    2378              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2379                      .dwattr $C$DW$T$35, DW_AT_name("CPUSEL4_BITS")
    2380                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2381              $C$DW$158       .dwtag  DW_TAG_member
    2382                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2383                      .dwattr $C$DW$158, DW_AT_name("SD1")
    2384                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_SD1")
    2385                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0f)
    2386                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2387                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2388                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2389              
    2390              $C$DW$159       .dwtag  DW_TAG_member
    2391                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2392                      .dwattr $C$DW$159, DW_AT_name("SD2")
    2393                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_SD2")
    2394                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0e)
    2395                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2396                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2397                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2398              
    2399              $C$DW$160       .dwtag  DW_TAG_member
    2400                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2401                      .dwattr $C$DW$160, DW_AT_name("rsvd1")
    2402                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd1")
    2403                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0d)
    2404                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2405                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2406                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   46

    2407              
    2408              $C$DW$161       .dwtag  DW_TAG_member
    2409                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2410                      .dwattr $C$DW$161, DW_AT_name("rsvd2")
    2411                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rsvd2")
    2412                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0c)
    2413                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2414                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2415                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2416              
    2417              $C$DW$162       .dwtag  DW_TAG_member
    2418                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2419                      .dwattr $C$DW$162, DW_AT_name("rsvd3")
    2420                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd3")
    2421                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0b)
    2422                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2423                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2424                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2425              
    2426              $C$DW$163       .dwtag  DW_TAG_member
    2427                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2428                      .dwattr $C$DW$163, DW_AT_name("rsvd4")
    2429                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd4")
    2430                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0a)
    2431                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2432                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2433                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2434              
    2435              $C$DW$164       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2437                      .dwattr $C$DW$164, DW_AT_name("rsvd5")
    2438                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd5")
    2439                      .dwattr $C$DW$164, DW_AT_bit_offset(0x09)
    2440                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2441                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2442                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2443              
    2444              $C$DW$165       .dwtag  DW_TAG_member
    2445                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2446                      .dwattr $C$DW$165, DW_AT_name("rsvd6")
    2447                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd6")
    2448                      .dwattr $C$DW$165, DW_AT_bit_offset(0x08)
    2449                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2450                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2451                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2452              
    2453              $C$DW$166       .dwtag  DW_TAG_member
    2454                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2455                      .dwattr $C$DW$166, DW_AT_name("rsvd7")
    2456                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd7")
    2457                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    2458                      .dwattr $C$DW$166, DW_AT_bit_size(0x08)
    2459                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2460                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2461              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   47

    2462              $C$DW$167       .dwtag  DW_TAG_member
    2463                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2464                      .dwattr $C$DW$167, DW_AT_name("rsvd8")
    2465                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd8")
    2466                      .dwattr $C$DW$167, DW_AT_bit_offset(0x00)
    2467                      .dwattr $C$DW$167, DW_AT_bit_size(0x10)
    2468                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2469                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2470              
    2471                      .dwendtag $C$DW$T$35
    2472              
    2473              
    2474              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2475                      .dwattr $C$DW$T$36, DW_AT_name("CPUSEL4_REG")
    2476                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2477              $C$DW$168       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$21)
    2479                      .dwattr $C$DW$168, DW_AT_name("all")
    2480                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_all")
    2481                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2482                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2483              
    2484              $C$DW$169       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$35)
    2486                      .dwattr $C$DW$169, DW_AT_name("bit")
    2487                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_bit")
    2488                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2489                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2490              
    2491                      .dwendtag $C$DW$T$36
    2492              
    2493              
    2494              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2495                      .dwattr $C$DW$T$37, DW_AT_name("CPUSEL5_BITS")
    2496                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2497              $C$DW$170       .dwtag  DW_TAG_member
    2498                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2499                      .dwattr $C$DW$170, DW_AT_name("SCI_A")
    2500                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_SCI_A")
    2501                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0f)
    2502                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2503                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2504                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2505              
    2506              $C$DW$171       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2508                      .dwattr $C$DW$171, DW_AT_name("SCI_B")
    2509                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_SCI_B")
    2510                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0e)
    2511                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2512                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2513                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2514              
    2515              $C$DW$172       .dwtag  DW_TAG_member
    2516                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   48

    2517                      .dwattr $C$DW$172, DW_AT_name("SCI_C")
    2518                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_SCI_C")
    2519                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0d)
    2520                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2521                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2522                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2523              
    2524              $C$DW$173       .dwtag  DW_TAG_member
    2525                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2526                      .dwattr $C$DW$173, DW_AT_name("SCI_D")
    2527                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_SCI_D")
    2528                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0c)
    2529                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2530                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2531                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2532              
    2533              $C$DW$174       .dwtag  DW_TAG_member
    2534                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2535                      .dwattr $C$DW$174, DW_AT_name("rsvd1")
    2536                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd1")
    2537                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00)
    2538                      .dwattr $C$DW$174, DW_AT_bit_size(0x0c)
    2539                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2540                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2541              
    2542              $C$DW$175       .dwtag  DW_TAG_member
    2543                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2544                      .dwattr $C$DW$175, DW_AT_name("rsvd2")
    2545                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd2")
    2546                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    2547                      .dwattr $C$DW$175, DW_AT_bit_size(0x10)
    2548                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2549                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2550              
    2551                      .dwendtag $C$DW$T$37
    2552              
    2553              
    2554              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2555                      .dwattr $C$DW$T$38, DW_AT_name("CPUSEL5_REG")
    2556                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2557              $C$DW$176       .dwtag  DW_TAG_member
    2558                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$21)
    2559                      .dwattr $C$DW$176, DW_AT_name("all")
    2560                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_all")
    2561                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2562                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2563              
    2564              $C$DW$177       .dwtag  DW_TAG_member
    2565                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$37)
    2566                      .dwattr $C$DW$177, DW_AT_name("bit")
    2567                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_bit")
    2568                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2569                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2570              
    2571                      .dwendtag $C$DW$T$38
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   49

    2572              
    2573              
    2574              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2575                      .dwattr $C$DW$T$39, DW_AT_name("CPUSEL6_BITS")
    2576                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2577              $C$DW$178       .dwtag  DW_TAG_member
    2578                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2579                      .dwattr $C$DW$178, DW_AT_name("SPI_A")
    2580                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_SPI_A")
    2581                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0f)
    2582                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2583                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2584                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2585              
    2586              $C$DW$179       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2588                      .dwattr $C$DW$179, DW_AT_name("SPI_B")
    2589                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_SPI_B")
    2590                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0e)
    2591                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2592                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2593                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2594              
    2595              $C$DW$180       .dwtag  DW_TAG_member
    2596                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2597                      .dwattr $C$DW$180, DW_AT_name("SPI_C")
    2598                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_SPI_C")
    2599                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0d)
    2600                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2601                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2602                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2603              
    2604              $C$DW$181       .dwtag  DW_TAG_member
    2605                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2606                      .dwattr $C$DW$181, DW_AT_name("rsvd1")
    2607                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd1")
    2608                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0c)
    2609                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2610                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2611                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2612              
    2613              $C$DW$182       .dwtag  DW_TAG_member
    2614                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2615                      .dwattr $C$DW$182, DW_AT_name("rsvd2")
    2616                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd2")
    2617                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    2618                      .dwattr $C$DW$182, DW_AT_bit_size(0x0c)
    2619                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2620                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2621              
    2622              $C$DW$183       .dwtag  DW_TAG_member
    2623                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2624                      .dwattr $C$DW$183, DW_AT_name("rsvd3")
    2625                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd3")
    2626                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   50

    2627                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2628                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2629                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2630              
    2631              $C$DW$184       .dwtag  DW_TAG_member
    2632                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2633                      .dwattr $C$DW$184, DW_AT_name("rsvd4")
    2634                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rsvd4")
    2635                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0e)
    2636                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2637                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2638                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2639              
    2640              $C$DW$185       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2642                      .dwattr $C$DW$185, DW_AT_name("rsvd5")
    2643                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd5")
    2644                      .dwattr $C$DW$185, DW_AT_bit_offset(0x00)
    2645                      .dwattr $C$DW$185, DW_AT_bit_size(0x0e)
    2646                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2647                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2648              
    2649                      .dwendtag $C$DW$T$39
    2650              
    2651              
    2652              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2653                      .dwattr $C$DW$T$40, DW_AT_name("CPUSEL6_REG")
    2654                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2655              $C$DW$186       .dwtag  DW_TAG_member
    2656                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$21)
    2657                      .dwattr $C$DW$186, DW_AT_name("all")
    2658                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_all")
    2659                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2660                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2661              
    2662              $C$DW$187       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$39)
    2664                      .dwattr $C$DW$187, DW_AT_name("bit")
    2665                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_bit")
    2666                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2667                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2668              
    2669                      .dwendtag $C$DW$T$40
    2670              
    2671              
    2672              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2673                      .dwattr $C$DW$T$41, DW_AT_name("CPUSEL7_BITS")
    2674                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2675              $C$DW$188       .dwtag  DW_TAG_member
    2676                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2677                      .dwattr $C$DW$188, DW_AT_name("I2C_A")
    2678                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_I2C_A")
    2679                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0f)
    2680                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2681                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   51

    2682                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2683              
    2684              $C$DW$189       .dwtag  DW_TAG_member
    2685                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2686                      .dwattr $C$DW$189, DW_AT_name("I2C_B")
    2687                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_I2C_B")
    2688                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0e)
    2689                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2690                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2691                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2692              
    2693              $C$DW$190       .dwtag  DW_TAG_member
    2694                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2695                      .dwattr $C$DW$190, DW_AT_name("rsvd1")
    2696                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd1")
    2697                      .dwattr $C$DW$190, DW_AT_bit_offset(0x00)
    2698                      .dwattr $C$DW$190, DW_AT_bit_size(0x0e)
    2699                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2700                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2701              
    2702              $C$DW$191       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2704                      .dwattr $C$DW$191, DW_AT_name("rsvd2")
    2705                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_rsvd2")
    2706                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0f)
    2707                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2708                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2709                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2710              
    2711              $C$DW$192       .dwtag  DW_TAG_member
    2712                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2713                      .dwattr $C$DW$192, DW_AT_name("rsvd3")
    2714                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd3")
    2715                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0e)
    2716                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2717                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2718                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2719              
    2720              $C$DW$193       .dwtag  DW_TAG_member
    2721                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2722                      .dwattr $C$DW$193, DW_AT_name("rsvd4")
    2723                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd4")
    2724                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00)
    2725                      .dwattr $C$DW$193, DW_AT_bit_size(0x0e)
    2726                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2727                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2728              
    2729                      .dwendtag $C$DW$T$41
    2730              
    2731              
    2732              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2733                      .dwattr $C$DW$T$42, DW_AT_name("CPUSEL7_REG")
    2734                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2735              $C$DW$194       .dwtag  DW_TAG_member
    2736                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   52

    2737                      .dwattr $C$DW$194, DW_AT_name("all")
    2738                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_all")
    2739                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2740                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2741              
    2742              $C$DW$195       .dwtag  DW_TAG_member
    2743                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$41)
    2744                      .dwattr $C$DW$195, DW_AT_name("bit")
    2745                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_bit")
    2746                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2747                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2748              
    2749                      .dwendtag $C$DW$T$42
    2750              
    2751              
    2752              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2753                      .dwattr $C$DW$T$43, DW_AT_name("CPUSEL8_BITS")
    2754                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2755              $C$DW$196       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2757                      .dwattr $C$DW$196, DW_AT_name("CAN_A")
    2758                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_CAN_A")
    2759                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0f)
    2760                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2761                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2762                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2763              
    2764              $C$DW$197       .dwtag  DW_TAG_member
    2765                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2766                      .dwattr $C$DW$197, DW_AT_name("CAN_B")
    2767                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_CAN_B")
    2768                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0e)
    2769                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2770                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2771                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2772              
    2773              $C$DW$198       .dwtag  DW_TAG_member
    2774                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2775                      .dwattr $C$DW$198, DW_AT_name("rsvd1")
    2776                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_rsvd1")
    2777                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0d)
    2778                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2779                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2780                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2781              
    2782              $C$DW$199       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2784                      .dwattr $C$DW$199, DW_AT_name("rsvd2")
    2785                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_rsvd2")
    2786                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0c)
    2787                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2788                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2789                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2790              
    2791              $C$DW$200       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   53

    2792                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2793                      .dwattr $C$DW$200, DW_AT_name("rsvd3")
    2794                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rsvd3")
    2795                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00)
    2796                      .dwattr $C$DW$200, DW_AT_bit_size(0x0c)
    2797                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2798                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2799              
    2800              $C$DW$201       .dwtag  DW_TAG_member
    2801                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2802                      .dwattr $C$DW$201, DW_AT_name("rsvd4")
    2803                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd4")
    2804                      .dwattr $C$DW$201, DW_AT_bit_offset(0x00)
    2805                      .dwattr $C$DW$201, DW_AT_bit_size(0x10)
    2806                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2807                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2808              
    2809                      .dwendtag $C$DW$T$43
    2810              
    2811              
    2812              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2813                      .dwattr $C$DW$T$44, DW_AT_name("CPUSEL8_REG")
    2814                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2815              $C$DW$202       .dwtag  DW_TAG_member
    2816                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    2817                      .dwattr $C$DW$202, DW_AT_name("all")
    2818                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_all")
    2819                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2820                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2821              
    2822              $C$DW$203       .dwtag  DW_TAG_member
    2823                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$43)
    2824                      .dwattr $C$DW$203, DW_AT_name("bit")
    2825                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_bit")
    2826                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2827                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2828              
    2829                      .dwendtag $C$DW$T$44
    2830              
    2831              
    2832              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2833                      .dwattr $C$DW$T$45, DW_AT_name("CPUSEL9_BITS")
    2834                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2835              $C$DW$204       .dwtag  DW_TAG_member
    2836                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2837                      .dwattr $C$DW$204, DW_AT_name("McBSP_A")
    2838                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_McBSP_A")
    2839                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0f)
    2840                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2841                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2842                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2843              
    2844              $C$DW$205       .dwtag  DW_TAG_member
    2845                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2846                      .dwattr $C$DW$205, DW_AT_name("McBSP_B")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   54

    2847                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_McBSP_B")
    2848                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0e)
    2849                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2850                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2851                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2852              
    2853              $C$DW$206       .dwtag  DW_TAG_member
    2854                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2855                      .dwattr $C$DW$206, DW_AT_name("rsvd1")
    2856                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_rsvd1")
    2857                      .dwattr $C$DW$206, DW_AT_bit_offset(0x00)
    2858                      .dwattr $C$DW$206, DW_AT_bit_size(0x0e)
    2859                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2860                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2861              
    2862              $C$DW$207       .dwtag  DW_TAG_member
    2863                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2864                      .dwattr $C$DW$207, DW_AT_name("rsvd2")
    2865                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd2")
    2866                      .dwattr $C$DW$207, DW_AT_bit_offset(0x00)
    2867                      .dwattr $C$DW$207, DW_AT_bit_size(0x10)
    2868                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2869                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2870              
    2871                      .dwendtag $C$DW$T$45
    2872              
    2873              
    2874              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2875                      .dwattr $C$DW$T$46, DW_AT_name("CPUSEL9_REG")
    2876                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2877              $C$DW$208       .dwtag  DW_TAG_member
    2878                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$21)
    2879                      .dwattr $C$DW$208, DW_AT_name("all")
    2880                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_all")
    2881                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2882                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2883              
    2884              $C$DW$209       .dwtag  DW_TAG_member
    2885                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$45)
    2886                      .dwattr $C$DW$209, DW_AT_name("bit")
    2887                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_bit")
    2888                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2889                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2890              
    2891                      .dwendtag $C$DW$T$46
    2892              
    2893              
    2894              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2895                      .dwattr $C$DW$T$47, DW_AT_name("DC0_BITS")
    2896                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2897              $C$DW$210       .dwtag  DW_TAG_member
    2898                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2899                      .dwattr $C$DW$210, DW_AT_name("SINGLE_CORE")
    2900                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_SINGLE_CORE")
    2901                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:49 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   55

    2902                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2903                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2904                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2905              
    2906              $C$DW$211       .dwtag  DW_TAG_member
    2907                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2908                      .dwattr $C$DW$211, DW_AT_name("rsvd1")
    2909                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd1")
    2910                      .dwattr $C$DW$211, DW_AT_bit_offset(0x00)
    2911                      .dwattr $C$DW$211, DW_AT_bit_size(0x0f)
    2912                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2913                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2914              
    2915              $C$DW$212       .dwtag  DW_TAG_member
    2916                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2917                      .dwattr $C$DW$212, DW_AT_name("rsvd2")
    2918                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd2")
    2919                      .dwattr $C$DW$212, DW_AT_bit_offset(0x00)
    2920                      .dwattr $C$DW$212, DW_AT_bit_size(0x10)
    2921                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2922                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2923              
    2924                      .dwendtag $C$DW$T$47
    2925              
    2926              
    2927              $C$DW$T$48      .dwtag  DW_TAG_union_type
    2928                      .dwattr $C$DW$T$48, DW_AT_name("DC0_REG")
    2929                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2930              $C$DW$213       .dwtag  DW_TAG_member
    2931                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$21)
    2932                      .dwattr $C$DW$213, DW_AT_name("all")
    2933                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_all")
    2934                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2935                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2936              
    2937              $C$DW$214       .dwtag  DW_TAG_member
    2938                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$47)
    2939                      .dwattr $C$DW$214, DW_AT_name("bit")
    2940                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_bit")
    2941                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2942                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2943              
    2944                      .dwendtag $C$DW$T$48
    2945              
