TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:50 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_EnableUnbondedIOPullups")

         00000364 0000 
    2366 00000365 1901          SUBB      ACC,#1                ; [CPU_ALU] |875| 
    2367 00000366 1E10!         MOVL      @$BLOCKED(_DcsmZ1Regs)+16,ACC ; [CPU_ALU] |875| 
    2368                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_SysCtrl.c"
    2369 00000367 0200          MOVB      ACC,#0                ; [CPU_ALU] |876| 
    2370 00000368 1901          SUBB      ACC,#1                ; [CPU_ALU] |876| 
    2371 00000369 1E12!         MOVL      @$BLOCKED(_DcsmZ1Regs)+18,ACC ; [CPU_ALU] |876| 
    2372                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_SysCtrl.c"
    2373 0000036a 0200          MOVB      ACC,#0                ; [CPU_ALU] |877| 
    2374 0000036b 1901          SUBB      ACC,#1                ; [CPU_ALU] |877| 
    2375 0000036c 1E14!         MOVL      @$BLOCKED(_DcsmZ1Regs)+20,ACC ; [CPU_ALU] |877| 
    2376                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_SysCtrl.c"
    2377 0000036d 0200          MOVB      ACC,#0                ; [CPU_ALU] |878| 
    2378 0000036e 1901          SUBB      ACC,#1                ; [CPU_ALU] |878| 
    2379 0000036f 1E16!         MOVL      @$BLOCKED(_DcsmZ1Regs)+22,ACC ; [CPU_ALU] |878| 
    2380                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_SysCtrl.c"
    2381 00000370 0200          MOVB      ACC,#0                ; [CPU_ALU] |880| 
    2382 00000371 761F!         MOVW      DP,#_DcsmZ2Regs+16    ; [CPU_ARAU] 
         00000372 0000 
    2383 00000373 1901          SUBB      ACC,#1                ; [CPU_ALU] |880| 
    2384 00000374 1E10!         MOVL      @$BLOCKED(_DcsmZ2Regs)+16,ACC ; [CPU_ALU] |880| 
    2385                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_SysCtrl.c"
    2386 00000375 0200          MOVB      ACC,#0                ; [CPU_ALU] |881| 
    2387 00000376 1901          SUBB      ACC,#1                ; [CPU_ALU] |881| 
    2388 00000377 1E12!         MOVL      @$BLOCKED(_DcsmZ2Regs)+18,ACC ; [CPU_ALU] |881| 
    2389                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_SysCtrl.c"
    2390 00000378 0200          MOVB      ACC,#0                ; [CPU_ALU] |882| 
    2391 00000379 1901          SUBB      ACC,#1                ; [CPU_ALU] |882| 
    2392 0000037a 1E14!         MOVL      @$BLOCKED(_DcsmZ2Regs)+20,ACC ; [CPU_ALU] |882| 
    2393                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_SysCtrl.c"
    2394 0000037b 0200          MOVB      ACC,#0                ; [CPU_ALU] |883| 
    2395 0000037c 1901          SUBB      ACC,#1                ; [CPU_ALU] |883| 
    2396 0000037d 1E16!         MOVL      @$BLOCKED(_DcsmZ2Regs)+22,ACC ; [CPU_ALU] |883| 
    2397 0000037e 761A   EDIS
    2398 0000037f FF69          SPM       #0                    ; [CPU_ALU] 
    2399                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_SysCtrl.c"
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   49

    2400 00000380 9A00          MOVB      AL,#0                 ; [CPU_ALU] |886| 
    2401              $C$DW$96        .dwtag  DW_TAG_TI_branch
    2402                      .dwattr $C$DW$96, DW_AT_low_pc(0x00)
    2403                      .dwattr $C$DW$96, DW_AT_TI_return
    2404              
    2405 00000381 0006          LRETR     ; [CPU_ALU] 
    2406                      ; return occurs ; [] 
    2407                      .dwattr $C$DW$95, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/so
    2408                      .dwattr $C$DW$95, DW_AT_TI_end_line(0x377)
    2409                      .dwattr $C$DW$95, DW_AT_TI_end_column(0x01)
    2410                      .dwendentry
    2411                      .dwendtag $C$DW$95
    2412              
    2413              ;**************************************************************
    2414              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2415              ;**************************************************************
    2416                      .global _GPIO_EnableUnbondedIOPullups
    2417                      .global _FlashPumpSemaphoreRegs
    2418                      .global _CpuTimer2Regs
    2419                      .global _DcsmZ1Regs
    2420                      .global _DcsmZ2Regs
    2421                      .global _Flash0EccRegs
    2422                      .global _WdRegs
    2423                      .global _ClkCfgRegs
    2424                      .global _AnalogSubsysRegs
    2425                      .global _CpuSysRegs
    2426                      .global _DevCfgRegs
    2427                      .global _Flash0CtrlRegs
    2428              
    2429              ;***************************************************************
    2430              ;* TYPE INFORMATION                                            *
    2431              ;***************************************************************
    2432              
    2433              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2434                      .dwattr $C$DW$T$25, DW_AT_name("ANALOG_SUBSYS_REGS")
    2435                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
    2436              $C$DW$97        .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    2438                      .dwattr $C$DW$97, DW_AT_name("rsvd1")
    2439                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd1")
    2440                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2441                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2442              
    2443              $C$DW$98        .dwtag  DW_TAG_member
    2444                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$186)
    2445                      .dwattr $C$DW$98, DW_AT_name("INTOSC1TRIM")
    2446                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    2447                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2448                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2449              
    2450              $C$DW$99        .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$188)
    2452                      .dwattr $C$DW$99, DW_AT_name("INTOSC2TRIM")
    2453                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    2454                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   50

    2455                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2456              
    2457              $C$DW$100       .dwtag  DW_TAG_member
    2458                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
    2459                      .dwattr $C$DW$100, DW_AT_name("rsvd2")
    2460                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd2")
    2461                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2462                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2463              
    2464              $C$DW$101       .dwtag  DW_TAG_member
    2465                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$300)
    2466                      .dwattr $C$DW$101, DW_AT_name("TSNSCTL")
    2467                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_TSNSCTL")
    2468                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2469                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2470              
    2471              $C$DW$102       .dwtag  DW_TAG_member
    2472                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$22)
    2473                      .dwattr $C$DW$102, DW_AT_name("rsvd3")
    2474                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd3")
    2475                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2476                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2477              
    2478              $C$DW$103       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$192)
    2480                      .dwattr $C$DW$103, DW_AT_name("LOCK")
    2481                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_LOCK")
    2482                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2483                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2484              
    2485              $C$DW$104       .dwtag  DW_TAG_member
    2486                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$23)
    2487                      .dwattr $C$DW$104, DW_AT_name("rsvd4")
    2488                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd4")
    2489                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2490                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2491              
    2492              $C$DW$105       .dwtag  DW_TAG_member
    2493                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$28)
    2494                      .dwattr $C$DW$105, DW_AT_name("ANAREFTRIMA")
    2495                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ANAREFTRIMA")
    2496                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2497                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2498              
    2499              $C$DW$106       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$30)
    2501                      .dwattr $C$DW$106, DW_AT_name("ANAREFTRIMB")
    2502                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_ANAREFTRIMB")
    2503                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2504                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2505              
    2506              $C$DW$107       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$32)
    2508                      .dwattr $C$DW$107, DW_AT_name("ANAREFTRIMC")
    2509                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_ANAREFTRIMC")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   51

    2510                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2511                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2512              
    2513              $C$DW$108       .dwtag  DW_TAG_member
    2514                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$34)
    2515                      .dwattr $C$DW$108, DW_AT_name("ANAREFTRIMD")
    2516                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_ANAREFTRIMD")
    2517                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2518                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2519              
    2520              $C$DW$109       .dwtag  DW_TAG_member
    2521                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$24)
    2522                      .dwattr $C$DW$109, DW_AT_name("rsvd5")
    2523                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd5")
    2524                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2525                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2526              
    2527                      .dwendtag $C$DW$T$25
    2528              
    2529              $C$DW$110       .dwtag  DW_TAG_TI_far_type
    2530                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$25)
    2531              
    2532              $C$DW$T$348     .dwtag  DW_TAG_volatile_type
    2533                      .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$110)
    2534              
    2535              
    2536              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2537                      .dwattr $C$DW$T$26, DW_AT_name("ANAREFTRIMA_BITS")
    2538                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2539              $C$DW$111       .dwtag  DW_TAG_member
    2540                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2541                      .dwattr $C$DW$111, DW_AT_name("BGVALTRIM")
    2542                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_BGVALTRIM")
    2543                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a)
    2544                      .dwattr $C$DW$111, DW_AT_bit_size(0x06)
    2545                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2546                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2547              
    2548              $C$DW$112       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2550                      .dwattr $C$DW$112, DW_AT_name("BGSLOPETRIM")
    2551                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2552                      .dwattr $C$DW$112, DW_AT_bit_offset(0x05)
    2553                      .dwattr $C$DW$112, DW_AT_bit_size(0x05)
    2554                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2555                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2556              
    2557              $C$DW$113       .dwtag  DW_TAG_member
    2558                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2559                      .dwattr $C$DW$113, DW_AT_name("IREFTRIM")
    2560                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_IREFTRIM")
    2561                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00)
    2562                      .dwattr $C$DW$113, DW_AT_bit_size(0x05)
    2563                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2564                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   52

    2565              
    2566              $C$DW$114       .dwtag  DW_TAG_member
    2567                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2568                      .dwattr $C$DW$114, DW_AT_name("rsvd1")
    2569                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd1")
    2570                      .dwattr $C$DW$114, DW_AT_bit_offset(0x08)
    2571                      .dwattr $C$DW$114, DW_AT_bit_size(0x08)
    2572                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2573                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2574              
    2575              $C$DW$115       .dwtag  DW_TAG_member
    2576                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2577                      .dwattr $C$DW$115, DW_AT_name("rsvd2")
    2578                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd2")
    2579                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
    2580                      .dwattr $C$DW$115, DW_AT_bit_size(0x08)
    2581                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2582                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2583              
    2584                      .dwendtag $C$DW$T$26
    2585              
    2586              
    2587              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2588                      .dwattr $C$DW$T$28, DW_AT_name("ANAREFTRIMA_REG")
    2589                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2590              $C$DW$116       .dwtag  DW_TAG_member
    2591                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$27)
    2592                      .dwattr $C$DW$116, DW_AT_name("all")
    2593                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_all")
    2594                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2595                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2596              
    2597              $C$DW$117       .dwtag  DW_TAG_member
    2598                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$26)
    2599                      .dwattr $C$DW$117, DW_AT_name("bit")
    2600                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_bit")
    2601                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2602                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2603              
    2604                      .dwendtag $C$DW$T$28
    2605              
    2606              
    2607              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2608                      .dwattr $C$DW$T$29, DW_AT_name("ANAREFTRIMB_BITS")
    2609                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2610              $C$DW$118       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2612                      .dwattr $C$DW$118, DW_AT_name("BGVALTRIM")
    2613                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_BGVALTRIM")
    2614                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0a)
    2615                      .dwattr $C$DW$118, DW_AT_bit_size(0x06)
    2616                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2617                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2618              
    2619              $C$DW$119       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   53

    2620                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2621                      .dwattr $C$DW$119, DW_AT_name("BGSLOPETRIM")
    2622                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2623                      .dwattr $C$DW$119, DW_AT_bit_offset(0x05)
    2624                      .dwattr $C$DW$119, DW_AT_bit_size(0x05)
    2625                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2626                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2627              
    2628              $C$DW$120       .dwtag  DW_TAG_member
    2629                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2630                      .dwattr $C$DW$120, DW_AT_name("IREFTRIM")
    2631                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_IREFTRIM")
    2632                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    2633                      .dwattr $C$DW$120, DW_AT_bit_size(0x05)
    2634                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2635                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2636              
    2637              $C$DW$121       .dwtag  DW_TAG_member
    2638                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2639                      .dwattr $C$DW$121, DW_AT_name("rsvd1")
    2640                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd1")
    2641                      .dwattr $C$DW$121, DW_AT_bit_offset(0x08)
    2642                      .dwattr $C$DW$121, DW_AT_bit_size(0x08)
    2643                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2644                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2645              
    2646              $C$DW$122       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2648                      .dwattr $C$DW$122, DW_AT_name("rsvd2")
    2649                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd2")
    2650                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00)
    2651                      .dwattr $C$DW$122, DW_AT_bit_size(0x08)
    2652                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2653                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2654              
    2655                      .dwendtag $C$DW$T$29
    2656              
    2657              
    2658              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2659                      .dwattr $C$DW$T$30, DW_AT_name("ANAREFTRIMB_REG")
    2660                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2661              $C$DW$123       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$27)
    2663                      .dwattr $C$DW$123, DW_AT_name("all")
    2664                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_all")
    2665                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2666                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2667              
    2668              $C$DW$124       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$29)
    2670                      .dwattr $C$DW$124, DW_AT_name("bit")
    2671                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bit")
    2672                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2673                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2674              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   54

    2675                      .dwendtag $C$DW$T$30
    2676              
    2677              
    2678              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2679                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFTRIMC_BITS")
    2680                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2681              $C$DW$125       .dwtag  DW_TAG_member
    2682                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2683                      .dwattr $C$DW$125, DW_AT_name("BGVALTRIM")
    2684                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_BGVALTRIM")
    2685                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0a)
    2686                      .dwattr $C$DW$125, DW_AT_bit_size(0x06)
    2687                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2688                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2689              
    2690              $C$DW$126       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2692                      .dwattr $C$DW$126, DW_AT_name("BGSLOPETRIM")
    2693                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2694                      .dwattr $C$DW$126, DW_AT_bit_offset(0x05)
    2695                      .dwattr $C$DW$126, DW_AT_bit_size(0x05)
    2696                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2697                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2698              
    2699              $C$DW$127       .dwtag  DW_TAG_member
    2700                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2701                      .dwattr $C$DW$127, DW_AT_name("IREFTRIM")
    2702                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_IREFTRIM")
    2703                      .dwattr $C$DW$127, DW_AT_bit_offset(0x00)
    2704                      .dwattr $C$DW$127, DW_AT_bit_size(0x05)
    2705                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2706                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2707              
    2708              $C$DW$128       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2710                      .dwattr $C$DW$128, DW_AT_name("rsvd1")
    2711                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd1")
    2712                      .dwattr $C$DW$128, DW_AT_bit_offset(0x08)
    2713                      .dwattr $C$DW$128, DW_AT_bit_size(0x08)
    2714                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2715                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2716              
    2717              $C$DW$129       .dwtag  DW_TAG_member
    2718                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2719                      .dwattr $C$DW$129, DW_AT_name("rsvd2")
    2720                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd2")
    2721                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    2722                      .dwattr $C$DW$129, DW_AT_bit_size(0x08)
    2723                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2724                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2725              
    2726                      .dwendtag $C$DW$T$31
    2727              
    2728              
    2729              $C$DW$T$32      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   55

    2730                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFTRIMC_REG")
    2731                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2732              $C$DW$130       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$27)
    2734                      .dwattr $C$DW$130, DW_AT_name("all")
    2735                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_all")
    2736                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2737                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2738              
    2739              $C$DW$131       .dwtag  DW_TAG_member
    2740                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$31)
    2741                      .dwattr $C$DW$131, DW_AT_name("bit")
    2742                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_bit")
    2743                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2744                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2745              
    2746                      .dwendtag $C$DW$T$32
    2747              
    2748              
    2749              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2750                      .dwattr $C$DW$T$33, DW_AT_name("ANAREFTRIMD_BITS")
    2751                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2752              $C$DW$132       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2754                      .dwattr $C$DW$132, DW_AT_name("BGVALTRIM")
    2755                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_BGVALTRIM")
    2756                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0a)
    2757                      .dwattr $C$DW$132, DW_AT_bit_size(0x06)
    2758                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2759                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2760              
    2761              $C$DW$133       .dwtag  DW_TAG_member
    2762                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2763                      .dwattr $C$DW$133, DW_AT_name("BGSLOPETRIM")
    2764                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2765                      .dwattr $C$DW$133, DW_AT_bit_offset(0x05)
    2766                      .dwattr $C$DW$133, DW_AT_bit_size(0x05)
    2767                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2768                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2769              
    2770              $C$DW$134       .dwtag  DW_TAG_member
    2771                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2772                      .dwattr $C$DW$134, DW_AT_name("IREFTRIM")
    2773                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_IREFTRIM")
    2774                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    2775                      .dwattr $C$DW$134, DW_AT_bit_size(0x05)
    2776                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2777                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2778              
    2779              $C$DW$135       .dwtag  DW_TAG_member
    2780                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2781                      .dwattr $C$DW$135, DW_AT_name("rsvd1")
    2782                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd1")
    2783                      .dwattr $C$DW$135, DW_AT_bit_offset(0x08)
    2784                      .dwattr $C$DW$135, DW_AT_bit_size(0x08)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   56

    2785                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2786                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2787              
    2788              $C$DW$136       .dwtag  DW_TAG_member
    2789                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2790                      .dwattr $C$DW$136, DW_AT_name("rsvd2")
    2791                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd2")
    2792                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    2793                      .dwattr $C$DW$136, DW_AT_bit_size(0x08)
    2794                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2795                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2796              
    2797                      .dwendtag $C$DW$T$33
    2798              
    2799              
    2800              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2801                      .dwattr $C$DW$T$34, DW_AT_name("ANAREFTRIMD_REG")
    2802                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2803              $C$DW$137       .dwtag  DW_TAG_member
    2804                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$27)
    2805                      .dwattr $C$DW$137, DW_AT_name("all")
    2806                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_all")
    2807                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2808                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2809              
    2810              $C$DW$138       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$33)
    2812                      .dwattr $C$DW$138, DW_AT_name("bit")
    2813                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_bit")
    2814                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2815                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2816              
    2817                      .dwendtag $C$DW$T$34
    2818              
    2819              
    2820              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2821                      .dwattr $C$DW$T$35, DW_AT_name("AUXCLKDIVSEL_BITS")
    2822                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2823              $C$DW$139       .dwtag  DW_TAG_member
    2824                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2825                      .dwattr $C$DW$139, DW_AT_name("AUXPLLDIV")
    2826                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_AUXPLLDIV")
    2827                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0e)
    2828                      .dwattr $C$DW$139, DW_AT_bit_size(0x02)
    2829                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2830                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2831              
    2832              $C$DW$140       .dwtag  DW_TAG_member
    2833                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2834                      .dwattr $C$DW$140, DW_AT_name("rsvd1")
    2835                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_rsvd1")
    2836                      .dwattr $C$DW$140, DW_AT_bit_offset(0x00)
    2837                      .dwattr $C$DW$140, DW_AT_bit_size(0x0e)
    2838                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2839                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   57

    2840              
    2841              $C$DW$141       .dwtag  DW_TAG_member
    2842                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2843                      .dwattr $C$DW$141, DW_AT_name("rsvd2")
    2844                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd2")
    2845                      .dwattr $C$DW$141, DW_AT_bit_offset(0x00)
    2846                      .dwattr $C$DW$141, DW_AT_bit_size(0x10)
    2847                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2848                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2849              
    2850                      .dwendtag $C$DW$T$35
    2851              
    2852              
    2853              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2854                      .dwattr $C$DW$T$36, DW_AT_name("AUXCLKDIVSEL_REG")
    2855                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2856              $C$DW$142       .dwtag  DW_TAG_member
    2857                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$27)
    2858                      .dwattr $C$DW$142, DW_AT_name("all")
    2859                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_all")
    2860                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2861                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2862              
    2863              $C$DW$143       .dwtag  DW_TAG_member
    2864                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$35)
    2865                      .dwattr $C$DW$143, DW_AT_name("bit")
    2866                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_bit")
    2867                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2868                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2869              
    2870                      .dwendtag $C$DW$T$36
    2871              
    2872              
    2873              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2874                      .dwattr $C$DW$T$37, DW_AT_name("AUXPLLCTL1_BITS")
    2875                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2876              $C$DW$144       .dwtag  DW_TAG_member
    2877                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2878                      .dwattr $C$DW$144, DW_AT_name("PLLEN")
    2879                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PLLEN")
    2880                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0f)
    2881                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2882                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2883                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2884              
    2885              $C$DW$145       .dwtag  DW_TAG_member
    2886                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2887                      .dwattr $C$DW$145, DW_AT_name("PLLCLKEN")
    2888                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PLLCLKEN")
    2889                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0e)
    2890                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2891                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2892                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2893              
    2894              $C$DW$146       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   58

    2895                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2896                      .dwattr $C$DW$146, DW_AT_name("rsvd1")
    2897                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd1")
    2898                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    2899                      .dwattr $C$DW$146, DW_AT_bit_size(0x0e)
    2900                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2901                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2902              
    2903              $C$DW$147       .dwtag  DW_TAG_member
    2904                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2905                      .dwattr $C$DW$147, DW_AT_name("rsvd2")
    2906                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd2")
    2907                      .dwattr $C$DW$147, DW_AT_bit_offset(0x00)
    2908                      .dwattr $C$DW$147, DW_AT_bit_size(0x10)
    2909                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2910                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2911              
    2912                      .dwendtag $C$DW$T$37
    2913              
    2914              
    2915              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2916                      .dwattr $C$DW$T$38, DW_AT_name("AUXPLLCTL1_REG")
    2917                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2918              $C$DW$148       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    2920                      .dwattr $C$DW$148, DW_AT_name("all")
    2921                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_all")
    2922                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2923                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2924              
    2925              $C$DW$149       .dwtag  DW_TAG_member
    2926                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$37)
    2927                      .dwattr $C$DW$149, DW_AT_name("bit")
    2928                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_bit")
    2929                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2930                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2931              
    2932                      .dwendtag $C$DW$T$38
    2933              
    2934              
    2935              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2936                      .dwattr $C$DW$T$39, DW_AT_name("AUXPLLMULT_BITS")
    2937                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2938              $C$DW$150       .dwtag  DW_TAG_member
    2939                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2940                      .dwattr $C$DW$150, DW_AT_name("IMULT")
    2941                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_IMULT")
    2942                      .dwattr $C$DW$150, DW_AT_bit_offset(0x09)
    2943                      .dwattr $C$DW$150, DW_AT_bit_size(0x07)
    2944                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2945                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2946              
    2947              $C$DW$151       .dwtag  DW_TAG_member
    2948                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2949                      .dwattr $C$DW$151, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   59

    2950                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd1")
    2951                      .dwattr $C$DW$151, DW_AT_bit_offset(0x08)
    2952                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2953                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2954                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2955              
    2956              $C$DW$152       .dwtag  DW_TAG_member
    2957                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2958                      .dwattr $C$DW$152, DW_AT_name("FMULT")
    2959                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_FMULT")
    2960                      .dwattr $C$DW$152, DW_AT_bit_offset(0x06)
    2961                      .dwattr $C$DW$152, DW_AT_bit_size(0x02)
    2962                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2963                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2964              
    2965              $C$DW$153       .dwtag  DW_TAG_member
    2966                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2967                      .dwattr $C$DW$153, DW_AT_name("rsvd2")
    2968                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd2")
    2969                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00)
    2970                      .dwattr $C$DW$153, DW_AT_bit_size(0x06)
    2971                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2972                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2973              
    2974              $C$DW$154       .dwtag  DW_TAG_member
    2975                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2976                      .dwattr $C$DW$154, DW_AT_name("rsvd3")
    2977                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd3")
    2978                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    2979                      .dwattr $C$DW$154, DW_AT_bit_size(0x10)
    2980                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2981                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2982              
    2983                      .dwendtag $C$DW$T$39
    2984              
    2985              
    2986              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2987                      .dwattr $C$DW$T$40, DW_AT_name("AUXPLLMULT_REG")
    2988                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2989              $C$DW$155       .dwtag  DW_TAG_member
    2990                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    2991                      .dwattr $C$DW$155, DW_AT_name("all")
    2992                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_all")
    2993                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2994                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2995              
    2996              $C$DW$156       .dwtag  DW_TAG_member
    2997                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$39)
    2998                      .dwattr $C$DW$156, DW_AT_name("bit")
    2999                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_bit")
    3000                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3001                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3002              
    3003                      .dwendtag $C$DW$T$40
    3004              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   60

    3005              
    3006              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3007                      .dwattr $C$DW$T$41, DW_AT_name("AUXPLLSTS_BITS")
    3008                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    3009              $C$DW$157       .dwtag  DW_TAG_member
    3010                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    3011                      .dwattr $C$DW$157, DW_AT_name("LOCKS")
    3012                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_LOCKS")
    3013                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0f)
    3014                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    3015                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3016                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3017              
    3018              $C$DW$158       .dwtag  DW_TAG_member
    3019                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    3020                      .dwattr $C$DW$158, DW_AT_name("SLIPS")
    3021                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_SLIPS")
    3022                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0e)
    3023                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    3024                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3025                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3026              
    3027              $C$DW$159       .dwtag  DW_TAG_member
    3028                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    3029                      .dwattr $C$DW$159, DW_AT_name("rsvd1")
    3030                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd1")
    3031                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00)
    3032                      .dwattr $C$DW$159, DW_AT_bit_size(0x0e)
    3033                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3034                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3035              
    3036              $C$DW$160       .dwtag  DW_TAG_member
    3037                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    3038                      .dwattr $C$DW$160, DW_AT_name("rsvd2")
    3039                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd2")
    3040                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    3041                      .dwattr $C$DW$160, DW_AT_bit_size(0x10)
    3042                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3043                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3044              
    3045                      .dwendtag $C$DW$T$41
    3046              
    3047              
    3048              $C$DW$T$42      .dwtag  DW_TAG_union_type
    3049                      .dwattr $C$DW$T$42, DW_AT_name("AUXPLLSTS_REG")
    3050                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    3051              $C$DW$161       .dwtag  DW_TAG_member
    3052                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$27)
    3053                      .dwattr $C$DW$161, DW_AT_name("all")
    3054                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_all")
    3055                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3056                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3057              
    3058              $C$DW$162       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$41)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   61

    3060                      .dwattr $C$DW$162, DW_AT_name("bit")
    3061                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_bit")
    3062                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3063                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3064              
    3065                      .dwendtag $C$DW$T$42
    3066              
    3067              
    3068              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3069                      .dwattr $C$DW$T$43, DW_AT_name("CLKCFGLOCK1_BITS")
    3070                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    3071              $C$DW$163       .dwtag  DW_TAG_member
    3072                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    3073                      .dwattr $C$DW$163, DW_AT_name("CLKSRCCTL1")
    3074                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3075                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0f)
    3076                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    3077                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3078                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3079              
    3080              $C$DW$164       .dwtag  DW_TAG_member
    3081                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    3082                      .dwattr $C$DW$164, DW_AT_name("CLKSRCCTL2")
    3083                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3084                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0e)
    3085                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    3086                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3087                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3088              
    3089              $C$DW$165       .dwtag  DW_TAG_member
    3090                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    3091                      .dwattr $C$DW$165, DW_AT_name("CLKSRCCTL3")
    3092                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3093                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0d)
    3094                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    3095                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3096                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3097              
    3098              $C$DW$166       .dwtag  DW_TAG_member
    3099                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    3100                      .dwattr $C$DW$166, DW_AT_name("SYSPLLCTL1")
    3101                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3102                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0c)
    3103                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    3104                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3105                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3106              
    3107              $C$DW$167       .dwtag  DW_TAG_member
    3108                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    3109                      .dwattr $C$DW$167, DW_AT_name("SYSPLLCTL2")
    3110                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    3111                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0b)
    3112                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    3113                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3114                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   62

    3115              
    3116              $C$DW$168       .dwtag  DW_TAG_member
    3117                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    3118                      .dwattr $C$DW$168, DW_AT_name("SYSPLLCTL3")
    3119                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    3120                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0a)
    3121                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    3122                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3123                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3124              
    3125              $C$DW$169       .dwtag  DW_TAG_member
    3126                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    3127                      .dwattr $C$DW$169, DW_AT_name("SYSPLLMULT")
    3128                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3129                      .dwattr $C$DW$169, DW_AT_bit_offset(0x09)
    3130                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    3131                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3132                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3133              
    3134              $C$DW$170       .dwtag  DW_TAG_member
    3135                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    3136                      .dwattr $C$DW$170, DW_AT_name("AUXPLLCTL1")
    3137                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3138                      .dwattr $C$DW$170, DW_AT_bit_offset(0x08)
    3139                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    3140                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3141                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3142              
    3143              $C$DW$171       .dwtag  DW_TAG_member
    3144                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    3145                      .dwattr $C$DW$171, DW_AT_name("rsvd1")
    3146                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd1")
    3147                      .dwattr $C$DW$171, DW_AT_bit_offset(0x07)
    3148                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    3149                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3150                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3151              
    3152              $C$DW$172       .dwtag  DW_TAG_member
    3153                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    3154                      .dwattr $C$DW$172, DW_AT_name("rsvd2")
    3155                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd2")
    3156                      .dwattr $C$DW$172, DW_AT_bit_offset(0x06)
    3157                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    3158                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3159                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3160              
    3161              $C$DW$173       .dwtag  DW_TAG_member
    3162                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    3163                      .dwattr $C$DW$173, DW_AT_name("AUXPLLMULT")
    3164                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3165                      .dwattr $C$DW$173, DW_AT_bit_offset(0x05)
    3166                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    3167                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3168                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3169              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   63

    3170              $C$DW$174       .dwtag  DW_TAG_member
    3171                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    3172                      .dwattr $C$DW$174, DW_AT_name("SYSCLKDIVSEL")
    3173                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3174                      .dwattr $C$DW$174, DW_AT_bit_offset(0x04)
    3175                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    3176                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3177                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3178              
    3179              $C$DW$175       .dwtag  DW_TAG_member
    3180                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    3181                      .dwattr $C$DW$175, DW_AT_name("AUXCLKDIVSEL")
    3182                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3183                      .dwattr $C$DW$175, DW_AT_bit_offset(0x03)
    3184                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    3185                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3186                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3187              
    3188              $C$DW$176       .dwtag  DW_TAG_member
    3189                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    3190                      .dwattr $C$DW$176, DW_AT_name("PERCLKDIVSEL")
    3191                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3192                      .dwattr $C$DW$176, DW_AT_bit_offset(0x02)
    3193                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    3194                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3195                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3196              
    3197              $C$DW$177       .dwtag  DW_TAG_member
    3198                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    3199                      .dwattr $C$DW$177, DW_AT_name("rsvd3")
    3200                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd3")
    3201                      .dwattr $C$DW$177, DW_AT_bit_offset(0x01)
    3202                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    3203                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3204                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3205              
    3206              $C$DW$178       .dwtag  DW_TAG_member
    3207                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    3208                      .dwattr $C$DW$178, DW_AT_name("LOSPCP")
    3209                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_LOSPCP")
    3210                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00)
    3211                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    3212                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3213                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3214              
    3215              $C$DW$179       .dwtag  DW_TAG_member
    3216                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    3217                      .dwattr $C$DW$179, DW_AT_name("rsvd4")
    3218                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd4")
    3219                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00)
    3220                      .dwattr $C$DW$179, DW_AT_bit_size(0x10)
    3221                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3222                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3223              
    3224                      .dwendtag $C$DW$T$43
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   64

    3225              
    3226              
    3227              $C$DW$T$44      .dwtag  DW_TAG_union_type
    3228                      .dwattr $C$DW$T$44, DW_AT_name("CLKCFGLOCK1_REG")
    3229                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    3230              $C$DW$180       .dwtag  DW_TAG_member
    3231                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    3232                      .dwattr $C$DW$180, DW_AT_name("all")
    3233                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_all")
    3234                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3235                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3236              
    3237              $C$DW$181       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$43)
    3239                      .dwattr $C$DW$181, DW_AT_name("bit")
    3240                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_bit")
    3241                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3242                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3243              
    3244                      .dwendtag $C$DW$T$44
    3245              
    3246              
    3247              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3248                      .dwattr $C$DW$T$45, DW_AT_name("CLKSEM_BITS")
    3249                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    3250              $C$DW$182       .dwtag  DW_TAG_member
    3251                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3252                      .dwattr $C$DW$182, DW_AT_name("SEM")
    3253                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_SEM")
    3254                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0e)
    3255                      .dwattr $C$DW$182, DW_AT_bit_size(0x02)
    3256                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3257                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3258              
    3259              $C$DW$183       .dwtag  DW_TAG_member
    3260                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3261                      .dwattr $C$DW$183, DW_AT_name("rsvd1")
    3262                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd1")
    3263                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00)
    3264                      .dwattr $C$DW$183, DW_AT_bit_size(0x0e)
    3265                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3266                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3267              
    3268              $C$DW$184       .dwtag  DW_TAG_member
    3269                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    3270                      .dwattr $C$DW$184, DW_AT_name("KEY")
    3271                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_KEY")
    3272                      .dwattr $C$DW$184, DW_AT_bit_offset(0x00)
    3273                      .dwattr $C$DW$184, DW_AT_bit_size(0x10)
    3274                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3275                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3276              
    3277                      .dwendtag $C$DW$T$45
    3278              
    3279              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   65

    3280              $C$DW$T$46      .dwtag  DW_TAG_union_type
    3281                      .dwattr $C$DW$T$46, DW_AT_name("CLKSEM_REG")
    3282                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    3283              $C$DW$185       .dwtag  DW_TAG_member
    3284                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$27)
    3285                      .dwattr $C$DW$185, DW_AT_name("all")
    3286                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_all")
    3287                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3288                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3289              
    3290              $C$DW$186       .dwtag  DW_TAG_member
    3291                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$45)
    3292                      .dwattr $C$DW$186, DW_AT_name("bit")
    3293                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_bit")
    3294                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3295                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3296              
    3297                      .dwendtag $C$DW$T$46
    3298              
    3299              
    3300              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3301                      .dwattr $C$DW$T$47, DW_AT_name("CLKSRCCTL1_BITS")
    3302                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    3303              $C$DW$187       .dwtag  DW_TAG_member
    3304                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    3305                      .dwattr $C$DW$187, DW_AT_name("OSCCLKSRCSEL")
    3306                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    3307                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0e)
    3308                      .dwattr $C$DW$187, DW_AT_bit_size(0x02)
    3309                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3310                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3311              
    3312              $C$DW$188       .dwtag  DW_TAG_member
    3313                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    3314                      .dwattr $C$DW$188, DW_AT_name("rsvd1")
    3315                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd1")
    3316                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0d)
    3317                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    3318                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3319                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3320              
    3321              $C$DW$189       .dwtag  DW_TAG_member
    3322                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    3323                      .dwattr $C$DW$189, DW_AT_name("INTOSC2OFF")
    3324                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_INTOSC2OFF")
    3325                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0c)
    3326                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    3327                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3328                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3329              
    3330              $C$DW$190       .dwtag  DW_TAG_member
    3331                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    3332                      .dwattr $C$DW$190, DW_AT_name("XTALOFF")
    3333                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_XTALOFF")
    3334                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0b)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   66

    3335                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    3336                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3337                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3338              
    3339              $C$DW$191       .dwtag  DW_TAG_member
    3340                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3341                      .dwattr $C$DW$191, DW_AT_name("WDHALTI")
    3342                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_WDHALTI")
    3343                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0a)
    3344                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    3345                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3346                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3347              
    3348              $C$DW$192       .dwtag  DW_TAG_member
    3349                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3350                      .dwattr $C$DW$192, DW_AT_name("rsvd2")
    3351                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd2")
    3352                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00)
    3353                      .dwattr $C$DW$192, DW_AT_bit_size(0x0a)
    3354                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3355                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3356              
    3357              $C$DW$193       .dwtag  DW_TAG_member
    3358                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    3359                      .dwattr $C$DW$193, DW_AT_name("rsvd3")
    3360                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd3")
    3361                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00)
    3362                      .dwattr $C$DW$193, DW_AT_bit_size(0x10)
    3363                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3364                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3365              
    3366                      .dwendtag $C$DW$T$47
    3367              
    3368              
    3369              $C$DW$T$48      .dwtag  DW_TAG_union_type
    3370                      .dwattr $C$DW$T$48, DW_AT_name("CLKSRCCTL1_REG")
    3371                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3372              $C$DW$194       .dwtag  DW_TAG_member
    3373                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    3374                      .dwattr $C$DW$194, DW_AT_name("all")
    3375                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_all")
    3376                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3377                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3378              
    3379              $C$DW$195       .dwtag  DW_TAG_member
    3380                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$47)
    3381                      .dwattr $C$DW$195, DW_AT_name("bit")
    3382                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_bit")
    3383                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3384                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3385              
    3386                      .dwendtag $C$DW$T$48
    3387              
    3388              
    3389              $C$DW$T$49      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   67

    3390                      .dwattr $C$DW$T$49, DW_AT_name("CLKSRCCTL2_BITS")
    3391                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    3392              $C$DW$196       .dwtag  DW_TAG_member
    3393                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    3394                      .dwattr $C$DW$196, DW_AT_name("AUXOSCCLKSRCSEL")
    3395                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    3396                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0e)
    3397                      .dwattr $C$DW$196, DW_AT_bit_size(0x02)
    3398                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3399                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3400              
    3401              $C$DW$197       .dwtag  DW_TAG_member
    3402                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    3403                      .dwattr $C$DW$197, DW_AT_name("CANABCLKSEL")
    3404                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_CANABCLKSEL")
    3405                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0c)
    3406                      .dwattr $C$DW$197, DW_AT_bit_size(0x02)
    3407                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3408                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3409              
    3410              $C$DW$198       .dwtag  DW_TAG_member
    3411                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    3412                      .dwattr $C$DW$198, DW_AT_name("CANBBCLKSEL")
    3413                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    3414                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0a)
    3415                      .dwattr $C$DW$198, DW_AT_bit_size(0x02)
    3416                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3417                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3418              
    3419              $C$DW$199       .dwtag  DW_TAG_member
    3420                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3421                      .dwattr $C$DW$199, DW_AT_name("rsvd1")
    3422                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_rsvd1")
    3423                      .dwattr $C$DW$199, DW_AT_bit_offset(0x08)
    3424                      .dwattr $C$DW$199, DW_AT_bit_size(0x02)
    3425                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3426                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3427              
    3428              $C$DW$200       .dwtag  DW_TAG_member
    3429                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    3430                      .dwattr $C$DW$200, DW_AT_name("rsvd2")
    3431                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rsvd2")
    3432                      .dwattr $C$DW$200, DW_AT_bit_offset(0x06)
    3433                      .dwattr $C$DW$200, DW_AT_bit_size(0x02)
    3434                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3435                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3436              
    3437              $C$DW$201       .dwtag  DW_TAG_member
    3438                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    3439                      .dwattr $C$DW$201, DW_AT_name("rsvd3")
    3440                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd3")
    3441                      .dwattr $C$DW$201, DW_AT_bit_offset(0x00)
    3442                      .dwattr $C$DW$201, DW_AT_bit_size(0x06)
    3443                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3444                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   68

    3445              
    3446              $C$DW$202       .dwtag  DW_TAG_member
    3447                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    3448                      .dwattr $C$DW$202, DW_AT_name("rsvd4")
    3449                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rsvd4")
    3450                      .dwattr $C$DW$202, DW_AT_bit_offset(0x00)
    3451                      .dwattr $C$DW$202, DW_AT_bit_size(0x10)
    3452                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3453                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3454              
    3455                      .dwendtag $C$DW$T$49
    3456              
    3457              
    3458              $C$DW$T$50      .dwtag  DW_TAG_union_type
    3459                      .dwattr $C$DW$T$50, DW_AT_name("CLKSRCCTL2_REG")
    3460                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    3461              $C$DW$203       .dwtag  DW_TAG_member
    3462                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$27)
    3463                      .dwattr $C$DW$203, DW_AT_name("all")
    3464                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_all")
    3465                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3466                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3467              
    3468              $C$DW$204       .dwtag  DW_TAG_member
    3469                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$49)
    3470                      .dwattr $C$DW$204, DW_AT_name("bit")
    3471                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_bit")
    3472                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3473                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3474              
    3475                      .dwendtag $C$DW$T$50
    3476              
    3477              
    3478              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3479                      .dwattr $C$DW$T$51, DW_AT_name("CLKSRCCTL3_BITS")
    3480                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    3481              $C$DW$205       .dwtag  DW_TAG_member
    3482                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3483                      .dwattr $C$DW$205, DW_AT_name("XCLKOUTSEL")
    3484                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    3485                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0d)
    3486                      .dwattr $C$DW$205, DW_AT_bit_size(0x03)
    3487                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3488                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3489              
    3490              $C$DW$206       .dwtag  DW_TAG_member
    3491                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3492                      .dwattr $C$DW$206, DW_AT_name("rsvd1")
    3493                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_rsvd1")
    3494                      .dwattr $C$DW$206, DW_AT_bit_offset(0x00)
    3495                      .dwattr $C$DW$206, DW_AT_bit_size(0x0d)
    3496                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3497                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3498              
    3499              $C$DW$207       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   69

    3500                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3501                      .dwattr $C$DW$207, DW_AT_name("rsvd2")
    3502                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd2")
    3503                      .dwattr $C$DW$207, DW_AT_bit_offset(0x00)
    3504                      .dwattr $C$DW$207, DW_AT_bit_size(0x10)
    3505                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3506                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3507              
    3508                      .dwendtag $C$DW$T$51
    3509              
    3510              
    3511              $C$DW$T$52      .dwtag  DW_TAG_union_type
    3512                      .dwattr $C$DW$T$52, DW_AT_name("CLKSRCCTL3_REG")
    3513                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    3514              $C$DW$208       .dwtag  DW_TAG_member
    3515                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$27)
    3516                      .dwattr $C$DW$208, DW_AT_name("all")
    3517                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_all")
    3518                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3519                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3520              
    3521              $C$DW$209       .dwtag  DW_TAG_member
    3522                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$51)
    3523                      .dwattr $C$DW$209, DW_AT_name("bit")
    3524                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_bit")
    3525                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3526                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3527              
    3528                      .dwendtag $C$DW$T$52
    3529              
    3530              
    3531              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3532                      .dwattr $C$DW$T$54, DW_AT_name("CLK_CFG_REGS")
    3533                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x32)
    3534              $C$DW$210       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$46)
    3536                      .dwattr $C$DW$210, DW_AT_name("CLKSEM")
    3537                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_CLKSEM")
    3538                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3539                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3540              
    3541              $C$DW$211       .dwtag  DW_TAG_member
    3542                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$44)
    3543                      .dwattr $C$DW$211, DW_AT_name("CLKCFGLOCK1")
    3544                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    3545                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3546                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3547              
    3548              $C$DW$212       .dwtag  DW_TAG_member
    3549                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$53)
    3550                      .dwattr $C$DW$212, DW_AT_name("rsvd1")
    3551                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd1")
    3552                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3553                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3554              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   70

    3555              $C$DW$213       .dwtag  DW_TAG_member
    3556                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$48)
    3557                      .dwattr $C$DW$213, DW_AT_name("CLKSRCCTL1")
    3558                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3559                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3560                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3561              
    3562              $C$DW$214       .dwtag  DW_TAG_member
    3563                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$50)
    3564                      .dwattr $C$DW$214, DW_AT_name("CLKSRCCTL2")
    3565                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3566                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3567                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3568              
    3569              $C$DW$215       .dwtag  DW_TAG_member
    3570                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$52)
    3571                      .dwattr $C$DW$215, DW_AT_name("CLKSRCCTL3")
    3572                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3573                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3574                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3575              
    3576              $C$DW$216       .dwtag  DW_TAG_member
    3577                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$284)
    3578                      .dwattr $C$DW$216, DW_AT_name("SYSPLLCTL1")
    3579                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3580                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3581                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3582              
    3583              $C$DW$217       .dwtag  DW_TAG_member
    3584                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$53)
    3585                      .dwattr $C$DW$217, DW_AT_name("rsvd2")
    3586                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_rsvd2")
    3587                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3588                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3589              
    3590              $C$DW$218       .dwtag  DW_TAG_member
    3591                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$286)
    3592                      .dwattr $C$DW$218, DW_AT_name("SYSPLLMULT")
    3593                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3594                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3595                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3596              
    3597              $C$DW$219       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$288)
    3599                      .dwattr $C$DW$219, DW_AT_name("SYSPLLSTS")
    3600                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_SYSPLLSTS")
    3601                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3602                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3603              
    3604              $C$DW$220       .dwtag  DW_TAG_member
    3605                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$38)
    3606                      .dwattr $C$DW$220, DW_AT_name("AUXPLLCTL1")
    3607                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3608                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3609                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   71

    3610              
    3611              $C$DW$221       .dwtag  DW_TAG_member
    3612                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$53)
    3613                      .dwattr $C$DW$221, DW_AT_name("rsvd3")
    3614                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_rsvd3")
    3615                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3616                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3617              
    3618              $C$DW$222       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$40)
    3620                      .dwattr $C$DW$222, DW_AT_name("AUXPLLMULT")
    3621                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3622                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3623                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3624              
    3625              $C$DW$223       .dwtag  DW_TAG_member
    3626                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$42)
    3627                      .dwattr $C$DW$223, DW_AT_name("AUXPLLSTS")
    3628                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_AUXPLLSTS")
    3629                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3630                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3631              
    3632              $C$DW$224       .dwtag  DW_TAG_member
    3633                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$280)
    3634                      .dwattr $C$DW$224, DW_AT_name("SYSCLKDIVSEL")
    3635                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3636                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3637                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3638              
    3639              $C$DW$225       .dwtag  DW_TAG_member
    3640                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$36)
    3641                      .dwattr $C$DW$225, DW_AT_name("AUXCLKDIVSEL")
    3642                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3643                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3644                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3645              
    3646              $C$DW$226       .dwtag  DW_TAG_member
    3647                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$236)
    3648                      .dwattr $C$DW$226, DW_AT_name("PERCLKDIVSEL")
    3649                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3650                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3651                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3652              
    3653              $C$DW$227       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$315)
    3655                      .dwattr $C$DW$227, DW_AT_name("XCLKOUTDIVSEL")
    3656                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    3657                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3658                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3659              
    3660              $C$DW$228       .dwtag  DW_TAG_member
    3661                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$21)
    3662                      .dwattr $C$DW$228, DW_AT_name("rsvd4")
    3663                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_rsvd4")
    3664                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   72

    3665                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3666              
    3667              $C$DW$229       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$194)
    3669                      .dwattr $C$DW$229, DW_AT_name("LOSPCP")
    3670                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_LOSPCP")
    3671                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3672                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3673              
    3674              $C$DW$230       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$200)
    3676                      .dwattr $C$DW$230, DW_AT_name("MCDCR")
    3677                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_MCDCR")
    3678                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3679                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3680              
    3681              $C$DW$231       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$313)
    3683                      .dwattr $C$DW$231, DW_AT_name("X1CNT")
    3684                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_X1CNT")
    3685                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3686                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3687              
    3688                      .dwendtag $C$DW$T$54
    3689              
    3690              $C$DW$232       .dwtag  DW_TAG_TI_far_type
    3691                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$54)
    3692              
    3693              $C$DW$T$364     .dwtag  DW_TAG_volatile_type
    3694                      .dwattr $C$DW$T$364, DW_AT_type(*$C$DW$232)
    3695              
    3696              
    3697              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3698                      .dwattr $C$DW$T$55, DW_AT_name("CPU2RESCTL_BITS")
    3699                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x02)
    3700              $C$DW$233       .dwtag  DW_TAG_member
    3701                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    3702                      .dwattr $C$DW$233, DW_AT_name("RESET")
    3703                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_RESET")
    3704                      .dwattr $C$DW$233, DW_AT_bit_offset(0x0f)
    3705                      .dwattr $C$DW$233, DW_AT_bit_size(0x01)
    3706                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3707                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3708              
    3709              $C$DW$234       .dwtag  DW_TAG_member
    3710                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    3711                      .dwattr $C$DW$234, DW_AT_name("rsvd1")
    3712                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_rsvd1")
    3713                      .dwattr $C$DW$234, DW_AT_bit_offset(0x00)
    3714                      .dwattr $C$DW$234, DW_AT_bit_size(0x0f)
    3715                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3716                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3717              
    3718              $C$DW$235       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   73

    3720                      .dwattr $C$DW$235, DW_AT_name("KEY")
    3721                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_KEY")
    3722                      .dwattr $C$DW$235, DW_AT_bit_offset(0x00)
    3723                      .dwattr $C$DW$235, DW_AT_bit_size(0x10)
    3724                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3725                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3726              
    3727                      .dwendtag $C$DW$T$55
    3728              
    3729              
    3730              $C$DW$T$56      .dwtag  DW_TAG_union_type
