TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:46 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("AdcaRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_AdcaRegs")

     424 000000c6 FF95          LSL       AH,6                  ; [CPU_ALU] |62| 
     425 000000c7 CBA9          OR        AH,AL                 ; [CPU_ALU] |62| 
     426 000000c8 9701!         MOV       @$BLOCKED(_AdcaRegs)+1,AH ; [CPU_ALU] |62| 
     427                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_Adc.c",lin
     428 000000c9 CDA2          AND       AH,AR2,#0x0001        ; [CPU_ALU] |63| 
         000000ca 0001 
     429 000000cb FF96          LSL       AH,7                  ; [CPU_ALU] |63| 
     430 000000cc CC01!         AND       AL,@$BLOCKED(_AdcaRegs)+1,#0xff7f ; [CPU_FPU] |63| 
         000000cd FF7F 
     431 000000ce CBA9          OR        AH,AL                 ; [CPU_ALU] |63| 
     432 000000cf 9701!         MOV       @$BLOCKED(_AdcaRegs)+1,AH ; [CPU_ALU] |63| 
     433                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_Adc.c",lin
     434 000000d0 7E3B!         MOV       @$BLOCKED(_AdcaRegs)+59,AR6 ; [CPU_ALU] |64| 
     435 000000d1 92A1          MOV       AL,AR1                ; [CPU_ALU] |64| 
     436                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_Adc.c",lin
     437 000000d2 600F          B         $C$L11,NEQ            ; [CPU_ALU] |65| 
     438                      ; branchcc occurs ; [] |65| 
     439 000000d3 761F!         MOVW      DP,#_AdcaRegs+112     ; [CPU_ARAU] 
         000000d4 0001 
     440                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_Adc.c",lin
     441 000000d5 0630!         MOVL      ACC,@$BLOCKED(_AdcaRegs)+112 ; [CPU_ALU] |70| 
     442 000000d6 9000          ANDB      AL,#0                 ; [CPU_ALU] |70| 
     443 000000d7 1E30!         MOVL      @$BLOCKED(_AdcaRegs)+112,ACC ; [CPU_ALU] |70| 
     444                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_Adc.c",lin
     445 000000d8 0632!         MOVL      ACC,@$BLOCKED(_AdcaRegs)+114 ; [CPU_ALU] |71| 
     446 000000d9 9000          ANDB      AL,#0                 ; [CPU_ALU] |71| 
     447 000000da 1E32!         MOVL      @$BLOCKED(_AdcaRegs)+114,ACC ; [CPU_ALU] |71| 
     448                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_Adc.c",lin
     449 000000db 0636!         MOVL      ACC,@$BLOCKED(_AdcaRegs)+118 ; [CPU_ALU] |72| 
     450 000000dc 9000          ANDB      AL,#0                 ; [CPU_ALU] |72| 
     451 000000dd 1E36!         MOVL      @$BLOCKED(_AdcaRegs)+118,ACC ; [CPU_ALU] |72| 
     452                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2837xD_Adc.c",lin
     453 000000de 0638!         MOVL      ACC,@$BLOCKED(_AdcaRegs)+120 ; [CPU_ALU] |73| 
     454 000000df 9000          ANDB      AL,#0                 ; [CPU_ALU] |73| 
     455 000000e0 1E38!         MOVL      @$BLOCKED(_AdcaRegs)+120,ACC ; [CPU_ALU] |73| 
     456 000000e1       $C$L11:    
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   10

     457 000000e1 82BE          MOVL      XAR3,*--SP            ; [CPU_ALU] 
     458                      .dwcfi  cfa_offset, -6
     459                      .dwcfi  restore_reg, 11
     460 000000e2 86BE          MOVL      XAR2,*--SP            ; [CPU_ALU] 
     461                      .dwcfi  cfa_offset, -4
     462                      .dwcfi  restore_reg, 9
     463 000000e3 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     464                      .dwcfi  cfa_offset, -2
     465                      .dwcfi  restore_reg, 7
     466              $C$DW$19        .dwtag  DW_TAG_TI_branch
     467                      .dwattr $C$DW$19, DW_AT_low_pc(0x00)
     468                      .dwattr $C$DW$19, DW_AT_TI_return
     469              
     470 000000e4 0006          LRETR     ; [CPU_ALU] 
     471                      ; return occurs ; [] 
     472                      .dwattr $C$DW$9, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/sou
     473                      .dwattr $C$DW$9, DW_AT_TI_end_line(0x7a)
     474                      .dwattr $C$DW$9, DW_AT_TI_end_column(0x01)
     475                      .dwendentry
     476                      .dwendtag $C$DW$9
     477              
     478              ;**************************************************************
     479              ;* UNDEFINED EXTERNAL REFERENCES                              *
     480              ;**************************************************************
     481                      .global _AdcaRegs
     482                      .global _AdcbRegs
     483                      .global _AdccRegs
     484                      .global _AdcdRegs
     485              
     486              ;***************************************************************
     487              ;* TYPE INFORMATION                                            *
     488              ;***************************************************************
     489              
     490              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     491                      .dwattr $C$DW$T$20, DW_AT_name("ADCBURSTCTL_BITS")
     492                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     493              $C$DW$20        .dwtag  DW_TAG_member
     494                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     495                      .dwattr $C$DW$20, DW_AT_name("BURSTTRIGSEL")
     496                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
     497                      .dwattr $C$DW$20, DW_AT_bit_offset(0x0a)
     498                      .dwattr $C$DW$20, DW_AT_bit_size(0x06)
     499                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     500                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     501              
     502              $C$DW$21        .dwtag  DW_TAG_member
     503                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     504                      .dwattr $C$DW$21, DW_AT_name("rsvd1")
     505                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_rsvd1")
     506                      .dwattr $C$DW$21, DW_AT_bit_offset(0x08)
     507                      .dwattr $C$DW$21, DW_AT_bit_size(0x02)
     508                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     509                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     510              
     511              $C$DW$22        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   11

     512                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     513                      .dwattr $C$DW$22, DW_AT_name("BURSTSIZE")
     514                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_BURSTSIZE")
     515                      .dwattr $C$DW$22, DW_AT_bit_offset(0x04)
     516                      .dwattr $C$DW$22, DW_AT_bit_size(0x04)
     517                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     518                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     519              
     520              $C$DW$23        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     522                      .dwattr $C$DW$23, DW_AT_name("rsvd2")
     523                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_rsvd2")
     524                      .dwattr $C$DW$23, DW_AT_bit_offset(0x01)
     525                      .dwattr $C$DW$23, DW_AT_bit_size(0x03)
     526                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     527                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     528              
     529              $C$DW$24        .dwtag  DW_TAG_member
     530                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     531                      .dwattr $C$DW$24, DW_AT_name("BURSTEN")
     532                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_BURSTEN")
     533                      .dwattr $C$DW$24, DW_AT_bit_offset(0x00)
     534                      .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     535                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     536                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     537              
     538                      .dwendtag $C$DW$T$20
     539              
     540              
     541              $C$DW$T$21      .dwtag  DW_TAG_union_type
     542                      .dwattr $C$DW$T$21, DW_AT_name("ADCBURSTCTL_REG")
     543                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     544              $C$DW$25        .dwtag  DW_TAG_member
     545                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     546                      .dwattr $C$DW$25, DW_AT_name("all")
     547                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_all")
     548                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     549                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     550              
     551              $C$DW$26        .dwtag  DW_TAG_member
     552                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
     553                      .dwattr $C$DW$26, DW_AT_name("bit")
     554                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_bit")
     555                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     556                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     557              
     558                      .dwendtag $C$DW$T$21
     559              
     560              
     561              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     562                      .dwattr $C$DW$T$22, DW_AT_name("ADCCOUNTER_BITS")
     563                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     564              $C$DW$27        .dwtag  DW_TAG_member
     565                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     566                      .dwattr $C$DW$27, DW_AT_name("FREECOUNT")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   12

     567                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_FREECOUNT")
     568                      .dwattr $C$DW$27, DW_AT_bit_offset(0x04)
     569                      .dwattr $C$DW$27, DW_AT_bit_size(0x0c)
     570                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     571                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     572              
     573              $C$DW$28        .dwtag  DW_TAG_member
     574                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     575                      .dwattr $C$DW$28, DW_AT_name("rsvd1")
     576                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd1")
     577                      .dwattr $C$DW$28, DW_AT_bit_offset(0x00)
     578                      .dwattr $C$DW$28, DW_AT_bit_size(0x04)
     579                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     580                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     581              
     582                      .dwendtag $C$DW$T$22
     583              
     584              
     585              $C$DW$T$23      .dwtag  DW_TAG_union_type
     586                      .dwattr $C$DW$T$23, DW_AT_name("ADCCOUNTER_REG")
     587                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     588              $C$DW$29        .dwtag  DW_TAG_member
     589                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     590                      .dwattr $C$DW$29, DW_AT_name("all")
     591                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_all")
     592                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     593                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     594              
     595              $C$DW$30        .dwtag  DW_TAG_member
     596                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$22)
     597                      .dwattr $C$DW$30, DW_AT_name("bit")
     598                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_bit")
     599                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     600                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     601              
     602                      .dwendtag $C$DW$T$23
     603              
     604              
     605              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     606                      .dwattr $C$DW$T$24, DW_AT_name("ADCCTL1_BITS")
     607                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     608              $C$DW$31        .dwtag  DW_TAG_member
     609                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     610                      .dwattr $C$DW$31, DW_AT_name("rsvd1")
     611                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd1")
     612                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0e)
     613                      .dwattr $C$DW$31, DW_AT_bit_size(0x02)
     614                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     615                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     616              
     617              $C$DW$32        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     619                      .dwattr $C$DW$32, DW_AT_name("INTPULSEPOS")
     620                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_INTPULSEPOS")
     621                      .dwattr $C$DW$32, DW_AT_bit_offset(0x0d)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   13

     622                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     623                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     624                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     625              
     626              $C$DW$33        .dwtag  DW_TAG_member
     627                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     628                      .dwattr $C$DW$33, DW_AT_name("rsvd2")
     629                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd2")
     630                      .dwattr $C$DW$33, DW_AT_bit_offset(0x09)
     631                      .dwattr $C$DW$33, DW_AT_bit_size(0x04)
     632                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     633                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     634              
     635              $C$DW$34        .dwtag  DW_TAG_member
     636                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     637                      .dwattr $C$DW$34, DW_AT_name("ADCPWDNZ")
     638                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_ADCPWDNZ")
     639                      .dwattr $C$DW$34, DW_AT_bit_offset(0x08)
     640                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     641                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     642                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     643              
     644              $C$DW$35        .dwtag  DW_TAG_member
     645                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     646                      .dwattr $C$DW$35, DW_AT_name("ADCBSYCHN")
     647                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_ADCBSYCHN")
     648                      .dwattr $C$DW$35, DW_AT_bit_offset(0x04)
     649                      .dwattr $C$DW$35, DW_AT_bit_size(0x04)
     650                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     651                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     652              
     653              $C$DW$36        .dwtag  DW_TAG_member
     654                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     655                      .dwattr $C$DW$36, DW_AT_name("rsvd3")
     656                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd3")
     657                      .dwattr $C$DW$36, DW_AT_bit_offset(0x03)
     658                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     659                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     660                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     661              
     662              $C$DW$37        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     664                      .dwattr $C$DW$37, DW_AT_name("ADCBSY")
     665                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_ADCBSY")
     666                      .dwattr $C$DW$37, DW_AT_bit_offset(0x02)
     667                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     668                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     669                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     670              
     671              $C$DW$38        .dwtag  DW_TAG_member
     672                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     673                      .dwattr $C$DW$38, DW_AT_name("rsvd4")
     674                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd4")
     675                      .dwattr $C$DW$38, DW_AT_bit_offset(0x00)
     676                      .dwattr $C$DW$38, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   14

     677                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     678                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     679              
     680                      .dwendtag $C$DW$T$24
     681              
     682              
     683              $C$DW$T$25      .dwtag  DW_TAG_union_type
     684                      .dwattr $C$DW$T$25, DW_AT_name("ADCCTL1_REG")
     685                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     686              $C$DW$39        .dwtag  DW_TAG_member
     687                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     688                      .dwattr $C$DW$39, DW_AT_name("all")
     689                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_all")
     690                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     691                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     692              
     693              $C$DW$40        .dwtag  DW_TAG_member
     694                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$24)
     695                      .dwattr $C$DW$40, DW_AT_name("bit")
     696                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_bit")
     697                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     698                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     699              
     700                      .dwendtag $C$DW$T$25
     701              
     702              
     703              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     704                      .dwattr $C$DW$T$26, DW_AT_name("ADCCTL2_BITS")
     705                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     706              $C$DW$41        .dwtag  DW_TAG_member
     707                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     708                      .dwattr $C$DW$41, DW_AT_name("PRESCALE")
     709                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_PRESCALE")
     710                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0c)
     711                      .dwattr $C$DW$41, DW_AT_bit_size(0x04)
     712                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     713                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     714              
     715              $C$DW$42        .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     717                      .dwattr $C$DW$42, DW_AT_name("rsvd1")
     718                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd1")
     719                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0a)
     720                      .dwattr $C$DW$42, DW_AT_bit_size(0x02)
     721                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     722                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     723              
     724              $C$DW$43        .dwtag  DW_TAG_member
     725                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     726                      .dwattr $C$DW$43, DW_AT_name("RESOLUTION")
     727                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_RESOLUTION")
     728                      .dwattr $C$DW$43, DW_AT_bit_offset(0x09)
     729                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     730                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     731                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   15

     732              
     733              $C$DW$44        .dwtag  DW_TAG_member
     734                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     735                      .dwattr $C$DW$44, DW_AT_name("SIGNALMODE")
     736                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_SIGNALMODE")
     737                      .dwattr $C$DW$44, DW_AT_bit_offset(0x08)
     738                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     739                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     740                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     741              
     742              $C$DW$45        .dwtag  DW_TAG_member
     743                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     744                      .dwattr $C$DW$45, DW_AT_name("rsvd2")
     745                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_rsvd2")
     746                      .dwattr $C$DW$45, DW_AT_bit_offset(0x03)
     747                      .dwattr $C$DW$45, DW_AT_bit_size(0x05)
     748                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     749                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     750              
     751              $C$DW$46        .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     753                      .dwattr $C$DW$46, DW_AT_name("rsvd3")
     754                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_rsvd3")
     755                      .dwattr $C$DW$46, DW_AT_bit_offset(0x00)
     756                      .dwattr $C$DW$46, DW_AT_bit_size(0x03)
     757                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     758                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     759              
     760                      .dwendtag $C$DW$T$26
     761              
     762              
     763              $C$DW$T$27      .dwtag  DW_TAG_union_type
     764                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL2_REG")
     765                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     766              $C$DW$47        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$47, DW_AT_name("all")
     769                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_all")
     770                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     771                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     772              
     773              $C$DW$48        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$26)
     775                      .dwattr $C$DW$48, DW_AT_name("bit")
     776                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_bit")
     777                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     778                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     779              
     780                      .dwendtag $C$DW$T$27
     781              
     782              
     783              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     784                      .dwattr $C$DW$T$28, DW_AT_name("ADCEVTCLR_BITS")
     785                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     786              $C$DW$49        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   16

     787                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     788                      .dwattr $C$DW$49, DW_AT_name("PPB1TRIPHI")
     789                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     790                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0f)
     791                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     792                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     793                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     794              
     795              $C$DW$50        .dwtag  DW_TAG_member
     796                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     797                      .dwattr $C$DW$50, DW_AT_name("PPB1TRIPLO")
     798                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     799                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0e)
     800                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     801                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     803              
     804              $C$DW$51        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     806                      .dwattr $C$DW$51, DW_AT_name("PPB1ZERO")
     807                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_PPB1ZERO")
     808                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0d)
     809                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     810                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     811                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     812              
     813              $C$DW$52        .dwtag  DW_TAG_member
     814                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     815                      .dwattr $C$DW$52, DW_AT_name("rsvd1")
     816                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_rsvd1")
     817                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0c)
     818                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     819                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     820                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     821              
     822              $C$DW$53        .dwtag  DW_TAG_member
     823                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     824                      .dwattr $C$DW$53, DW_AT_name("PPB2TRIPHI")
     825                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PPB2TRIPHI")
     826                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0b)
     827                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     828                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     829                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     830              
     831              $C$DW$54        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     833                      .dwattr $C$DW$54, DW_AT_name("PPB2TRIPLO")
     834                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PPB2TRIPLO")
     835                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0a)
     836                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     837                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     838                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     839              
     840              $C$DW$55        .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   17

     842                      .dwattr $C$DW$55, DW_AT_name("PPB2ZERO")
     843                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_PPB2ZERO")
     844                      .dwattr $C$DW$55, DW_AT_bit_offset(0x09)
     845                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     846                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     847                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     848              
     849              $C$DW$56        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     851                      .dwattr $C$DW$56, DW_AT_name("rsvd2")
     852                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd2")
     853                      .dwattr $C$DW$56, DW_AT_bit_offset(0x08)
     854                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     855                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     856                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     857              
     858              $C$DW$57        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     860                      .dwattr $C$DW$57, DW_AT_name("PPB3TRIPHI")
     861                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_PPB3TRIPHI")
     862                      .dwattr $C$DW$57, DW_AT_bit_offset(0x07)
     863                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     864                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     865                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     866              
     867              $C$DW$58        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     869                      .dwattr $C$DW$58, DW_AT_name("PPB3TRIPLO")
     870                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_PPB3TRIPLO")
     871                      .dwattr $C$DW$58, DW_AT_bit_offset(0x06)
     872                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     873                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     874                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     875              
     876              $C$DW$59        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     878                      .dwattr $C$DW$59, DW_AT_name("PPB3ZERO")
     879                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_PPB3ZERO")
     880                      .dwattr $C$DW$59, DW_AT_bit_offset(0x05)
     881                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     882                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     883                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     884              
     885              $C$DW$60        .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     887                      .dwattr $C$DW$60, DW_AT_name("rsvd3")
     888                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd3")
     889                      .dwattr $C$DW$60, DW_AT_bit_offset(0x04)
     890                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     891                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     893              
     894              $C$DW$61        .dwtag  DW_TAG_member
     895                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     896                      .dwattr $C$DW$61, DW_AT_name("PPB4TRIPHI")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   18

     897                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PPB4TRIPHI")
     898                      .dwattr $C$DW$61, DW_AT_bit_offset(0x03)
     899                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     900                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     901                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     902              
     903              $C$DW$62        .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     905                      .dwattr $C$DW$62, DW_AT_name("PPB4TRIPLO")
     906                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PPB4TRIPLO")
     907                      .dwattr $C$DW$62, DW_AT_bit_offset(0x02)
     908                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     909                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     910                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     911              
     912              $C$DW$63        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     914                      .dwattr $C$DW$63, DW_AT_name("PPB4ZERO")
     915                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PPB4ZERO")
     916                      .dwattr $C$DW$63, DW_AT_bit_offset(0x01)
     917                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     918                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     919                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     920              
     921              $C$DW$64        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     923                      .dwattr $C$DW$64, DW_AT_name("rsvd4")
     924                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_rsvd4")
     925                      .dwattr $C$DW$64, DW_AT_bit_offset(0x00)
     926                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     927                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     928                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     929              
     930                      .dwendtag $C$DW$T$28
     931              
     932              
     933              $C$DW$T$29      .dwtag  DW_TAG_union_type
     934                      .dwattr $C$DW$T$29, DW_AT_name("ADCEVTCLR_REG")
     935                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     936              $C$DW$65        .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     938                      .dwattr $C$DW$65, DW_AT_name("all")
     939                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_all")
     940                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     941                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     942              
     943              $C$DW$66        .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$28)
     945                      .dwattr $C$DW$66, DW_AT_name("bit")
     946                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_bit")
     947                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     949              
     950                      .dwendtag $C$DW$T$29
     951              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   19

     952              
     953              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     954                      .dwattr $C$DW$T$30, DW_AT_name("ADCEVTINTSEL_BITS")
     955                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     956              $C$DW$67        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     958                      .dwattr $C$DW$67, DW_AT_name("PPB1TRIPHI")
     959                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     960                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0f)
     961                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     962                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     963                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     964              
     965              $C$DW$68        .dwtag  DW_TAG_member
     966                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     967                      .dwattr $C$DW$68, DW_AT_name("PPB1TRIPLO")
     968                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     969                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0e)
     970                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     971                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     972                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     973              
     974              $C$DW$69        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$69, DW_AT_name("PPB1ZERO")
     977                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_PPB1ZERO")
     978                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0d)
     979                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     980                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     982              
     983              $C$DW$70        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$70, DW_AT_name("rsvd1")
     986                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_rsvd1")
     987                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0c)
     988                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     989                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     990                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     991              
     992              $C$DW$71        .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     994                      .dwattr $C$DW$71, DW_AT_name("PPB2TRIPHI")
     995                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_PPB2TRIPHI")
     996                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0b)
     997                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     998                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1000              
    1001              $C$DW$72        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$72, DW_AT_name("PPB2TRIPLO")
    1004                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1005                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0a)
    1006                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   20

    1007                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1008                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1009              
    1010              $C$DW$73        .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$73, DW_AT_name("PPB2ZERO")
    1013                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_PPB2ZERO")
    1014                      .dwattr $C$DW$73, DW_AT_bit_offset(0x09)
    1015                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1016                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1018              
    1019              $C$DW$74        .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1021                      .dwattr $C$DW$74, DW_AT_name("rsvd2")
    1022                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_rsvd2")
    1023                      .dwattr $C$DW$74, DW_AT_bit_offset(0x08)
    1024                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1025                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1026                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1027              
    1028              $C$DW$75        .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1030                      .dwattr $C$DW$75, DW_AT_name("PPB3TRIPHI")
    1031                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1032                      .dwattr $C$DW$75, DW_AT_bit_offset(0x07)
    1033                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1034                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1036              
    1037              $C$DW$76        .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$76, DW_AT_name("PPB3TRIPLO")
    1040                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1041                      .dwattr $C$DW$76, DW_AT_bit_offset(0x06)
    1042                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1043                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1045              
    1046              $C$DW$77        .dwtag  DW_TAG_member
    1047                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1048                      .dwattr $C$DW$77, DW_AT_name("PPB3ZERO")
    1049                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_PPB3ZERO")
    1050                      .dwattr $C$DW$77, DW_AT_bit_offset(0x05)
    1051                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1052                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1054              
    1055              $C$DW$78        .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$78, DW_AT_name("rsvd3")
    1058                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_rsvd3")
    1059                      .dwattr $C$DW$78, DW_AT_bit_offset(0x04)
    1060                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1061                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   21

    1062                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1063              
    1064              $C$DW$79        .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1066                      .dwattr $C$DW$79, DW_AT_name("PPB4TRIPHI")
    1067                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1068                      .dwattr $C$DW$79, DW_AT_bit_offset(0x03)
    1069                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1070                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1071                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1072              
    1073              $C$DW$80        .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1075                      .dwattr $C$DW$80, DW_AT_name("PPB4TRIPLO")
    1076                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1077                      .dwattr $C$DW$80, DW_AT_bit_offset(0x02)
    1078                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1079                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1081              
    1082              $C$DW$81        .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1084                      .dwattr $C$DW$81, DW_AT_name("PPB4ZERO")
    1085                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_PPB4ZERO")
    1086                      .dwattr $C$DW$81, DW_AT_bit_offset(0x01)
    1087                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1088                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1090              
    1091              $C$DW$82        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$82, DW_AT_name("rsvd4")
    1094                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd4")
    1095                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1096                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1097                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1099              
    1100                      .dwendtag $C$DW$T$30
    1101              
    1102              
    1103              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1104                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTINTSEL_REG")
    1105                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1106              $C$DW$83        .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1108                      .dwattr $C$DW$83, DW_AT_name("all")
    1109                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_all")
    1110                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1111                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1112              
    1113              $C$DW$84        .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$30)
    1115                      .dwattr $C$DW$84, DW_AT_name("bit")
    1116                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   22

    1117                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1118                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1119              
    1120                      .dwendtag $C$DW$T$31
    1121              
    1122              
    1123              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1124                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTSEL_BITS")
    1125                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1126              $C$DW$85        .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1128                      .dwattr $C$DW$85, DW_AT_name("PPB1TRIPHI")
    1129                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1130                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0f)
    1131                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1132                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1133                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1134              
    1135              $C$DW$86        .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1137                      .dwattr $C$DW$86, DW_AT_name("PPB1TRIPLO")
    1138                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1139                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0e)
    1140                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1141                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1143              
    1144              $C$DW$87        .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1146                      .dwattr $C$DW$87, DW_AT_name("PPB1ZERO")
    1147                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_PPB1ZERO")
    1148                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0d)
    1149                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1150                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1151                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1152              
    1153              $C$DW$88        .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1155                      .dwattr $C$DW$88, DW_AT_name("rsvd1")
    1156                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd1")
    1157                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0c)
    1158                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1159                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1160                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1161              
    1162              $C$DW$89        .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1164                      .dwattr $C$DW$89, DW_AT_name("PPB2TRIPHI")
    1165                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1166                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0b)
    1167                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1168                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1170              
    1171              $C$DW$90        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   23

    1172                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$90, DW_AT_name("PPB2TRIPLO")
    1174                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1175                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0a)
    1176                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1177                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1179              
    1180              $C$DW$91        .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1182                      .dwattr $C$DW$91, DW_AT_name("PPB2ZERO")
    1183                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_PPB2ZERO")
    1184                      .dwattr $C$DW$91, DW_AT_bit_offset(0x09)
    1185                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1186                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1188              
    1189              $C$DW$92        .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1191                      .dwattr $C$DW$92, DW_AT_name("rsvd2")
    1192                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd2")
    1193                      .dwattr $C$DW$92, DW_AT_bit_offset(0x08)
    1194                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1195                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1196                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1197              
    1198              $C$DW$93        .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1200                      .dwattr $C$DW$93, DW_AT_name("PPB3TRIPHI")
    1201                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1202                      .dwattr $C$DW$93, DW_AT_bit_offset(0x07)
    1203                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1204                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1205                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207              $C$DW$94        .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1209                      .dwattr $C$DW$94, DW_AT_name("PPB3TRIPLO")
    1210                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1211                      .dwattr $C$DW$94, DW_AT_bit_offset(0x06)
    1212                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1213                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1214                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1215              
    1216              $C$DW$95        .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1218                      .dwattr $C$DW$95, DW_AT_name("PPB3ZERO")
    1219                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_PPB3ZERO")
    1220                      .dwattr $C$DW$95, DW_AT_bit_offset(0x05)
    1221                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1222                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1224              
    1225              $C$DW$96        .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   24

    1227                      .dwattr $C$DW$96, DW_AT_name("rsvd3")
    1228                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd3")
    1229                      .dwattr $C$DW$96, DW_AT_bit_offset(0x04)
    1230                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1231                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1232                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1233              
    1234              $C$DW$97        .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1236                      .dwattr $C$DW$97, DW_AT_name("PPB4TRIPHI")
    1237                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1238                      .dwattr $C$DW$97, DW_AT_bit_offset(0x03)
    1239                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1240                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1242              
    1243              $C$DW$98        .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1245                      .dwattr $C$DW$98, DW_AT_name("PPB4TRIPLO")
    1246                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1247                      .dwattr $C$DW$98, DW_AT_bit_offset(0x02)
    1248                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1249                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1250                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1251              
    1252              $C$DW$99        .dwtag  DW_TAG_member
    1253                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1254                      .dwattr $C$DW$99, DW_AT_name("PPB4ZERO")
    1255                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_PPB4ZERO")
    1256                      .dwattr $C$DW$99, DW_AT_bit_offset(0x01)
    1257                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1258                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1259                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1260              
    1261              $C$DW$100       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1263                      .dwattr $C$DW$100, DW_AT_name("rsvd4")
    1264                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd4")
    1265                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00)
    1266                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1267                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1268                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1269              
    1270                      .dwendtag $C$DW$T$32
    1271              
    1272              
    1273              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1274                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTSEL_REG")
    1275                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1276              $C$DW$101       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1278                      .dwattr $C$DW$101, DW_AT_name("all")
    1279                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1280                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1281                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   25

    1282              
    1283              $C$DW$102       .dwtag  DW_TAG_member
    1284                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$32)
    1285                      .dwattr $C$DW$102, DW_AT_name("bit")
    1286                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1287                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1288                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1289              
    1290                      .dwendtag $C$DW$T$33
    1291              
    1292              
    1293              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1294                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTSTAT_BITS")
    1295                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1296              $C$DW$103       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1298                      .dwattr $C$DW$103, DW_AT_name("PPB1TRIPHI")
    1299                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1300                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0f)
    1301                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1302                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1303                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1304              
    1305              $C$DW$104       .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$104, DW_AT_name("PPB1TRIPLO")
    1308                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1309                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e)
    1310                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1311                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1313              
    1314              $C$DW$105       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1316                      .dwattr $C$DW$105, DW_AT_name("PPB1ZERO")
    1317                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_PPB1ZERO")
    1318                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0d)
    1319                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1320                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1321                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1322              
    1323              $C$DW$106       .dwtag  DW_TAG_member
    1324                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1325                      .dwattr $C$DW$106, DW_AT_name("rsvd1")
    1326                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd1")
    1327                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0c)
    1328                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1329                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1331              
    1332              $C$DW$107       .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1334                      .dwattr $C$DW$107, DW_AT_name("PPB2TRIPHI")
    1335                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1336                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0b)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   26

    1337                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1338                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1340              
    1341              $C$DW$108       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$108, DW_AT_name("PPB2TRIPLO")
    1344                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1345                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0a)
    1346                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1347                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1349              
    1350              $C$DW$109       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1352                      .dwattr $C$DW$109, DW_AT_name("PPB2ZERO")
    1353                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_PPB2ZERO")
    1354                      .dwattr $C$DW$109, DW_AT_bit_offset(0x09)
    1355                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1356                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1358              
    1359              $C$DW$110       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1361                      .dwattr $C$DW$110, DW_AT_name("rsvd2")
    1362                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd2")
    1363                      .dwattr $C$DW$110, DW_AT_bit_offset(0x08)
    1364                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1365                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1367              
    1368              $C$DW$111       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1370                      .dwattr $C$DW$111, DW_AT_name("PPB3TRIPHI")
    1371                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1372                      .dwattr $C$DW$111, DW_AT_bit_offset(0x07)
    1373                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1374                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1376              
    1377              $C$DW$112       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1379                      .dwattr $C$DW$112, DW_AT_name("PPB3TRIPLO")
    1380                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1381                      .dwattr $C$DW$112, DW_AT_bit_offset(0x06)
    1382                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1383                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1385              
    1386              $C$DW$113       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1388                      .dwattr $C$DW$113, DW_AT_name("PPB3ZERO")
    1389                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_PPB3ZERO")
    1390                      .dwattr $C$DW$113, DW_AT_bit_offset(0x05)
    1391                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   27

    1392                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395              $C$DW$114       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$114, DW_AT_name("rsvd3")
    1398                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd3")
    1399                      .dwattr $C$DW$114, DW_AT_bit_offset(0x04)
    1400                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1401                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1403              
    1404              $C$DW$115       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1406                      .dwattr $C$DW$115, DW_AT_name("PPB4TRIPHI")
    1407                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1408                      .dwattr $C$DW$115, DW_AT_bit_offset(0x03)
    1409                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1410                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$116       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$116, DW_AT_name("PPB4TRIPLO")
    1416                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1417                      .dwattr $C$DW$116, DW_AT_bit_offset(0x02)
    1418                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1419                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1420                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1421              
    1422              $C$DW$117       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1424                      .dwattr $C$DW$117, DW_AT_name("PPB4ZERO")
    1425                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_PPB4ZERO")
    1426                      .dwattr $C$DW$117, DW_AT_bit_offset(0x01)
    1427                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1428                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1429                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1430              
    1431              $C$DW$118       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1433                      .dwattr $C$DW$118, DW_AT_name("rsvd4")
    1434                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd4")
    1435                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    1436                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1437                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440                      .dwendtag $C$DW$T$34
    1441              
    1442              
    1443              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1444                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSTAT_REG")
    1445                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1446              $C$DW$119       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   28

    1447                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1448                      .dwattr $C$DW$119, DW_AT_name("all")
    1449                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    1450                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1452              
    1453              $C$DW$120       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$34)
    1455                      .dwattr $C$DW$120, DW_AT_name("bit")
    1456                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    1457                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1459              
    1460                      .dwendtag $C$DW$T$35
    1461              
    1462              
    1463              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1464                      .dwattr $C$DW$T$36, DW_AT_name("ADCINTFLGCLR_BITS")
    1465                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1466              $C$DW$121       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1468                      .dwattr $C$DW$121, DW_AT_name("ADCINT1")
    1469                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_ADCINT1")
    1470                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0f)
    1471                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1472                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1474              
    1475              $C$DW$122       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1477                      .dwattr $C$DW$122, DW_AT_name("ADCINT2")
    1478                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_ADCINT2")
    1479                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e)
    1480                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1481                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1483              
    1484              $C$DW$123       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$123, DW_AT_name("ADCINT3")
    1487                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_ADCINT3")
    1488                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0d)
    1489                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1490                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1492              
    1493              $C$DW$124       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1495                      .dwattr $C$DW$124, DW_AT_name("ADCINT4")
    1496                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_ADCINT4")
    1497                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0c)
    1498                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1499                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1501              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   29

    1502              $C$DW$125       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1504                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    1505                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
    1506                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00)
    1507                      .dwattr $C$DW$125, DW_AT_bit_size(0x0c)
    1508                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1510              
    1511                      .dwendtag $C$DW$T$36
    1512              
    1513              
    1514              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1515                      .dwattr $C$DW$T$37, DW_AT_name("ADCINTFLGCLR_REG")
    1516                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1517              $C$DW$126       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1519                      .dwattr $C$DW$126, DW_AT_name("all")
    1520                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_all")
    1521                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$127       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$36)
    1526                      .dwattr $C$DW$127, DW_AT_name("bit")
    1527                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_bit")
    1528                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1529                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1530              
    1531                      .dwendtag $C$DW$T$37
    1532              
    1533              
    1534              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1535                      .dwattr $C$DW$T$38, DW_AT_name("ADCINTFLG_BITS")
    1536                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1537              $C$DW$128       .dwtag  DW_TAG_member
    1538                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1539                      .dwattr $C$DW$128, DW_AT_name("ADCINT1")
    1540                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_ADCINT1")
    1541                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0f)
    1542                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1543                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1544                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1545              
    1546              $C$DW$129       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1548                      .dwattr $C$DW$129, DW_AT_name("ADCINT2")
    1549                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ADCINT2")
    1550                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0e)
    1551                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1552                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1553                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1554              
    1555              $C$DW$130       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   30

    1557                      .dwattr $C$DW$130, DW_AT_name("ADCINT3")
    1558                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ADCINT3")
    1559                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0d)
    1560                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1561                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1563              
    1564              $C$DW$131       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1566                      .dwattr $C$DW$131, DW_AT_name("ADCINT4")
    1567                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADCINT4")
    1568                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0c)
    1569                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1570                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1571                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$132       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$132, DW_AT_name("rsvd1")
    1576                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd1")
    1577                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    1578                      .dwattr $C$DW$132, DW_AT_bit_size(0x0c)
    1579                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1581              
    1582                      .dwendtag $C$DW$T$38
    1583              
    1584              
    1585              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1586                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLG_REG")
    1587                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1588              $C$DW$133       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1590                      .dwattr $C$DW$133, DW_AT_name("all")
    1591                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_all")
    1592                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1594              
    1595              $C$DW$134       .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$38)
    1597                      .dwattr $C$DW$134, DW_AT_name("bit")
    1598                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_bit")
    1599                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1600                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1601              
    1602                      .dwendtag $C$DW$T$39
    1603              
    1604              
    1605              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1606                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTOVFCLR_BITS")
    1607                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1608              $C$DW$135       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1610                      .dwattr $C$DW$135, DW_AT_name("ADCINT1")
    1611                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_ADCINT1")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   31

    1612                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0f)
    1613                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1614                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1615                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1616              
    1617              $C$DW$136       .dwtag  DW_TAG_member
    1618                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1619                      .dwattr $C$DW$136, DW_AT_name("ADCINT2")
    1620                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ADCINT2")
    1621                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0e)
    1622                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1623                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1624                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1625              
    1626              $C$DW$137       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1628                      .dwattr $C$DW$137, DW_AT_name("ADCINT3")
    1629                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ADCINT3")
    1630                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0d)
    1631                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1632                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1633                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1634              
    1635              $C$DW$138       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1637                      .dwattr $C$DW$138, DW_AT_name("ADCINT4")
    1638                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ADCINT4")
    1639                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0c)
    1640                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1641                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1643              
    1644              $C$DW$139       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1646                      .dwattr $C$DW$139, DW_AT_name("rsvd1")
    1647                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd1")
    1648                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1649                      .dwattr $C$DW$139, DW_AT_bit_size(0x0c)
    1650                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1651                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1652              
    1653                      .dwendtag $C$DW$T$40
    1654              
    1655              
    1656              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1657                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTOVFCLR_REG")
    1658                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1659              $C$DW$140       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1661                      .dwattr $C$DW$140, DW_AT_name("all")
    1662                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1663                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1664                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1665              
    1666              $C$DW$141       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   32

    1667                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$40)
    1668                      .dwattr $C$DW$141, DW_AT_name("bit")
    1669                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1670                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1671                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1672              
    1673                      .dwendtag $C$DW$T$41
    1674              
    1675              
    1676              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1677                      .dwattr $C$DW$T$42, DW_AT_name("ADCINTOVF_BITS")
    1678                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1679              $C$DW$142       .dwtag  DW_TAG_member
    1680                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1681                      .dwattr $C$DW$142, DW_AT_name("ADCINT1")
    1682                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ADCINT1")
    1683                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0f)
    1684                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1685                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1686                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1687              
    1688              $C$DW$143       .dwtag  DW_TAG_member
    1689                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1690                      .dwattr $C$DW$143, DW_AT_name("ADCINT2")
    1691                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ADCINT2")
    1692                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0e)
    1693                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1694                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1695                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1696              
    1697              $C$DW$144       .dwtag  DW_TAG_member
    1698                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1699                      .dwattr $C$DW$144, DW_AT_name("ADCINT3")
    1700                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_ADCINT3")
    1701                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0d)
    1702                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1703                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1705              
    1706              $C$DW$145       .dwtag  DW_TAG_member
    1707                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1708                      .dwattr $C$DW$145, DW_AT_name("ADCINT4")
    1709                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCINT4")
    1710                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0c)
    1711                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1712                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1713                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1714              
    1715              $C$DW$146       .dwtag  DW_TAG_member
    1716                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1717                      .dwattr $C$DW$146, DW_AT_name("rsvd1")
    1718                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd1")
    1719                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    1720                      .dwattr $C$DW$146, DW_AT_bit_size(0x0c)
    1721                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   33

    1722                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1723              
    1724                      .dwendtag $C$DW$T$42
    1725              
    1726              
    1727              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1728                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTOVF_REG")
    1729                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1730              $C$DW$147       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1732                      .dwattr $C$DW$147, DW_AT_name("all")
    1733                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_all")
    1734                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1736              
    1737              $C$DW$148       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$42)
    1739                      .dwattr $C$DW$148, DW_AT_name("bit")
    1740                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_bit")
    1741                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1742                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1743              
    1744                      .dwendtag $C$DW$T$43
    1745              
    1746              
    1747              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1748                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTSEL1N2_BITS")
    1749                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1750              $C$DW$149       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1752                      .dwattr $C$DW$149, DW_AT_name("INT1SEL")
    1753                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_INT1SEL")
    1754                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0c)
    1755                      .dwattr $C$DW$149, DW_AT_bit_size(0x04)
    1756                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1758              
    1759              $C$DW$150       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1761                      .dwattr $C$DW$150, DW_AT_name("rsvd1")
    1762                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd1")
    1763                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0b)
    1764                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1765                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1766                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1767              
    1768              $C$DW$151       .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1770                      .dwattr $C$DW$151, DW_AT_name("INT1E")
    1771                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_INT1E")
    1772                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0a)
    1773                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1774                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1775                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1776              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:46 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   34

    1777              $C$DW$152       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1779                      .dwattr $C$DW$152, DW_AT_name("INT1CONT")
    1780                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_INT1CONT")
    1781                      .dwattr $C$DW$152, DW_AT_bit_offset(0x09)
    1782                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1783                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1784                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
