TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Nov 18 21:47:50 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v210/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("PIE_RESERVED_ISR")

    1506                      .global _EQEP1_ISR
    1507                      .global _EQEP2_ISR
    1508                      .global _EQEP3_ISR
    1509                      .global _SPIA_RX_ISR
    1510                      .global _SPIA_TX_ISR
    1511                      .global _SPIB_RX_ISR
    1512                      .global _SPIB_TX_ISR
    1513                      .global _MCBSPA_RX_ISR
    1514                      .global _MCBSPA_TX_ISR
    1515                      .global _MCBSPB_RX_ISR
    1516                      .global _MCBSPB_TX_ISR
    1517                      .global _DMA_CH1_ISR
    1518                      .global _DMA_CH2_ISR
    1519                      .global _DMA_CH3_ISR
    1520                      .global _DMA_CH4_ISR
    1521                      .global _DMA_CH5_ISR
    1522                      .global _DMA_CH6_ISR
    1523                      .global _I2CA_ISR
    1524                      .global _I2CA_FIFO_ISR
    1525                      .global _I2CB_ISR
    1526                      .global _I2CB_FIFO_ISR
    1527                      .global _SCIC_RX_ISR
    1528                      .global _SCIC_TX_ISR
    1529                      .global _SCID_RX_ISR
    1530                      .global _SCID_TX_ISR
    1531                      .global _SCIA_RX_ISR
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   33

    1532                      .global _SCIA_TX_ISR
    1533                      .global _SCIB_RX_ISR
    1534                      .global _SCIB_TX_ISR
    1535                      .global _CANA0_ISR
    1536                      .global _CANA1_ISR
    1537                      .global _CANB0_ISR
    1538                      .global _CANB1_ISR
    1539                      .global _ADCA_EVT_ISR
    1540                      .global _ADCA2_ISR
    1541                      .global _ADCA3_ISR
    1542                      .global _ADCA4_ISR
    1543                      .global _ADCB_EVT_ISR
    1544                      .global _ADCB2_ISR
    1545                      .global _ADCB3_ISR
    1546                      .global _ADCB4_ISR
    1547                      .global _CLA1_1_ISR
    1548                      .global _CLA1_2_ISR
    1549                      .global _CLA1_3_ISR
    1550                      .global _CLA1_4_ISR
    1551                      .global _CLA1_5_ISR
    1552                      .global _CLA1_6_ISR
    1553                      .global _CLA1_7_ISR
    1554                      .global _CLA1_8_ISR
    1555                      .global _XINT3_ISR
    1556                      .global _XINT4_ISR
    1557                      .global _XINT5_ISR
    1558                      .global _VCU_ISR
    1559                      .global _FPU_OVERFLOW_ISR
    1560                      .global _FPU_UNDERFLOW_ISR
    1561                      .global _IPC0_ISR
    1562                      .global _IPC1_ISR
    1563                      .global _IPC2_ISR
    1564                      .global _IPC3_ISR
    1565                      .global _EPWM9_TZ_ISR
    1566                      .global _EPWM10_TZ_ISR
    1567                      .global _EPWM11_TZ_ISR
    1568                      .global _EPWM12_TZ_ISR
    1569                      .global _EPWM9_ISR
    1570                      .global _EPWM10_ISR
    1571                      .global _EPWM11_ISR
    1572                      .global _EPWM12_ISR
    1573                      .global _SD1_ISR
    1574                      .global _SD2_ISR
    1575                      .global _SPIC_RX_ISR
    1576                      .global _SPIC_TX_ISR
    1577                      .global _UPPA_ISR
    1578                      .global _USBA_ISR
    1579                      .global _ADCC_EVT_ISR
    1580                      .global _ADCC2_ISR
    1581                      .global _ADCC3_ISR
    1582                      .global _ADCC4_ISR
    1583                      .global _ADCD_EVT_ISR
    1584                      .global _ADCD2_ISR
    1585                      .global _ADCD3_ISR
    1586                      .global _ADCD4_ISR
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   34

    1587                      .global _EMIF_ERROR_ISR
    1588                      .global _RAM_CORRECTABLE_ERROR_ISR
    1589                      .global _FLASH_CORRECTABLE_ERROR_ISR
    1590                      .global _RAM_ACCESS_VIOLATION_ISR
    1591                      .global _SYS_PLL_SLIP_ISR
    1592                      .global _AUX_PLL_SLIP_ISR
    1593                      .global _CLA_OVERFLOW_ISR
    1594                      .global _CLA_UNDERFLOW_ISR
    1595                      .global _PieCtrlRegs
    1596                      .global _PieVectTable
    1597              
    1598              ;***************************************************************
    1599              ;* TYPE INFORMATION                                            *
    1600              ;***************************************************************
    1601              
    1602              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1603                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
    1604                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1605              $C$DW$147       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1607                      .dwattr $C$DW$147, DW_AT_name("ACK1")
    1608                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ACK1")
    1609                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0f)
    1610                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1611                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1613              
    1614              $C$DW$148       .dwtag  DW_TAG_member
    1615                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1616                      .dwattr $C$DW$148, DW_AT_name("ACK2")
    1617                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ACK2")
    1618                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0e)
    1619                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1620                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1621                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1622              
    1623              $C$DW$149       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1625                      .dwattr $C$DW$149, DW_AT_name("ACK3")
    1626                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ACK3")
    1627                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0d)
    1628                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1629                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1630                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1631              
    1632              $C$DW$150       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1634                      .dwattr $C$DW$150, DW_AT_name("ACK4")
    1635                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ACK4")
    1636                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0c)
    1637                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1638                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1639                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1640              
    1641              $C$DW$151       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   35

    1642                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1643                      .dwattr $C$DW$151, DW_AT_name("ACK5")
    1644                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ACK5")
    1645                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0b)
    1646                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1647                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1649              
    1650              $C$DW$152       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1652                      .dwattr $C$DW$152, DW_AT_name("ACK6")
    1653                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ACK6")
    1654                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0a)
    1655                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1656                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1657                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1658              
    1659              $C$DW$153       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1661                      .dwattr $C$DW$153, DW_AT_name("ACK7")
    1662                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ACK7")
    1663                      .dwattr $C$DW$153, DW_AT_bit_offset(0x09)
    1664                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1665                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1666                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1667              
    1668              $C$DW$154       .dwtag  DW_TAG_member
    1669                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1670                      .dwattr $C$DW$154, DW_AT_name("ACK8")
    1671                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ACK8")
    1672                      .dwattr $C$DW$154, DW_AT_bit_offset(0x08)
    1673                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1674                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1675                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1676              
    1677              $C$DW$155       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1679                      .dwattr $C$DW$155, DW_AT_name("ACK9")
    1680                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ACK9")
    1681                      .dwattr $C$DW$155, DW_AT_bit_offset(0x07)
    1682                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1683                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1685              
    1686              $C$DW$156       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1688                      .dwattr $C$DW$156, DW_AT_name("ACK10")
    1689                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ACK10")
    1690                      .dwattr $C$DW$156, DW_AT_bit_offset(0x06)
    1691                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1692                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1693                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1694              
    1695              $C$DW$157       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   36

    1697                      .dwattr $C$DW$157, DW_AT_name("ACK11")
    1698                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ACK11")
    1699                      .dwattr $C$DW$157, DW_AT_bit_offset(0x05)
    1700                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1701                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1702                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1703              
    1704              $C$DW$158       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1706                      .dwattr $C$DW$158, DW_AT_name("ACK12")
    1707                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ACK12")
    1708                      .dwattr $C$DW$158, DW_AT_bit_offset(0x04)
    1709                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    1710                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1711                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1712              
    1713              $C$DW$159       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1715                      .dwattr $C$DW$159, DW_AT_name("rsvd1")
    1716                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd1")
    1717                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00)
    1718                      .dwattr $C$DW$159, DW_AT_bit_size(0x04)
    1719                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1720                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1721              
    1722                      .dwendtag $C$DW$T$20
    1723              
    1724              
    1725              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1726                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
    1727                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1728              $C$DW$160       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1730                      .dwattr $C$DW$160, DW_AT_name("all")
    1731                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_all")
    1732                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1733                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1734              
    1735              $C$DW$161       .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    1737                      .dwattr $C$DW$161, DW_AT_name("bit")
    1738                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_bit")
    1739                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1740                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1741              
    1742                      .dwendtag $C$DW$T$21
    1743              
    1744              
    1745              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1746                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
    1747                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1748              $C$DW$162       .dwtag  DW_TAG_member
    1749                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1750                      .dwattr $C$DW$162, DW_AT_name("ENPIE")
    1751                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_ENPIE")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   37

    1752                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0f)
    1753                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    1754                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1755                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1756              
    1757              $C$DW$163       .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1759                      .dwattr $C$DW$163, DW_AT_name("PIEVECT")
    1760                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PIEVECT")
    1761                      .dwattr $C$DW$163, DW_AT_bit_offset(0x00)
    1762                      .dwattr $C$DW$163, DW_AT_bit_size(0x0f)
    1763                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1764                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1765              
    1766                      .dwendtag $C$DW$T$22
    1767              
    1768              
    1769              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1770                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
    1771                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1772              $C$DW$164       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1774                      .dwattr $C$DW$164, DW_AT_name("all")
    1775                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_all")
    1776                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1777                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1778              
    1779              $C$DW$165       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$22)
    1781                      .dwattr $C$DW$165, DW_AT_name("bit")
    1782                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_bit")
    1783                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1784                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1785              
    1786                      .dwendtag $C$DW$T$23
    1787              
    1788              
    1789              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1790                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER10_BITS")
    1791                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1792              $C$DW$166       .dwtag  DW_TAG_member
    1793                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1794                      .dwattr $C$DW$166, DW_AT_name("INTx1")
    1795                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_INTx1")
    1796                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0f)
    1797                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    1798                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1799                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1800              
    1801              $C$DW$167       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1803                      .dwattr $C$DW$167, DW_AT_name("INTx2")
    1804                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_INTx2")
    1805                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0e)
    1806                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   38

    1807                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1808                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1809              
    1810              $C$DW$168       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1812                      .dwattr $C$DW$168, DW_AT_name("INTx3")
    1813                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_INTx3")
    1814                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0d)
    1815                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    1816                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1817                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1818              
    1819              $C$DW$169       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1821                      .dwattr $C$DW$169, DW_AT_name("INTx4")
    1822                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_INTx4")
    1823                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0c)
    1824                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    1825                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1826                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1827              
    1828              $C$DW$170       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1830                      .dwattr $C$DW$170, DW_AT_name("INTx5")
    1831                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_INTx5")
    1832                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0b)
    1833                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    1834                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1835                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1836              
    1837              $C$DW$171       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1839                      .dwattr $C$DW$171, DW_AT_name("INTx6")
    1840                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_INTx6")
    1841                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0a)
    1842                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    1843                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1844                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1845              
    1846              $C$DW$172       .dwtag  DW_TAG_member
    1847                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1848                      .dwattr $C$DW$172, DW_AT_name("INTx7")
    1849                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_INTx7")
    1850                      .dwattr $C$DW$172, DW_AT_bit_offset(0x09)
    1851                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    1852                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1853                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1854              
    1855              $C$DW$173       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1857                      .dwattr $C$DW$173, DW_AT_name("INTx8")
    1858                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_INTx8")
    1859                      .dwattr $C$DW$173, DW_AT_bit_offset(0x08)
    1860                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    1861                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   39

    1862                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1863              
    1864              $C$DW$174       .dwtag  DW_TAG_member
    1865                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1866                      .dwattr $C$DW$174, DW_AT_name("INTx9")
    1867                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_INTx9")
    1868                      .dwattr $C$DW$174, DW_AT_bit_offset(0x07)
    1869                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    1870                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1871                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1872              
    1873              $C$DW$175       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1875                      .dwattr $C$DW$175, DW_AT_name("INTx10")
    1876                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_INTx10")
    1877                      .dwattr $C$DW$175, DW_AT_bit_offset(0x06)
    1878                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    1879                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1880                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1881              
    1882              $C$DW$176       .dwtag  DW_TAG_member
    1883                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1884                      .dwattr $C$DW$176, DW_AT_name("INTx11")
    1885                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_INTx11")
    1886                      .dwattr $C$DW$176, DW_AT_bit_offset(0x05)
    1887                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    1888                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1889                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1890              
    1891              $C$DW$177       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1893                      .dwattr $C$DW$177, DW_AT_name("INTx12")
    1894                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_INTx12")
    1895                      .dwattr $C$DW$177, DW_AT_bit_offset(0x04)
    1896                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    1897                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1899              
    1900              $C$DW$178       .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1902                      .dwattr $C$DW$178, DW_AT_name("INTx13")
    1903                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_INTx13")
    1904                      .dwattr $C$DW$178, DW_AT_bit_offset(0x03)
    1905                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    1906                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1907                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1908              
    1909              $C$DW$179       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1911                      .dwattr $C$DW$179, DW_AT_name("INTx14")
    1912                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_INTx14")
    1913                      .dwattr $C$DW$179, DW_AT_bit_offset(0x02)
    1914                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    1915                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1916                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   40

    1917              
    1918              $C$DW$180       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1920                      .dwattr $C$DW$180, DW_AT_name("INTx15")
    1921                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_INTx15")
    1922                      .dwattr $C$DW$180, DW_AT_bit_offset(0x01)
    1923                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    1924                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1925                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1926              
    1927              $C$DW$181       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1929                      .dwattr $C$DW$181, DW_AT_name("INTx16")
    1930                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_INTx16")
    1931                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00)
    1932                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    1933                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1934                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1935              
    1936                      .dwendtag $C$DW$T$24
    1937              
    1938              
    1939              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1940                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER10_REG")
    1941                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1942              $C$DW$182       .dwtag  DW_TAG_member
    1943                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1944                      .dwattr $C$DW$182, DW_AT_name("all")
    1945                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_all")
    1946                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1947                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1948              
    1949              $C$DW$183       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$24)
    1951                      .dwattr $C$DW$183, DW_AT_name("bit")
    1952                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_bit")
    1953                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1955              
    1956                      .dwendtag $C$DW$T$25
    1957              
    1958              
    1959              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1960                      .dwattr $C$DW$T$26, DW_AT_name("PIEIER11_BITS")
    1961                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1962              $C$DW$184       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1964                      .dwattr $C$DW$184, DW_AT_name("INTx1")
    1965                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_INTx1")
    1966                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0f)
    1967                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    1968                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1969                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1970              
    1971              $C$DW$185       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   41

    1972                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1973                      .dwattr $C$DW$185, DW_AT_name("INTx2")
    1974                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_INTx2")
    1975                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0e)
    1976                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    1977                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1978                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1979              
    1980              $C$DW$186       .dwtag  DW_TAG_member
    1981                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1982                      .dwattr $C$DW$186, DW_AT_name("INTx3")
    1983                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_INTx3")
    1984                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0d)
    1985                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    1986                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1987                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1988              
    1989              $C$DW$187       .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1991                      .dwattr $C$DW$187, DW_AT_name("INTx4")
    1992                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_INTx4")
    1993                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0c)
    1994                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    1995                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1996                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1997              
    1998              $C$DW$188       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2000                      .dwattr $C$DW$188, DW_AT_name("INTx5")
    2001                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_INTx5")
    2002                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0b)
    2003                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2004                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2005                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2006              
    2007              $C$DW$189       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2009                      .dwattr $C$DW$189, DW_AT_name("INTx6")
    2010                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_INTx6")
    2011                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0a)
    2012                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2013                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2014                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2015              
    2016              $C$DW$190       .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2018                      .dwattr $C$DW$190, DW_AT_name("INTx7")
    2019                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_INTx7")
    2020                      .dwattr $C$DW$190, DW_AT_bit_offset(0x09)
    2021                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2022                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2023                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2024              
    2025              $C$DW$191       .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   42

    2027                      .dwattr $C$DW$191, DW_AT_name("INTx8")
    2028                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_INTx8")
    2029                      .dwattr $C$DW$191, DW_AT_bit_offset(0x08)
    2030                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2031                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2032                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2033              
    2034              $C$DW$192       .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2036                      .dwattr $C$DW$192, DW_AT_name("INTx9")
    2037                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_INTx9")
    2038                      .dwattr $C$DW$192, DW_AT_bit_offset(0x07)
    2039                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2040                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2041                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2042              
    2043              $C$DW$193       .dwtag  DW_TAG_member
    2044                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2045                      .dwattr $C$DW$193, DW_AT_name("INTx10")
    2046                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_INTx10")
    2047                      .dwattr $C$DW$193, DW_AT_bit_offset(0x06)
    2048                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2049                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2050                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2051              
    2052              $C$DW$194       .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2054                      .dwattr $C$DW$194, DW_AT_name("INTx11")
    2055                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_INTx11")
    2056                      .dwattr $C$DW$194, DW_AT_bit_offset(0x05)
    2057                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2058                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2059                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2060              
    2061              $C$DW$195       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2063                      .dwattr $C$DW$195, DW_AT_name("INTx12")
    2064                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_INTx12")
    2065                      .dwattr $C$DW$195, DW_AT_bit_offset(0x04)
    2066                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2067                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2068                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2069              
    2070              $C$DW$196       .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2072                      .dwattr $C$DW$196, DW_AT_name("INTx13")
    2073                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_INTx13")
    2074                      .dwattr $C$DW$196, DW_AT_bit_offset(0x03)
    2075                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2076                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2077                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2078              
    2079              $C$DW$197       .dwtag  DW_TAG_member
    2080                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2081                      .dwattr $C$DW$197, DW_AT_name("INTx14")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   43

    2082                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_INTx14")
    2083                      .dwattr $C$DW$197, DW_AT_bit_offset(0x02)
    2084                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2085                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2086                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2087              
    2088              $C$DW$198       .dwtag  DW_TAG_member
    2089                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2090                      .dwattr $C$DW$198, DW_AT_name("INTx15")
    2091                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_INTx15")
    2092                      .dwattr $C$DW$198, DW_AT_bit_offset(0x01)
    2093                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2094                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2095                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2096              
    2097              $C$DW$199       .dwtag  DW_TAG_member
    2098                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2099                      .dwattr $C$DW$199, DW_AT_name("INTx16")
    2100                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_INTx16")
    2101                      .dwattr $C$DW$199, DW_AT_bit_offset(0x00)
    2102                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2103                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2104                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2105              
    2106                      .dwendtag $C$DW$T$26
    2107              
    2108              
    2109              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2110                      .dwattr $C$DW$T$27, DW_AT_name("PIEIER11_REG")
    2111                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2112              $C$DW$200       .dwtag  DW_TAG_member
    2113                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2114                      .dwattr $C$DW$200, DW_AT_name("all")
    2115                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_all")
    2116                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2117                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2118              
    2119              $C$DW$201       .dwtag  DW_TAG_member
    2120                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$26)
    2121                      .dwattr $C$DW$201, DW_AT_name("bit")
    2122                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_bit")
    2123                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2124                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2125              
    2126                      .dwendtag $C$DW$T$27
    2127              
    2128              
    2129              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2130                      .dwattr $C$DW$T$28, DW_AT_name("PIEIER12_BITS")
    2131                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2132              $C$DW$202       .dwtag  DW_TAG_member
    2133                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2134                      .dwattr $C$DW$202, DW_AT_name("INTx1")
    2135                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_INTx1")
    2136                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   44

    2137                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2138                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2139                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2140              
    2141              $C$DW$203       .dwtag  DW_TAG_member
    2142                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2143                      .dwattr $C$DW$203, DW_AT_name("INTx2")
    2144                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_INTx2")
    2145                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0e)
    2146                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2147                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2148                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2149              
    2150              $C$DW$204       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2152                      .dwattr $C$DW$204, DW_AT_name("INTx3")
    2153                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_INTx3")
    2154                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0d)
    2155                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2156                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2157                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2158              
    2159              $C$DW$205       .dwtag  DW_TAG_member
    2160                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2161                      .dwattr $C$DW$205, DW_AT_name("INTx4")
    2162                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_INTx4")
    2163                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0c)
    2164                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2165                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2166                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2167              
    2168              $C$DW$206       .dwtag  DW_TAG_member
    2169                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2170                      .dwattr $C$DW$206, DW_AT_name("INTx5")
    2171                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_INTx5")
    2172                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0b)
    2173                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2174                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2175                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2176              
    2177              $C$DW$207       .dwtag  DW_TAG_member
    2178                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2179                      .dwattr $C$DW$207, DW_AT_name("INTx6")
    2180                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_INTx6")
    2181                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0a)
    2182                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2183                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2184                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2185              
    2186              $C$DW$208       .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2188                      .dwattr $C$DW$208, DW_AT_name("INTx7")
    2189                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_INTx7")
    2190                      .dwattr $C$DW$208, DW_AT_bit_offset(0x09)
    2191                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   45

    2192                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2193                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2194              
    2195              $C$DW$209       .dwtag  DW_TAG_member
    2196                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2197                      .dwattr $C$DW$209, DW_AT_name("INTx8")
    2198                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_INTx8")
    2199                      .dwattr $C$DW$209, DW_AT_bit_offset(0x08)
    2200                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2201                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2202                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2203              
    2204              $C$DW$210       .dwtag  DW_TAG_member
    2205                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2206                      .dwattr $C$DW$210, DW_AT_name("INTx9")
    2207                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_INTx9")
    2208                      .dwattr $C$DW$210, DW_AT_bit_offset(0x07)
    2209                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2210                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2211                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2212              
    2213              $C$DW$211       .dwtag  DW_TAG_member
    2214                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2215                      .dwattr $C$DW$211, DW_AT_name("INTx10")
    2216                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_INTx10")
    2217                      .dwattr $C$DW$211, DW_AT_bit_offset(0x06)
    2218                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2219                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2221              
    2222              $C$DW$212       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2224                      .dwattr $C$DW$212, DW_AT_name("INTx11")
    2225                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_INTx11")
    2226                      .dwattr $C$DW$212, DW_AT_bit_offset(0x05)
    2227                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    2228                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2230              
    2231              $C$DW$213       .dwtag  DW_TAG_member
    2232                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2233                      .dwattr $C$DW$213, DW_AT_name("INTx12")
    2234                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_INTx12")
    2235                      .dwattr $C$DW$213, DW_AT_bit_offset(0x04)
    2236                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2237                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2238                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2239              
    2240              $C$DW$214       .dwtag  DW_TAG_member
    2241                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2242                      .dwattr $C$DW$214, DW_AT_name("INTx13")
    2243                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_INTx13")
    2244                      .dwattr $C$DW$214, DW_AT_bit_offset(0x03)
    2245                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    2246                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   46

    2247                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2248              
    2249              $C$DW$215       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2251                      .dwattr $C$DW$215, DW_AT_name("INTx14")
    2252                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_INTx14")
    2253                      .dwattr $C$DW$215, DW_AT_bit_offset(0x02)
    2254                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    2255                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2256                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2257              
    2258              $C$DW$216       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2260                      .dwattr $C$DW$216, DW_AT_name("INTx15")
    2261                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_INTx15")
    2262                      .dwattr $C$DW$216, DW_AT_bit_offset(0x01)
    2263                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    2264                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2265                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2266              
    2267              $C$DW$217       .dwtag  DW_TAG_member
    2268                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2269                      .dwattr $C$DW$217, DW_AT_name("INTx16")
    2270                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_INTx16")
    2271                      .dwattr $C$DW$217, DW_AT_bit_offset(0x00)
    2272                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    2273                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2274                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2275              
    2276                      .dwendtag $C$DW$T$28
    2277              
    2278              
    2279              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2280                      .dwattr $C$DW$T$29, DW_AT_name("PIEIER12_REG")
    2281                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2282              $C$DW$218       .dwtag  DW_TAG_member
    2283                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2284                      .dwattr $C$DW$218, DW_AT_name("all")
    2285                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_all")
    2286                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2288              
    2289              $C$DW$219       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$28)
    2291                      .dwattr $C$DW$219, DW_AT_name("bit")
    2292                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_bit")
    2293                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2294                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2295              
    2296                      .dwendtag $C$DW$T$29
    2297              
    2298              
    2299              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2300                      .dwattr $C$DW$T$30, DW_AT_name("PIEIER1_BITS")
    2301                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   47

    2302              $C$DW$220       .dwtag  DW_TAG_member
    2303                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2304                      .dwattr $C$DW$220, DW_AT_name("INTx1")
    2305                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_INTx1")
    2306                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0f)
    2307                      .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    2308                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2309                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2310              
    2311              $C$DW$221       .dwtag  DW_TAG_member
    2312                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2313                      .dwattr $C$DW$221, DW_AT_name("INTx2")
    2314                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_INTx2")
    2315                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0e)
    2316                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    2317                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2318                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2319              
    2320              $C$DW$222       .dwtag  DW_TAG_member
    2321                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2322                      .dwattr $C$DW$222, DW_AT_name("INTx3")
    2323                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_INTx3")
    2324                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0d)
    2325                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    2326                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2327                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2328              
    2329              $C$DW$223       .dwtag  DW_TAG_member
    2330                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2331                      .dwattr $C$DW$223, DW_AT_name("INTx4")
    2332                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_INTx4")
    2333                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0c)
    2334                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    2335                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2336                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2337              
    2338              $C$DW$224       .dwtag  DW_TAG_member
    2339                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2340                      .dwattr $C$DW$224, DW_AT_name("INTx5")
    2341                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_INTx5")
    2342                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0b)
    2343                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    2344                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2345                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2346              
    2347              $C$DW$225       .dwtag  DW_TAG_member
    2348                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2349                      .dwattr $C$DW$225, DW_AT_name("INTx6")
    2350                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_INTx6")
    2351                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0a)
    2352                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    2353                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2354                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2355              
    2356              $C$DW$226       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   48

    2357                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2358                      .dwattr $C$DW$226, DW_AT_name("INTx7")
    2359                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_INTx7")
    2360                      .dwattr $C$DW$226, DW_AT_bit_offset(0x09)
    2361                      .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    2362                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2363                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2364              
    2365              $C$DW$227       .dwtag  DW_TAG_member
    2366                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    2367                      .dwattr $C$DW$227, DW_AT_name("INTx8")
    2368                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_INTx8")
    2369                      .dwattr $C$DW$227, DW_AT_bit_offset(0x08)
    2370                      .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    2371                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2372                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2373              
    2374              $C$DW$228       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2376                      .dwattr $C$DW$228, DW_AT_name("INTx9")
    2377                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_INTx9")
    2378                      .dwattr $C$DW$228, DW_AT_bit_offset(0x07)
    2379                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    2380                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2381                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2382              
    2383              $C$DW$229       .dwtag  DW_TAG_member
    2384                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2385                      .dwattr $C$DW$229, DW_AT_name("INTx10")
    2386                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_INTx10")
    2387                      .dwattr $C$DW$229, DW_AT_bit_offset(0x06)
    2388                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    2389                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2390                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2391              
    2392              $C$DW$230       .dwtag  DW_TAG_member
    2393                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    2394                      .dwattr $C$DW$230, DW_AT_name("INTx11")
    2395                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_INTx11")
    2396                      .dwattr $C$DW$230, DW_AT_bit_offset(0x05)
    2397                      .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    2398                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2399                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2400              
    2401              $C$DW$231       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2403                      .dwattr $C$DW$231, DW_AT_name("INTx12")
    2404                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_INTx12")
    2405                      .dwattr $C$DW$231, DW_AT_bit_offset(0x04)
    2406                      .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    2407                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2409              
    2410              $C$DW$232       .dwtag  DW_TAG_member
    2411                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   49

    2412                      .dwattr $C$DW$232, DW_AT_name("INTx13")
    2413                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_INTx13")
    2414                      .dwattr $C$DW$232, DW_AT_bit_offset(0x03)
    2415                      .dwattr $C$DW$232, DW_AT_bit_size(0x01)
    2416                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2418              
    2419              $C$DW$233       .dwtag  DW_TAG_member
    2420                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    2421                      .dwattr $C$DW$233, DW_AT_name("INTx14")
    2422                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_INTx14")
    2423                      .dwattr $C$DW$233, DW_AT_bit_offset(0x02)
    2424                      .dwattr $C$DW$233, DW_AT_bit_size(0x01)
    2425                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2426                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2427              
    2428              $C$DW$234       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    2430                      .dwattr $C$DW$234, DW_AT_name("INTx15")
    2431                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_INTx15")
    2432                      .dwattr $C$DW$234, DW_AT_bit_offset(0x01)
    2433                      .dwattr $C$DW$234, DW_AT_bit_size(0x01)
    2434                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2435                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2436              
    2437              $C$DW$235       .dwtag  DW_TAG_member
    2438                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    2439                      .dwattr $C$DW$235, DW_AT_name("INTx16")
    2440                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_INTx16")
    2441                      .dwattr $C$DW$235, DW_AT_bit_offset(0x00)
    2442                      .dwattr $C$DW$235, DW_AT_bit_size(0x01)
    2443                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2444                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2445              
    2446                      .dwendtag $C$DW$T$30
    2447              
    2448              
    2449              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2450                      .dwattr $C$DW$T$31, DW_AT_name("PIEIER1_REG")
    2451                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2452              $C$DW$236       .dwtag  DW_TAG_member
    2453                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    2454                      .dwattr $C$DW$236, DW_AT_name("all")
    2455                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_all")
    2456                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2457                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2458              
    2459              $C$DW$237       .dwtag  DW_TAG_member
    2460                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$30)
    2461                      .dwattr $C$DW$237, DW_AT_name("bit")
    2462                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_bit")
    2463                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2464                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2465              
    2466                      .dwendtag $C$DW$T$31
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   50

    2467              
    2468              
    2469              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2470                      .dwattr $C$DW$T$32, DW_AT_name("PIEIER2_BITS")
    2471                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2472              $C$DW$238       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    2474                      .dwattr $C$DW$238, DW_AT_name("INTx1")
    2475                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_INTx1")
    2476                      .dwattr $C$DW$238, DW_AT_bit_offset(0x0f)
    2477                      .dwattr $C$DW$238, DW_AT_bit_size(0x01)
    2478                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2479                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2480              
    2481              $C$DW$239       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    2483                      .dwattr $C$DW$239, DW_AT_name("INTx2")
    2484                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_INTx2")
    2485                      .dwattr $C$DW$239, DW_AT_bit_offset(0x0e)
    2486                      .dwattr $C$DW$239, DW_AT_bit_size(0x01)
    2487                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2488                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2489              
    2490              $C$DW$240       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    2492                      .dwattr $C$DW$240, DW_AT_name("INTx3")
    2493                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_INTx3")
    2494                      .dwattr $C$DW$240, DW_AT_bit_offset(0x0d)
    2495                      .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    2496                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2497                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2498              
    2499              $C$DW$241       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    2501                      .dwattr $C$DW$241, DW_AT_name("INTx4")
    2502                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_INTx4")
    2503                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0c)
    2504                      .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    2505                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2506                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2507              
    2508              $C$DW$242       .dwtag  DW_TAG_member
    2509                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    2510                      .dwattr $C$DW$242, DW_AT_name("INTx5")
    2511                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_INTx5")
    2512                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0b)
    2513                      .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    2514                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2515                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2516              
    2517              $C$DW$243       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2519                      .dwattr $C$DW$243, DW_AT_name("INTx6")
    2520                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_INTx6")
    2521                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   51

    2522                      .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    2523                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2524                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2525              
    2526              $C$DW$244       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2528                      .dwattr $C$DW$244, DW_AT_name("INTx7")
    2529                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_INTx7")
    2530                      .dwattr $C$DW$244, DW_AT_bit_offset(0x09)
    2531                      .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    2532                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2533                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2534              
    2535              $C$DW$245       .dwtag  DW_TAG_member
    2536                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2537                      .dwattr $C$DW$245, DW_AT_name("INTx8")
    2538                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_INTx8")
    2539                      .dwattr $C$DW$245, DW_AT_bit_offset(0x08)
    2540                      .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    2541                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2542                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2543              
    2544              $C$DW$246       .dwtag  DW_TAG_member
    2545                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    2546                      .dwattr $C$DW$246, DW_AT_name("INTx9")
    2547                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_INTx9")
    2548                      .dwattr $C$DW$246, DW_AT_bit_offset(0x07)
    2549                      .dwattr $C$DW$246, DW_AT_bit_size(0x01)
    2550                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2551                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2552              
    2553              $C$DW$247       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    2555                      .dwattr $C$DW$247, DW_AT_name("INTx10")
    2556                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_INTx10")
    2557                      .dwattr $C$DW$247, DW_AT_bit_offset(0x06)
    2558                      .dwattr $C$DW$247, DW_AT_bit_size(0x01)
    2559                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2560                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2561              
    2562              $C$DW$248       .dwtag  DW_TAG_member
    2563                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    2564                      .dwattr $C$DW$248, DW_AT_name("INTx11")
    2565                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_INTx11")
    2566                      .dwattr $C$DW$248, DW_AT_bit_offset(0x05)
    2567                      .dwattr $C$DW$248, DW_AT_bit_size(0x01)
    2568                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2569                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2570              
    2571              $C$DW$249       .dwtag  DW_TAG_member
    2572                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    2573                      .dwattr $C$DW$249, DW_AT_name("INTx12")
    2574                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_INTx12")
    2575                      .dwattr $C$DW$249, DW_AT_bit_offset(0x04)
    2576                      .dwattr $C$DW$249, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   52

    2577                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2578                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2579              
    2580              $C$DW$250       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    2582                      .dwattr $C$DW$250, DW_AT_name("INTx13")
    2583                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_INTx13")
    2584                      .dwattr $C$DW$250, DW_AT_bit_offset(0x03)
    2585                      .dwattr $C$DW$250, DW_AT_bit_size(0x01)
    2586                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2587                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2588              
    2589              $C$DW$251       .dwtag  DW_TAG_member
    2590                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    2591                      .dwattr $C$DW$251, DW_AT_name("INTx14")
    2592                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_INTx14")
    2593                      .dwattr $C$DW$251, DW_AT_bit_offset(0x02)
    2594                      .dwattr $C$DW$251, DW_AT_bit_size(0x01)
    2595                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2596                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2597              
    2598              $C$DW$252       .dwtag  DW_TAG_member
    2599                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    2600                      .dwattr $C$DW$252, DW_AT_name("INTx15")
    2601                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_INTx15")
    2602                      .dwattr $C$DW$252, DW_AT_bit_offset(0x01)
    2603                      .dwattr $C$DW$252, DW_AT_bit_size(0x01)
    2604                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2605                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2606              
    2607              $C$DW$253       .dwtag  DW_TAG_member
    2608                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    2609                      .dwattr $C$DW$253, DW_AT_name("INTx16")
    2610                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_INTx16")
    2611                      .dwattr $C$DW$253, DW_AT_bit_offset(0x00)
    2612                      .dwattr $C$DW$253, DW_AT_bit_size(0x01)
    2613                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2614                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2615              
    2616                      .dwendtag $C$DW$T$32
    2617              
    2618              
    2619              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2620                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER2_REG")
    2621                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2622              $C$DW$254       .dwtag  DW_TAG_member
    2623                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    2624                      .dwattr $C$DW$254, DW_AT_name("all")
    2625                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_all")
    2626                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2627                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2628              
    2629              $C$DW$255       .dwtag  DW_TAG_member
    2630                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$32)
    2631                      .dwattr $C$DW$255, DW_AT_name("bit")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   53

    2632                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_bit")
    2633                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2634                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2635              
    2636                      .dwendtag $C$DW$T$33
    2637              
    2638              
    2639              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2640                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER3_BITS")
    2641                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2642              $C$DW$256       .dwtag  DW_TAG_member
    2643                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    2644                      .dwattr $C$DW$256, DW_AT_name("INTx1")
    2645                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_INTx1")
    2646                      .dwattr $C$DW$256, DW_AT_bit_offset(0x0f)
    2647                      .dwattr $C$DW$256, DW_AT_bit_size(0x01)
    2648                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2649                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2650              
    2651              $C$DW$257       .dwtag  DW_TAG_member
    2652                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    2653                      .dwattr $C$DW$257, DW_AT_name("INTx2")
    2654                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_INTx2")
    2655                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0e)
    2656                      .dwattr $C$DW$257, DW_AT_bit_size(0x01)
    2657                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2658                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2659              
    2660              $C$DW$258       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    2662                      .dwattr $C$DW$258, DW_AT_name("INTx3")
    2663                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_INTx3")
    2664                      .dwattr $C$DW$258, DW_AT_bit_offset(0x0d)
    2665                      .dwattr $C$DW$258, DW_AT_bit_size(0x01)
    2666                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2667                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2668              
    2669              $C$DW$259       .dwtag  DW_TAG_member
    2670                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    2671                      .dwattr $C$DW$259, DW_AT_name("INTx4")
    2672                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_INTx4")
    2673                      .dwattr $C$DW$259, DW_AT_bit_offset(0x0c)
    2674                      .dwattr $C$DW$259, DW_AT_bit_size(0x01)
    2675                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2676                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2677              
    2678              $C$DW$260       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    2680                      .dwattr $C$DW$260, DW_AT_name("INTx5")
    2681                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_INTx5")
    2682                      .dwattr $C$DW$260, DW_AT_bit_offset(0x0b)
    2683                      .dwattr $C$DW$260, DW_AT_bit_size(0x01)
    2684                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2685                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2686              
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   54

    2687              $C$DW$261       .dwtag  DW_TAG_member
    2688                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    2689                      .dwattr $C$DW$261, DW_AT_name("INTx6")
    2690                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_INTx6")
    2691                      .dwattr $C$DW$261, DW_AT_bit_offset(0x0a)
    2692                      .dwattr $C$DW$261, DW_AT_bit_size(0x01)
    2693                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2694                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2695              
    2696              $C$DW$262       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    2698                      .dwattr $C$DW$262, DW_AT_name("INTx7")
    2699                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_INTx7")
    2700                      .dwattr $C$DW$262, DW_AT_bit_offset(0x09)
    2701                      .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    2702                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2703                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2704              
    2705              $C$DW$263       .dwtag  DW_TAG_member
    2706                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    2707                      .dwattr $C$DW$263, DW_AT_name("INTx8")
    2708                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_INTx8")
    2709                      .dwattr $C$DW$263, DW_AT_bit_offset(0x08)
    2710                      .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    2711                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2712                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2713              
    2714              $C$DW$264       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    2716                      .dwattr $C$DW$264, DW_AT_name("INTx9")
    2717                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_INTx9")
    2718                      .dwattr $C$DW$264, DW_AT_bit_offset(0x07)
    2719                      .dwattr $C$DW$264, DW_AT_bit_size(0x01)
    2720                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2721                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2722              
    2723              $C$DW$265       .dwtag  DW_TAG_member
    2724                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    2725                      .dwattr $C$DW$265, DW_AT_name("INTx10")
    2726                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_INTx10")
    2727                      .dwattr $C$DW$265, DW_AT_bit_offset(0x06)
    2728                      .dwattr $C$DW$265, DW_AT_bit_size(0x01)
    2729                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2730                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2731              
    2732              $C$DW$266       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    2734                      .dwattr $C$DW$266, DW_AT_name("INTx11")
    2735                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_INTx11")
    2736                      .dwattr $C$DW$266, DW_AT_bit_offset(0x05)
    2737                      .dwattr $C$DW$266, DW_AT_bit_size(0x01)
    2738                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2739                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2740              
    2741              $C$DW$267       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   55

    2742                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    2743                      .dwattr $C$DW$267, DW_AT_name("INTx12")
    2744                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_INTx12")
    2745                      .dwattr $C$DW$267, DW_AT_bit_offset(0x04)
    2746                      .dwattr $C$DW$267, DW_AT_bit_size(0x01)
    2747                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2748                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2749              
    2750              $C$DW$268       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    2752                      .dwattr $C$DW$268, DW_AT_name("INTx13")
    2753                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_INTx13")
    2754                      .dwattr $C$DW$268, DW_AT_bit_offset(0x03)
    2755                      .dwattr $C$DW$268, DW_AT_bit_size(0x01)
    2756                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2757                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2758              
    2759              $C$DW$269       .dwtag  DW_TAG_member
    2760                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    2761                      .dwattr $C$DW$269, DW_AT_name("INTx14")
    2762                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_INTx14")
    2763                      .dwattr $C$DW$269, DW_AT_bit_offset(0x02)
    2764                      .dwattr $C$DW$269, DW_AT_bit_size(0x01)
    2765                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2766                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2767              
    2768              $C$DW$270       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    2770                      .dwattr $C$DW$270, DW_AT_name("INTx15")
    2771                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_INTx15")
    2772                      .dwattr $C$DW$270, DW_AT_bit_offset(0x01)
    2773                      .dwattr $C$DW$270, DW_AT_bit_size(0x01)
    2774                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2775                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2776              
    2777              $C$DW$271       .dwtag  DW_TAG_member
    2778                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    2779                      .dwattr $C$DW$271, DW_AT_name("INTx16")
    2780                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_INTx16")
    2781                      .dwattr $C$DW$271, DW_AT_bit_offset(0x00)
    2782                      .dwattr $C$DW$271, DW_AT_bit_size(0x01)
    2783                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2784                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2785              
    2786                      .dwendtag $C$DW$T$34
    2787              
    2788              
    2789              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2790                      .dwattr $C$DW$T$35, DW_AT_name("PIEIER3_REG")
    2791                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2792              $C$DW$272       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    2794                      .dwattr $C$DW$272, DW_AT_name("all")
    2795                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_all")
    2796                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   56

    2797                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2798              
    2799              $C$DW$273       .dwtag  DW_TAG_member
    2800                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$34)
    2801                      .dwattr $C$DW$273, DW_AT_name("bit")
    2802                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_bit")
    2803                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2804                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2805              
    2806                      .dwendtag $C$DW$T$35
    2807              
    2808              
    2809              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2810                      .dwattr $C$DW$T$36, DW_AT_name("PIEIER4_BITS")
    2811                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2812              $C$DW$274       .dwtag  DW_TAG_member
    2813                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    2814                      .dwattr $C$DW$274, DW_AT_name("INTx1")
    2815                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_INTx1")
    2816                      .dwattr $C$DW$274, DW_AT_bit_offset(0x0f)
    2817                      .dwattr $C$DW$274, DW_AT_bit_size(0x01)
    2818                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2819                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2820              
    2821              $C$DW$275       .dwtag  DW_TAG_member
    2822                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    2823                      .dwattr $C$DW$275, DW_AT_name("INTx2")
    2824                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_INTx2")
    2825                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0e)
    2826                      .dwattr $C$DW$275, DW_AT_bit_size(0x01)
    2827                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2828                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2829              
    2830              $C$DW$276       .dwtag  DW_TAG_member
    2831                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    2832                      .dwattr $C$DW$276, DW_AT_name("INTx3")
    2833                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_INTx3")
    2834                      .dwattr $C$DW$276, DW_AT_bit_offset(0x0d)
    2835                      .dwattr $C$DW$276, DW_AT_bit_size(0x01)
    2836                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2837                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2838              
    2839              $C$DW$277       .dwtag  DW_TAG_member
    2840                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    2841                      .dwattr $C$DW$277, DW_AT_name("INTx4")
    2842                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_INTx4")
    2843                      .dwattr $C$DW$277, DW_AT_bit_offset(0x0c)
    2844                      .dwattr $C$DW$277, DW_AT_bit_size(0x01)
    2845                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2846                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2847              
    2848              $C$DW$278       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    2850                      .dwattr $C$DW$278, DW_AT_name("INTx5")
    2851                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_INTx5")
TMS320C2000 Assembler PC v20.2.1 Wed Nov 18 21:47:50 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   57

    2852                      .dwattr $C$DW$278, DW_AT_bit_offset(0x0b)
    2853                      .dwattr $C$DW$278, DW_AT_bit_size(0x01)
    2854                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2855                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2856              
    2857              $C$DW$279       .dwtag  DW_TAG_member
    2858                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    2859                      .dwattr $C$DW$279, DW_AT_name("INTx6")
    2860                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_INTx6")
    2861                      .dwattr $C$DW$279, DW_AT_bit_offset(0x0a)
    2862                      .dwattr $C$DW$279, DW_AT_bit_size(0x01)
    2863                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2864                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2865              
    2866              $C$DW$280       .dwtag  DW_TAG_member
    2867                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    2868                      .dwattr $C$DW$280, DW_AT_name("INTx7")
    2869                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_INTx7")
    2870                      .dwattr $C$DW$280, DW_AT_bit_offset(0x09)
    2871                      .dwattr $C$DW$280, DW_AT_bit_size(0x01)
    2872                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2873                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2874              
    2875              $C$DW$281       .dwtag  DW_TAG_member
    2876                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    2877                      .dwattr $C$DW$281, DW_AT_name("INTx8")
    2878                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_INTx8")
    2879                      .dwattr $C$DW$281, DW_AT_bit_offset(0x08)
    2880                      .dwattr $C$DW$281, DW_AT_bit_size(0x01)
    2881                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2882                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2883              
    2884              $C$DW$282       .dwtag  DW_TAG_member
    2885                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    2886                      .dwattr $C$DW$282, DW_AT_name("INTx9")
    2887                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_INTx9")
