;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
;* Date/Time created: Wed Nov 18 21:47:54 2020                 *
;***************************************************************
	.compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --quiet --silicon_errata_fpu1_workaround=off --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 --tmu_support=tmu0 --vcu_support=vcu2 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../sources/FCL_SFRA_XL_DualServo.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\admin\Documents\GitHub\fault_tolerant_drives\Software\MPC_WS\FCL_379XL\F2837x_RAM")
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_FCL_CNTLR+0,32
	.bits		0,16
			; _FCL_CNTLR @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_sfraTestLoop+0,32
	.bits		0,16
			; _sfraTestLoop @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_loadMotor+0,32
	.bits		0,16

	.dwpsn	file "../sources/FCL_SFRA_XL_DualServo.c",line 1929,column 5,is_stmt,isa 0
        MOV32     R0H,@$BLOCKED(_motor2)+274 ; [CPU_FPU] |1929| 
$C$DW$227	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$227, DW_AT_low_pc(0x00)
	.dwattr $C$DW$227, DW_AT_name("_PwmDac3")
	.dwattr $C$DW$227, DW_AT_TI_call

        LCR       #_PwmDac3             ; [CPU_ALU] |1929| 
        ; call occurs [#_PwmDac3] ; [] |1929| 
        MOVW      DP,#_motor2+272       ; [CPU_ARAU] 
	.dwpsn	file "../sources/FCL_SFRA_XL_DualServo.c",line 1930,column 2,is_stmt,isa 0
        MOV32     R0H,@$BLOCKED(_motor2)+272 ; [CPU_FPU] |1930| 
        MOV32     R1H,@$BLOCKED(_motor2)+270 ; [CPU_FPU] |1930| 
        SUBF32    R0H,R1H,R0H           ; [CPU_FPU] |1930| 
$C$DW$228	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$228, DW_AT_low_pc(0x00)
	.dwattr $C$DW$228, DW_AT_name("_PwmDac4")
	.dwattr $C$DW$228, DW_AT_TI_call

        LCR       #_PwmDac4             ; [CPU_ALU] |1930| 
        ; call occurs [#_PwmDac4] ; [] |1930| 
        MOVW      DP,#_GpioDataRegs+24  ; [CPU_ARAU] 
	.dwpsn	file "../sources/FCL_SFRA_XL_DualServo.c",line 2281,column 2,is_stmt,isa 0
        MOVL      XAR4,#_dlog_4ch1      ; [CPU_ARAU] |2281| 
	.dwpsn	file "../sources/FCL_SFRA_XL_DualServo.c",line 2275,column 2,is_stmt,isa 0
        AND       @$BLOCKED(_GpioDataRegs)+24,#0xfeff ; [CPU_ALU] |2275| 
	.dwpsn	file "../sources/FCL_SFRA_XL_DualServo.c",line 2281,column 2,is_stmt,isa 0
$C$DW$229	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$229, DW_AT_low_pc(0x00)
	.dwattr $C$DW$229, DW_AT_name("_DLOG_4CH_F_FUNC")
	.dwattr $C$DW$229, DW_AT_TI_call

        LCR       #_DLOG_4CH_F_FUNC     ; [CPU_ALU] |2281| 
        ; call occurs [#_DLOG_4CH_F_FUNC] ; [] |2281| 
        MOVW      DP,#_IsrTicker        ; [CPU_ARAU] 
	.dwpsn	file "../sources/FCL_SFRA_XL_DualServo.c",line 2286,column 5,is_stmt,isa 0
        MOVB      ACC,#1                ; [CPU_ALU] |2286| 
        ADDL      @_IsrTicker,ACC       ; [CPU_ALU] |2286| 
        MOVW      DP,#_EPwm1Regs+170    ; [CPU_ARAU] 
	.dwpsn	file "../sources/FCL_SFRA_XL_DualServo.c",line 2291,column 5,is_stmt,isa 0
        OR        @$BLOCKED(_EPwm1Regs)+170,#0x0001 ; [CPU_ALU] |2291| 
        MOVW      DP,#_AdcaRegs+4       ; [CPU_ARAU] 
	.dwpsn	file "../sources/FCL_SFRA_XL_DualServo.c",line 2292,column 5,is_stmt,isa 0
        OR        @$BLOCKED(_AdcaRegs)+4,#0x0001 ; [CPU_ALU] |2292| 
	.dwpsn	file "../sources/FCL_SFRA_XL_DualServo.c",line 2293,column 5,is_stmt,isa 0
        OR        @$BLOCKED(_AdcaRegs)+4,#0x0002 ; [CPU_ALU] |2293| 
        MOVW      DP,#_PieCtrlRegs+1    ; [CPU_ARAU] 
	.dwpsn	file "../sources/FCL_SFRA_XL_DualServo.c",line 2294,column 5,is_stmt,isa 0
        MOVB      @$BLOCKED(_PieCtrlRegs)+1,#4,UNC ; [CPU_ALU] |2294| 
        SUBB      SP,#4                 ; [CPU_ARAU] 
	.dwcfi	cfa_offset, -16
        RESTORE   ; [CPU_FPU] 
        POP       RB                    ; [CPU_FPU] 
	.dwcfi	cfa_offset, -14
	.dwcfi	restore_reg, 74
        MOVL      XAR7,*--SP            ; [CPU_ALU] 
	.dwcfi	cfa_offset, -12
	.dwcfi	restore_reg, 18
        MOVL      XAR6,*--SP            ; [CPU_ALU] 
	.dwcfi	cfa_offset, -10
	.dwcfi	restore_reg, 16
        MOVL      XAR5,*--SP            ; [CPU_ALU] 
	.dwcfi	cfa_offset, -8
	.dwcfi	restore_reg, 14
        MOVL      XAR4,*--SP            ; [CPU_ALU] 
	.dwcfi	cfa_offset, -6
	.dwcfi	restore_reg, 12
        MOVL      XT,*--SP              ; [CPU_ALU] 
	.dwcfi	cfa_offset, -4
	.dwcfi	restore_reg, 22
	.dwcfi	restore_reg, 21
        POP       AR1H:AR0H             ; [CPU_ALU] 
	.dwcfi	cfa_offset, -2
	.dwcfi	restore_reg, 5
	.dwcfi	restore_reg, 7
        NASP      ; [CPU_ALU] 
$C$DW$230	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$230, DW_AT_low_pc(0x00)
	.dwattr $C$DW$230, DW_AT_TI_return

        IRET      ; [CPU_ALU] 
        ; return occurs ; [] 
	.dwattr $C$DW$220, DW_AT_TI_end_file("../sources/FCL_SFRA_XL_DualServo.c")
	.dwattr $C$DW$220, DW_AT_TI_end_line(0x8fa)
	.dwattr $C$DW$220, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$220

;**************************************************************
;* UNDEFINED EXTERNAL REFERENCES                              *
;**************************************************************
	.global	_PwmDac1
	.global	_PwmDac2
	.global	_PwmDac3
	.global	_PwmDac4
	.global	_InitSysCtrl
	.global	_InitPieCtrl
	.global	_InitPieVectTable
	.global	_GPIO_SetupPinOptions
	.global	_GPIO_SetupPinMux
	.global	_PWM_1ch_UpDwnCnt_CNF
	.global	_InitMotor1EPwmGpio
	.global	_InitMotor2EPwmGpio
	.global	_ConfigureADC
	.global	_PwmDac_Init
	.global	_InitMotor1EQepGpio
	.global	_InitMotor2EQepGpio
	.global	_InitMotor1_DRV_Gpio
	.global	_InitMotor2_DRV_Gpio
	.global	_ENABLE_INVERTER
	.global	_F28x_usDelay
	.global	_FCL_initPWM
	.global	_DLOG_4CH_F_init
	.global	_DMC1_Protection_Config
	.global	_DMC2_Protection_Config
	.global	_DMC_Protection
	.global	_DLOG_4CH_F_FUNC
	.global	_Pwmdac12_PwmRegs
	.global	_Pwmdac34_PwmRegs
	.global	_FCL_GetSwVersion
	.global	_SyncSocRegs
	.global	_CpuTimer0Regs
	.global	_CpuTimer1Regs
	.global	_CpuTimer2Regs
	.global	_SpiaRegs
	.global	_SpibRegs
	.global	_AdcaResultRegs
	.global	_AdcbResultRegs
	.global	_AdccResultRegs
	.global	_PieCtrlRegs
	.global	_Cmpss1Regs
	.global	_Cmpss2Regs
	.global	_Cmpss3Regs
	.global	_Cmpss5Regs
	.global	_Cmpss6Regs
	.global	_EQep1Regs
	.global	_EQep2Regs
	.global	_GpioDataRegs
	.global	_AdcaRegs
	.global	_AdcbRegs
	.global	_AdccRegs
	.global	_CpuSysRegs
	.global	_EPwm1Regs
	.global	_EPwm2Regs
	.global	_EPwm3Regs
	.global	_EPwm4Regs
	.global	_EPwm5Regs
	.global	_EPwm6Regs
	.global	_EPwm7Regs
	.global	_EPwm8Regs
	.global	_PieVectTable

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x1a)
$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$231, DW_AT_name("input_ptr1")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("_input_ptr1")
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$232, DW_AT_name("input_ptr2")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("_input_ptr2")
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$233, DW_AT_name("input_ptr3")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("_input_ptr3")
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$234, DW_AT_name("input_ptr4")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("_input_ptr4")
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$235, DW_AT_name("output_ptr1")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("_output_ptr1")
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$236, DW_AT_name("output_ptr2")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("_output_ptr2")
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$237, DW_AT_name("output_ptr3")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("_output_ptr3")
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$238, DW_AT_name("output_ptr4")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("_output_ptr4")
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$239, DW_AT_name("prev_value")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("_prev_value")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$240, DW_AT_name("trig_value")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("_trig_value")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$241, DW_AT_name("status")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("_status")
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$242, DW_AT_name("pre_scalar")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("_pre_scalar")
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$243, DW_AT_name("skip_count")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("_skip_count")
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$244, DW_AT_name("size")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("_size")
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$245, DW_AT_name("count")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("_count")
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$22

$C$DW$T$645	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$645, DW_AT_name("DLOG_4CH_F")
	.dwattr $C$DW$T$645, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$645, DW_AT_language(DW_LANG_C)

$C$DW$T$646	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$646, DW_AT_type(*$C$DW$T$645)
	.dwattr $C$DW$T$646, DW_AT_address_class(0x20)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$246, DW_AT_name("As")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("_As")
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$247, DW_AT_name("Bs")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("_Bs")
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$248, DW_AT_name("Cs")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("_Cs")
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$249, DW_AT_name("Alpha")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("_Alpha")
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$250, DW_AT_name("Beta")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("_Beta")
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$24

$C$DW$T$80	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$80, DW_AT_name("CLARKE")
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$251, DW_AT_name("Alpha")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("_Alpha")
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$252, DW_AT_name("Beta")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("_Beta")
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$253, DW_AT_name("Angle")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("_Angle")
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$254, DW_AT_name("Ds")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("_Ds")
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$255, DW_AT_name("Qs")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("_Qs")
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$256, DW_AT_name("Sine")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("_Sine")
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$257, DW_AT_name("Cosine")
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("_Cosine")
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$25

$C$DW$T$81	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$81, DW_AT_name("PARK")
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x0e)
$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$258, DW_AT_name("Alpha")
	.dwattr $C$DW$258, DW_AT_TI_symbol_name("_Alpha")
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$259, DW_AT_name("Beta")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("_Beta")
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$260	.dwtag  DW_TAG_member
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$260, DW_AT_name("Angle")
	.dwattr $C$DW$260, DW_AT_TI_symbol_name("_Angle")
	.dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$261, DW_AT_name("Ds")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("_Ds")
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$262, DW_AT_name("Qs")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("_Qs")
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$263, DW_AT_name("Sine")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("_Sine")
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$264, DW_AT_name("Cosine")
	.dwattr $C$DW$264, DW_AT_TI_symbol_name("_Cosine")
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$26

$C$DW$T$82	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$82, DW_AT_name("IPARK")
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$265, DW_AT_name("Ref")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("_Ref")
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$266, DW_AT_name("Fdb")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("_Fdb")
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$267, DW_AT_name("Err")
	.dwattr $C$DW$267, DW_AT_TI_symbol_name("_Err")
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$268, DW_AT_name("Kp")
	.dwattr $C$DW$268, DW_AT_TI_symbol_name("_Kp")
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$269, DW_AT_name("Up")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("_Up")
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$270, DW_AT_name("Ui")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("_Ui")
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$271, DW_AT_name("Ud")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("_Ud")
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$272, DW_AT_name("OutPreSat")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("_OutPreSat")
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$273, DW_AT_name("OutMax")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("_OutMax")
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$274, DW_AT_name("OutMin")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("_OutMin")
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$275, DW_AT_name("Out")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("_Out")
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$276, DW_AT_name("SatErr")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("_SatErr")
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$277, DW_AT_name("Ki")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("_Ki")
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$278, DW_AT_name("Kc")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("_Kc")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$279, DW_AT_name("Kd")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("_Kd")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$280, DW_AT_name("Up1")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("_Up1")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$27

$C$DW$T$83	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$83, DW_AT_name("PIDREG3")
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)


$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x18)
$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$281, DW_AT_name("Ref")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("_Ref")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$282, DW_AT_name("Fbk")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("_Fbk")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$283, DW_AT_name("Out")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("_Out")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$284, DW_AT_name("Kp")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("_Kp")
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$285, DW_AT_name("Ki")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("_Ki")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$286, DW_AT_name("Umax")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("_Umax")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$287, DW_AT_name("Umin")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("_Umin")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$288, DW_AT_name("up")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("_up")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$289, DW_AT_name("ui")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("_ui")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$290, DW_AT_name("v1")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("_v1")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$291, DW_AT_name("i1")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("_i1")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$292, DW_AT_name("w1")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("_w1")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$28

$C$DW$T$84	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$84, DW_AT_name("PI_CONTROLLER")
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x0a)
$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$293, DW_AT_name("Ref")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("_Ref")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$294, DW_AT_name("Fbk")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("_Fbk")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$295, DW_AT_name("Out")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("_Out")
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$296, DW_AT_name("c1")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("_c1")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$297, DW_AT_name("c2")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("_c2")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$29

$C$DW$T$32	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$32, DW_AT_name("PID_TERMINALS")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x0e)
$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$298, DW_AT_name("Kr")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("_Kr")
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$299, DW_AT_name("Kp")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("_Kp")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$300, DW_AT_name("Ki")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("_Ki")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$301, DW_AT_name("Kd")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("_Kd")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$302, DW_AT_name("Km")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("_Km")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$303, DW_AT_name("Umax")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("_Umax")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$304, DW_AT_name("Umin")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("_Umin")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$30

$C$DW$T$33	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$33, DW_AT_name("PID_PARAMETERS")
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x10)
$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$305, DW_AT_name("up")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("_up")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$306, DW_AT_name("ui")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("_ui")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$307, DW_AT_name("ud")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("_ud")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$308, DW_AT_name("v1")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("_v1")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$309, DW_AT_name("i1")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("_i1")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$310, DW_AT_name("d1")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("_d1")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$311, DW_AT_name("d2")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("_d2")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$312, DW_AT_name("w1")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("_w1")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$31

$C$DW$T$34	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$34, DW_AT_name("PID_DATA")
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)


$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x28)
$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$313, DW_AT_name("term")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("_term")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$314, DW_AT_name("param")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("_param")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$315, DW_AT_name("data")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("_data")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$35

$C$DW$T$85	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$85, DW_AT_name("PID_CONTROLLER")
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)


$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x22)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$316, DW_AT_name("Ref")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("_Ref")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$317, DW_AT_name("Fbk")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("_Fbk")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$318, DW_AT_name("Err")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("_Err")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$319, DW_AT_name("xErr")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_xErr")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$320, DW_AT_name("Out")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_Out")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$321, DW_AT_name("CarryOver")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_CarryOver")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$322, DW_AT_name("Kp")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_Kp")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$323, DW_AT_name("Ki")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_Ki")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$324, DW_AT_name("Kerr")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_Kerr")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$325, DW_AT_name("Kxerr")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("_Kxerr")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$326, DW_AT_name("KerrOld")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("_KerrOld")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$327, DW_AT_name("cosWTs")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_cosWTs")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$328, DW_AT_name("sinWTs")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_sinWTs")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$329, DW_AT_name("expVal")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_expVal")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$330, DW_AT_name("kDirect")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_kDirect")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$331, DW_AT_name("Umax")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_Umax")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$332, DW_AT_name("Umin")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_Umin")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$36

$C$DW$T$86	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$86, DW_AT_name("CURRENT_CONTROLLER")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)


$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x12)
$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$333, DW_AT_name("Ualpha")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("_Ualpha")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$334, DW_AT_name("Ubeta")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_Ubeta")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$335, DW_AT_name("Ta")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_Ta")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$336, DW_AT_name("Tb")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_Tb")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$337, DW_AT_name("Tc")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_Tc")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$338, DW_AT_name("tmp1")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("_tmp1")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$339, DW_AT_name("tmp2")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_tmp2")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$340, DW_AT_name("tmp3")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("_tmp3")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$341, DW_AT_name("VecSector")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("_VecSector")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$38

$C$DW$T$88	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$88, DW_AT_name("SVGEN")
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x10)
$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$342, DW_AT_name("TargetValue")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_TargetValue")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$343, DW_AT_name("RampDelayMax")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("_RampDelayMax")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$344, DW_AT_name("RampLowLimit")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("_RampLowLimit")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$345, DW_AT_name("RampHighLimit")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("_RampHighLimit")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$346, DW_AT_name("RampDelayCount")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("_RampDelayCount")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$347, DW_AT_name("SetpointValue")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("_SetpointValue")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$348, DW_AT_name("EqualFlag")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("_EqualFlag")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$349, DW_AT_name("Tmp")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("_Tmp")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$40

$C$DW$T$89	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$89, DW_AT_name("RMPCNTL")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$350, DW_AT_name("Freq")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("_Freq")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$351, DW_AT_name("StepAngleMax")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("_StepAngleMax")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$352, DW_AT_name("Angle")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("_Angle")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$353, DW_AT_name("Gain")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_Gain")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$354, DW_AT_name("Out")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("_Out")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$355, DW_AT_name("Offset")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("_Offset")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$41

$C$DW$T$90	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$90, DW_AT_name("RAMPGEN")
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)


$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x16)
$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$356, DW_AT_name("DcBusVolt")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("_DcBusVolt")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$357, DW_AT_name("MfuncV1")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("_MfuncV1")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$358, DW_AT_name("MfuncV2")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("_MfuncV2")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$359, DW_AT_name("MfuncV3")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("_MfuncV3")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$360, DW_AT_name("OutOfPhase")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("_OutOfPhase")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$361, DW_AT_name("VphaseA")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("_VphaseA")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$362, DW_AT_name("VphaseB")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("_VphaseB")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$363, DW_AT_name("VphaseC")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_VphaseC")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$364, DW_AT_name("Valpha")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("_Valpha")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$365, DW_AT_name("Vbeta")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("_Vbeta")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$366, DW_AT_name("temp")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_temp")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$42

$C$DW$T$91	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$91, DW_AT_name("PHASEVOLTAGE")
	.dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)


$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x14)
$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$367, DW_AT_name("ElecTheta")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("_ElecTheta")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$368, DW_AT_name("DirectionQep")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("_DirectionQep")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$369, DW_AT_name("OldElecTheta")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("_OldElecTheta")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$370, DW_AT_name("Speed")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("_Speed")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$371, DW_AT_name("BaseRpm")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("_BaseRpm")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$372, DW_AT_name("K1")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("_K1")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$373, DW_AT_name("K2")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("_K2")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$374, DW_AT_name("K3")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("_K3")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$375, DW_AT_name("SpeedRpm")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("_SpeedRpm")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$376, DW_AT_name("Tmp")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_Tmp")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$45

$C$DW$T$92	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$92, DW_AT_name("SPEED_MEAS_QEP")
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x12)
$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$377, DW_AT_name("ElecTheta")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("_ElecTheta")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$378, DW_AT_name("MechTheta")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_MechTheta")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$379, DW_AT_name("DirectionQep")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("_DirectionQep")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$380, DW_AT_name("QepPeriod")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("_QepPeriod")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$381, DW_AT_name("QepCountIndex")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("_QepCountIndex")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$382, DW_AT_name("RawTheta")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("_RawTheta")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$383, DW_AT_name("MechScaler")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("_MechScaler")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$384, DW_AT_name("LineEncoder")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_LineEncoder")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$385, DW_AT_name("PolePairs")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_PolePairs")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$386, DW_AT_name("CalibratedAngle")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_CalibratedAngle")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$387, DW_AT_name("IndexSyncFlag")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_IndexSyncFlag")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$46

$C$DW$T$93	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$93, DW_AT_name("QEP")
	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)


$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x07)
$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$388, DW_AT_name("stat_reg1")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("_stat_reg1")
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$389, DW_AT_name("stat_reg2")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("_stat_reg2")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$390, DW_AT_name("cntrl_reg1")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("_cntrl_reg1")
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$391, DW_AT_name("cntrl_reg2")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("_cntrl_reg2")
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$392, DW_AT_name("readCntrl1")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("_readCntrl1")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$393, DW_AT_name("readCntrl2")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("_readCntrl2")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$394, DW_AT_name("DRV_fault")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("_DRV_fault")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$51

$C$DW$T$94	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$94, DW_AT_name("DRV8301_Vars")
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x15)
$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$395, DW_AT_name("Rsvd0")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("_Rsvd0")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$396, DW_AT_name("status1_wwd")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_status1_wwd")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$397, DW_AT_name("status2_ov_vds")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_status2_ov_vds")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$398, DW_AT_name("status3_IC")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_status3_IC")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$399, DW_AT_name("status4_gd_Vgs")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_status4_gd_Vgs")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$400, DW_AT_name("cntrl5_hs_gd")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$401, DW_AT_name("cntrl6_ls_gd")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$402, DW_AT_name("cntrl7_gd")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("_cntrl7_gd")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$403, DW_AT_name("Rsvd8")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("_Rsvd8")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$404, DW_AT_name("cntrl9_IC_ops")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$405, DW_AT_name("cntrlA_shunt_amp")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$406, DW_AT_name("cntrlB_Vreg")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("_cntrlB_Vreg")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$407, DW_AT_name("cntrlC_Vds_SNS")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$408, DW_AT_name("readCntrl5")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("_readCntrl5")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$409, DW_AT_name("readCntrl6")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("_readCntrl6")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$410, DW_AT_name("readCntrl7")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("_readCntrl7")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$411, DW_AT_name("readCntrl9")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("_readCntrl9")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$412, DW_AT_name("readCntrlA")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("_readCntrlA")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$413, DW_AT_name("readCntrlB")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("_readCntrlB")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$414, DW_AT_name("readCntrlC")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_readCntrlC")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$415, DW_AT_name("DRV_fault")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_DRV_fault")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$63

$C$DW$T$95	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$95, DW_AT_name("DRV8305_Vars")
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)


$C$DW$T$100	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$100, DW_AT_byte_size(0x1ce)
$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$416, DW_AT_name("PwmARegs")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_PwmARegs")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$417, DW_AT_name("PwmBRegs")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_PwmBRegs")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$418, DW_AT_name("PwmCRegs")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_PwmCRegs")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$419, DW_AT_name("QepRegs")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_QepRegs")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$420, DW_AT_name("SpiRegs")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_SpiRegs")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$421, DW_AT_name("CmpssARegs")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_CmpssARegs")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$422, DW_AT_name("CmpssBRegs")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_CmpssBRegs")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$423, DW_AT_name("CmpssCRegs")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("_CmpssCRegs")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$424, DW_AT_name("CurA_PPBRESULT")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_CurA_PPBRESULT")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$425, DW_AT_name("CurB_PPBRESULT")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_CurB_PPBRESULT")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$426, DW_AT_name("CurC_PPBRESULT")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_CurC_PPBRESULT")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$427, DW_AT_name("Vdc_AdcResult")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_Vdc_AdcResult")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$428, DW_AT_name("pwmCompA")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_pwmCompA")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$429, DW_AT_name("pwmCompB")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_pwmCompB")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$430, DW_AT_name("pwmCompC")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_pwmCompC")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$431, DW_AT_name("clarke")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_clarke")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$432, DW_AT_name("park")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_park")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$433, DW_AT_name("ipark")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_ipark")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$434, DW_AT_name("pid_pos")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_pid_pos")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$435, DW_AT_name("pi_pos")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_pi_pos")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$436, DW_AT_name("pid_spd")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_pid_spd")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$437, DW_AT_name("cntlr_id")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_cntlr_id")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$438, DW_AT_name("cntlr_iq")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_cntlr_iq")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$439, DW_AT_name("FCL_Pars")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_FCL_Pars")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$440, DW_AT_name("svgen")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_svgen")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$441, DW_AT_name("rc")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("_rc")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$442, DW_AT_name("rg")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("_rg")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$443, DW_AT_name("volt")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_volt")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$444, DW_AT_name("speed")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_speed")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x14e]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$445, DW_AT_name("qep")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_qep")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x162]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$446, DW_AT_name("drv8301")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_drv8301")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$447, DW_AT_name("drv8305")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_drv8305")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x17b]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$448, DW_AT_name("currentAs")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_currentAs")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x190]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$449, DW_AT_name("currentBs")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_currentBs")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x192]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$450, DW_AT_name("currentCs")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_currentCs")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x194]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$451, DW_AT_name("currentSenseScale")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_currentSenseScale")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x196]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$452, DW_AT_name("T")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_T")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x198]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$453, DW_AT_name("Speed0")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_Speed0")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x19a]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$454, DW_AT_name("SFRA_noiseD")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_SFRA_noiseD")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x19c]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$455, DW_AT_name("SFRA_noiseQ")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_SFRA_noiseQ")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x19e]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$456, DW_AT_name("SFRA_noiseW")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_SFRA_noiseW")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$457, DW_AT_name("BaseInverterVoltage")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_BaseInverterVoltage")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a2]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$458, DW_AT_name("BaseMotorVoltage")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_BaseMotorVoltage")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a4]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$459, DW_AT_name("BaseInverterCurrent")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_BaseInverterCurrent")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a6]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$460, DW_AT_name("BaseMotorCurrent")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_BaseMotorCurrent")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a8]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$461, DW_AT_name("BaseFrequency")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_BaseFrequency")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1aa]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$462, DW_AT_name("offset_shntA")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_offset_shntA")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ac]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$463, DW_AT_name("offset_shntB")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_offset_shntB")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ae]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$464, DW_AT_name("offset_shntC")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_offset_shntC")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b0]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$465, DW_AT_name("VdTesting")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_VdTesting")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b2]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$466, DW_AT_name("VqTesting")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_VqTesting")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b4]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$467, DW_AT_name("IdRef")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_IdRef")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b6]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$468, DW_AT_name("IqRef")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_IqRef")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b8]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$469, DW_AT_name("SpeedRef")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_SpeedRef")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ba]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$470, DW_AT_name("angMax")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_angMax")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x1bc]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$471, DW_AT_name("ElecTheta")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_ElecTheta")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1be]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$472, DW_AT_name("MechTheta")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_MechTheta")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c0]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$473, DW_AT_name("alignCntr")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_alignCntr")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c2]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$474, DW_AT_name("alignCnt")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_alignCnt")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c4]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$475, DW_AT_name("lsw")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("_lsw")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c6]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$476, DW_AT_name("RunMotor")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("_RunMotor")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c7]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$477, DW_AT_name("TripFlagDMC")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_TripFlagDMC")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c8]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$478, DW_AT_name("clearTripFlagDMC")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_clearTripFlagDMC")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c9]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$479, DW_AT_name("SpeedLoopPrescaler")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_SpeedLoopPrescaler")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ca]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$480, DW_AT_name("SpeedLoopCount")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_SpeedLoopCount")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x1cb]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$481, DW_AT_name("PosSenseReverse")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_PosSenseReverse")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x1cc]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$482, DW_AT_name("newCmdDRV")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("_newCmdDRV")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x1cd]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$100

$C$DW$T$648	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$648, DW_AT_name("MOTOR_VARS")
	.dwattr $C$DW$T$648, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$T$648, DW_AT_language(DW_LANG_C)

$C$DW$T$649	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$649, DW_AT_type(*$C$DW$T$648)
	.dwattr $C$DW$T$649, DW_AT_address_class(0x20)


$C$DW$T$101	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$101, DW_AT_byte_size(0x01)
$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$483, DW_AT_name("all")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$484, DW_AT_name("bit")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$101

$C$DW$T$47	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$47, DW_AT_name("DRV8301_STATUS_REG_1")
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)


$C$DW$T$102	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$102, DW_AT_byte_size(0x01)
$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$485, DW_AT_name("all")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$486, DW_AT_name("bit")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$102

$C$DW$T$48	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$48, DW_AT_name("DRV8301_STATUS_REG_2")
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)


$C$DW$T$103	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$103, DW_AT_byte_size(0x01)
$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$487, DW_AT_name("all")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$488, DW_AT_name("bit")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$103

$C$DW$T$49	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$49, DW_AT_name("DRV8301_CONTROL_REG_1")
	.dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)


$C$DW$T$104	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$104, DW_AT_byte_size(0x01)
$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$489, DW_AT_name("all")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$490, DW_AT_name("bit")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$104

$C$DW$T$50	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$50, DW_AT_name("DRV8301_CONTROL_REG_2")
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)


$C$DW$T$105	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$105, DW_AT_byte_size(0x01)
$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$491, DW_AT_name("all")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$492, DW_AT_name("bit")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$105

$C$DW$T$52	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$52, DW_AT_name("DRV8305_WWD_REG")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)


$C$DW$T$106	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$106, DW_AT_byte_size(0x01)
$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$493, DW_AT_name("all")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$349)
	.dwattr $C$DW$494, DW_AT_name("bit")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$106

$C$DW$T$53	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$53, DW_AT_name("DRV8305_OV_VDS_FAULTS_REG")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)


$C$DW$T$107	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$107, DW_AT_byte_size(0x01)
$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$495, DW_AT_name("all")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$496, DW_AT_name("bit")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$107

$C$DW$T$54	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$54, DW_AT_name("DRV8305_IC_FAULTS_REG")
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)


$C$DW$T$108	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$108, DW_AT_byte_size(0x01)
$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$497, DW_AT_name("all")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$498, DW_AT_name("bit")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$108

$C$DW$T$55	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$55, DW_AT_name("DRV8305_GD_VGS_FAULTS_REG")
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)


$C$DW$T$109	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$499, DW_AT_name("all")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$345)
	.dwattr $C$DW$500, DW_AT_name("bit")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$109

$C$DW$T$56	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$56, DW_AT_name("DRV8305_HS_GATE_DRIVER_CNTRL_REG")
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)


$C$DW$T$110	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$110, DW_AT_byte_size(0x01)
$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$501, DW_AT_name("all")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$348)
	.dwattr $C$DW$502, DW_AT_name("bit")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$110

$C$DW$T$57	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$57, DW_AT_name("DRV8305_LS_GATE_DRIVER_CNTRL_REG")
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)


$C$DW$T$111	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$111, DW_AT_byte_size(0x01)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$503, DW_AT_name("all")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$504, DW_AT_name("bit")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$111

$C$DW$T$58	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$58, DW_AT_name("DRV8305_GD_CNTRL_REG")
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)


$C$DW$T$112	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$112, DW_AT_byte_size(0x01)
$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$505, DW_AT_name("all")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$347)
	.dwattr $C$DW$506, DW_AT_name("bit")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$112

$C$DW$T$59	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$59, DW_AT_name("DRV8305_IC_OPS_REG")
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)


$C$DW$T$113	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$113, DW_AT_byte_size(0x01)
$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$507, DW_AT_name("all")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$508, DW_AT_name("bit")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_bit")
